{
  "summary": [
    {
      "body": "Ok, people, here's another hardy perennial. It's now getting VERY COLD.  I feel the cold quite badly and am at home much of the time (like many others in the Barbican) and the free-standing electric heaters which we have just don't do the job properly. Not to mention the fact that we've already spent a small fortune this summer on using them because the weather was so cold some of the time. I rang the BEO to be given the usual \"oh, we never turn the heating on until October\". I pointed out that if it gets cold before the beginning of October, and enough people request it, then it can be turned on earlier (as has happened in previous years) so I was getting my request in early this year. This went down like the proverbial lead balloon. Apart from being cold, I'm also very annoyed. It seems to escape the notice of BEO staff that RESIDENTS PAY FOR THEIR HEATING through the service charge and if we need it turned on slightly earlier then we're perfectly entitled to have it. It's always a rather worrying situation when those in charge of your heating system a) don't live here and b) have a vested interest in keeping the cost down. I know that our heating system is an ongoing concern because of its incredibly complicated time/temperature triggers (nothing like a simple thermostat here) and also because it is hopelessly antiquated but it shouldn't be such a battle to get it turned on every year. I don't want to knock the BEO staff because usually they provide a very good service - but this one really gets me going   So, please - ring your House Officers and request that we have access to our own heating. It still takes about a month for the buildings to warm up properly so, even if it goes on now, it will some time before we really start to feel it. House Officers' telephone numbers are:-   Andrewes, Brandon, Cromwell, Gilbert, Speed and Willoughby - Helen Davinson on 7029 3963 Defoe, Lambert Jones, Lauderdale, Mountjoy, Postern, Seddon, Thomas More and Wallside - Sarah Styles on 7029 3962 BJH, Breton, Bryer, Bunyan, John Trundle and Shakespeare - Rebecca Marshall on 7029 3964. Yours in scarves and sweaters etc. etc.", 
      "date": "2007-09-26 15:09:00", 
      "id": 3804, 
      "responses": 101, 
      "subject": "HEATING!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3692"
    }, 
    {
      "body": "I'd be interested in hearing what others think about the latest estate initiative we are being consulted on -- this time about providing residents meeting rooms. If I understand it correctly the idea is that we are being asked to pay for the renovation and the upkeep on our service charge, but then also pay rent to use the facilities -- although it's difficult to say given the paucity of information provided in the flyer. If that's the case, it seems a bit much to me. Surely if we are going to have rooms we can rent then the estate  should fund the refurbishment cost and the annual upkeep, we shouldn't have to pay twice. And I thought local authorities were supposed to provide these facilities, not the estate office. I'd also love to know whose great idea this was.  ", 
      "date": "2006-10-27 17:29:00", 
      "id": 3201, 
      "responses": 35, 
      "subject": "residents meeting rooms consulation", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2706"
    }, 
    {
      "body": "I have been away for six weeks so am not up to date on what is happening about the Garchey removal proposals. I have lived in two flats in the Barbican and in each of those I have paid to have the Garchey removed at a cost of about 850 each time. I now understand from the Estate Office that residents who have already had this work done - there are about 800 flats involved - will have to pay the charge again if the work goes forward across the whole estate. Whilst I have no objection to paying my share of the removal of pipework etc estate-wide, I see no reason why people who have already had the work done inside their flats should have to subsidise those who have not. I have asked the estate office whether the works could be divided into \"estate wide\" works and \"interior\" works and have been told that this is not possible. This seems to be grossly unfair as it is clearly possible to estimate how much the interior works cost. I wonder if anyone else is in this position? Best wishes Ann George", 
      "date": "2006-09-04 08:41:00", 
      "id": 4473, 
      "responses": 13, 
      "subject": "To all people who have had their Garcheys removed", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2574"
    }, 
    {
      "body": "whilst reading about the mendohlson tree, i wondered ...  whilst recognising that we are indeed very lucky in our police resources, is there a specific reason why the bored-out-of-their-minds security staff from the arts centre can't cast their net wider ... ? I ask because the  lovely gardens by bunyan / jt / bryer are a bit of an attraction for the \"malcontents\" because they're so lovely and lush and screen things from public view ... the group of youths, for example, referred to in previous posts i think, have taken to drinking under bunyan - having re-located from jt ...  presumably the answer is the security guards are employed by the arts centre but i wonder how whether the financial equation to extend their duties to the rest of the estate would be a cheaper option than using the police and the cost of repairs (when things can be repaired, that is, unlike the tree sculpture...) just a thought", 
      "date": "2006-05-01 23:08:00", 
      "id": 3084, 
      "responses": 8, 
      "subject": "security", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2244"
    }, 
    {
      "body": "anyone else notice that 02 lift in ben jonson needs just a splash of paint to get rid of the graffiti? its all begining to look a lttle tatty and it shouldn't", 
      "date": "2005-04-20 21:31:00", 
      "id": 2939, 
      "responses": 5, 
      "subject": "service charges, somerfield, and a splash of paint", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1579"
    }, 
    {
      "body": "Has anyone else noticed substantially lower heating temperatures this year? Mine hovers around 58F and only just makes it to 60F in my tiny bathroom. The tiles only feel as though the chill has been taken off, not nice and warm as previously. It used to be too warm for anyone to consider sleeping on the floor and anything left on the floor felt very warm underneath. I have called the engineers twice, but have noticed no change from the chilly conditions prevailing. Obviously, I can top up with additional heaters but I am still also paying for for a severely depleted level of background heating. I understand the system is supposed to maintain at least 60F except in very severe conditions and today it is relatively mild. Brrrr!", 
      "date": "2007-12-04 15:15:00", 
      "id": 3492, 
      "responses": 5, 
      "subject": "Heating temperatures", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3843"
    }, 
    {
      "body": "We have just received the questionnaire about the refurbishment, and I hope that many residents will complete it and return it to the estate office. Overall the refurbishment looks great, and the automatic doors are a big improvement. However, the budget was 190,000 - quite an astonishing amount of money to spend on the podium entrance and car park entrance. The budget apparently did not stretch to the following items which I think residents should consider, as I had understood that they would be included: -- the porters' desk was not renewed and is showing lots of signs of wear and tear -- there is no parcel store - as before, parcels are left on the floor, which I find rather astonishing. Nowadays people order more and more online, and there is no provision for the storage of delivered items. -- the doors at podium level (possibly elsewhere) were poorly repainted. You can see that old layers of paint were not removed, and already the new paintwork is showing signs of damage. I'd be interested in hearing opinions from my neighbours on this. The house committee has been silent, to my knowledge. The whole job took an extraordinary amount of time, and cost an unfathomable amount of money, and I think that in less than 12 months we will all have serious misgivings - if we don't already.", 
      "date": "2007-11-24 20:32:00", 
      "id": 3614, 
      "responses": 4, 
      "subject": "Shakespeare lobby refurb questionnaire", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3815"
    }
  ]
}