{
  "summary": [
    {
      "body": "The owner of the flat upstairs from ours installed a stone floor. I'm sure it looks great, but it means a lot of noise is transferred downstairs to our flat. For example every time a table or chair is moved or somebody walks across the floor. When we spoke to him he was quite reasonable about it, but has moved out since and rented it out. The new people are probably totally unaware of this. Am I right in thinking there is a rule in the leasehold saying flats must be carpeted. If so, is it ever enforced? Has anybody else encountered this sort of issue before.  Any advice much appreciated.", 
      "date": "2008-05-20 07:27:00", 
      "id": 2812, 
      "sentiment": 2, 
      "subject": "uncarpeted flats", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4358"
    }, 
    {
      "body": "What's the established practice for Christmas gift giving/tipping of Barbican staff - porters, window cleaners etc? Having only lived in the Barbican since May this year, this is my first Christmas here. Is the consensus to take the attitude that we already pay enough service charge, so do nothing? Or are people more generous than this? What gifts might people give? I don't want to innocently contribute towards overloading the Shakespeare porters with mince pies and Quality Street.", 
      "date": "2005-12-07 13:06:00", 
      "id": 2999, 
      "sentiment": 2, 
      "subject": "Established practice for Christmas tipping of BBcan staff?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1973"
    }, 
    {
      "body": "After slowly dying over the past year, my video recorder has finally packed up. Although I guess I could dispose of it in the rubbish skip in the car-park, I was wondering if there was  a special service for recycling electrical items. A lot of local councils run these schemes, partially to stop landfills getting contaminated with nasties, and also to recycle scrap copper etc. On another point, I'm going to replace my elderly computer soon. It seems a pity to just throw it away as it still works perfectly well, although it's not up to the demands of running today's software. Does anybody know if there's any charity or similar who would be interested in taking it? Cheers, Charles.", 
      "date": "2006-05-02 19:47:00", 
      "id": 3080, 
      "sentiment": 2, 
      "subject": "Recycling electrical items", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2248"
    }, 
    {
      "body": "Hullo I have an original bathroom in my flat which I like very much. My problem is that the sink has a number of cracks in and there are lots of broken tiles.  I want to repair the room but I'm not sure what I'm allowed to do under the listing rules. Is there anywhere obvious to find out? Do I need to ask the Estate Office?  If anyone has an experience of something similar, I'd be really grateful for your advice Thanks", 
      "date": "2006-11-07 17:18:00", 
      "id": 3199, 
      "sentiment": 2, 
      "subject": "bathroom and listing rules", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2734"
    }, 
    {
      "body": "We have wood flooring in our flat (I think it's \"engineered wood\" floorboards, rather than solid wood or laminate). Some of it by one of the floor-ceiling doors/windows has started buckling, and there's a mouldy smell -- I think something's wet under there. I can't tell if water's coming in from outside, so I guess we'll have to try and take some of the floor up to see what's happening. Rather than do it myself and cause stupid damage, does anyone have good experience with a company or person who have laid wooden flooring in the Barbican? Any suggestions appreciated, thanks. (Yes, I know wooden flooring isn't allowed so please don't start going down that route, thanks. The floor was installed by the people we bought the flat from, and we always take our shoes off when we get home.)", 
      "date": "2006-11-20 14:53:00", 
      "id": 3224, 
      "sentiment": 2, 
      "subject": "Wooden floor companies/people?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2761"
    }
  ]
}