{
  "summary": [
    {
      "body": "I hate to be a moaning minnie, but the sound of the lady above me marching up and down and up and down her flat is driving me mad! Whats the etiquette here? She must have a wooded/hard floor. I guess I might just need to knock on her door and have a quiet word, but by the sound of her footsteps, she sounds bigger than me!", 
      "date": "2008-03-13 17:47:00", 
      "id": 1597, 
      "sentiment": 3, 
      "subject": "Footsteps driving me crazy!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4119"
    }, 
    {
      "body": "I like reading Barbicanews and I am grateful to the people that put it together. And I liked what I read in the July issue with the exception of this short section, which did rather jump out at me (p.20):  OK, no problem with the washing, but I don't actually recall ever having seen anyone's bedding or bloomers out in the breeze in EC2. But what is this about recreational use? And people smoking on balconies? It is the very place we send smokers, and that probably happens 6 times a year at our \"demise\".  So, what is recreational? Have I been inviting the wrath of my neighbours while I have been : - Gardening (beyond that which is strictly necessary to comply with the lease) - Contemplating the view - Talking to the neighbours - Taking in the sun - Watching the rain, the fireworks, planes, helicopters... ? If they mean filling the balcony with patio furniture, then they should say so. I am with the BEO if there is a serious risk of harm by people blocking off others' means of escape. But doesn't the rest go a bit too far?", 
      "date": "2005-08-14 22:34:00", 
      "id": 2976, 
      "sentiment": 3, 
      "subject": "Recreational visits to balconies now banned?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1806"
    }, 
    {
      "body": "Has anyone else been bothered by a dog barking on  a balcony in Shakespear tower?  I'm in Lauderdale and with the doors open, all I've been hearing today is a regular yapping from what sounds like a puppy.   I think the noise is coming from a flat roundabout the 9th floor, but I'm sure the flats above and below are aware of just which floor the dog is on! I'm hoping that the dog is just a weekend visitor, but does anyone know what the situation would be if it turns out to be a permanent resident?  Keeping pets is not allowed in the lease, but how is this enforced by the Corporation?", 
      "date": "2005-09-10 13:46:00", 
      "id": 2998, 
      "sentiment": 3, 
      "subject": "Barking dog", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1838"
    }, 
    {
      "body": "This is a Shakespeare Tower problem that others - elsewhere on the Estate - may have experienced. If so, help, guidance and advice would be appreciated. It is driving us mad. At 0600 each morning the bedroom wall behind our bed broadcasts the  Radio 4 time pips and then - for an hour - we get the TODAY programme. On the other side of that wall is a stairwell and not the wall of an adjacent flat.  We have no objection the programme - one of us normally gets out of bed to listen to it on the radio in the bathroom at around 0620 before going off to work - but the other needs to go on sleeping and cannot because of the noise from the wall. The two of us have to suffer it at the weekend. It is a real and intrusive problem. We have (as informally as is possible as 0600, gumpy, wearing pyjamas and carrying tumblers to improve the accoustics by resting them against front doors) checked the neighbours flats. It does not seem to be those immediately above or below us.  God know what they would have done if they had seen us. The noise is coming from somewhere else on our side of the tower (we are an 8B: **2 flat). It seems to be travelling up (or down) the wall from a flat where someone has the radio on a timer that lasts for exactly one hour.  Then there is peace. Is anyone else suffering - we are finding this noise is seriously intrusive - and what do we need to do?", 
      "date": "2006-05-07 21:45:00", 
      "id": 3091, 
      "sentiment": 3, 
      "subject": "Broadcasting Wall", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2270"
    }, 
    {
      "body": "Do you remember not all that long ago when one could wander over to the Centre amble up to the seventh floor ( or even take the lift ) and enter the wilds of what at one time was a haven of tranquility surrounded with the lush collection of plants, trees and heaven knows what from all over the world that abounded all about one. Fat old carp merrily swimming about two pools, one situated in a mini jungle and the other in a display pool. At one time all about the visitor were displays of many a colourful variety of named and mystery plants all beautiful in their glory.         On a floor above is situated a collection of cactus growing in all shapes and sizes and if one visits during the blooming period one can admire the hanging baskets filled to overflowing with the cascading variety. Upon leaving this wonderment look down and to the right and see a large grouping of terrapins.           All this was brought to a screetching halt some years ago when the Management of the Centre came to the conclusion that money could be made by barring residents during the week and selected weekends and letting it out, naturally for a price, to functions, receptions bla, bla,bla. Kind of makes one wonder where the priorities lie, with those who it was given to originally years ago or to a profit making group who put profit before resident! ", 
      "date": "2006-08-11 10:07:00", 
      "id": 3148, 
      "sentiment": 3, 
      "subject": "The lost gardens of the conservatory!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2518"
    }
  ]
}