{
  "summary": [
    {
      "body": "We have just received the questionnaire about the refurbishment, and I hope that many residents will complete it and return it to the estate office. Overall the refurbishment looks great, and the automatic doors are a big improvement. However, the budget was 190,000 - quite an astonishing amount of money to spend on the podium entrance and car park entrance. The budget apparently did not stretch to the following items which I think residents should consider, as I had understood that they would be included: -- the porters' desk was not renewed and is showing lots of signs of wear and tear -- there is no parcel store - as before, parcels are left on the floor, which I find rather astonishing. Nowadays people order more and more online, and there is no provision for the storage of delivered items. -- the doors at podium level (possibly elsewhere) were poorly repainted. You can see that old layers of paint were not removed, and already the new paintwork is showing signs of damage. I'd be interested in hearing opinions from my neighbours on this. The house committee has been silent, to my knowledge. The whole job took an extraordinary amount of time, and cost an unfathomable amount of money, and I think that in less than 12 months we will all have serious misgivings - if we don't already.", 
      "date": "2007-11-24 20:32:00", 
      "id": 3614, 
      "responses": 4, 
      "subject": "Shakespeare lobby refurb questionnaire", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3815"
    }, 
    {
      "body": "Have you filled in the NHS questionnaire? The on-line consultation on changes to London's healthcare closes THIS WEEK on 7 March 2008. It proposes for example that many services now provided by hospitals will be moved to big new 'polyclinics' (with 25 or more GPs).  This is part of the Darzi Review [by Health Minister Lord Darzi], which you've probably heard about?  Visit  . You can also comment on    For other parts of England, visit   You can also Freephone: 0808 238 5430, email:   or write to FREEPOST Consulting the Capital", 
      "date": "2008-03-01 17:29:00", 
      "id": 3529, 
      "responses": 2, 
      "subject": "NHS questionnaire closes 7 March. Have your say!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4074"
    }
  ]
}