{
  "summary": [
    {
      "body": "Sorry to interrupt the Waitrose debate. Back on the subject of the YMCA, and I hope it doesn't get out of hand this time. I am in conversation with the Environmental Health and Snow Hill regarding what we can do about the noise from the YMCA  the (temporary) noisy residents that on Fridays and Saturdays congregate on Fann Street at 1am or so in large crowds before going out. In anticipation that this is going to become more and more frequent in the summer I really want to sort this out before it gets out of control. If any of you are disturbed by the noise, I have been instructed by Snow Hill to report it to them where complaint will be logged. We need to keep a diary and gather up some evidence. Please back me up so I can enjoy the summer without being woken up to the sounds of Viva Espana!", 
      "date": "2006-03-20 18:19:00", 
      "id": 4285, 
      "responses": 206, 
      "subject": "YMCA noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2148"
    }, 
    {
      "body": "whitbread buildings north side of Chiswell St has aquired a band of squatters (see notices on doors and railings). If any  abuse,noise etc don't forget these should be reported to met police at,I believe Kings Cross,as that side of the road is not a City matter.It seems there is no water as they have been using local pubs for toilets etc.", 
      "date": "2005-09-06 09:21:00", 
      "id": 2996, 
      "responses": 9, 
      "subject": "squatters", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1829"
    }, 
    {
      "body": "At risk of sounding like Disgusted of Willoughby, not only did we have the police drama in the night on Sunday, but we also had noisy building work going on all through Sunday morning and afternoon from the Austral House site at London Wall/Coleman Street. It finally finished at 3.30pm That has been 7 days of construction noise from three sites within view of our balcony ALL week.  I did log my complaint with Guildhall on Sunday, and the Environmental Health duty office did call me back. He told me that the Austral House site work had been authorised becuase they had applied for a permit and been granted one. On a Sunday! It is likely they have applied for and been granted others too. Can anyone else bothered by this please also log their complaint with the City. During the week, speak to the Pollution Team on 020 7332 3630. At the weekends, when the noise nusiance is happening, call Guildhall switchboard on 020 7606 3030 and say you have a noise nusiance complaint. We really must bring pressure to bear on the City to not issue noisy works permits for Sundays so close to the Barbican Estate.", 
      "date": "2006-04-24 22:26:00", 
      "id": 3068, 
      "responses": 3, 
      "subject": "Weekend Constuction", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2221"
    }, 
    {
      "body": "Over the last week or more, have you been persistently disturbed by noisy out of hours drilling in Lauderdale Tower? It has been discovered to be coming from the hairdressers Cissor's Palace under Lauderdale. The owner has been given written details of the permissible hours for noisy work but continues to flout them. Last week drilling went on until 6.30pm and then was only stopped by the porter. On Sunday there was crashing and hammering that went on all afternoon and into the early evening and today the porters had to go round again to stop him using a power saw at 5.30pm. The porters are asking that Lauderdalers report any further infractions both to them and to Sheila Delaney at the estate office.", 
      "date": "2005-09-13 16:58:00", 
      "id": 3051, 
      "responses": 2, 
      "subject": "Out of Hours Noise at Cissor's Palace", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1841"
    }
  ]
}