{
  "summary": [
    {
      "body": "Hello I am an interloper so I hope it's okay to ask this.  I don't live in the Barbican yet and perhaps never will (as you all no doubt know, there is a dearth of properties) but I wondered if any of you would be generous enough to share your thoughts on living there and good points/bad points. I've lived in flats all my life (we currently live near Old Street and hurrah for the new Waitrose even if, yes, some of the staff are very incongruous for JLP) so I know that properties can differ wildly and that it's also a matter of personal choice. But these are the things I'd like to ask (in no particular order): Am I correct in thinking the biggest flats are in the towers? Is it generally a quiet and safe place to live or does it vary wildly from block to block? What's it like for children? The private gardens seem amazing but in reality what's it like? Is the service charge astronomical (I realise it depends on size of flat)? What will happen when all TV goes digital and the Barbican has no digital cable?? Is the listed building classification a pain if you want to do any work in the flat? Garchey, good or bad? Are parking places readily available to rent or is there a shortage? Anything to look for that an outsider may not know about.  I'd be really grateful for any answers. If I can reciprocate in any way...my specialities are fly fishing, beauty products, nutrition and fashion. I know, ecletic and slightly bizarre! Thank you. AB", 
      "date": "2006-06-05 17:37:00", 
      "id": 3180, 
      "responses": 29, 
      "subject": "What's it like living in the Barbican?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2338"
    }, 
    {
      "body": "I have just received my Thames Water bill for 2006/07, which has now climbed to 644, and represents a huge increase over the past few years.  I note that there is a process whereby one can apply for a water meter, which I presume in Barbican flats cannot be fitted (?), and then be offered an alternative charging basis, called the 'Average Household Charge'.    Questions that spring to mind: Has anybody gone through this process (especially in a tower flat, like mine)?   Can Thames Water fit meters, or do you end up with the Average Household Charge?  Does it in fact lead to lower water bills?  Any information/thoughts would be gratefully received.  Thanks.", 
      "date": "2006-02-21 10:18:00", 
      "id": 4604, 
      "responses": 16, 
      "subject": "Water Bills/Tower Flats", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2095"
    }, 
    {
      "body": "Hi everyone, I am in early pregnancy stage now.  The bath tub in our flat in andrewes house is 60cm(equal to 2 feet) tall.  Although i am able to get into the bath tub now, i dont think it will be easy for me to do that in a few months time (i am 160cm tall). i am worried it would be slippery and risky. We rent this flat and are planning to ask the landlord permission to change the bath into a walk in shower. We checked with a plumber to change the bath tub into a walk-in shower, and the estimate he gave is around 6000 pounds. My queries are: 1)does all barbican flats have this tall bathtubs. Landlord/estate agent say this is an original bathtub. what does \"original\" mean....size, shape, material..??? 2)How do pregnant women here manage to get in..any tips? 3)Is there any other less expensive solution available? (like power bath tubs that lifts the user and drop in..like those used by elderly people...are they less expensive to replace the existing normal tubs) 4)what is typically done when some modification effort is undertaken. (other than getting permission from landlord, informing estate office and dropping a note to neighbouring flats about the planned work) we plan to ask the barbican estate office for some contacts of plumbers familiar with barbican issues any suggestion or info or pointers would be useful. Thanks", 
      "date": "2006-06-04 18:48:00", 
      "id": 4410, 
      "responses": 3, 
      "subject": "barbican bath tub query", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2336"
    }, 
    {
      "body": "Can anyone please advise what the procedure is for sorting out neighbours with noisy plumbing - as ever it is so hard to know which flat is actually responsible for the noise.  At the moment when one of our neighbours (unsure which) runs their water taps we hear a loud whining noise throughout our flat - the noise seems to be getting worse too. Has anyone else experienced a similiar problem? Is this something the Corporation can deal with - how will they identify the flat?", 
      "date": "2006-08-19 12:15:00", 
      "id": 3162, 
      "responses": 2, 
      "subject": "Noisy Plumbing", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2540"
    }, 
    {
      "body": "Does anyone know what's happening on the Moorfields Highwalk? It's been cordoned off for almost 21/2 weeks now and no progress seems to be made. Should I speak to the BEO?", 
      "date": "2006-12-13 09:31:00", 
      "id": 3310, 
      "responses": 2, 
      "subject": "Moorfields Highwalk", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2828"
    }
  ]
}