{
  "summary": [
    {
      "body": "Hi everyone I need a bit of advice, please. I didn't mind the duck nesting last month and am a proud auntie to 11 ducklings in Mountjoy House lake, but two days ago, a wood pigeon started to nest in another window-box.  We shooed her away yesterday morning and discarded of the twig nest, but she and her mate came back that evening and she's refusing to be moved on, even when I use the mop or broom. In fact, she started snapping out, as to bite both objects. She backs into my favourite echyium (Canarian palm) to the extent that her wing hits it at a funny angle and it looks like she'll break her wing, which stops me from being more agressive towards her. I left her for the night but her mate came back and cooed again at 6am and I'm really shattered today, so have cancelled plans to go out to the flower market  I think I recall that you can prick the eggs. I don't know if she's laid yet, but the way she's biting out at the broom and not moving this time, implies she has one underneath her. Maybe if I put her rent up? Does anyone have any experience of what happens when the eggs hatch? Do your plants really die?  Any advice would be greatly appreciated. She is very sweet looking, the nest building exercise showed the devotion of her love-interest, but I'm really tired and grumpy today, and don't want to be like this for the next few weeks, otherwise it will be ME snapping everytime I see a mop or broom.    ", 
      "date": "2008-04-20 09:10:00", 
      "id": 3897, 
      "responses": 39, 
      "subject": "Wood pigeon dilemma", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4251"
    }, 
    {
      "body": "I didn't realise until this morning, but there are two pairs of canada geese. One pair has six goslings, the other pair has six eggs (on the island at Wallside). 16 canada geese! I think it's a bit of a shame that they're colonising the lakes. They're quite aggressive - I have had one go for me. And apparently they killed every one of the ducklings this year.", 
      "date": "2006-05-26 08:32:00", 
      "id": 4409, 
      "responses": 26, 
      "subject": "Canada goose colony", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2319"
    }, 
    {
      "body": "has anyone else been dive bombed by the very maternal seagull on the lake?  I was mindlessly looking at the baby seagull wondering what it was [realised it was a bit fat for a duck but no more than that    ] when down swoops mummy with claws about an inch above my head ... chased me under the bridge by gilbey ... have to confess was a bit scared ... though the staff of the Arts centre having fags had a good laugh ...    ... still, her baby gull was terribly ugly", 
      "date": "2005-07-31 15:30:00", 
      "id": 4608, 
      "responses": 24, 
      "subject": "seagull", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1775"
    }, 
    {
      "body": "One of the nice things about the Barbican gardens has been the fact that they are free of mess.  At the weekend I went to the Defoe garden and couldn't believe how much crap there was on the ground.  It wasn't hard to see why since there were two geese and five half-grown geese parading up and down.  Seven big and quite aggressive geese is beyond a joke and stepping around mounds of goose turds is not funny either.  I seem to remember reading that the Corporation hadn't received enough complaints to justify the hassle of getting rid of the geese.", 
      "date": "2006-06-27 14:18:00", 
      "id": 3144, 
      "responses": 19, 
      "subject": "Goose crap in the gardens", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2400"
    }, 
    {
      "body": "Spotted on the lake near the music school today: one Canada Goose, with a glint in his eye, and 3 fluffy yellow dead ducklings nearby.....", 
      "date": "2006-04-09 14:11:00", 
      "id": 3087, 
      "responses": 18, 
      "subject": "Canada goose - up to his old tricks?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2189"
    }, 
    {
      "body": "I've moved this to a seperate thread so that we don't clutter up the thread on dogs in the garden with debates on foxes, mange, townies, country bumpkins etc: Re; the manged fox some residents have seen - i often feed a fox from outside my window late at night. This animal, which i last saw about 2 weeks ago certainly doesn't have mange (yet), so i can only asume that this is another animal that is afflicted. My concern is that it's very likely to pass it on to the other fox(es?) in the area. I just phoned a vet friend who (after finally stopping laughing at me for me being so sentimental) said that it is possible to treat them in the wild but it's difficult becuase medication needs to be given a couple of times a week and usually this is hard becuase foxes roam around. but this is the barbican, not Yorkshire (thank god) and the manged fox is pretty much feeding from the garden, so coldn't we just leave medicated food out for it. apparently it will die within 6 months anyway, but it's a fairly disgusting death. I suppose there's 3 options, and i wondered what people think:  1) Leave it alone and it will die. My concern about this is that it's a horrid death and also it might then spread the diease to other foxes in the area  2) Get someone from the council or something to kill it.  3) Try and treat it and see what happens.  What do people think?", 
      "date": "2007-05-10 10:52:00", 
      "id": 4341, 
      "responses": 14, 
      "subject": "Fox", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3316"
    }, 
    {
      "body": "The over feeding of the Barbican ducks needs to be addressed - are we killing them with kindness? Bread is NOT duck food!  Mallards are designed to eat natural foods - adults and ducklings eat aquatic invertebrates like midge and mosquito larvae, mayfly and damselfly nymphs. All are present in the Barbican lakes - our lakes may be man made but any body of water attracts a natural food source for waterfowl.( And most of us have the bites to prove it!) Ducks, like children, will take the easy junkfood option every time. However, 'training' ducks to rely on an easy but nutritionally poor diet damages their health, the health of the lake ecosystem and could damage the health of the human population. Ducks fed a diet of bread develop engorged and fatty internal organs, leading to heart disease, liver problems and ultimately, and ironically, malnutrition. Feeding bread shortens their natural life and disturbs their migratory patterns, encouraging them to stay longer and even to over-winter at their summer home. Over-wintering does not give the lakes the break they need to naturally dispose of water fowl waste. Dozens of loaves of bread are being thrown into the water every week. Uneaten bread makes the water a breeding ground for parasites and diseases. Bacteria levels can rise to where they start killing off the fish and other aquatic life. Rotting bread in the water leads to Duck Virus Enteritis, a deadly mould Aspergillus, and Avian Botulism that can kill an entire waterfowl population and can be contracted by humans.", 
      "date": "2005-07-08 14:32:00", 
      "id": 4441, 
      "responses": 14, 
      "subject": "Ducks: Killing with kindness", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1732"
    }, 
    {
      "body": "I've just seen a grey heron flying about over BJH and Bryer (around 7.00 pm). Is it nesting on the Barbie or was it just flying over? Anyone else seen it? The blackbird/nightingale is singing its head off at the moment too. Beautiful!", 
      "date": "2006-03-31 18:53:00", 
      "id": 4653, 
      "responses": 14, 
      "subject": "Grey heron", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2165"
    }, 
    {
      "body": "anyone else curious about the solitary ornamental carp swimming about in the pond under breyer house? did he get lost on his way to the lake? is he some experiment to see if the pond can sustain fish? perhaps he's someone's pet, outgrown his goldfish bowl? in any event, he seems very lonely. the ducks seem reluctant to play with him, too.", 
      "date": "2005-05-18 15:08:00", 
      "id": 4722, 
      "responses": 14, 
      "subject": "big fish little fish swimming in the water", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1636"
    }, 
    {
      "body": "Does anybody know why there are two people trying to fish out the baby ducklings from the Lake?", 
      "date": "2008-04-12 18:44:00", 
      "id": 3874, 
      "responses": 13, 
      "subject": "Baby ducklings", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4231"
    }, 
    {
      "body": "For those who delight in the majestic silhouette of the Canada Goose rejoice they have arrived yet again. This time being the friendly rascals they have proven to be they picked up three more hitch hikers along the way and now number FIVE! For those who live beneath their flight path, they arrive from somewhere each morning usually from 4 A.M. onward, the day is lengthened whether we want the change or not. Five geese looking for nesting sites, places to graze, loo facilities and practicing their scales from long before daylight once again have a cross to bear.          The Corporation for years has turned it's collective back on complaints from residents but I suppose it's explained away by those who make up the committees who govern us by living far away and out of range of the problem!           Gads am I being overly critical here?    ", 
      "date": "2007-02-01 10:43:00", 
      "id": 4226, 
      "responses": 11, 
      "subject": "The blinkin geese are back!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2999"
    }, 
    {
      "body": "To all BarbicanTalk users I'm the administrator of this site and would like your assistance in a small matter, plus your feedback on ways to deal with it. As some of you have already been discussing, there are falcon chicks nesting within the Estate. This is quite unusual as apparently most falcons do not last long in urban areas. I have received a phone call from the City of London's Wildlife Officer, who is vociferous that the location of the birds should not be revealed. This is so that the birds can have the best shot at survival, without attracting attention from people who might want to steal the chicks' eggs (which are apparently relatively rare and valuable.) There is an additional danger that people could be injured trying to get up to watch the birds close up, or to steal the eggs - apparently something similar happened elsewhere last year. For the meantime, I have edited out all references to the location of the birds. Amending text is not something I have done often in the five years or so that this site has been around, but in this case I hope there's not too much serious injustice involved. What's more, I think most people would agree that we don't want to be attracting burglars (or birdwatchers!) onto the estate. In turn you could help by agreeing not to reveal the location in your postings. Ultimately it may prove academic if more mainstream media (newspapers/ TV etc) mention the exact location. In that case, of course, we can re-assess the situation. Please feel free to give me your feedback on this approach. Hopefully you'll agree this is a fair solution, but I'm happy to read any discussion.", 
      "date": "2006-06-19 15:50:00", 
      "id": 3170, 
      "responses": 10, 
      "subject": "Important - for all readers - bird issue", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2377"
    }, 
    {
      "body": "Yes, sounds odd I know. We have recently noticed an awful lot of bird activity coming from one of the flats above us. You can certainly hear a nest of young uns chirping away, which leads to a rather big bird swooping down and off on a food run. Is the person that's harbouring a nestful of Golden Eagles s forum member? If so, please tell me that they are Golden Eagles and not pigeons.  Anyone else noticed them?", 
      "date": "2006-03-13 13:14:00", 
      "id": 4426, 
      "responses": 10, 
      "subject": "Erm...bird of prey?!?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2132"
    }, 
    {
      "body": "How did we get rid of the geese (thank you for whoever managed that) and - in their absence - how did the clever white-breasted Mummy duck land up upside-down and dead in the water last week? Gulls? Predatory pigeons? Other ducks? Other predators? I doubt whether it was Mr and Mrs Coot or the Moorhen family. There is a lot of life and sudden death going on, Lakeside, but it is quite difficult to keep up with it....it is a bit like missing the key episode in a Soap.", 
      "date": "2007-04-15 20:57:00", 
      "id": 4390, 
      "responses": 9, 
      "subject": "LakesideLife", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3235"
    }, 
    {
      "body": "Has anyone else noticed the Squirrel on the 2nd floor of Willoughby / Andrewes / Speed?  We often spot him (or perhaps her?) in the mornings on our 2nd floor Willoughby balcony. He has had a great time digging up and eating old bulbs and even though I don't like him trampling on my new bulb shoots he is fun to watch. Unlike the wood pigeons he is not at least eating the new shoots. When he's finished digging up our troughs he continues round into Speed. Today he put his front paws on our sliding window - he seemed to know what the door was for and wanted to come in. He seems very tame and does not mind people standing over him, inches away, when he is eating old bulbs. He is also getting very fat. Has someone been letting him in and feeding him I wonder? How did he get up to the 2nd floor balcony? I wonder if he can get down or get between the floors? Also, have you noticed the Herons? I saw one on the top of Gilbert this morning and later on my boyfriend saw two circling around. Perhaps they are spotting nesting sites in the Barbican?", 
      "date": "2006-02-14 09:41:00", 
      "id": 4590, 
      "responses": 9, 
      "subject": "Second floor Squirrel / Herons", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2074"
    }, 
    {
      "body": "We have lost the sparrow colony by Breton House, which this summer had built up to around 30 birds. Hawks, the adjacent building works and disease have all been suggested -maybe a combination of factors, but one way or another they have gone. Even more worrying is the suggestion other small birds, such a blue tits, are also becoming scarce. Has anyone else noticed anything?", 
      "date": "2006-12-12 09:28:00", 
      "id": 3368, 
      "responses": 8, 
      "subject": "Loss of Barbican sparrow colony", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2824"
    }, 
    {
      "body": "A yellow wagtail was down on the lake today between St Giles and the Barbican Terrace.   Would be interested to hear if anyone else has seen one here before - it seems to have strayed in from its summer migratory areas of 'Norfolk wetlands' and similar", 
      "date": "2007-07-07 15:38:00", 
      "id": 3487, 
      "responses": 7, 
      "subject": "Yellow Wagtail", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3477"
    }, 
    {
      "body": "Does anyone know what the bird is that puts out a repeated single high 'whistle'? I can hear it from Andrewes day and night.  Don't worry, I don't want to take my air gun to it, I'd just like to see what it looks like as I haven't heard this call before.  Have tried to spot it around the lake but it seems to have the ability to throw its voice just to confuse me.", 
      "date": "2005-06-24 08:45:00", 
      "id": 4678, 
      "responses": 7, 
      "subject": "ornithology: do you know...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1713"
    }, 
    {
      "body": "Is it me, or is the mosquito situation getting out of hand. I have never been bitten in my life before, but last week i awoke thinking i was having a bad dream - i thought i'd heard a buzzing in my ear. I lay there, just as i was going off to sleep, it happened again. And then again. then i felt something crawling over my face. I jumped out of bed, couldn't see anything, went back. This happened continuously throughout the night and drove me mad. In the morning... big red bite marks everywhere. then searched my room and found a mosquito, bloated with what i presume was my blood. squashed it, blood everywhere. Since then i have found dozens each day in my flat. It's driving me crazy. What's going on? i don't even live particuarly near the lakes. Help! I don't want to get mosguito nets for my windows, but i don't remember it being like this last year. I do remember though there being other posts last year about this from people near the lakes, and wondered if they've noticed it getting even worse. Or perhaps you've all just got mosquito nets and so they've travelled a little further this year, hence why i'm now plagued. I had discussed getting some stickleback for the lakes/bryer pond - am now going back tomorrow to my mum's house where there are hundreds in the pond and think i might do a bit of pond-dipping before heading back to barbican  ", 
      "date": "2007-08-07 11:46:00", 
      "id": 3383, 
      "responses": 6, 
      "subject": "mosquito", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3570"
    }, 
    {
      "body": "I noticed a heron being attacked by sea gulls on top of Thomas Moore House early this morning. The same thing happened earlier in the Summer and the heron disappeared for a few months. I love seeing these birds around the pond, can anything be done to get rid of the sea gulls? Last year the heron was here throughout the Summer.", 
      "date": "2007-09-01 11:53:00", 
      "id": 3420, 
      "responses": 6, 
      "subject": "Heron", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3619"
    }, 
    {
      "body": "Following helpful advice to put peanuts in the bird feeder rather than bird seed I now have some visitors!  However despite not being completely ignorant on the topic, I have never seen these birds before. They are big - smaller than pigeons/magpies I think but bigger than any other garden bird I have seen.  They have a rosy/brown/pinkish chest and a flash of white at the back.  They are pretty acrobatic and can balance on the bird feeder (which is hanging) to get the nuts.  And there are 2 of them. Any ideas? Whilst writing any ideas how to keep the pigeons away? Thanks.", 
      "date": "2007-09-11 08:52:00", 
      "id": 3429, 
      "responses": 6, 
      "subject": "bird identification", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3644"
    }, 
    {
      "body": "This evening's 'The Nature of Britain' programme includes filming which took place last year of the raising of ducklings on the Barbican Estate.  It's on at 9.00 on BBC1 (recording number 4453 if you want to record it).", 
      "date": "2007-10-24 14:16:00", 
      "id": 3470, 
      "responses": 6, 
      "subject": "This evening's 'The Nature of Britain' - Barbican ducklings", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3745"
    }, 
    {
      "body": "There's a very weird sort of skinny fox-type creature with black and brown splotches , foxshaped head and long tail, looks hairless from here, which ahs just appeared on the school site below my window. Tell me how to import a photo and I'll put one on the chat-room. Wotizzit???   [/img]", 
      "date": "2007-04-22 18:33:00", 
      "id": 4246, 
      "responses": 6, 
      "subject": "What on earth is this creature?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3259"
    }, 
    {
      "body": "great news ... the lovely, determined, admirable duck with the white breast has had 8 ducklings on the pond beneath bryer, causing great joy in all who witness them ... i thought i'd tell people because all the ducklings i've seen this year have been floating ones ... i hope they stay there because living on the big lake at the moment must be like swimming across the Styx every day for a small new arrival, what with geese, ferocious males and clinging green mess ...", 
      "date": "2005-07-03 18:58:00", 
      "id": 4689, 
      "responses": 6, 
      "subject": "the patter of webbed feet", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1724"
    }, 
    {
      "body": "Sorry to report the raiding of a blackbird nest on a top floor balcony in Ben Jonson by a crow this morning.  Sadly it seemed inevitable as both crows and magpies had been hanging around and showing an interest. Have the ducks been any more successful this year?", 
      "date": "2007-06-13 08:37:00", 
      "id": 3346, 
      "responses": 5, 
      "subject": "Predatory crows and magpies", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3419"
    }, 
    {
      "body": "I woke up this morning to the most lovely chirpy but tuneful birdsong outside amongst the plants in the windowboxes. It was about 5am but the sound cheered me up no end. Anyone know which birds are singing in the Barbican at this time of year? This followed ducklings running along the fire escape on Saturday so it's been quite an ornithological weekend. It's a great bonus to live in the middle of a major city with all this wildlife outside - and some wild life inside by all accounts!  ", 
      "date": "2008-03-24 05:28:00", 
      "id": 3827, 
      "responses": 5, 
      "subject": "Birdsong", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4149"
    }, 
    {
      "body": "Not sure the peregrines are enjoying their new found celebrity status. On several occasions over the last few days, they have been displaying alarm calls and flight patterns. Am concerned that if they continue to be disturbed they will relocate elsewhere. ", 
      "date": "2006-06-05 18:41:00", 
      "id": 4425, 
      "responses": 5, 
      "subject": "Feathered celebrities", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2339"
    }, 
    {
      "body": "A ghostly female form was spotted in St Giles Churchyard at 9.30 this evening, feeding the geese. Who are you, ghostly lady - and please, no more encouragement to the geese.", 
      "date": "2006-04-05 21:16:00", 
      "id": 4647, 
      "responses": 5, 
      "subject": "Feeding the geese", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2176"
    }, 
    {
      "body": "Six more ducklings sitting on the lake... And if one more seagull should fancy a bite size snack There'll be five more ducklings sitting on the lake etc until they are all gone! Maybe the ducks could offer to clean up the goose poo in return for protection of the ducklings?", 
      "date": "2006-06-28 19:55:00", 
      "id": 3174, 
      "responses": 4, 
      "subject": "Ducklingicide", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2410"
    }, 
    {
      "body": "Not sure if this is a \"secret\" or not, but it seems the Falcons (jnr) have returned to the Bbcan. We seem to see them quite regularly and it appears to be part of their hunting ground. Anyone with a chihuahua be warned!!!!!", 
      "date": "2006-11-01 13:59:00", 
      "id": 3205, 
      "responses": 4, 
      "subject": "Birds...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2713"
    }, 
    {
      "body": "Is that woman still feeding the ducks?", 
      "date": "2008-05-04 21:24:00", 
      "id": 3571, 
      "responses": 4, 
      "subject": "Ducks", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4300"
    }, 
    {
      "body": "The other night at about 11 pm a tuneful bird was singing its heart out in Speed House Garden.  Any experts on birdsong hear this.  Was it a nightingale - or perhaps an insomniac blackbird?", 
      "date": "2006-03-10 13:32:00", 
      "id": 4629, 
      "responses": 4, 
      "subject": "Night birdsong", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2126"
    }, 
    {
      "body": "i'm not sure if its my imagination but i think the water is slowly but surely draining out of the pond under bryer ... is there some work going on or are we seeing the first radical signs of water conservation?   i know there are so many other things to think about but i'm worried about the frog spawn ...", 
      "date": "2006-04-12 07:20:00", 
      "id": 3070, 
      "responses": 3, 
      "subject": "bryer pond", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2196"
    }, 
    {
      "body": "Many residents will see that we have a beautiful grey -blue heron who first came for a visit, but is now here more frequently. Yesterday I saw her?him ? at about 10.30 am on the strip of garden by the lake overlooked by Wallside. The heron had flown there after being thrown bread by a couple of visitors on the west space outside St Giles. I know herons stand still for an amazing amount of time, watching their prey, and walk rather stiffly. Yet there was something about the way he walked towards the lake - he seemed tired.  Perhaps its just my imagination, or the time of year, but I hope the heron is OK and is not being stressed by living with so many people.  Perhaps others who know more about herons can enlighten me.", 
      "date": "2007-09-15 08:25:00", 
      "id": 3424, 
      "responses": 3, 
      "subject": "Is the heron OK?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3657"
    }, 
    {
      "body": "Anyone any idea about the crazy barking dog that was making such a racket about 8am this morning on the Speed side of things? Or was it just a mad bird that sounds like a dog? I've heard pigeons in the barbican that make a noise like a gorilla, so it's not out of the question.", 
      "date": "2007-06-30 14:34:00", 
      "id": 3475, 
      "responses": 3, 
      "subject": "Mad barking dog", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3457"
    }, 
    {
      "body": "I was surprised on Sunday afternoon to look out of the window and see a fox on the path outside, looking at me - TM garden.  It looked quite young and loped leisurely across the garden to the jungle that is Lambert Jones and was last seen heading for the swings.  Have we had a fox for some time and I've only just noticed?  I'm not known for my powers of observation.  As long as a hunt doesn't come crashing in, in pursuit!", 
      "date": "2006-12-27 11:28:00", 
      "id": 4119, 
      "responses": 3, 
      "subject": "Urban fox", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2860"
    }, 
    {
      "body": "According to the FT today (\"the way we live now column\" on page 14) a nest of falcons is in the Barbican and the June 6 Mozart fireworks have been cancelled to allow oeace and quiet for hatching.", 
      "date": "2006-05-30 13:31:00", 
      "id": 4428, 
      "responses": 3, 
      "subject": "Barbican peregine falcon", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2327"
    }, 
    {
      "body": "I saw the most astonishing bird on the lake opposite wall side. The size of a sparrow, bright yellow (dare I say canary yellow) breast and an extraordinarily long tail, swallow shaped in yellow and black. Any body know what it is please?", 
      "date": "2008-05-23 08:41:00", 
      "id": 3605, 
      "responses": 2, 
      "subject": "Bird Identification", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4366"
    }, 
    {
      "body": "Not sure whether the black aquatic birds with red heads are coots or moor hens but a tradgedy is beginning to unfold as one of them laboriously constructs a nest on top of the fountain in front of Mountjoy House. Normally inactive this is tested once a week on Sundays between 4 and 5 in the afternoon. Anyone have a hot line to the estate office.", 
      "date": "2008-04-23 07:29:00", 
      "id": 3890, 
      "responses": 2, 
      "subject": "Coot Alert", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4267"
    }, 
    {
      "body": "Hi there I've just come back from Columbia Flower Market with a couple of Echiums (canary palms) which grow really well here, and are loved by the finches.  I almost bought an olive tree but thought it best to ask the learned Forum if they grow well on our balconies. When I first moved in to Thomas More four years ago, I lost a fortune on plants which didn't do too well.  We're in Thomas More but are moving to Mount Joy where the corner part of the balcony is large enough for a small olive tree, and still be a fire exit.  I sat in Mount Joy yesterday looking at the view and a jay flew down and started to sing - very surreal. I now want to get more plants/trees to attract more wildlife. Has anyone had any success with olive trees here or anything similar? The balcony corner has a north/east aspect.  Thank you.", 
      "date": "2007-04-22 14:20:00", 
      "id": 4392, 
      "responses": 2, 
      "subject": "Olive Trees on our balconies", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3257"
    }, 
    {
      "body": "We were amazed and thrilled last night at around 9:30 to see a fox slinking along the podium under Speed House. We followed him along the podium, up the stairs to the conservatory where he (or she) pattered off towards the Golden Lane Estate. Even though it was a bit of a scrawny specimen, it still struck us as rather grand to be living amongst wild mammals in the heart of the city. Or are there any horrendous down-sides to sharing our homes with  ?", 
      "date": "2004-07-11 20:12:00", 
      "id": 1506, 
      "responses": 1, 
      "subject": "Fox on the podium", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&hilit=foxes&t=1190"
    }, 
    {
      "body": "We were amazed and thrilled last night at around 9:30 to see a fox slinking along the podium under Speed House. We followed him along the podium, up the stairs to the conservatory where he (or she) pattered off towards the Golden Lane Estate. Even though it was a bit of a scrawny specimen, it still struck us as rather grand to be living amongst wild mammals in the heart of the city. Or are there any horrendous down-sides to sharing our homes with foxes?", 
      "date": "2004-07-11 20:12:00", 
      "id": 2902, 
      "responses": 1, 
      "subject": "Fox on the podium", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1190"
    }, 
    {
      "body": "Jay Bird. Now I've got your attention... Has anyone else noticed the really beautiful Jay Bird(s) that is frequenting the Barbican lately. I never saw anything as nice when I lived outside of London, so I feel its even more amazing to see it here. It is obviously a bit more canny than the other birds as it has mastered my pigeon proof peanut feeder.", 
      "date": "2005-08-31 07:57:00", 
      "id": 2991, 
      "responses": 1, 
      "subject": "Naked as a...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1824"
    }, 
    {
      "body": "Andrewes House pond-side, the nasty Canadian geese have produced 6 of the fluffiest goslings ever. Worth a look.  I'll be watching the ducks to see if they exact revenge on the little ones.", 
      "date": "2006-05-11 08:46:00", 
      "id": 3101, 
      "responses": 1, 
      "subject": "Canadian goslings", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2282"
    }, 
    {
      "body": "If you thought our pigeon discussion got out of hand, take a look at what happened down in Kingston (letters at the end of the article):", 
      "date": "2006-12-07 10:06:00", 
      "id": 3253, 
      "responses": 1, 
      "subject": "Pigeon discussion", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2813"
    }, 
    {
      "body": "This morning I found the remains of a blackbird on our Speed House balcony - mostly feathers, with just enough legs, beak and guts to make it sticky. Is this likely to be the work of a seagull, or perhaps we have another bird of prey on the estate, or do we have a phantom cat stalking the balconies after dark?", 
      "date": "2007-12-20 09:11:00", 
      "id": 4182, 
      "responses": 1, 
      "subject": "Look what I found on the balcony....", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3880"
    }, 
    {
      "body": "I've just come back from a weekend away only to find that the pigeons have eaten all the radishes and beetroots on my balcony. What I would like to know is how do city pigeons know anything about vegetable plots or do they have country retreats too!", 
      "date": "2007-05-08 10:14:00", 
      "id": 4331, 
      "responses": 1, 
      "subject": "City Slicker Pigeons", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3311"
    }, 
    {
      "body": "I heard some odd bird noises this morning - are the falcons from last summer back on the estate?", 
      "date": "2007-03-25 12:15:00", 
      "id": 4349, 
      "responses": 1, 
      "subject": "Bird question", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3182"
    }, 
    {
      "body": "The following April 1 notice was put up in a Speed House lift but I am not sure it circulated much wider and I think it deserves to be preserved for posterity.   Pigeon control on the Barbican estate  Measures to reduce the numbers of wild pigeons on the Barbican Estate are proving successful with the introduction of pigeon pie in the Waterside caf. The weekly visits from the Harris hawk are ensuring that the pigeons are fully race-fit and the pies have now been authorised as low-fat by the Cripplegate healthy eating society.  To ensure a plentiful supply of pigeons we ask that if residents find a nest on their balcony, you keep your personal noise to a minimum.  We have been assured by Barbican engineers that the recent noises from running barbican fire alarm tests at the weekend, drilling for oil in Milton Court on unloading trucks at all hours are collectively and statistically less intrusive than the noise residents make playing Radio 3 at low volume with the windows closed.  Please respect your wildlife neighbours and please wear soft slippers indoors at all times. Feeding the pigeons is OK - but Waitrose only please. We have had some younger birds gagging on Somerfield tit-bits and remember  no fast food. If you want pigeon Foie Gras  Harrods can deliver a rather nice hamper of foods to stuff your pigeons with.  We do not recommend stuffing by force (gavage)  sp please just ask your birds politely to eat as much as they can.", 
      "date": "2007-04-12 00:06:00", 
      "id": 4372, 
      "responses": 1, 
      "subject": "Pigeon control on the Barbican estate", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3222"
    }, 
    {
      "body": "This evening I actually spotted a shoal of golden orfe, or whatever they are, in the lower lake.  I had begun to think that the new fish stock for the lake was a figment of someone's imagination!  However, the recent comment that there aren't any mosquitoes has not been borne out by a number of the bloodsuckers in my flat last night! Also on the lake spied some other ducks (other than mallards).  There were a couple with red necks and one with a black neck.  Perhaps someone with ornithological knowledge could let us know what species these are and whether they are migratory, or likely to stay.", 
      "date": "2005-06-23 21:21:00", 
      "id": 4670, 
      "responses": 1, 
      "subject": "Ducks and fish", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1712"
    }, 
    {
      "body": "So according to the BEO, the insects swarming from the lake are mainly mayflies which don't bite, make excellent food for birds and bats, and should die off at the beginning of June. Any ressies near the lake care to comment?", 
      "date": "2005-06-03 12:45:00", 
      "id": 4729, 
      "responses": 1, 
      "subject": "Lake Insects", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1662"
    }
  ]
}