{
  "summary": [
    {
      "body": "This lift rarely seems to be working - something which I have seen cause considerable distress to a number of people (myself included). Today there was a notice stuck to the lift button at the upper level which read approximately as follows:- \"This lift button is not working. To call the lift please use lift button on the other level.\" This might be someone's sick idea of an April Fool's joke - or it might be genuine. Either way, it stinks. But who takes responsibility for this?", 
      "date": "2008-04-01 14:57:00", 
      "id": 3844, 
      "responses": 14, 
      "subject": "Lift at the corner of Speed/Willoughby", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4172"
    }, 
    {
      "body": "Received the latest copy of Barbican News this morning. Apart from the usual updates, I was most interested in one article. It was the one about the lift doors in John Trundle and Bunyan. How have these lift doors got into such a state? From what I could make out in the small photograph, they appear to have suffered a lot of vandalism. Do these block suffer from feral youth and other such problems? And if so why has nothing been done. Will be the lifts themselves next?", 
      "date": "2005-07-29 16:04:00", 
      "id": 2961, 
      "responses": 10, 
      "subject": "Feral Vandals?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1769"
    }, 
    {
      "body": "Does anyone else find the noise of lifts intrusive? I was wondering if we just had a poorly serviced one in our block. It's seems to emanate from the winding gear (perhaps the cables). Sound level is variable but when I first heard it thought it was distant roadworks!", 
      "date": "2005-12-30 14:03:00", 
      "id": 3027, 
      "responses": 6, 
      "subject": "Lift noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2001"
    }, 
    {
      "body": "anyone else notice that 02 lift in ben jonson needs just a splash of paint to get rid of the graffiti? its all begining to look a lttle tatty and it shouldn't", 
      "date": "2005-04-20 21:31:00", 
      "id": 2939, 
      "responses": 5, 
      "subject": "service charges, somerfield, and a splash of paint", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1579"
    }, 
    {
      "body": "The lift on the East side of Ben Jonson is breaking down on a regular basis. It's absolutely ridiculous. My boyfriend was stuck there for 15mns this morning before the lift started working again. He was late for work. Anybody else got similar problems in other blocks? Clochette", 
      "date": "2005-05-06 12:25:00", 
      "id": 2931, 
      "responses": 2, 
      "subject": "Lifts - Enough is enough", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1610"
    }, 
    {
      "body": "Twice in recent weeks the new lift at the eastern end of the estate has broken down.  The telephone number posted for emergencies actually leads to the Guildhall switchboard.  They have no record of who is responsible.  The Corporation failed to pass relevant material sent to them from the then builder Ardmore-Mace (now fired by Gerald Ronson for not being tough enough in their dealings with residents and the Environmental Health people when damage was caused to a number of flats due to their work).  Ardmore-Mace says it is not responsible.  So the fire brigade had to be called.  Anyone using the lift should be aware that aside form shouting no help is available.  The Corporation was informed at least a fortnight ago and still no telephone numbers have been posted. They even claimed that the lift should be maintained by the Estate!  News to the Estate and our excellent engineers.  The Estate was unaware of this and, in any case, the Estate would not assume responsibility for a year after construction.  One trusts that the Estate will charge the Corporation for staff time.   So use that lift at your own risk.  If you press the bell no one who can do anything is altered.  If you use the telephone you get the staff at the Guildhall or the new call centre and the reply that the lift does not exist or they know nothing.  The name of the contractor and an emergency telephone number should be there by law.  It is not.  The Corporation has done nothing about this that has led to an improved situation.   However, the alternative of the exit from Willoughby 03 car park is also very uncertain.  The door has been out of action at least twice over the last fortnight nicely coinciding, on occasion, with the lift on the podium being out of action. People in wheelchairs and other people with walking difficulties have no way out from that corner of the estate unless someone with a pass key kindly takes them through Willoughby House and that is a long way around.", 
      "date": "2008-02-03 10:22:00", 
      "id": 3625, 
      "responses": 2, 
      "subject": "Corporation incompetence?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3977"
    }, 
    {
      "body": "Does anyone have any insider knowledge about when the lift and staircase between the street and the podium level on Moor House will finally be available for use? It seems that they've been completed weeks, if not months, ago. I have a pram, and the lift would be really helpful. Is the Corp in charge of these things, or the owners of Moor House?", 
      "date": "2005-08-13 09:30:00", 
      "id": 2969, 
      "responses": 1, 
      "subject": "Lift/Moor House", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1803"
    }
  ]
}