{
  "summary": [
    {
      "body": "I have just received a letter from the corporation notifying me about Heron's planning application to convert much of the Speed/Willoughby car parks over to the exclusive use of the new Milton Court developers. Call me a nimby, but I would encourage as many people as possible to object.  - the application involves turning ALL the spaces on Speed 03 and Willoughby 02 over to the exclusive use of Milton Court. That is over 150 spaces to be removed from residents' use. (Together with developments in Lauderdale, there seems to be a trend developing here.) - Milton Court drivers would share the existing entry into 03 level with us, but have their own entrance to 02 level from the existing ramp on Moor Lane. Both entrances will have no CPAs, just electric gates plus CCTV. Pedestrian entry for Milton Court residents into 02 and 03 levels would be by a new door at the corner of silk street and Moor lane, again with electronic entry. In my view the combination of large numbers of people using 03 level together with no CPA leads to an unacceptable reduction in security. Brandon Mews residents have their back doors opening onto the car park plus there are a number of storage lockers there. Given that it's all too easy for someone to slip in before the electric gates close, this greatly increases the scope for intruders. (And I don't put much faith in CCTV - it's only effective if someone's watching it all the time, in which case why not put them in the car park instead of behind a screen?) This also affects flats overlooking Speed Gardens, which can be accessed from the car park directly (the door currently has no lock on the car park side). Note that there will be pedestrian access between the Milton Court and resident parts of the car parks, so security will be compromised for resident car park spaces as well - anyone slipping in behind a Milton Court user will be able to get into the resident areas of 02/03 without having to pass a CPA.  Further the spaces (& CCTV cameras) proposed for 02 level are directly opposite Brandon Mews kitchens/2nd bedrooms, resulting in increased noise and less privacy for residents. The plan is also stupid from the perspective of Milton Court residents who (following the removal of their bridge) would have to cross the road (with no pedestrian crossing) to get to their car park.   Last but not least, if you're opposed to the Milton Court tower, then opposing the parking scheme is another way to scupper it as it could not proceed without the car park.  The deadline for objections is 23 November. Details of the application can be found at ", 
      "date": "2007-11-04 00:16:00", 
      "id": 3684, 
      "responses": 49, 
      "subject": "Milton Court car park proposal", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3770"
    }, 
    {
      "body": "Since BA Chair isn't interested in finding out what a majority of residents think on this issue, here's a very non-scientific poll to find out.", 
      "date": "2006-12-04 22:14:00", 
      "id": 3311, 
      "responses": 29, 
      "subject": "Milton Court Poll", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2801"
    }, 
    {
      "body": "It is not too late to make a difference. Today (31 October) is the last day to get in your objections for the Milton Court development: a school for the Guildhall School of Music and an enormous residential tower. Reference 06/01160/FULEIA If you haven't got your objection in yet, you can email it to   or you can hand it over in person by going to the 18th floor of St Alphage House. You must ask for a receipt with today's date. Objections received after today will still be taken receipt of, but might not be considered fully. But if you can't make today, you should definitely still send yours in. I have pasted derbyram's points to object on below. It is important that people who object to the proposal to send in a letter of objection. We helped to have the submission rejected before and we can hopefully do it again. Here are the points: The plan submitted in March has been modified in an attempt to satisfy some of the objections raised, but in essence remains the same: a new building with the lower block housing a concert hall and theatre for the GSMD, surmounted by a residential tower.  284 flats in a tower covering half of the existing site, just lower than City Point  residential density over 8x greater than within the Barbican (even Heron note this in their environmental impact study  density will be 1183 units per hectare, compared with a recommended central location maximum of 240-435 as per the Mayors London Plan, which also states that density should respect local context and communities)  the existing Milton Court perimeter wall moved 1.9m closer to the Barbican, resulting in the road carriageway narrowing from 10.4m to 7.3m  buses and other large vehicles will have great difficulty is safely negotiating the Silk Street/Moor Lane junction in the face of oncoming traffic.  Heron still plan to purchase 210 car parking spaces in level 03 and 02 car parks below Willoughby, and convert space under the Moor Lane car-park ramp into secure bicycle parking, all for the exclusive use of Milton Court.  a health spa/club with outside tables will sit on top of the GSMD building (6F), directly opposite upper floor residents bedrooms in Willoughby and Speed.  many flats in north Willoughby and Speed will still suffer from a loss of light, loss of privacy, and be subject to overlooking from the new tower.  loss of the existing public highwalk  note that recent new buildings constructed around the Barbican area have been designed to retain highwalk access  similarly redevelopment of Milton Court should follow the same UDP requirement.  this development will generate 3,705 person trips and 423 vehicle trips per day, which will be in addition to traffic generated by the new Ropemaker Place building.  a caf/restaurant will be located at the SE ground floor corner  expect early morning delivery noise, as experienced with the City Point bars/restaurants.  the contractor has promised to abide by CoL working hours (which differ from Barbican Estate noisy work hours), but note than the contractor has already broken such pledges made while constructing the new lift/staircase.", 
      "date": "2007-10-31 10:07:00", 
      "id": 4154, 
      "responses": 29, 
      "subject": "MILTON COURT FINAL OBJECTIONS", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3755"
    }, 
    {
      "body": "I understand that Heron, the  company owned by Gerald Ronson, has supplied Linklaters with excellent secondary glazing as a form of minimising noise during the demolition/construction opposite. As far as I know the same offer was not made to the residents of Speed and possibly Willoughby who are even closer to the site. Why have the house committees and the BA itself not taken action on behalf of the residents?  Why has there not been any public information?  Heavy and noisy destruction is about to start and nothing has been done. Answer please!", 
      "date": "2008-02-04 08:35:00", 
      "id": 3501, 
      "responses": 21, 
      "subject": "Milton Court:  Failure to protect Speed and Willoughby", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3978"
    }, 
    {
      "body": "I noticed that there is a letter from Waitrose on the communal noticeboard acknowledging the petition many of us signed in favour of a Barbican branch. Looks like positive stuff. PS Crispins is selling Andrex 4-packs for 1.55 so hurry!", 
      "date": "2005-10-06 17:49:00", 
      "id": 4530, 
      "responses": 21, 
      "subject": "Waitrose in Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1871"
    }, 
    {
      "body": "There's a planning application by the City to remove some of the car parking spaces beneath Lauderdale Tower on 02 level, and turn it into office space (apparently the Barbican Estate Office have outgrown their offices). This would have a detrimental effect to the look and feel of Lambert Jones Mews, as the new offices would overlook the Mews. There would also, obviously, be a loss of carparking facility for residents not only of Lauderdale Tower but of the estate as a whole. Could I just urge anyone who thinks this is another terrible idea to write a letter opposing this aplication as soon as possible. The case officer is Chhaya Patel and the Planning Portal Reference number is: P40059 and the application reference is: 07/00684/LBC. You can I do this online I think, you can certainly have a look at the proposals via this link:   I think it's a slippery slope if we turn a blind eye to allowing parts of the estate to be turned over to commercial uses in this way, especialy if we end up losing valuable facilities such as parking places, and it affects the character of the estate.", 
      "date": "2007-08-30 16:58:00", 
      "id": 3462, 
      "responses": 19, 
      "subject": "Application to turn part of Lauderdale car park into offices", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3614"
    }, 
    {
      "body": "With the new rules in it seems that the local pubs are all applying for late licenses.  I gather this doesn't mean they will necessarily open late but it does mean if they get them they will have the freedom to do so. Under the new rules once they have this licence they have it forever - there is no annual renewal process. The Pubs involved are: The Podium - 12.30 am The Hoggs Head (Aldersgate Street) - 2.00 am The Rack and Tenter (Love Lane/Citypoint) - 2.30 The Globe (Moorgate) - 2 am The Cuban Bar (City Point) - 1  am Objections are due either this weekend or next - send them to the David Milnes at the the town clerk's department -   Include your name and address in the email.", 
      "date": "2005-07-15 10:48:00", 
      "id": 4695, 
      "responses": 18, 
      "subject": "5 New late night license applications", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1744"
    }, 
    {
      "body": "There is a sign from the COL Planning department on the building on the corner of Aldersgate Street/ Carthusian Street stating that Tesco has applied to change the doors and if anyone thinks that this will \"affect the character and appearance of Charethouse Square\" they should write in before Auggust 17th.  Apparently plans may be viewed at their office on the 18th Floor of St Alphage House, Fore Street and protests may be sent to - Department of Planning and Transportation, COL, Po Box 270, Guildhall.", 
      "date": "2006-07-28 10:26:00", 
      "id": 3142, 
      "responses": 8, 
      "subject": "Tesco Doors", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2485"
    }, 
    {
      "body": "While we're on the subject of planning applications, there has been one made for the \"Void Space\" at the base of Cromwell Tower to be turned into a flat. I mention this as a recent flyer in Cromwell informed that the applicant is already a Cromwell Tower resident...and is also a member of the Cromwell Tower House Group. I would not want to comment on the rights and wrongs of the above, suffice to say that given the huge demand for tower flats, perhaps interested parties would like to contact the Chair of Cromwell Tower sub group, John Tomlinson, to evaluate the proposal. Apparently he is also liasing with David Graves of the BA. My personal view is that either the space should be converted into an apartment for a local key worker (teacher, nurse etc) plus family*, or auctioned by the corporation to the highest bidder with the resultant sum being spent on residential amenities. Either way, there should be more visibility as I suspect non-Cromwellians have not been informed of this. M * I should point out that I have no idea if the applicant - who is named on the flyer - is actually a key worker. For all I know, he might be. For that matter, he might also have already won an auction.", 
      "date": "2008-01-23 20:51:00", 
      "id": 3588, 
      "responses": 7, 
      "subject": "Cromwell Tower new flat being created - planning application", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3945"
    }, 
    {
      "body": "When Somerfield acquired 115 stores from Morrisons, the Office of Fair Trading referred the matter to the Competition Commission.  The Competition Commission has this morning issued its provisional findings. It believes that there are competition concerns in 14 of the areas. These are listed, but do not include Whitecross Street. This surprised me as Somerfield seems to have our local market thoroughly stitched up (particularly on Sundays). If only Somerfield were required to sell on the Whitecross Street store to another operator...  Anyone wishing to comment on the findings is invited to e-mail  . A summary of the provisional findings report is available on ", 
      "date": "2005-07-26 06:32:00", 
      "id": 2950, 
      "responses": 6, 
      "subject": "Calling all anti-Somerfield campaigners", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1762"
    }, 
    {
      "body": "I've found the planning applications for Milton Court.   This first one details the demolition etc    This second one gives details of a new bridge to replace exisiting one    The details show that both applications have been received by the City of London and you are able to submit your comments on both.", 
      "date": "2007-01-15 14:48:00", 
      "id": 3250, 
      "responses": 5, 
      "subject": "Planning application details - MILTON COURT", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2915"
    }, 
    {
      "body": "Only joking... I'm not at all. I'm very cross about it ...BUT That said, is it worth discussing what we should lobby for in the medium to long term with regards to the St Alphage site?  We might get lucky and Chase JP Bear away this time. The economy might collapse. Bear JP might be rouge traded, I don't know. But the fact remains that someone at some point will try and develop the land. It may be 5-10 years from now, but surely, it will happen.  Putting aside the ghastly injustices of the political situation which've been detailed on other posts, what is clear is that the hilariously impartial planning department regard us as nothing more than a bunch of self-serving fascists who don't understand the basics of the  London economy.  It seems to me that this their way of writing off our concerns as a form of selfish Nimbyism that damages the productivity of the City.  This is clearly ridiculous, but it seems entrenched in the mind of the planning department.  Surely then, we have to present ourselves as people who care deeply about the City ( not untrue I would imagine) and who lobby for the Barbican on belhalf of the 300 000 workers we have been sterotyped as being against? We should argue for an architecture that is bold and as landmark as the Barbican itself.  We should present ourselves as people who not only care about The Barbican- but care about other people having acess to the Barbican? Not just the arts centre, but the place as a whole? If this is a grandmother suck eggs situation, forgive me. My white rage at the proposal has made me want to do all kinds of things! But should we also be working out what would be acceptable- or is this giving up before we've even started? Perhaps it is a dangerous strategy. Perhaps me saying this is all part of their darstardly plan. I put nothing past their evil cunning. And I'm sure I'm absolutely stating the obvious here and everyone else is five steps ahead of me on this- for example- the Save the Barbican T-shirts I thought struck the right note I thought! I personally would rather another Gherkin or even a 'Shard of Glass' outside my living room than the bulky monstosity we've been offered. But more importantly, I want to be able to walk to the Guildhall / Cheapside without crossing a big road. I want to get to Moorgate without getting in a lift and I want the safety offered by having a steady stream of people coming in and out of the Barbican. These are, to me, more important that the height of the building. A landmark beauty would, in my view, benefit us all. But discuss... And apologies for the provocative subject title, I was concerned that the telephone had knocked the issue off the top spot. Don't even get me started on BT. [/i]", 
      "date": "2008-04-12 14:20:00", 
      "id": 3866, 
      "responses": 5, 
      "subject": "Pro the St Alphage Development", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4229"
    }, 
    {
      "body": "T-Mobile are about to put in a planning application to site a phone mast on the roof of 45 Beech Street. A very quick internet scan suggests from various sources that there are potential health risks, particularly to those living within 300 metres of mobile phone masts. If we want to object to the siting of this mast - individual letters/objections count. Does anybody else know about this?", 
      "date": "2006-06-13 17:17:00", 
      "id": 4429, 
      "responses": 5, 
      "subject": "T-Mobile proposed phone base station - i.e.mast", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2364"
    }, 
    {
      "body": "I note a few messages about Crossrail on another thread - and thought it might make sense to start a new one here.  I think one of the messages says that there is a plan B regarding the Crossover cavern under Defoe House.  There is indeed a Plan B, but that doesn't stop the crossover being constructed - but it might enable the engineers to do away with the proposed surface works on Aldersgate Street as the plan involves removing the muck through the tunnels back to Liverpool street, rather than through a shaft at Aldersgate Street/Beech Street.  Regarding subsidence, residents will be exceedingly unlucky if they are affected at all.  Virtually all underground works make for some subsidence (most of the Barbican falls within a prospective area where up to 10mm of subsidence might be expected) - but if this occurs evenly across the structures it is unlikely that anyone will notice apart from the engineers with their precision monitoring instrumentation.  Bear in mind that the Crossrail route under the Barbican is actually directly underneath the existing Metropolitan Line/Circle line/Thameslink tracks - and for safety reasons any subsidence will have to be very tightly controlled under the existing tracks.  I don't think Defoe residents should have anything to worry about.  Plenty of tunnelling has taken place under London recently without damage to overlying structures. Regarding the Crossover cavern - this is a structure where the twin tunnels are merged effectively into one much wider one so that trains can be switched from one track to the other.  These are necessary for both safety and operational reasons.  I am not sure why such a cavern needs to be directly under Defoe, but it is necessary for it to be somewhere, and in an urban environment it is virtually bound to be under some building and the plans place it  below Defoe and I doubt that that will be changed, but I reiterate that I still don't believe that Defoe, or any other Barbican residents will have anything to worry about from the tunnels themselves as they are 30 m down and modern engineering should be able to cope very well with this kind of problem.  The noise etc. from works in Aldersgate Street is another factor altogether and i think the current plans call for works to be carried out there for up to 43 months! - If we can do anything to get Crossrail to implement Plan B then we should.  Traffic disruption alone will be pretty horrendous, and there will also be major traffic problems in Moorgate where a major sewer has to be diverted and then replaced.  We do live in 'interesting times.'", 
      "date": "2005-04-13 20:06:00", 
      "id": 2909, 
      "responses": 3, 
      "subject": "Crossrail", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1560"
    }, 
    {
      "body": "Have spent an hour this evening looking at the proposals for the redevelopment of Milton Court and am extremely worried.  There was no mention, that I could see, of the impact a 42 storey building would have on the surrounding residential buildings.  In the expensive looking mock ups of every possible aspect of the new building + model, there was no reference to Cromwell Tower for example.  Residents there, and their current views had been conveniently forgotten. There was also minimal reference to Speed House & Willoughby House, unless I am mistaken. Am I the only one concerned about the imposing nature of the building, the impending building noise, light disturbance and additional hassle such a large building will cause? When I asked the City of London representative about the impending planning application & the date it would be submitted, he was reluctant to be specific.  He tried to placate me with \"sometime in June\".  My advice to all residents in the Barbican is to be vigilant about the planning applications and register your objections as soon as possible.  I would be interested in other peoples opinions on the redevelopment plans.....", 
      "date": "2006-04-27 21:38:00", 
      "id": 3075, 
      "responses": 2, 
      "subject": "Milton Court - proposed redevelopment", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2233"
    }, 
    {
      "body": "Heron and the GSMD have distribited a sales memo stating that the application to redevelop Milton Court was deferred because of \"design related reasons\". This is simply not true. I was at that planning application meeting - there were a myriad of reasons given by those who spoke in objection to this plan, and the Planning Committee effectively said \" go back and come up with an entirely new plan\". However - it seems that Heron and the GSMD care not a jot for the concerns of local residents, and believe that those concerns can be \"steamrollered\" away. So much for so-called \"consultation\". As invited by this memo, please do contact  \"leanne.parkinson@fourcommunications.com\"  and let Heron know how Barbican residents feel about such an approach........", 
      "date": "2007-06-06 22:16:00", 
      "id": 3337, 
      "responses": 2, 
      "subject": "Milton Court - Communication from Heron & GSMD", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3401"
    }
  ]
}