{
  "summary": [
    {
      "body": "I'm interested in finding out more about the Golden Lane guest flats (quality, pricing, etc.).  Any information would be much appreciated.  Regretfully my search showed only the last post of recent weeks.  Many thanks!", 
      "date": "2007-09-15 12:43:00", 
      "id": 1425, 
      "responses": 15, 
      "subject": "Golden Lane Guest Flats", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3658"
    }, 
    {
      "body": "I was just thinking....  My friend has to do a lot of reading for work. He spends something approaching 1k a year on books. Most he reads once and then never looks at again.  Is there a sort of video rental store but for books?? It would make things a lot cheaper, plus once one person has read one, the next person can get enjoyment from it.", 
      "date": "2008-01-30 13:52:00", 
      "id": 3621, 
      "responses": 10, 
      "subject": "Massive Hook", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3963"
    }, 
    {
      "body": "Hi There  Does anyone know if there are any rooms available to hire nearby suitable for a small kids party? (small in number and size!) thanks", 
      "date": "2008-02-09 21:55:00", 
      "id": 3498, 
      "responses": 6, 
      "subject": "room hire", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4004"
    }, 
    {
      "body": "There is what looks like a rather nice (and large) meeting room directly above the street entrance to Cromwell Tower .... Does anypone know if this is available for use by residents (and possibly invited guests) ?", 
      "date": "2007-09-28 13:41:00", 
      "id": 3435, 
      "responses": 5, 
      "subject": "Cromwell Tower meeting room ?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3697"
    }, 
    {
      "body": "We're moving into a Barbican flat where the original wardrobes have all been stripped out. (That sounds as though it's against the guidelines...) We'd like to replace them with originals or close replicas and would welcome any advice from others who have done the same.  Is there by any chance a mysterious store of wardrobes next to the mythical store of original kitchens somewhere on the Estate??", 
      "date": "2005-05-16 12:16:00", 
      "id": 4710, 
      "responses": 4, 
      "subject": "Original Barbican wardrobes", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1634"
    }, 
    {
      "body": "Does anyone know the latest on the salvage store? Last thing I heard was that it was closed for asbestos inspection. Is it back open again now? Any advice appreciated.", 
      "date": "2007-07-22 13:57:00", 
      "id": 4055, 
      "responses": 3, 
      "subject": "Salvage Store", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3527"
    }, 
    {
      "body": "Hi, Just moved into Shakespeare Tower (which we are loving).  I inquired about storage and have been offered \"baggage stores 741\".  I am obviously too much of a pack-rat, as I think I could potentially fill a wall of these units.... My questions:  Are all storage units this tiny?  If there are bigger ones available, should I wait?  If I take this one, are my chances of getting a second or bigger storage unit diminished, or years away?? Many thanks for your advice!", 
      "date": "2008-04-18 08:08:00", 
      "id": 3872, 
      "responses": 2, 
      "subject": "Storage Units", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4246"
    }, 
    {
      "body": "How can I find which sort of things they stock?    need a loo part and possibly a BJH stair rail", 
      "date": "2007-11-19 16:54:00", 
      "id": 4143, 
      "responses": 1, 
      "subject": "Barbican Salvage", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3803"
    }
  ]
}