{
  "summary": [
    {
      "body": "Hi! I just wanted to say how fantastic I think this site is! I've just moved over  from the States and I am really excited about living in the Barbican. I plan to spruce up my flat a little as its somewhat dated, and this site is such a great source of all kinds of information... its fantastic!", 
      "date": "2007-03-15 22:31:00", 
      "id": 4243, 
      "responses": 14, 
      "subject": "New to the Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3147"
    }, 
    {
      "body": "Well, it had to happen. When I first saw it over a year ago, I couldn't stand the place. Concrete as far as the eye could see; stark lines and council-estate environment. Or so I thought. Yet now, a year on, I find myself totally smitten! A true urban village; neighbours who greet each other, societies to join and a real community to become part of. The architecture fascinates me, as it has done my partner who has lived here for the past three or four years. So now it is that I am leaving South-West London suburbia to move here to the Barbican. What more could I ask for: superbly designed living accommodation, service staff who smile and go way beyond the call of duty, views to die for, a cinema and arts centre in the basement, gardens with lakes and waterfalls, beautiful secure gardens, a jungle hothouse to rival Kew, virtually non-existent crime rates, police who really do care, considerate neigbours... and all the benefits of the City on the doorstep. Anyway, with that over, I just wanted to say \"Hi, I'm new here\" - I feel priviledged to be in such a superb place to live. Why would anyone want to live anywhere else? God, I'm gushing now. How embarrassing... Timbo", 
      "date": "2007-04-15 19:27:00", 
      "id": 4323, 
      "responses": 9, 
      "subject": "Hullo, I'm new here", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3234"
    }, 
    {
      "body": "Hi!! We have just moved in to John Trundle. I am Sarahjayne, a graphic designer and my partner Jonnie is a Management Consultant. We have been here for a few weeks now and absolutely love it! There are a few things we are unsure of and would appreciate any advice. Is it possible to get Sky +, if so, how? Do we have to use a specific broadband internet provider? If we have visitors, where can they park? Our bathroom occassionally smells - is there a problem with the drains in John Trundle???!!! Where is best to do our food shopping? We have visited Sainsbury's in Angel and weren't impressed!! We don't have car, so ideally would love somewhere nearby other than the 'local' or 'express' variety of supermarkets where the selection is not great. This is probably wishful thinking!!  We look forward to learning more about our new area!! Many thanks", 
      "date": "2005-09-27 15:48:00", 
      "id": 4438, 
      "responses": 7, 
      "subject": "Hello! We've just moved in and have a few questions!!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1858"
    }
  ]
}