{
  "summary": [
    {
      "body": "As those of you who have received the latest Barbican Life will have seen, we did use barbicantalk comments on local establishments.  I am particularly keen to continue doing so, so please do comment in this thread on good, or bad, eating experiences in the general Barbican area.  I'm also keen to learn of reaction to new restaurants - for example I looked in on the new Cardamom Rooms restaurant in Charterhouse Square the other day (has replaced the old Gulshan/Bar Bombay) and it looks really nice and they seemed to be making a great effort - but I haven't eaten there yet.  Any comments would be appreciated. Also the Comptoir Gascon in Charterhouse Street has extended its eating options - anybody tried this yet? Any other new restaurants around that barbicantalkers have sampled?", 
      "date": "2005-09-25 08:56:00", 
      "id": 1375, 
      "responses": 136, 
      "subject": "Restaurants", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1854"
    }, 
    {
      "body": "Does anyone know when they are going to start demolition of Milton Court and whats going in its place. Barbican maintenance etc have already moved out and corporation have approved demolition. Nothing from Speed or Wiioughby groups, let alone B.Ass(ociation)", 
      "date": "2006-01-04 12:35:00", 
      "id": 3231, 
      "responses": 85, 
      "subject": "milton court", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2010"
    }, 
    {
      "body": "Anyone know what's happening to this pub on the corner of Goswell and Clerkenwell? After years standing empty, there seems to be some refitting going on.", 
      "date": "2006-07-19 20:33:00", 
      "id": 4046, 
      "responses": 36, 
      "subject": "Hat and Feathers", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2462"
    }, 
    {
      "body": "Does anyone have any information as to how high, how wide, the number of students, the age of said inhabitants, when will the structure be finished, when will the first kids be under roof etc. etc.! I've heard all kinds of stories, some plausable, some pretty far fetched, a few wanting me to sell up and flee. Having risen from the ashes of the old seat of learning the structure at present looks pretty formidable to say the least! Many months ago I was under the impression it would be a one story group of buildings. If one looks at what has risen so far that couldn't be gospel. I've even heard that there will be situated a football pitch on the roof!!! Enough rumours and neighborhood horror stories...any REAL information to give we who are interested to the point of distraction!", 
      "date": "2007-03-02 17:59:00", 
      "id": 3568, 
      "responses": 25, 
      "subject": "That shiney new school on Whitecros Street.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3095"
    }, 
    {
      "body": "Work men seem to be refitting it.  Does anyone know if/when it is reopening?", 
      "date": "2006-09-25 13:26:00", 
      "id": 4313, 
      "responses": 23, 
      "subject": "Crowders Well to Re-Open?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2630"
    }, 
    {
      "body": "I'm looking at covering new (relatively) restaurants in the next issue of Barbican Life magazine, plus those newly into the BA discount scheme.  If any Barbicantalkers care to comment on any of these it would be great in giving me an idea of how residents feel about these establishments. The 'new' restaurants I plan to cover include:  St Julien (Long Lane), Spice Corner (Aldersgate Street), Issus (Charterhouse Street), Warin (Whitecross Street), Portal and Pho (st John street).  Anyone know of any new restaurants I've missed locally?  lso any comments on the refurbished Barbican Bistro in the Barbican Centre. The new BA discounters are:  Coconut Lagoon (Aldersgate Street), Brasserie Malmaison (Charterhouse Square) as well as several of the 'new' restaurants above. Any comments much appreciated - thanks.", 
      "date": "2005-08-02 16:12:00", 
      "id": 2986, 
      "responses": 22, 
      "subject": "Restaurants again", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1779"
    }, 
    {
      "body": "Does anyone know if a new Tesco is coming to the building on the corner of Aldersgate Street and Carthusian Street?  It's the building currently covered in scaffolding, next to the NatWest Bank.  I know planning permission has been given for flats and a bookies.", 
      "date": "2006-05-27 11:09:00", 
      "id": 3122, 
      "responses": 20, 
      "subject": "Planning permission - Tesco?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2322"
    }, 
    {
      "body": "Has anyone else noticed a grinding squealing noise at night ?  Any ideas where it is coming from ?", 
      "date": "2005-08-07 08:36:00", 
      "id": 2970, 
      "responses": 14, 
      "subject": "Squealing noise near speed house", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1794"
    }, 
    {
      "body": "The Rising Sun shut at 9pm yesterday.  The Sutton has reverted to being closed on Sats.  The Hand & Shears is never open on Sats.  The Red Cow has closed.  The Butchers Hook and Cleaver only opens for private parties. Questions: where to find a half decent pub in the city for a pint on a saturday night?Anyone know why more of those that are open shut early?", 
      "date": "2007-04-01 19:50:00", 
      "id": 4375, 
      "responses": 14, 
      "subject": "The Rising Sun and saturday eve. drinking in the City", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3197"
    }, 
    {
      "body": "Is there anything more irritating than having one hover and circle over you when you're at home? It seems to be happening quite frequently. And before anyone shouts SECURITY, what can you possibly see that's any use from a helicopter that you can't see from the ground? If they're there for traffic purposes why would they hover over the Barbican? They must be very expensive to run. A friend once rang the police to ask the reason, and was told \"you don't think we're going to tell you do you?\". Well I think we should be told more about this sort of thing.. does anyone know what they're doing up there?", 
      "date": "2005-09-24 11:30:00", 
      "id": 4448, 
      "responses": 12, 
      "subject": "Helicopters", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1852"
    }, 
    {
      "body": "Does anyone know what is happening to this building by the Musem of London roundabout?", 
      "date": "2007-06-20 08:58:00", 
      "id": 3361, 
      "responses": 10, 
      "subject": "Clifford Chance Building", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3428"
    }, 
    {
      "body": "There is   in the Ben Jonson House car park. A whole pile of several full wheely suitcases by the lift. They could be full of gold, or diamonds, or goodness knows what. Or someone has gone on holiday with their large family and forgotten all their luggage. So many possibilities.", 
      "date": "2005-10-21 15:26:00", 
      "id": 4509, 
      "responses": 10, 
      "subject": "Ben Jonson car-park treasure!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1901"
    }, 
    {
      "body": "I think that the Waitrose thread includes a mention of Fresh & Wild, the 'health' food shop in Old Street, near the roundabout. I have heard that it will shortly be closing.  Can anyone confirm this?", 
      "date": "2006-05-09 12:33:00", 
      "id": 3093, 
      "responses": 9, 
      "subject": "Fresh & Wild", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2274"
    }, 
    {
      "body": "Just back from a month in the states and have found my postal ballot. Anyone know where the polling station is so I can either hand it in or vote there? thanks", 
      "date": "2008-04-30 11:32:00", 
      "id": 3902, 
      "responses": 9, 
      "subject": "Mayor of London and London Assembly Elections - May 1 - info", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4288"
    }, 
    {
      "body": "will it be open on time april ", 
      "date": "2008-02-07 21:45:00", 
      "id": 3785, 
      "responses": 8, 
      "subject": "golden lane campus", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3991"
    }, 
    {
      "body": "Has anyone heard that the Barbican/Museum of London is extending its liquor license to serve later?  If so, how much later?", 
      "date": "2006-05-08 13:15:00", 
      "id": 3092, 
      "responses": 7, 
      "subject": "New Extended Liquor Licensing for the Barbican/MOL?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2272"
    }, 
    {
      "body": "Does anyone know if there are exciting archaeological discoveries being made on the site of the new school in Whitecross St.? I can see it from my windows and was surprised to see that a large white protective roof has gone up over part of the site. There's a notice saying 'Danger Deep Excavation' on the surrounding fencing. The people who've been visible on site today are certainly not the usual workforce, either. As an historian specialising in this area I'm fascinated!", 
      "date": "2006-05-05 14:56:00", 
      "id": 3108, 
      "responses": 6, 
      "subject": "Archaeology on the new school site?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2256"
    }, 
    {
      "body": "about 3pm on Friday - lots of rumblings; sounds like buildings being demolished nearby. anyone know what all the noise is?", 
      "date": "2005-07-22 13:57:00", 
      "id": 2953, 
      "responses": 5, 
      "subject": "what is all that noise?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1755"
    }, 
    {
      "body": "T-Mobile are about to put in a planning application to site a phone mast on the roof of 45 Beech Street. A very quick internet scan suggests from various sources that there are potential health risks, particularly to those living within 300 metres of mobile phone masts. If we want to object to the siting of this mast - individual letters/objections count. Does anybody else know about this?", 
      "date": "2006-06-13 17:17:00", 
      "id": 4429, 
      "responses": 5, 
      "subject": "T-Mobile proposed phone base station - i.e.mast", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2364"
    }, 
    {
      "body": "Does anyone have any details of the planning application for the school in Whitecross Street to be extended extensively to cover the whole playground area? It's under Islington Council. This will mean at the very least that all the lovely trees will come down, more congestion in Whitecross Street etc.", 
      "date": "2005-06-20 08:27:00", 
      "id": 4671, 
      "responses": 5, 
      "subject": "PLANNING APPLICATION", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1699"
    }, 
    {
      "body": "I was disappointed to see that the Fox and Anchor has closed as it was a really nice Art Nouveau-ish local pub - and still had Smithfield opening hours so that it did a great breakfast. Anybody know if anybody's got plans to take it over?", 
      "date": "2006-09-30 20:27:00", 
      "id": 4289, 
      "responses": 4, 
      "subject": "Fox and Anchor closed down", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2646"
    }, 
    {
      "body": "is there anywere local to take your children to see fireworks thanks?", 
      "date": "2005-10-20 10:18:00", 
      "id": 4454, 
      "responses": 4, 
      "subject": "GUY FAWKES NIGHT", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1896"
    }, 
    {
      "body": "I've heard that the Crescent is being considered for shops - as in the original plan.  Firstly, is this correct? Could we convince Waitrose to open something that fits the surroundings?", 
      "date": "2006-02-19 22:35:00", 
      "id": 4593, 
      "responses": 4, 
      "subject": "Waitrose at the Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2091"
    }, 
    {
      "body": "Does anyone know when the Barbican Christmas tree goes up? And does it still go up by the stairs overlooking the lake by Willoughby?", 
      "date": "2005-11-30 09:23:00", 
      "id": 184, 
      "responses": 3, 
      "subject": "Christmas", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1964"
    }, 
    {
      "body": "I am in the process of buying a flat in John Trundle, and my solicitor made some enquiries with crossrail. What came back was a non specific letter, which told me nothing I am going to attach the letter at the end of the mail. My question is, has anyone in the same block had any more useful information than this, and is the possibility of structural damage a real possibility. Thanks Max Thank you for your enquiry of 9 December 2005 regarding the effect of Crossrail on the above property.  Cross London Rail Links Limited administers a Direction issued by the Department of Transport on 22 February 2005 for the Safeguarding of the preferred alignment of Crossrail. The Secretary of State for Transport has introduced a Bill into Parliament that if enacted would authorise acquisition of the land and construction of the project. The Bill is expected to take about 2 years to be approved, which will include an examination of the proposals and objections to them in public before two Parliamentary Committees. Construction could start in 2008 and take about 6 years.  You may inspect and/or purchase copies of Plans, Sections, Environmental Statement, Explanatory Notes and Non-Technical Summary regarding the Crossrail Proposals at specified Libraries and Local Authority Offices.  The proposed route of Crossrail runs from Shenfield to Stratford, descending into a tunnel at Bow. The line will continue through Whitechapel, Liverpool Street, Farringdon, Tottenham Court Road, Bond Street and Paddington, and continue on the surface to Heathrow and Maidenhead.  The property falls within the consultation limits shown on the plans attached to the Safeguarding Direction. The terms of the Direction require the local authority to consult Cross London Rail Links Limited regarding planning applications that are within the limits of consultation. The local planning authority is required to report to the Secretary of State for Transport if it resolves to determine the application in a manner which is inconsistent with the advice given by Crossrail.  It is Crossrail policy to limit damage to buildings as a result of settlement to slight (as defined by the work of Burland et al 1977 and Boscardin and Cording 1989), if necessary by carrying out engineering protective works.  We currently anticipate that properties located within the zone of settlement will be surveyed by independent building surveyors and a schedule of existing defects prepared.  Should any claim subsequently be made in respect of damage to the building caused by the construction of the works it will be considered against this initial survey and schedule.  Compensation will be payable in respect of any justifiable claims for damage so caused, in accordance with compensation law and practice.  With regard to operational noise, the underground sections of Crossrail are being designed with the aim that re-radiated noise levels inside buildings will not exceed a maximum sound level of 40dB(A).  In most underground areas the trains will run on continuous welded track supported on resilient base plates, which will help to reduce any adverse noise and vibration levels considerably.  If redevelopment is being considered, Crossrail would advise that a meeting be arranged with its engineers as soon as possible to discuss the impact of foundations, basements and other structures (including piles) on Crossrails proposed structures and tunnels, including ground movement arising from the construction thereof and the effects of noise and vibration.  I hope this information is helpful, but if you require any further assistance then please feel free to contact me.", 
      "date": "2005-12-12 16:49:00", 
      "id": 3005, 
      "responses": 3, 
      "subject": "crossrail letter", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1984"
    }, 
    {
      "body": "Is the retail butcher next to Smiths in Smithfield any good? I was going to buy a whole fillet of beef but it's all vacuum packed in plastic so I couldn't even see if it looked ok. Consumer comments welcome, thanks", 
      "date": "2007-08-23 09:49:00", 
      "id": 3412, 
      "responses": 3, 
      "subject": "SMITHFIELD BUTCHER", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3603"
    }, 
    {
      "body": "This morning on the way to work I saw a little demo between St Pauls and the Millennium Bridge. There were signs up protesting against the City's plans to allow an incinerator to be built there, just by the Salvation Army building. Anyone know what this is all about?", 
      "date": "2007-07-09 21:13:00", 
      "id": 3483, 
      "responses": 3, 
      "subject": "incinerator near St Paul's?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3485"
    }, 
    {
      "body": "According to Skyscrapernews.com planning permission has been granted for a 13 story building on the site of the Fore Street telephone exchange   . . I do not understand this on two counts.  Firstly I was not aware of plans having been submitted for public comment, and secondly I thought that the highly contentious plans for redeveloping the St Alphage Highwalk included taking in this site.", 
      "date": "2008-02-08 09:32:00", 
      "id": 3495, 
      "responses": 3, 
      "subject": "Redevelopment of Fore Street telephone exchange site?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3994"
    }, 
    {
      "body": "Does anyone have any idea when the demolition work on St Alphage House and surroundings is going to start? I understand that the plan is to start sometime in 2008", 
      "date": "2008-02-02 22:38:00", 
      "id": 3624, 
      "responses": 3, 
      "subject": "JPMorgan Chase building", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3975"
    }, 
    {
      "body": "Have we all received the above letter telling us that a hoarding \"will be erected\" for the above work on 23rd April, the very day that a decision was due on planning permission. Was permission granted? If so, are there any ways for the decision to be called in or appealed? Has a hoarding gone up?", 
      "date": "2007-04-24 12:19:00", 
      "id": 4253, 
      "responses": 3, 
      "subject": "Milton Court Lift / Stair Works (Four Communications)", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3266"
    }, 
    {
      "body": "I note that Keltbray having finished demolition on Ropemaker Street seem to be moving on to 1 Moor Lane, the rather striking green blue glass building just north of Milton Court.  Does anyone know what is proposed for that site?", 
      "date": "2005-09-06 21:21:00", 
      "id": 2993, 
      "responses": 2, 
      "subject": "New Demolition", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1832"
    }, 
    {
      "body": "Does anyone know what they are building where the old Whitecross school used to be?????? I looked on the islington planning website but couldn't find any info", 
      "date": "2006-05-13 18:36:00", 
      "id": 3104, 
      "responses": 2, 
      "subject": "Building works opposite from Waitrose", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2288"
    }, 
    {
      "body": "Anyone know what happene to the City Boot over Tuesday night?  Smashed out window, the smell of smoke and police on Wednesday morning leas to one conclusion. Any details anyone?", 
      "date": "2006-07-20 06:51:00", 
      "id": 3137, 
      "responses": 2, 
      "subject": "City Boot", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2464"
    }, 
    {
      "body": "Why is it being knocked down before consent has been given for a new building?  Or has the consent for the latest application been given?", 
      "date": "2007-11-29 20:05:00", 
      "id": 4152, 
      "responses": 2, 
      "subject": "Milton Court Demolition", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3824"
    }, 
    {
      "body": "Anyone know what the event is happening in Fore Street this lunchtime? It's all quite exciting -  Darth Vader, Stormtroopers, the Lord Mayor (of London, not a galaxy far far away) and scores of schoolkids.  Lots of fun but what's it about? It's all a lot nicer than writing a report which is what I'm supposed to be doing ", 
      "date": "2006-06-23 12:17:00", 
      "id": 4433, 
      "responses": 2, 
      "subject": "The force is with us", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2387"
    }, 
    {
      "body": "Does anyone know who / where the drilling noise in Speed House is coming from ? It seems almost impossible to pinpoint since it resonates through the concrete, but it's been happening most days on and off for about a month and it's driving me potty ! They do seem to keep reasonably close to the 10-4 time limit, but I can't imagine what can be taking so long !", 
      "date": "2006-04-04 14:44:00", 
      "id": 4640, 
      "responses": 2, 
      "subject": "Speed House drilling ?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2171"
    }, 
    {
      "body": "Anybody know what the big tent inside Frobisher Crescent is for?", 
      "date": "2004-06-03 15:06:00", 
      "id": 2900, 
      "responses": 1, 
      "subject": "Marquee", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1144"
    }, 
    {
      "body": "Heard that Whitecross Street is going to be overhauled - to what extent I don't know. There was a man with a clipboard questioning passers-by yesterday lunchtime. Anyone know anything?", 
      "date": "2006-01-12 11:44:00", 
      "id": 3035, 
      "responses": 1, 
      "subject": "Whitecross Street", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2029"
    }, 
    {
      "body": "did anyone find out what the digging on old school site on whitecross/golden lane site is about.Is it the old Jewish cemetry?All info greatfully reeived", 
      "date": "2006-05-16 17:15:00", 
      "id": 3106, 
      "responses": 1, 
      "subject": "archiology", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2297"
    }, 
    {
      "body": "why have they decided to chop half a meter of the width of the pavement  ouside the shops and school?", 
      "date": "2008-02-26 13:31:00", 
      "id": 3526, 
      "responses": 1, 
      "subject": "pavement reduction whitecross st", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4063"
    }, 
    {
      "body": "have just discovered a Barbican news release on a light display projected on london buildings in april 2006 , 10 sculpture court 12 same ,13 waterside, 14 waterside. Does any one know how far this display will spread onto/into surrounding blocks as no info that i know of has been released to B.A. or house groups?", 
      "date": "2006-02-18 16:48:00", 
      "id": 4588, 
      "responses": 1, 
      "subject": "light display", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2086"
    }, 
    {
      "body": "Does anyone know when the above building is coming down ? THANK YOU", 
      "date": "2006-03-18 16:33:00", 
      "id": 4615, 
      "responses": 1, 
      "subject": "MOORFIELDS BUILDING", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2143"
    }, 
    {
      "body": "The Haweli restaurant is boarded up - to me it looks like it's closed down rather than being refitted. Does anyone know what's happened?", 
      "date": "2005-06-04 18:11:00", 
      "id": 4735, 
      "responses": 1, 
      "subject": "Haweli", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1666"
    }, 
    {
      "body": "Whatever happened to the playgroup that was in the Barbican? I think it was called the \"Mary Rose Playgroup\". Anyone remember it?", 
      "date": "2005-06-06 16:15:00", 
      "id": 4739, 
      "responses": 1, 
      "subject": "Playgroups", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1671"
    }, 
    {
      "body": "About 2:15 today, five police and a riot shield standing around outside the Shakespeare pub. Anyone know what was going on?", 
      "date": "2006-10-06 13:53:00", 
      "id": 5039, 
      "responses": 1, 
      "subject": "Police outside the Shakespeare pub", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=2663"
    }
  ]
}