{
  "summary": [
    {
      "body": "Has anybody used Abracadabra or Helping Hands for cleaning (or anything else)? If so, a report would be most welcome. Thanks", 
      "date": "2005-04-27 17:46:00", 
      "id": 2935, 
      "responses": 14, 
      "subject": "cleaner report", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1596"
    }, 
    {
      "body": "I have now recommended my cleaner to 5 different people requiring cleaning/ironing not one of which has contacted her or me. Am I iwasting my time and hers?", 
      "date": "2007-07-04 16:44:00", 
      "id": 3438, 
      "responses": 14, 
      "subject": "cleaners", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3472"
    }, 
    {
      "body": "Thinking of calling Abracadabra to do a professional clean to my new Barbican flat.  Can any of you recommend them?", 
      "date": "2006-02-07 11:40:00", 
      "id": 3289, 
      "responses": 13, 
      "subject": "Flat cleaning", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2061"
    }, 
    {
      "body": "Hi, can anyone recommend a good carpet cleaner please? I have a flyer for Martyn Everett (if you've used his services, let me know please if he was any good/ how much he charges!) but I usually like to get a couple of quotes. Any advice about carpet dry cleaning generally - it sounds better, but is it smelly?", 
      "date": "2008-05-06 09:45:00", 
      "id": 3583, 
      "responses": 4, 
      "subject": "Carpet cleaner rec please", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4309"
    }, 
    {
      "body": "Can anyone please tell me the going rate for a cleaner?  I was thinking of paying 9 an hour.  I don't want to be stingy so would be grateful for information.", 
      "date": "2007-12-06 02:08:00", 
      "id": 4167, 
      "responses": 4, 
      "subject": "Cleaning rates", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3847"
    }, 
    {
      "body": "oops just realised i put this on the wrong forum, so apologies for duplication..... have been trying to call Terry to come and clean my garchey (rather overdue....) but getting a 'not possible to connect you' message  can anyone recommend someone else to come and give it a good scrubbing?", 
      "date": "2006-06-14 20:21:00", 
      "id": 4422, 
      "responses": 3, 
      "subject": "Garchey cleaning", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2367"
    }, 
    {
      "body": "Anyone used a good carpet cleaning service (steam or pref dry cleaning)  lately please? Or had a good experience with DIY hire cleaner?", 
      "date": "2007-03-19 18:56:00", 
      "id": 3298, 
      "responses": 2, 
      "subject": "carpet cleaning wanted", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3163"
    }, 
    {
      "body": "Please could anyone recommend a good reliable and trustworthy cleaner/household help who already works in the Barbican. I would prefer not to use an agency. Someone who can iron would be nice. Many thanks.", 
      "date": "2005-08-18 14:06:00", 
      "id": 2982, 
      "responses": 1, 
      "subject": "good and trustworthy cleaner needed asap", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1813"
    }, 
    {
      "body": "We've been using Helping Hand cleaners. Our current cleaner \"Jola\" is competent, and although I've some reservations about Helping Hand, they are by-and-large OK. Now I get a letter from Helping Hand saying they are closing down on Aug 31st and handing over \"the network\" to \"Reme McGurn Trading as Sparkling Touch\". I have to create a contract with her to continue the service we get. I am not atall sure about this. Has anyone any experience of \"Reme McGurn trading as Sparkling Touch\"? In particular, do they know the Barbican, provide photo id,show up on time  and clean the place OK?  Has anyone else had this letter from Helping Hand? Can anyone recommend another cleaning company/cleaner?", 
      "date": "2007-08-21 18:29:00", 
      "id": 3403, 
      "responses": 1, 
      "subject": "Helping Hand cleaner/Reme McGurn", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3601"
    }
  ]
}