{
  "summary": [
    {
      "body": "We have just received from EDF Energy the annual review of our monthly direct debit payment. At the end of the year we owed 25 and it was proposed to increase our monthly direct debit by 8 - 96 in the year to come. After a lengthy freephone call, this was reduced after much haggling to an additional 5 a month - 60 a year. EDF have been overestimating our direct debits in this manner for some years and I once raised the matter with Ofgen. We now contemplate looking for another supplier and will be interested in others' experience of EDF and any other suppliers and any suggestions for an alternative supplier and problems in switching suppliers. Help!  PS. We wish the French SNCF had taken over running our railways rather than dabbling in electricity supply.", 
      "date": "2007-05-01 11:41:00", 
      "id": 4321, 
      "responses": 6, 
      "subject": "Electricity charges", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3289"
    }, 
    {
      "body": "I moved here six months ago and have had two very high electricity bills.  The original oven would appear to be the culprit.  Have those of you who have replaced the original oven noticed a significant reduction in their bills?", 
      "date": "2007-10-20 10:44:00", 
      "id": 3455, 
      "responses": 5, 
      "subject": "Original oven", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3736"
    }, 
    {
      "body": "Hi - I've a strange question perhaps. I live in Ben Jonson and don't know where my electricity meter is. I've been getting estimated bills since I moved in and they seem high at 80 per month so I'd like to take an actual reading. Can anyone tell me where to find the little devil? Thanks", 
      "date": "2005-05-30 19:48:00", 
      "id": 4746, 
      "responses": 5, 
      "subject": "Electricity Meter reading", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1653"
    }, 
    {
      "body": "Today may be an unlikely day to mention solar energy,BUT--does anyone know how much energy could be generated from solar panels or photo-voltaic cells on the available roof space of the Barbican complex. I would think there must be a hectare or so of roof--but I don't know. Has anyone ever investigated this?   Should they?  Would turbines be useful? How much could be saved if the complex was made more energy efficient? Does anyone care?  Should they?  I know that PV cells generate DC, as opposed to AC voltage, and that inverters need to used to convert to AC. there seems to be no objective info on this: it is a morass of propaganda, and difficult to form a conclusion.  Any website references? Or do you just Google \"deluded enthusiasm\"?", 
      "date": "2006-02-12 16:36:00", 
      "id": 4585, 
      "responses": 2, 
      "subject": "Solar panels", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2069"
    }
  ]
}