{
  "summary": [
    {
      "body": "Hi everyone I need a bit of advice, please. I didn't mind the duck nesting last month and am a proud auntie to 11 ducklings in Mountjoy House lake, but two days ago, a wood pigeon started to nest in another window-box.  We shooed her away yesterday morning and discarded of the twig nest, but she and her mate came back that evening and she's refusing to be moved on, even when I use the mop or broom. In fact, she started snapping out, as to bite both objects. She backs into my favourite echyium (Canarian palm) to the extent that her wing hits it at a funny angle and it looks like she'll break her wing, which stops me from being more agressive towards her. I left her for the night but her mate came back and cooed again at 6am and I'm really shattered today, so have cancelled plans to go out to the flower market  I think I recall that you can prick the eggs. I don't know if she's laid yet, but the way she's biting out at the broom and not moving this time, implies she has one underneath her. Maybe if I put her rent up? Does anyone have any experience of what happens when the eggs hatch? Do your plants really die?  Any advice would be greatly appreciated. She is very sweet looking, the nest building exercise showed the devotion of her love-interest, but I'm really tired and grumpy today, and don't want to be like this for the next few weeks, otherwise it will be ME snapping everytime I see a mop or broom.    ", 
      "date": "2008-04-20 09:10:00", 
      "id": 3897, 
      "responses": 39, 
      "subject": "Wood pigeon dilemma", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4251"
    }, 
    {
      "body": "I know there was a thread with some related info on this but does anyone know where I can get something to treat the pests (not sure whether caterpillars or slugs - can't believe caterpillars survive in this weather!) that are destroying my lovely pansies? They are literally eating the whole things. Now I know why people have geraniums - our neighbours' plants seem to be perfectly healthy!", 
      "date": "2005-11-22 09:49:00", 
      "id": 3045, 
      "responses": 13, 
      "subject": "Plants", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1950"
    }, 
    {
      "body": "Has anybody managed to grow tomatoes on a south facing balcony?  I don't want to try until I know it will work!  We are facing Salters Hall on the 5th floor - so the balcony gets sun, but not full sun at the base of the plants. Any advice wecome.", 
      "date": "2006-05-01 16:55:00", 
      "id": 3119, 
      "responses": 9, 
      "subject": "growing tomatoes", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2242"
    }, 
    {
      "body": "Could anyone give me advice about plants suitable for my window-box over winter?  This summer was my first one running a Barbican window box (comprising six and half containers). I had some fun over summer with the range of things I bought, but it all looks a bit patchy now. Some plants fared better than others: in my box they went like this:     good: hebe, rosemary, sage, thyme, heather;      OK but then died off when I went on hols: lobelia, rocket, nicotania, lavender;      didn't really work at all: strawberry. I'd like to add some more things for winter that are fairly hardy, not just because of the cold and wind, but also becuase holidays will inevitably make watering rather patchy.", 
      "date": "2006-10-10 16:59:00", 
      "id": 3196, 
      "responses": 9, 
      "subject": "Winter plants", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2671"
    }, 
    {
      "body": "I have two things that i'd be really grateful for some ideas about... Firstly, i want the soil from two of the large 'architectural troughs' outside my window removed. Helping Hands Garden Service appear to be winding down and can't help. Does anyone know of any other gardeners/handymen etc that would be willing to remove and dispose of the soil? Secondly, and related to the first problem, is that the troughs have nothing in them except 2 large plants (one in each trough). I don't know what they are - they look to me to be something like an overgrown ugly aloe vera, although my mum is convinced they're Trifids! They're succulents with little thorns on. And they're green. Anyway, i've noticed them around the estate (although not as big) - there's one in a raised bed at the barbican centre end of Thomas More Gardens, and there are a few in the conservatory. Anyone has any ideas what i should do with them? seems a bit mean to throw them away (and logistically probably quite tricky given their size). I thought about seeing if the gardeners might want them to plant somewhere in the grounds, but don't know how to get hold of them. Any other bright ideas though?", 
      "date": "2006-04-26 17:38:00", 
      "id": 3079, 
      "responses": 8, 
      "subject": "Soil and plant problems", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2228"
    }, 
    {
      "body": "I replanted this year and have actually kept my plants alive on the balcony all summer.  But yesterday I noticed I have a problem, which wiped the smug grin off my face, my four hebes seem to have been colonized by some evil pest. Lots of the leaves are curled round into a tube arrangement and stuck together with some cobwebby silvery thread. I peeled a few open, most were empty and then horrors, a tiny green caterpillar nosed out to meet me! Do I need to spray the plants? Or do I just remove all the offending tubular caterpillar homes. Any help would be appreciated.", 
      "date": "2005-11-01 09:53:00", 
      "id": 4512, 
      "responses": 8, 
      "subject": "A gardeners question", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1917"
    }, 
    {
      "body": "I am always searching for something other than geraniums to survive the hurricane-like conditions on my balcony, and I came across this advice on a website.:\"In such extremely windy conditions you need some bulletproof plants with thick, leathery leaves, which protect them from drying out and can take a bit of a battering without showing too much damage. This does mean you can use some dramatic-shaped plants such as phormiums, cordylines and yuccas, all of which have large, sword-shaped leaves. Also consider dwarf conifers such as Pinus mugo and the low, spreading junipers. Hebes will give windproof flowers to go with your geraniums. The ornamental grasses carex, stipa and calamagrostis will provide swaying movement. \" Anyone had any success with any of these plants?", 
      "date": "2007-06-04 17:15:00", 
      "id": 3341, 
      "responses": 6, 
      "subject": "plants for windy balconies", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3392"
    }, 
    {
      "body": "I'm a newcomer to TMH, and I've inherited a number of derelict planters. I'm no gardener. On consultation, the Estate Office who gave me a flyer for  Helping Hands Garden Services. Has anyone else used them please; if so, are they as helpful as their name suggests? If not, can anyone recommend a firm I can use. And is April a good month to replant? All advice welcomed. (My intention is to stick strictly to low maintenance planting.)", 
      "date": "2006-02-23 23:52:00", 
      "id": 4603, 
      "responses": 6, 
      "subject": "Advice re planters", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2098"
    }, 
    {
      "body": "Hello, We are tempted to grow a Virginia Creeper on our terrace. Has anyone tried growing one in a north-facing pot? Oh and is there anyone out there delivering pots and plants to the Barbican? Many thanks!", 
      "date": "2007-10-04 09:14:00", 
      "id": 3444, 
      "responses": 5, 
      "subject": "Virginia Creeper delivered to the Barbican?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3708"
    }, 
    {
      "body": "Hello everyone!  I've inherited 15 window boxes of geraniums and am not sure how to manage them this first winter?  Ideally, I'd love to prevent them growing tall and \"knobbly\". Someone once told me they heard you cut them down to mere stumps in order to keep them bushy and full of flowers. Anyone have any suggestions?  Many thanks!", 
      "date": "2007-10-20 14:53:00", 
      "id": 3454, 
      "responses": 5, 
      "subject": "How to care for Geraniums?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3738"
    }, 
    {
      "body": "I have two clematis plants which I cut right back last winter. They made plenty of new growth in the late spring but failed to produce any flowers. They are on a North facing balcony so the base is in the shade. I had planned to cut them back again but notice that both are producing new leaves. What should I do? I did feed them in the summer and I have had some success with a previous clematis producing flowers in this location. The balcony gets morning and evening sun in the summer months.", 
      "date": "2006-12-20 22:57:00", 
      "id": 4123, 
      "responses": 3, 
      "subject": "Clematis care", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2850"
    }, 
    {
      "body": "Can anyone offer any advice on how to deal with heavy infestations of aphids [black and green] on window box plants. I've been looking for advice online but I haven't really found any useful information beyond 'Pick them off'. Am I destined to spend all my summer weekend flicking small bugs off my balcony?", 
      "date": "2007-04-28 17:30:00", 
      "id": 4315, 
      "responses": 3, 
      "subject": "Window box gardening advice", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3282"
    }, 
    {
      "body": "Hi Barbican I am in the process of buying the smallest kind of studio (F1A) in John Trundle (inward facing). I was wondering if there is anything I should be wary of - things like heating and wether it works, and any Garchey related  issues, for example. Or - huge future service charge bills - I know that the roof and lift has recently been done in JT, but the potential overhaul of Garchey and underfloor heating concerns me a bit.  Also, I will be looking for some original kitchen parts, so if anyone is thinking of selling anything, please let me know.  Also - are there any experts on windowbox plant options? Thanks Max", 
      "date": "2005-10-12 20:37:00", 
      "id": 4437, 
      "responses": 3, 
      "subject": "New resident - questions", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1880"
    }, 
    {
      "body": "For the last few years, I have used wooden planters on the top balcony of my Willoughby House flat.  Inevitably, after two years at best , they disintegrate.  Does anyone know of good alternatives, and where to find them?  Size is a problem - the wooden ones are about 120 centimetres long, and 14c wide and deep, too big probably for ceramic cotainers.", 
      "date": "2006-04-15 08:39:00", 
      "id": 4651, 
      "responses": 3, 
      "subject": "Planters", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2200"
    }, 
    {
      "body": "hi. i had a look on the inside of one of my planter boxes the other day and was a little alarmed to read the little sticker that said \"TAKE CARE WITH AESBESTOS\". uhm... anyone else know about this? are we really surrounded with an outside wall of carsenogenic concrete planters?", 
      "date": "2005-05-14 14:43:00", 
      "id": 4707, 
      "responses": 3, 
      "subject": "inhaling planters", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1629"
    }, 
    {
      "body": "[color=green][/color has anybody got information about or experience of installing an automatic watering system for Barbican window boxes? Our summers are drier, people are often away and getting the boxes watered is a bit of a headache. please let me know if you have any info ! Thanks Sheila Hillier", 
      "date": "2005-05-24 08:05:00", 
      "id": 4734, 
      "responses": 3, 
      "subject": "automatic watering systems", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1645"
    }, 
    {
      "body": "I'm putting in my winter flowers on the terraces, and don't want to put the old plants in the bin ... anyone know if we \"communally compost\" anywhere?  and i'm not getting a bin myself cos I've read the articles about wormeries and there's enough death and destruction in the world without frying / feeezing worms all year ... any ideas appreciated", 
      "date": "2005-11-19 17:06:00", 
      "id": 3022, 
      "responses": 2, 
      "subject": "old plants for composting", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1943"
    }, 
    {
      "body": "I don't know if anyone can help... I'm due down to our flat (5th floor Andrewes House) on Tuesday and want to bring some flower pots down for our balcony overlooking the lake. I foolishly forgot to take a measurement before we came away and wanted to buy the plots tomorrow. I wondered if anyone might be able to take a quick measurement and let me know the max. diameter we'd be able to fit between the glass planel and the wires across the front. Thanks in advance! Simon", 
      "date": "2007-08-05 08:19:00", 
      "id": 4113, 
      "responses": 2, 
      "subject": "Max. width of flowerpot?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3562"
    }, 
    {
      "body": "Does any one know whether it would be possible to grow silver birch trees in pots on a 6th floor North facing balcony?", 
      "date": "2007-04-29 18:33:00", 
      "id": 4264, 
      "responses": 2, 
      "subject": "Gardening Question - Trees on 6th Floor Balcony", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3285"
    }, 
    {
      "body": "Hi there I've just come back from Columbia Flower Market with a couple of Echiums (canary palms) which grow really well here, and are loved by the finches.  I almost bought an olive tree but thought it best to ask the learned Forum if they grow well on our balconies. When I first moved in to Thomas More four years ago, I lost a fortune on plants which didn't do too well.  We're in Thomas More but are moving to Mount Joy where the corner part of the balcony is large enough for a small olive tree, and still be a fire exit.  I sat in Mount Joy yesterday looking at the view and a jay flew down and started to sing - very surreal. I now want to get more plants/trees to attract more wildlife. Has anyone had any success with olive trees here or anything similar? The balcony corner has a north/east aspect.  Thank you.", 
      "date": "2007-04-22 14:20:00", 
      "id": 4392, 
      "responses": 2, 
      "subject": "Olive Trees on our balconies", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3257"
    }, 
    {
      "body": "I know this has been discussed before, but I can't find the info. Can anyone provide me with the details of the window box planting business, I think it was callled helping hands.... Ta Max", 
      "date": "2006-03-17 18:00:00", 
      "id": 4616, 
      "responses": 1, 
      "subject": "window box services", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2141"
    }, 
    {
      "body": "Hello, I bought eight geraniums yesterday which I have planted in my two Barbican pots.  They look miserable... You can't even see them from outside... Am I supposed to put more than four in a box or will they grow pretty fast (by fast, I mean two to three weeks)? Other displays on Buyan Court (where I live) and John Trundle Court put me to shame! Clochette", 
      "date": "2005-06-20 13:17:00", 
      "id": 4685, 
      "responses": 1, 
      "subject": "Inexperienced Gardener", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1701"
    }
  ]
}