{
  "summary": [
    {
      "body": "It's been good and cold so hopefully all the little devils have been killed.  But it can't last long. So place your bets. When will the 1st bite start and the plug-in deterents be in place.  I'm reckoning 2nd week March personally....", 
      "date": "2007-01-24 21:09:00", 
      "id": 4391, 
      "responses": 26, 
      "subject": "Mosquito predictions...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2954"
    }, 
    {
      "body": "Has anyone else had recent trouble with bites from mosquito like insects? I've had over 12 bites in the past week and caught six of the beggars!", 
      "date": "2005-08-03 10:59:00", 
      "id": 3048, 
      "responses": 19, 
      "subject": "Mosquito's or some such lfying pest", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1782"
    }, 
    {
      "body": "Any ideas how to get rid of moths from a standard store room please? I keep my out of season clothes there & the expense of dry cleaning them when I retrieve them, to get rid of moth-ball pong, is getting silly. Am I the only one with moths?? Why don't our flats have any storage space anyway?", 
      "date": "2005-10-04 14:02:00", 
      "id": 3115, 
      "responses": 19, 
      "subject": "Moths in store rooms - help", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1866"
    }, 
    {
      "body": "Bitten 15 times on Sunday night   Looks like the dipping failed    Killed it this morning though", 
      "date": "2007-05-15 11:11:00", 
      "id": 3349, 
      "responses": 14, 
      "subject": "Mozzies are back", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3331"
    }, 
    {
      "body": "The over feeding of the Barbican ducks needs to be addressed - are we killing them with kindness? Bread is NOT duck food!  Mallards are designed to eat natural foods - adults and ducklings eat aquatic invertebrates like midge and mosquito larvae, mayfly and damselfly nymphs. All are present in the Barbican lakes - our lakes may be man made but any body of water attracts a natural food source for waterfowl.( And most of us have the bites to prove it!) Ducks, like children, will take the easy junkfood option every time. However, 'training' ducks to rely on an easy but nutritionally poor diet damages their health, the health of the lake ecosystem and could damage the health of the human population. Ducks fed a diet of bread develop engorged and fatty internal organs, leading to heart disease, liver problems and ultimately, and ironically, malnutrition. Feeding bread shortens their natural life and disturbs their migratory patterns, encouraging them to stay longer and even to over-winter at their summer home. Over-wintering does not give the lakes the break they need to naturally dispose of water fowl waste. Dozens of loaves of bread are being thrown into the water every week. Uneaten bread makes the water a breeding ground for parasites and diseases. Bacteria levels can rise to where they start killing off the fish and other aquatic life. Rotting bread in the water leads to Duck Virus Enteritis, a deadly mould Aspergillus, and Avian Botulism that can kill an entire waterfowl population and can be contracted by humans.", 
      "date": "2005-07-08 14:32:00", 
      "id": 4441, 
      "responses": 14, 
      "subject": "Ducks: Killing with kindness", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1732"
    }, 
    {
      "body": "I know there was a thread with some related info on this but does anyone know where I can get something to treat the pests (not sure whether caterpillars or slugs - can't believe caterpillars survive in this weather!) that are destroying my lovely pansies? They are literally eating the whole things. Now I know why people have geraniums - our neighbours' plants seem to be perfectly healthy!", 
      "date": "2005-11-22 09:49:00", 
      "id": 3045, 
      "responses": 13, 
      "subject": "Plants", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1950"
    }, 
    {
      "body": "Being woken up yet again by my neighbours noisy toilet and water pipes I got up and put the light on and saw five or six silverfish fleeing across the carpet.  Needless to say they didn't last long. But can anyone tell me please where they come from and how I can stop them?  The flat is clean, honest!  I live on the ground floor so are they coming in from the garden?  ugh, ugh.", 
      "date": "2006-09-12 09:36:00", 
      "id": 4490, 
      "responses": 11, 
      "subject": "Silverfish ugh", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2594"
    }, 
    {
      "body": "Can anyone recommend someone to deal with mice in the house?!", 
      "date": "2007-09-20 11:40:00", 
      "id": 3380, 
      "responses": 10, 
      "subject": "Mice problem", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3669"
    }, 
    {
      "body": "I fear our list of tropical pests may be extending beyond mosquitos. Walking on the podium this morning, just where the Postern meets the ramp to JP Morgan/Pizza Express, I noticed a rather large (2 inches), brown, fat, hairy and frankly horrendous spider. If someone braver than me spots it again, perhaps they could entice it into a jar and take it off for identificaton? Or failing that, stamp on it?", 
      "date": "2007-05-01 17:14:00", 
      "id": 1391, 
      "responses": 8, 
      "subject": "Spider alert", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3291"
    }, 
    {
      "body": "I replanted this year and have actually kept my plants alive on the balcony all summer.  But yesterday I noticed I have a problem, which wiped the smug grin off my face, my four hebes seem to have been colonized by some evil pest. Lots of the leaves are curled round into a tube arrangement and stuck together with some cobwebby silvery thread. I peeled a few open, most were empty and then horrors, a tiny green caterpillar nosed out to meet me! Do I need to spray the plants? Or do I just remove all the offending tubular caterpillar homes. Any help would be appreciated.", 
      "date": "2005-11-01 09:53:00", 
      "id": 4512, 
      "responses": 8, 
      "subject": "A gardeners question", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1917"
    }, 
    {
      "body": "Has any one else noticed a lot of minute black flies around indoors? I can't find an obvious source, but they are so tiny they could enter through the narrowest  crack. Advice on how to eliminate them welcomed.", 
      "date": "2006-11-27 14:10:00", 
      "id": 3221, 
      "responses": 7, 
      "subject": "Flies", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2784"
    }, 
    {
      "body": "Still seem to be attracting the odd mozza or two. Never happened last year but it has been rather mild.  Is anyone else suffering", 
      "date": "2007-01-10 12:20:00", 
      "id": 4215, 
      "responses": 7, 
      "subject": "Still being bitten", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2895"
    }, 
    {
      "body": "Is it me, or is the mosquito situation getting out of hand. I have never been bitten in my life before, but last week i awoke thinking i was having a bad dream - i thought i'd heard a buzzing in my ear. I lay there, just as i was going off to sleep, it happened again. And then again. then i felt something crawling over my face. I jumped out of bed, couldn't see anything, went back. This happened continuously throughout the night and drove me mad. In the morning... big red bite marks everywhere. then searched my room and found a mosquito, bloated with what i presume was my blood. squashed it, blood everywhere. Since then i have found dozens each day in my flat. It's driving me crazy. What's going on? i don't even live particuarly near the lakes. Help! I don't want to get mosguito nets for my windows, but i don't remember it being like this last year. I do remember though there being other posts last year about this from people near the lakes, and wondered if they've noticed it getting even worse. Or perhaps you've all just got mosquito nets and so they've travelled a little further this year, hence why i'm now plagued. I had discussed getting some stickleback for the lakes/bryer pond - am now going back tomorrow to my mum's house where there are hundreds in the pond and think i might do a bit of pond-dipping before heading back to barbican  ", 
      "date": "2007-08-07 11:46:00", 
      "id": 3383, 
      "responses": 6, 
      "subject": "mosquito", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3570"
    }, 
    {
      "body": "Nothing new about getting rid of it? Where is he committee? Thanks for any info if there is any... Any idea to attract the attention of the media? Maybe attraction of the media bathing naked in the lakes... ...physique du role gone and...  ....scared of bacteria, green stuff...bleah!", 
      "date": "2007-11-29 16:34:00", 
      "id": 4169, 
      "responses": 5, 
      "subject": "garchey the revenge...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3822"
    }, 
    {
      "body": "walked into living room this a.m. to discover an invasion of ants. seem to be coming in through window, Im penthouse floor low rise block. Anyone know of sure way of getting rid of them, and as they are coming from \"fire escape\" does the Barbican have any resposibility?", 
      "date": "2006-03-20 11:49:00", 
      "id": 4637, 
      "responses": 5, 
      "subject": "ants", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2147"
    }, 
    {
      "body": "Am i the only lucky Barbican resident with vistors for summer?  Ants.  Lots of them.  Entire familys. The corporation is in the process of dealing with it.  If anyone else has them maybe we could get a mass extermination. D07", 
      "date": "2007-05-15 22:53:00", 
      "id": 4340, 
      "responses": 4, 
      "subject": "Ants", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3338"
    }, 
    {
      "body": "I was bitten three times during the week and another three times during this weekend. Since beoming aware of the little devils I've killed about another half dozen of them. Can anyone explain this epidemic and it anyone else suffering!", 
      "date": "2005-06-19 17:10:00", 
      "id": 4661, 
      "responses": 2, 
      "subject": "Mosquitos", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1697"
    }, 
    {
      "body": "I know we've had threads about the mosquitos before, but I ended up in an emergency clinic this morning because the bite I got on Saturday afternoon somewhere on the podium went septic. I'm now on a strong and lengthy course of antibiotics. The doctor I saw told me that they are seeing a much larger number of infected bites than usual, possibly because the mosquitos are carrying something different this year, although they don't know what. Possibly from raw sewage overflowing in the heavy rains.  Whatever the reason, you're advised to see someone asap if your insect bite goes blistered or weepy and/or a red rash starts spreading away from the site.Plus the tthing itches or throbs. If this happens, antihistamine is NOT the answer - you need antibiotics. I'm just beginning to feel a bit better, but I'm still very tired and with a slight temperature. Hope no-one else suffers!", 
      "date": "2007-08-27 18:39:00", 
      "id": 3415, 
      "responses": 1, 
      "subject": "Infected mozzy bites", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3611"
    }, 
    {
      "body": "Have discovered,much to my horror, cashmere sweaters put away(in bags)have been attacked, know how to darn but wretched eyesight prevents me doing a satisfactory job.Does anyone know of a repairer or even a knitter whom I would pay to do it.Have most of the relevant matching wools.Thanks in advance", 
      "date": "2007-08-07 10:51:00", 
      "id": 4117, 
      "responses": 1, 
      "subject": "moth attack", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3569"
    }, 
    {
      "body": "This evening I actually spotted a shoal of golden orfe, or whatever they are, in the lower lake.  I had begun to think that the new fish stock for the lake was a figment of someone's imagination!  However, the recent comment that there aren't any mosquitoes has not been borne out by a number of the bloodsuckers in my flat last night! Also on the lake spied some other ducks (other than mallards).  There were a couple with red necks and one with a black neck.  Perhaps someone with ornithological knowledge could let us know what species these are and whether they are migratory, or likely to stay.", 
      "date": "2005-06-23 21:21:00", 
      "id": 4670, 
      "responses": 1, 
      "subject": "Ducks and fish", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1712"
    }, 
    {
      "body": "Following on from Moth trouble (recently posted) - we're on the 4th floor of Breton and have been discovering ants in the cupboards.  Any good tips for getting rid of them?  Anyone know where the nest might be?  Any help appreciated. Thanks", 
      "date": "2005-06-29 07:58:00", 
      "id": 4680, 
      "responses": 1, 
      "subject": "Ant trouble", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1716"
    }, 
    {
      "body": "So according to the BEO, the insects swarming from the lake are mainly mayflies which don't bite, make excellent food for birds and bats, and should die off at the beginning of June. Any ressies near the lake care to comment?", 
      "date": "2005-06-03 12:45:00", 
      "id": 4729, 
      "responses": 1, 
      "subject": "Lake Insects", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1662"
    }
  ]
}