{
  "summary": [
    {
      "body": "I'd like to open the campaign for the election in the Ward of Cripplegate, as I have already lodged my nomination papers. This is to fill the vacancy created by the resignation of Sir Gavyn Arthur on becoming a circuit judge.  The wardmote takes place on Tuesday, 3 June, and 4 June is voting day at St Giles's, Cripplegate.  I shall be getting my election mailing out next week. My new website   is now up and running.  I would be glad to hear from any Cripplegate elector and am happy to deal with questions about the policies I would pursue if elected as alderman. You can email me on  .", 
      "date": "2008-05-14 22:15:00", 
      "id": 3687, 
      "responses": 104, 
      "subject": "Cripplegate Aldermanic Election", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4342"
    }, 
    {
      "body": "I would like to start a campaign to destry the horrible passage of the exhibition hall. It is ugly not functional etc not build by the architects etc. Any volunteers? I need to speak to Maged he is the guy.... ", 
      "date": "2006-09-28 08:29:00", 
      "id": 4275, 
      "responses": 16, 
      "subject": "Break down the wall!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2638"
    }, 
    {
      "body": "Can we discuss the option of lighting the 3 towers at night for dramtic effect?  Not sure if you have noticed but EVERY sky shot of london that has Natwest, Swiss Re, etc... has the Barbican Towers removed.  Anytime there is a news shot or a programme with an interview with a london backdrop...our council towers are not to be seen. I would like to propose that we campaign the city of london to make a feature of these. Who is in? D07", 
      "date": "2007-01-02 23:37:00", 
      "id": 4126, 
      "responses": 11, 
      "subject": "landmark!!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2875"
    }, 
    {
      "body": "Could the Residents' Meeting be our chance to put our views on St Alphage to the vote? On our RSVP card we have requested that there should be a vote on the current proposals. Should we contact the Chair prior to the meeting to get this officially on the agenda?  Perhaps it would be a good idea that residents attending the meeting refrain from participating in the electronic voting on the issues of the City's choice unless we can vote on a motion, along the lines of \"We reject the current proposals for St Alphage House\".  Of course if we propose such a vote we must win it convincingly. Perhaps we should put up information on block notice boards to make sure there is a good attendance - and give out information to residents as they arrive for the meeting. Is this something that the BA sub committee on St Alphage could co-ordinate? We would hope that asking for a vote is something that our elected representatives - the CCs of the relevant wards and the House Group chairs and committee members would support. Incidentally - isn't it time we heard about the BA St Alphage sub committee's strategy?", 
      "date": "2008-05-20 17:11:00", 
      "id": 3601, 
      "responses": 10, 
      "subject": "2nd June Residents' Meeting - Chance to vote on St Alphage?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4360"
    }, 
    {
      "body": "Only joking... I'm not at all. I'm very cross about it ...BUT That said, is it worth discussing what we should lobby for in the medium to long term with regards to the St Alphage site?  We might get lucky and Chase JP Bear away this time. The economy might collapse. Bear JP might be rouge traded, I don't know. But the fact remains that someone at some point will try and develop the land. It may be 5-10 years from now, but surely, it will happen.  Putting aside the ghastly injustices of the political situation which've been detailed on other posts, what is clear is that the hilariously impartial planning department regard us as nothing more than a bunch of self-serving fascists who don't understand the basics of the  London economy.  It seems to me that this their way of writing off our concerns as a form of selfish Nimbyism that damages the productivity of the City.  This is clearly ridiculous, but it seems entrenched in the mind of the planning department.  Surely then, we have to present ourselves as people who care deeply about the City ( not untrue I would imagine) and who lobby for the Barbican on belhalf of the 300 000 workers we have been sterotyped as being against? We should argue for an architecture that is bold and as landmark as the Barbican itself.  We should present ourselves as people who not only care about The Barbican- but care about other people having acess to the Barbican? Not just the arts centre, but the place as a whole? If this is a grandmother suck eggs situation, forgive me. My white rage at the proposal has made me want to do all kinds of things! But should we also be working out what would be acceptable- or is this giving up before we've even started? Perhaps it is a dangerous strategy. Perhaps me saying this is all part of their darstardly plan. I put nothing past their evil cunning. And I'm sure I'm absolutely stating the obvious here and everyone else is five steps ahead of me on this- for example- the Save the Barbican T-shirts I thought struck the right note I thought! I personally would rather another Gherkin or even a 'Shard of Glass' outside my living room than the bulky monstosity we've been offered. But more importantly, I want to be able to walk to the Guildhall / Cheapside without crossing a big road. I want to get to Moorgate without getting in a lift and I want the safety offered by having a steady stream of people coming in and out of the Barbican. These are, to me, more important that the height of the building. A landmark beauty would, in my view, benefit us all. But discuss... And apologies for the provocative subject title, I was concerned that the telephone had knocked the issue off the top spot. Don't even get me started on BT. [/i]", 
      "date": "2008-04-12 14:20:00", 
      "id": 3866, 
      "responses": 5, 
      "subject": "Pro the St Alphage Development", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4229"
    }, 
    {
      "body": "Anyone interested in the campaign to save Milton Court should check out   , about which I received a flyer last week (surprised no-one has posted to complain about such unsolicited missives disturbing the order of their letterboxes)", 
      "date": "2006-10-14 21:03:00", 
      "id": 4292, 
      "responses": 4, 
      "subject": "Milton Court website", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2679"
    }, 
    {
      "body": "Is it me or is it since the roof works that we have had more flooding in our palaces? I believe that since the roof works and the water drainage system being \"redirected\" on the 6th floor balconies, we are getting flooded every time. Who would like to support my campaign for a real architect and building firm (not a bunch of lads off a boat from Gdansk) to look at the works, along with English Heritage to see if it can be rectified? ..and if I hear from our Estate office that it is to do with Global Warming or Al Gore from I might slap someone. D07", 
      "date": "2007-07-22 23:21:00", 
      "id": 3385, 
      "responses": 3, 
      "subject": "Ben Jonson Campaign", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3530"
    }, 
    {
      "body": "Could we please organize a big gathering with a fake big hammer to get rid of the horrible corridor under Ben Jonson House? What do you think? Or is it more sensible to lobby with the association to protect the barbican...this is the question...", 
      "date": "2007-11-29 16:38:00", 
      "id": 4170, 
      "responses": 3, 
      "subject": "Big  Fake Hammer?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3823"
    }
  ]
}