{
  "summary": [
    {
      "body": "I have just received a letter from the corporation notifying me about Heron's planning application to convert much of the Speed/Willoughby car parks over to the exclusive use of the new Milton Court developers. Call me a nimby, but I would encourage as many people as possible to object.  - the application involves turning ALL the spaces on Speed 03 and Willoughby 02 over to the exclusive use of Milton Court. That is over 150 spaces to be removed from residents' use. (Together with developments in Lauderdale, there seems to be a trend developing here.) - Milton Court drivers would share the existing entry into 03 level with us, but have their own entrance to 02 level from the existing ramp on Moor Lane. Both entrances will have no CPAs, just electric gates plus CCTV. Pedestrian entry for Milton Court residents into 02 and 03 levels would be by a new door at the corner of silk street and Moor lane, again with electronic entry. In my view the combination of large numbers of people using 03 level together with no CPA leads to an unacceptable reduction in security. Brandon Mews residents have their back doors opening onto the car park plus there are a number of storage lockers there. Given that it's all too easy for someone to slip in before the electric gates close, this greatly increases the scope for intruders. (And I don't put much faith in CCTV - it's only effective if someone's watching it all the time, in which case why not put them in the car park instead of behind a screen?) This also affects flats overlooking Speed Gardens, which can be accessed from the car park directly (the door currently has no lock on the car park side). Note that there will be pedestrian access between the Milton Court and resident parts of the car parks, so security will be compromised for resident car park spaces as well - anyone slipping in behind a Milton Court user will be able to get into the resident areas of 02/03 without having to pass a CPA.  Further the spaces (& CCTV cameras) proposed for 02 level are directly opposite Brandon Mews kitchens/2nd bedrooms, resulting in increased noise and less privacy for residents. The plan is also stupid from the perspective of Milton Court residents who (following the removal of their bridge) would have to cross the road (with no pedestrian crossing) to get to their car park.   Last but not least, if you're opposed to the Milton Court tower, then opposing the parking scheme is another way to scupper it as it could not proceed without the car park.  The deadline for objections is 23 November. Details of the application can be found at ", 
      "date": "2007-11-04 00:16:00", 
      "id": 3684, 
      "responses": 49, 
      "subject": "Milton Court car park proposal", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3770"
    }
  ]
}