{
  "summary": [
    {
      "body": "I know the subject has been here many times but I got overwhelmed today when the Estate informed us that the new system will be installed in Mountjoy from next week (so not the week of 25/7 as the BA chairman let us know on Barbicantalk in March). I thought we would finally get a sort of cable system that lets us view foreign channels, as everybody on the continent gets (practically free, I think), but I only saw Sky mentioned in the discussions, Top up TV, and Freeview. Even Sky at 19.95 per month does not offer foreign channels, though they said that you can tune in those channels yourself once you have Sky. Does anyone have any experience with this - in the new system? Is there an alternative to Sky? We are not interested in most of their 40 or so channels. We dislike NTL like everybody else but we do get the channels we want and pay dearly for them but Sky is not much cheaper and we must still see if we can tune in these other channels. We have no digital TV. Will appreciate some advice.", 
      "date": "2005-04-18 16:28:00", 
      "id": 3050, 
      "responses": 97, 
      "subject": "TV again", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1572"
    }, 
    {
      "body": "Hello I am an interloper so I hope it's okay to ask this.  I don't live in the Barbican yet and perhaps never will (as you all no doubt know, there is a dearth of properties) but I wondered if any of you would be generous enough to share your thoughts on living there and good points/bad points. I've lived in flats all my life (we currently live near Old Street and hurrah for the new Waitrose even if, yes, some of the staff are very incongruous for JLP) so I know that properties can differ wildly and that it's also a matter of personal choice. But these are the things I'd like to ask (in no particular order): Am I correct in thinking the biggest flats are in the towers? Is it generally a quiet and safe place to live or does it vary wildly from block to block? What's it like for children? The private gardens seem amazing but in reality what's it like? Is the service charge astronomical (I realise it depends on size of flat)? What will happen when all TV goes digital and the Barbican has no digital cable?? Is the listed building classification a pain if you want to do any work in the flat? Garchey, good or bad? Are parking places readily available to rent or is there a shortage? Anything to look for that an outsider may not know about.  I'd be really grateful for any answers. If I can reciprocate in any way...my specialities are fly fishing, beauty products, nutrition and fashion. I know, ecletic and slightly bizarre! Thank you. AB", 
      "date": "2006-06-05 17:37:00", 
      "id": 3180, 
      "responses": 29, 
      "subject": "What's it like living in the Barbican?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2338"
    }, 
    {
      "body": "Anyone know if we will be able to get it? I'm guessing yes if the dishes on the roof are compatible.", 
      "date": "2008-05-04 12:15:00", 
      "id": 4080, 
      "responses": 15, 
      "subject": "Freesat", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4299"
    }, 
    {
      "body": "Is anyone else having TV reception problems? For the past three days our reception cuts out for about five seconds every 10 or 15 minutes and the screen displays 'No satellite signal being received'. We're in Seddon and watch through a Sky box. We reported this to the Estate Office yesterday (Friday 16th) and they said they'd speak to Metro Digital, who service the dish. But no one else had complained - are we the only ones, in which case it could be a problem with our Sky box?", 
      "date": "2007-03-17 07:59:00", 
      "id": 3299, 
      "responses": 14, 
      "subject": "TV reception constantly cutting out", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3151"
    }, 
    {
      "body": "Has anyone else tried to have Sky+ installed and solved the problem of not having a second TV socket? The estate office put us in touch with Metro Digital, who they said would do it for a fee, but they've just been to inspect our flat in Seddon and doubt that it can be done because - unlike the tower blocks - we don't have the necessary ducting to allow a second feed from the dish. They're going to have a think about it, but can this really be true???", 
      "date": "2007-03-08 09:18:00", 
      "id": 3561, 
      "responses": 11, 
      "subject": "Sky+ installation problem", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3119"
    }, 
    {
      "body": "Just moved into The Barbican and wondering whether the TV license is covered under the Service Charge (probably wishful thinking, I realise) or whether I need to buy one before I fire up the old goggle box?", 
      "date": "2006-09-21 10:51:00", 
      "id": 4501, 
      "responses": 11, 
      "subject": "TV License", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2616"
    }, 
    {
      "body": "I had to pay SCI 500 for the installation of a Sky Plus box - the one with the higher capacity of 100GB. Just wondering if anyone else has had experience with SCI installing a Sky Plus, and if this is a reasonable going rate?", 
      "date": "2006-04-14 13:42:00", 
      "id": 4239, 
      "responses": 10, 
      "subject": "Installation of Sky Plus", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2199"
    }, 
    {
      "body": "Seemed to be interruptions to the signal a couple of hours earlier, been out and back, now at 9pm no digital TV signal/channels at all and only terrestrial channels which are currently viewable mainly as grey clouds of dots only...", 
      "date": "2005-09-22 19:59:00", 
      "id": 4445, 
      "responses": 10, 
      "subject": "No digital TV signal in Andrewes Thurs 9pm - anyone else?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1849"
    }, 
    {
      "body": "Have just lost tv signal in flat in seddon house at approx 7.40 pm - anyone else with a similar problem?", 
      "date": "2006-10-30 19:50:00", 
      "id": 4310, 
      "responses": 9, 
      "subject": "No tv signal", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2711"
    }, 
    {
      "body": "Does anyone know whether it's possible to get Sky HD in the Barbican? Specifically BJH? Thanks a lot.", 
      "date": "2008-03-25 13:53:00", 
      "id": 3916, 
      "responses": 8, 
      "subject": "SKY HD", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4151"
    }, 
    {
      "body": "Has anybody got problems with TV reception? We just get \"No Signal\" showing up on our screen.", 
      "date": "2006-09-24 21:22:00", 
      "id": 4293, 
      "responses": 7, 
      "subject": "TV Reception in BJH", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2627"
    }, 
    {
      "body": "Hi!! We have just moved in to John Trundle. I am Sarahjayne, a graphic designer and my partner Jonnie is a Management Consultant. We have been here for a few weeks now and absolutely love it! There are a few things we are unsure of and would appreciate any advice. Is it possible to get Sky +, if so, how? Do we have to use a specific broadband internet provider? If we have visitors, where can they park? Our bathroom occassionally smells - is there a problem with the drains in John Trundle???!!! Where is best to do our food shopping? We have visited Sainsbury's in Angel and weren't impressed!! We don't have car, so ideally would love somewhere nearby other than the 'local' or 'express' variety of supermarkets where the selection is not great. This is probably wishful thinking!!  We look forward to learning more about our new area!! Many thanks", 
      "date": "2005-09-27 15:48:00", 
      "id": 4438, 
      "responses": 7, 
      "subject": "Hello! We've just moved in and have a few questions!!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1858"
    }, 
    {
      "body": "We have recently moved from Breton to Willoughby, and since moving, cannot get ITV or C4 (or any related channels e.g. ITV2) from our Freeview box. BBC channels work perfectly and so does Sky Sports News. Has this happened to anyone else? If so does anyone have a solution?", 
      "date": "2005-10-04 14:44:00", 
      "id": 4447, 
      "responses": 7, 
      "subject": "Freeview", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1867"
    }, 
    {
      "body": "Just had it installed and it's very very impressive for those that are interested, now need to have another Sky Cable installed to take full atvantage of the Sky + element, does anyone know how I get this done?", 
      "date": "2006-07-03 09:39:00", 
      "id": 3128, 
      "responses": 5, 
      "subject": "SKY HD", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2424"
    }, 
    {
      "body": "I've just bought a new television, with a built-in digital box. The signal gives out every few minutes and the screen goes blank. The channels also swop at random. I've had the television swopped, but the same problem is occurring and I therefore suspect that the signal is too weak. The Barbican technical people have been in to test the signal, but I was told it was fine.  Does anyone have a similar problem, particularly in Defoe House? I'm not sure where to go from here. Would an aerial booster be any good? Thank you for any useful tips!", 
      "date": "2006-07-01 18:28:00", 
      "id": 3185, 
      "responses": 5, 
      "subject": "Digital signal", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2420"
    }, 
    {
      "body": "Hi Everyone  I'd like to watch the ashes but I need sky sports. How do people compare ntl (my flat has the wiring for this) to sky in terms of cost, ease of installation and time from initial order to completion? Thanks.", 
      "date": "2006-11-17 15:40:00", 
      "id": 3215, 
      "responses": 5, 
      "subject": "Easiest way to get Sky Sports", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2757"
    }, 
    {
      "body": "Has anyone tried mounting an lcd or plasma tv on the wall of their flat and also chased in the cables?  Was it easy?  Is it even allowed under the terms of the lease?!", 
      "date": "2007-08-21 15:55:00", 
      "id": 3408, 
      "responses": 4, 
      "subject": "Wall mount lcd tv with chased in cables", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3600"
    }, 
    {
      "body": " Will the new cable network support this?", 
      "date": "2005-08-06 16:23:00", 
      "id": 3428, 
      "responses": 4, 
      "subject": "High defenition TV", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1793"
    }, 
    {
      "body": "My TV has gone down - is any anyone experiencing problems? Is it the system or my TV? I susupect it is the system.  I rarely watch TV - say, twice a week for an hour or so, depending on the length of the chosen programme or film - and yet at least once of the two occasions the TV cuts out, usually for a minute or two, but occasionally - like tonight - for longer. Has our expensive new system we paid for been properly installed? Should we all be complaining to the estate office?", 
      "date": "2007-08-03 20:58:00", 
      "id": 4114, 
      "responses": 4, 
      "subject": "tv problems", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3558"
    }, 
    {
      "body": "That's television, rather than transvestite by the way.  Anyone know a decent technician who would install and set up a new dvd to my telly. I know this must sound feeble to all of you who know what you are talking about on the massive posting about our new television system, but my expertise lies in other directions.", 
      "date": "2005-07-28 12:55:00", 
      "id": 2947, 
      "responses": 3, 
      "subject": "TV technician", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1766"
    }, 
    {
      "body": " We've just got our Freeview box and all is not well.  The TV aerial goes from the wall to the freeview box to the TV.  The TV is giving us the 5 old channels but the Freeview box is picking up nothing.  The signal strength is exactly 0% for both its tuners.  Any ideas?  Since having SCCI change the face plate on the wall we've not been able to get FM radio.  We've tried retuning but it's not helped.  Again, there's no signal at all.  Any ideas? thanks.", 
      "date": "2005-09-09 21:27:00", 
      "id": 3049, 
      "responses": 3, 
      "subject": "Freeview & radio problems", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1837"
    }, 
    {
      "body": "Would a kind neighbour please be willing to help me retune my tv which seems, inexplicably, to have detuned itself today?  I'm not getting any channels either on digital or analogue.  I've been staring at the setup guide for the last hour and I may as well be reading Martian.  I know I'm being a big girlie about it and should be able to manage without the telly but I'm stuck at home not too well AND my computer has a trojan (someone coming to sort that one out later), so I'm now feeling a bit sorry for myself as well as very inept. If there's anyone in or near Andrewes House that would be happy to accept money or a nice bottle of wine or two to tune in my tv, I would be so grateful.  Please call me on 07775 570208 as I won't have access to my computer later once the trojan expert arrives.  Thank you very much.", 
      "date": "2007-10-31 16:03:00", 
      "id": 3461, 
      "responses": 3, 
      "subject": "help please!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3756"
    }, 
    {
      "body": "The cable reception went down last night, came on again this morning... and now there's no reception again. Anyone else with the same problem our is it just in my flat? (also, does anyone have the number to call at hand?) Thanks", 
      "date": "2007-05-02 16:39:00", 
      "id": 4319, 
      "responses": 3, 
      "subject": "Willoughby House TV reception", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3296"
    }, 
    {
      "body": "Has anyone else lost their tv signal? I'm an Andrewes House resident and have been without a signal since at least Friday. I've played with the cable, connections and turned everyone on and off a few times but to no avail. I suspect it's the signal because the tv actually works fine in watching pre-recorded items off my freeview box. Although my quality of life has probably improved as a result, it would be nice to know whether the problem is localised to me or if anyone else has been affected? Secondly does anyone know if there's a standard e-mail address for the estate office or repairs to which we can send queries such as this to? Thanks.", 
      "date": "2007-04-15 15:00:00", 
      "id": 4380, 
      "responses": 3, 
      "subject": "TV signal down?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3233"
    }, 
    {
      "body": "Is anyone who has had the digi-upgrade experiencing problems with their channel selection. I can seem to get BBCs 1,2,3,4 (and much more to boot) but can't get ITV1, 2, CH4, CH5 and who knows what else. I'm still using the original cables that we used for analogue, is there some kind of digital cable upgrade that I would be advised to purchase? I've also noticed that the signal strength is \"OK\" (ie. 41%), while the signal quality is 100%. Any advice welcome, it's really rather annoying. Thanks", 
      "date": "2005-05-21 08:00:00", 
      "id": 4715, 
      "responses": 3, 
      "subject": "Digital telly", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1641"
    }, 
    {
      "body": "The programme guide on my Digi-Box has stopped displaying the names/times of programmes. Has anyone else had this problem? (if so, it might be something to do with the feed coming down the cabling, if not it's probably my Digi-Box is bust).", 
      "date": "2006-11-25 21:58:00", 
      "id": 3217, 
      "responses": 2, 
      "subject": "Digital TV programme guide", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2780"
    }, 
    {
      "body": "We seem to have lost all aerial signal tonight - has anyone else had any problems?", 
      "date": "2007-09-24 18:14:00", 
      "id": 3381, 
      "responses": 2, 
      "subject": "TV reception - any problems?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3687"
    }, 
    {
      "body": "Anyone lost TV reception in Willoughby? Or is it just me", 
      "date": "2007-11-09 19:32:00", 
      "id": 3469, 
      "responses": 2, 
      "subject": "TV reception in Willoughby House (Friday 9th)", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3781"
    }, 
    {
      "body": "Has anyone else had problems with their television reception today?  I called the Estate Office to report a fault but as they had not received any other calls about problems with reception thought that the fault lay with my set up.  I've disconnected the freeview box and fed the antenna lead from the socket in the wall direct to the television but still no reception.  I'm now at a complete loss as to what to do.  There is no problem with the television, so do not need a television engineer.  Does anyone have a clue as to what I should do? Any feedback would be really appreciated.", 
      "date": "2008-02-29 00:00:00", 
      "id": 3524, 
      "responses": 2, 
      "subject": "Television reception problem", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4071"
    }, 
    {
      "body": "I live in Lauderdale Tower and I seem to remember that the Barbican (or the Towers at least) have been plumbed in for Sky TV. Is this right, or have I gone completely mad?  Can anyone advise me as to how I go about subscribing to the service if it is available. Five terresrial channels just isn't entertaining me anymore...", 
      "date": "2007-01-16 09:45:00", 
      "id": 4140, 
      "responses": 2, 
      "subject": "Sky/cable TV", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2919"
    }, 
    {
      "body": "Has anyone else attempted to get new TV sockets fitted by SCCI, and with any success? After 2 months we're still waiting just for them to give us a quote.  Tried chasing, they said the quote would go out urgently but still not a word.  I don't know why they wasted our time coming to measure up if they didn't want to do the work. Any advice about alternative contractors?", 
      "date": "2005-11-21 11:41:00", 
      "id": 4535, 
      "responses": 2, 
      "subject": "SCCI, new TV points", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1944"
    }, 
    {
      "body": "Has anybody tried to wall mount a plasma screen and channel out for the wiring, and if so how successful was it?", 
      "date": "2005-05-13 15:04:00", 
      "id": 2937, 
      "responses": 1, 
      "subject": "Plasma Screens", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1626"
    }, 
    {
      "body": "Does anyone know how the wires for the new TV system are going to be run? When the last block of flats I lived in got cabled, they just drilled holes through the floors and ran white plastic cable guides everywhere, and I guess I'm concerned this doesn't happen here.", 
      "date": "2005-01-16 10:11:00", 
      "id": 2942, 
      "responses": 1, 
      "subject": "New TV system", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1420"
    }, 
    {
      "body": "Does anyone else have problems receiving ITV and Channel 4 on digital TV? I've just bought a new TV with a digital decoder built in and I can only get BBC (and other free to air) digital channels on it. The troubleshooting guide suggest the arial might be to blame. Has anyone else had these problems with our Barbican arial? Thanks for any advice.", 
      "date": "2007-12-29 18:16:00", 
      "id": 3490, 
      "responses": 1, 
      "subject": "Problems with our Barbican TV arial?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3890"
    }, 
    {
      "body": "Has any body else stop receiving TV Saturday morning from 0130hr following a power failure. I have called the Bunyan court CPA who was going to look into it, so I then called the resident Engineer, only to have the phone answered by Defoe house CPA who said his TV works alright and he would connect me to the Bunyan CPA who would deal with my problem. The Bunyan CPA did call back with a telephone no. of the TV / satellite people under contract to the Barbican Estate, I call the number and listened to an answer machine message requesting our contract number with them (to which I don't know, only the Barbican office knowns, and they are not back for 3 days, so I could not leave any information). I have decided that Life dose not revolve around TV, so thanks to the BEO and there contract with an answer service I am now cancelling my subscription to rip off sky and going to buy a free view box which will work when the BEO get the TV people to switch back on the trip switch (shame the resident engineers dont know where this switch is!). Sorry about the rant, but missing all my favourite TV programmes this weekend. AHHHHHHHHHHHHHHHHHHHHH -0", 
      "date": "2008-05-05 19:40:00", 
      "id": 3566, 
      "responses": 1, 
      "subject": "TV Bunyan Court - May Day Bank Holiday weekend without TV", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4304"
    }, 
    {
      "body": "Is anyone else's TV not working? Ours had been out since this morning...though i am not sure what the reason is as we do have a baby who may have pulled a lead somewhere...wondering if it is just us?", 
      "date": "2008-05-01 17:29:00", 
      "id": 3903, 
      "responses": 1, 
      "subject": "TV not working", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4294"
    }, 
    {
      "body": "What has anyone else done with their old NTL set-top boxes now we have the new TV system? The woman I spoke to at NTL kept telling me I could \"disregard\" it, which I assume is business speak for \"throw it away\". Seems a waste, but I guess there's no need for these analogue boxes anywhere...?", 
      "date": "2006-02-03 08:52:00", 
      "id": 4564, 
      "responses": 1, 
      "subject": "Old NTL set-top boxes", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2057"
    }, 
    {
      "body": "We have a satellite system already, which works well and never gives us problems. I have just bought a Freeview box for another TV. However, I am only able to receive a few channels using the Barbicans internal antenna system.  Does anyone else have problems with Freeview on the Internal System. I did buy an internal aerial from Argos, but that seems to be just as patchy. Given the Barbicans internal system has just been upgraded, why am I getting such a poor signal.  Thanks for any advice offered.", 
      "date": "2006-03-22 12:11:00", 
      "id": 4621, 
      "responses": 1, 
      "subject": "Freeview problems", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2150"
    }, 
    {
      "body": "I currently have the following message on my Sky TV for CNBC which is channel 505 on my box. \"\"No satellite signal is being received\" (Although this particular channel is one of just a few missing, Sky tell me that the software needs updating on my box, and it cannot be received over the satellite if any of the channels are not being received.) I'd be grateful for your help. Does anyone else have the message \"No satellite signal is being received\" on certain channels.? Sky says is suggests the dish is out of alignment. I'm going to ring SCC tomorrow but would like to know if it is a general of specific problem. best regards,", 
      "date": "2006-04-06 21:35:00", 
      "id": 4644, 
      "responses": 1, 
      "subject": "CNBC - No satellite signal is being received", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2183"
    }
  ]
}