{
  "summary": [
    {
      "body": "Does anyone know where I can source original style taps? I would like to replace most of ours as they are looking pretty grotty. I think it would spruce the place up nicely to have new shiny taps, so any advice would be lovely! ", 
      "date": "2005-08-01 17:07:00", 
      "id": 2955, 
      "sentiment": 3, 
      "subject": "bathroom and kitchen taps", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1777"
    }, 
    {
      "body": "I have been through all the  flooring options for my flat, and am dead keen on getting a fawn coloured resin coating, or screed, highly polished. See this   link for a view of what I am after  I am convinced that this could be the ultimate flooring solution for the Barbiacan style of flat. Has anyone had any experience of this service? Max", 
      "date": "2005-12-09 00:20:00", 
      "id": 3037, 
      "sentiment": 3, 
      "subject": "floor screed", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1978"
    }, 
    {
      "body": "Hello Has anyone switched from London Energy to another supplier? I've just been quoted 68 a year from Southern Electric, which is much lower than my current bill and sounds too good to be true. If you have any horror stories about them (or can allay my suspicions) I'd be grateful to hear from you. Thanks", 
      "date": "2005-09-20 13:04:00", 
      "id": 3052, 
      "sentiment": 3, 
      "subject": "electricity", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1847"
    }, 
    {
      "body": "Hello people, I am moving to the Barbican this week after an exciting 5 months wrangling with estate agents etc. At last! Where i currently live I get broadband (cable modem), Cable TV and phone from NTL.    It seems that NTL do not supply this bundle in the Barbican. I was wondering what people typically did. Do people normally get cable via this communal Sky TV set up? I hear broadband has to be over the phone line - what do people tend to use - ISDN? ASDL?    And most importantly what supplier do people recommend for broadband in the Barbican.  Any recommendations much appreciated! kind regards Hal", 
      "date": "2006-04-24 12:38:00", 
      "id": 3067, 
      "sentiment": 3, 
      "subject": "Broadband Recommendations?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2217"
    }, 
    {
      "body": "I have noticed a rather attractive pale green small tree / shrub-like plant on the 2nd floor of Speed House, south-facing, in the middle of the block approx. I think there is a similar plant on the first floor of Gilbert, on the east-facing balcony. Both seem to be evergreen. Does anyone know what these plants/trees are called?", 
      "date": "2006-04-30 07:17:00", 
      "id": 3077, 
      "sentiment": 3, 
      "subject": "Balcony plant identification question!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2238"
    }
  ]
}