{
  "summary": [
    {
      "body": "Hi there I've just come back from Columbia Flower Market with a couple of Echiums (canary palms) which grow really well here, and are loved by the finches.  I almost bought an olive tree but thought it best to ask the learned Forum if they grow well on our balconies. When I first moved in to Thomas More four years ago, I lost a fortune on plants which didn't do too well.  We're in Thomas More but are moving to Mount Joy where the corner part of the balcony is large enough for a small olive tree, and still be a fire exit.  I sat in Mount Joy yesterday looking at the view and a jay flew down and started to sing - very surreal. I now want to get more plants/trees to attract more wildlife. Has anyone had any success with olive trees here or anything similar? The balcony corner has a north/east aspect.  Thank you.", 
      "date": "2007-04-22 14:20:00", 
      "id": 4392, 
      "sentiment": 4, 
      "subject": "Olive Trees on our balconies", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3257"
    }, 
    {
      "body": "hello all. i've been considering moving to the barbican estate for a long time now - it's near to work, public transport is good. most importantly, the estate itself is quite beautiful - in an odd way. and the barbican centre is incredible. so i've spent a few hours looking over estate agents and this site. service charges are a recurring question though - i've lived in a mansion block before so i'm used to phenomenal service charges. does anyone know round-about annual service charges. i'm looking at type 28/29 , or larger studios w/ \"bed areas\" (type 44?). the flat would have to be in a \"north-south\" terrace - i really can't afford being hit by a mega-lift-charge. if anyone knows really approximate for a studio/1bed/2bed flats in one of the north-south terraces i would really appreciate it. thanks.", 
      "date": "2006-08-25 22:31:00", 
      "id": 4458, 
      "sentiment": 4, 
      "subject": "service charges", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2560"
    }
  ]
}