{
  "summary": [
    {
      "body": "This morning, at Columbia Road market, my friend (also a Barbican resident), had her wallet taken from her bag, at around 10.50 a.m..  This was in one of the shops as you approach the market from the western end of Columbia Road.  With hindsight she realised she had been jostled by two or more females, early twenties, for whom we and the shop owner could have given a reasonable description.  My friend immediately cancelled the one credit card in her wallet.  Another shop owner gave me the telephone number for Bethnal Green Police Station, who we were told cover that area.  I was cut off after about 10 minutes holding trying to get through.  I then tried Barbican Police on the basis that they might either have another number for Bethnal Green or a way of contacting any police who might be in the Columbia Road area, in case the thieves were working their way through the market.  As one was clutching a bunch of small sunflowers (which admittedly could have been thrown away), they were potentially easy to identify, together with the description of appearance we could have given.  There was no reply from Barbican Police and at the time I couldn't find the Snow Hill number, though I found it subsequently.  When we got back to the Barbican, my friend tried the Bethnal Green number again.  After around 15 minutes she got to speak to someone, who asked which postcode Columbia Road was in.  Surprised that they did not know Columbia Road (well known Sunday plant market etc) was in E2, local to Bethnal Green, my friend was then told she was not through to Bethnal Green police but through to a central office dealing with both general and emergency calls and noting incidents.  She was told someone from Bethnal Green Police would get back to her (presumably now tomorrow). At what stage is it warranted to phone 999?  No-one had been hurt so it was not an emergency in that sense, merely a stolen wallet with all the inconvenience (membership cards, congestion charge card, library card etc), but time was lost during which the thieves may have continued their thieving and if police were in the area, they could have been notified promptly and maybe the perpetrators could have been caught.  I always understood prompt reporting of incidents was important.    Please can you tell me what we should have done in the circumstances described?", 
      "date": "2007-07-22 20:32:00", 
      "id": 5354, 
      "responses": 3, 
      "subject": "What should we do if pick-pocketed?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=3529"
    }
  ]
}