{
  "summary": [
    {
      "body": "Ive been wondering where on earth my service charge bill had got to, and now its here the *** thing has given me a conniption.  On top of the substantially increased quarterly service charge for 06-07, Im being charged 191.07 for Services 2005/06 Year End Balance From 01/04/2005 to 31/03/2006. But I only purchased my flat on 3 February 06, so surely I should be liable for less than a sixth of that 191. Of course I will be going to the estate office about this first thing Monday morning, but the bills have gone out so late this time  arrived Saturday 16/9, due date is 29/9  that Ill be in arrears and presumably getting penalised for it if I dont cough up almost immediately. While 191 might be peanuts to some people on the estate, its a serious problem for me. So in case I get the runaround, is anyone able to tell me ahead of time how theyve dealt with this situation? I assume it must happen to everyone who buys a flat here. Are the Corporation just trying it on, or have I agreed to be liable for this by buying my flat? Am I going to have to go back to my solicitor and ask her to extract the money from the dodgy letting company who owned this flat previously? And is that even possible six months after the sale is supposed to have been wrapped up? I appreciate any light anyone can shed on the matter. Its the fact that the bill is both late and timed to arrive on a weekend that makes me particularly angry. Thats two totally unnecessary days of worry.", 
      "date": "2006-09-16 23:21:00", 
      "id": 4491, 
      "responses": 6, 
      "subject": "Incorrect service charge", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2607"
    }, 
    {
      "body": "OK, this is a bit belated, but I'm up to the August post now. In the September service charge statement, it says we got a Refund of Supervision and management Charges for the period 01/04/1999 to 31/03/2007. This amounts to 170 for our flat.  My question is this (for the more legally minded I expect): are we expected or required to pay the previous owners of the flat their share? For example, if we bought the flat on 01/04/2003, would the previous owner get 4 years of the refund (50%)? Or is it all mine?", 
      "date": "2007-11-12 20:12:00", 
      "id": 3472, 
      "responses": 1, 
      "subject": "Refund of Supervision and Management Charges", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3790"
    }
  ]
}