{
  "summary": [
    {
      "body": "Next week we are supposed to be voting in a by-election in the ward that covers the west and north sides of the Barbican and Golden Lane.(Sorry if you live in Seddon, Mountjoy, Defoe, etc - you're not affected) Has anyone heard from any candidates yet?", 
      "date": "2006-09-04 08:42:00", 
      "id": 4483, 
      "responses": 29, 
      "subject": "By-election in Cripplegate Ward?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2575"
    }, 
    {
      "body": "After the Mozart Requiem, there will be fireworks outside the Barbican Centre tonight - around 9.30-10pm I would guess. I would advise sedating toddlers and (illegal) pets, and those residents who complained that they have \"seen it, done it\" might want to look for alternative entertainment elsewhere. For example, they might want to book a hot air balloon over the lovely Kent countryside on this fine evening. For the rest of us, enjoy! I know I will.", 
      "date": "2007-08-04 08:05:00", 
      "id": 3389, 
      "responses": 28, 
      "subject": "fireworks tonight", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3560"
    }, 
    {
      "body": "Posted: Tue Dec 19, 2006 7:34 pm    Post subject: First Barbican Gay/LGBT & Friends Residents Gathering     -------------------------------------------------------------------------------- Following on from the Only Straights on the Estate string, the first First Barbican Gay/LGBT & Friends Residents Gathering will be held on 9th January at the Wood St Bar from 7.30pm.  I've had to pay a deposit and I need to have some rough idea of numbers, so that we can make sure we have the best possible space on the night.  Please PM me if you'd like to come or email  . Please let other people know so that as many people come along as possible. I'll be inviting a few friends just to make sure it's not me sitting on my own with Paul all night!!", 
      "date": "2006-12-20 12:23:00", 
      "id": 3460, 
      "responses": 25, 
      "subject": "First Gay / LGBT & Friends Residents' Gathering - Jan 9t", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2849"
    }, 
    {
      "body": "I read with interest in the Mail on Sunday that Mr Harris of Frank Harris has been quoted as follows\" b] Maybe making money is all that is of interest to Mr Harris and his Company!!! Why cant people embrace the fact we have achieved a great thing in securing the 2012 Olympics instead of being negative and disinterested!", 
      "date": "2005-07-11 07:30:00", 
      "id": 4505, 
      "responses": 20, 
      "subject": "\"We dont want the Olympics\" - Frank Harris", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1735"
    }, 
    {
      "body": " ", 
      "date": "2006-09-30 18:04:00", 
      "id": 4291, 
      "responses": 16, 
      "subject": "Whitecross Street Market Food Festival OCT6/7/8TH", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2644"
    }, 
    {
      "body": "What are peoples thoughts???", 
      "date": "2005-05-20 18:29:00", 
      "id": 4724, 
      "responses": 15, 
      "subject": "How about a residents BBQ in the Barbican???", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1640"
    }, 
    {
      "body": "Following on from the Only Straights on the Estate string, the Second Barbican (and Golden Lane) Gay/LGBT & Friends Residents Gathering will be held on Tuesday 13th January at the Wood St Bar from 7.30pm. Please PM me if you'd like to come or email  . If the numbers are looking strong, we might be able to take over the downstairs room and, following lots of positive ideas from everyone who came last time, I shall buy some nibbles and bits to eat this time. Please let me know if you can make it.  Danny", 
      "date": "2007-01-14 21:34:00", 
      "id": 3257, 
      "responses": 14, 
      "subject": "2nd LGBT Residents Gathering - 13 Feb at Wood St Bar", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2908"
    }, 
    {
      "body": "Can anyone enlighten me as to what, exactly, happens at a Ward Mote. I am relatively new to the Barbican and am quite bemused by some of the strange  practices that take place within the city wards.", 
      "date": "2008-02-21 21:05:00", 
      "id": 3818, 
      "responses": 14, 
      "subject": "Ward Mote", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4045"
    }, 
    {
      "body": "In my never ceasing, and sometimes vain,  attempts to find information for Barbican Life magazine, I have now been informed that a Food Festival for the regenerated Whitecross Street market area is definitely planned for October 6th-8th.  The regeneration is being undertaken by Islington council and EC1 New Deal, while the Food Fair itself is being organised by the consultancy firm which launched the Food Fair which led to the regular Borough Market.  This is an update from the piece I wrote in the last BL magazine.  I have been talking to the guy behind the Food Festival and he is working on the Borough Market model and is very confident that they can make a go of another 'Borough Market' right on our doorstep, which would be great news for Barbican residents.  Do put the dates in your diaries.  A successful first effort could mean that the chances of a continuing food fair on a more regular basis would be much enhanced.", 
      "date": "2006-07-25 15:47:00", 
      "id": 3127, 
      "responses": 11, 
      "subject": "Whitecross street food festival", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2476"
    }, 
    {
      "body": "Anybody know what time the fireworks will be starting? Thanks", 
      "date": "2007-07-13 12:33:00", 
      "id": 3622, 
      "responses": 11, 
      "subject": "fireworks on st giles pavement tonight", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3493"
    }, 
    {
      "body": "not earth shattering, but if you have 5 minutes, the new exhibition at the curve in the arts centre is lovely ...  we went early on sat. and were by ourselves and i have seldom felt so soothed without an empty bottle by my side ...   have a look", 
      "date": "2006-05-14 20:33:00", 
      "id": 3118, 
      "responses": 10, 
      "subject": "peace", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2291"
    }, 
    {
      "body": "After at least 330 years (!) as the Kings Head (and also the St Pauls) closes next weekend.  In theory the Kings Head will reopen as a pub once the Chiswell Street Brewery has been redeveloped as a hotel.   However, given the abject spinelessness of the City when faced with major developers we could well see the pub converted to become the breakfast bar of the aformentioned hotel, as per the developer's original plans. Meanwhile, there will be a closing party at the Kings Head on the evening of Thursday 21st February.  As I first supped there over thirty three years ago I'll see you there!  Mine's a pint of bitter!", 
      "date": "2008-02-17 18:56:00", 
      "id": 3817, 
      "responses": 10, 
      "subject": "Kings Head closing down next weekend", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4036"
    }, 
    {
      "body": "Having entered one of those 5k charity runs (seemed like a good idea at the time....) I am now faced with the unpleasant task of training. finding treadmills terminally dull even with the benefit of pumping tunes in my ears, i have just realised the benefits of the perimeter highwalk (including round by museum of london) as a running route. does anyone know how far this is so i can work out how many laps is the equivalent to 5k?  need to learn to pace to myself before i collapse in a beetroot-faced heap......", 
      "date": "2006-05-14 19:11:00", 
      "id": 3107, 
      "responses": 9, 
      "subject": "How long is the highwalk?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2290"
    }, 
    {
      "body": "I just discovered today that the Barbican cinema has started a baby & parent screening. Mondays at 12am, for children under 1 year.  Here's the link", 
      "date": "2007-01-30 20:18:00", 
      "id": 3285, 
      "responses": 9, 
      "subject": "Parent & baby cinema!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2981"
    }, 
    {
      "body": "Our last LGBT gathering had about 60 people. And we're growing.  So, we've decided to go a bit more formal. From now on, we'll be known as EC2Gayz. And we're a group of Barbican and Golden Lane residents. And we're about EC2 gay and lesbian residents (and friends) getting together to get to know each other and swap scary amounts of local gossip.  Michelle has kindly offered to help as my co-host at the next gathering.  Our next meet will be downstairs at the Wood St Bar & Restaurant on Tuesday 27 March.  We'll be putting some flyers up around the Estate and hope to capture more people who don't use BarbicanTalk at our next gathering.  Looking forward to seeing everyone again on Tuesday 27 March.  Danny", 
      "date": "2007-02-23 13:55:00", 
      "id": 3262, 
      "responses": 8, 
      "subject": "March 27 Gay and Lesbian Residents Gathering - EC2 Gayz", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3079"
    }, 
    {
      "body": "Does anyone know when the next St Giles book sale is? I want to donate some books for them to sell.  I can't see anything about it on the St Giles website (although it does have some great photos of the history of the church).", 
      "date": "2008-04-21 11:13:00", 
      "id": 3565, 
      "responses": 8, 
      "subject": "St Giles Book-sale: when is the next one?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4256"
    }, 
    {
      "body": "There's a notice going around from the Soil Association. Looks like a very good line-up of exhibitors. Sounds like a one-off so we need to give as much attendance as poss. to encourage them to repeat. Should be well worth going. 10:00 till 4:00 on Sunday 8th Jan. Admittance fee not mentioned so assume free. We're defininitely going - see you there  ", 
      "date": "2006-01-04 14:34:00", 
      "id": 3026, 
      "responses": 7, 
      "subject": "Organic farmers' market this Sunday at the Brewery", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2011"
    }, 
    {
      "body": "what's happened to easygays or whatever it was called - any plans for a christmas gathering?", 
      "date": "2007-12-12 12:50:00", 
      "id": 3533, 
      "responses": 7, 
      "subject": "Gay drinks", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3864"
    }, 
    {
      "body": "take care crossing the streets in Feb....!  Shell backs Ferrari F1 with world's costliest ad (from Marketing mag 23 Jan) LONDON - Shell is to seal off the City of London and turn it into a mini Grand Prix-style racing circuit, as part of the filming of an ad highlighting its partnership with the Ferrari Formula One team. The TV execution, whose production cost 2m, making it the most expensive ad ever, will promote Shell's high-performance V-Power fuel. It is intended to support Shell's positioning as the most innovative fuel brand.  The ad will feature Ferrari F1 cars racing through some of the world's most famous cities, including New York and Sydney. The London leg of the ad, being created by JWT London, will be shot on 17 February, with the execution set to air globally in March.", 
      "date": "2007-01-27 22:45:00", 
      "id": 4230, 
      "responses": 7, 
      "subject": "Formula 1 in the City: 17 Feb", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2966"
    }, 
    {
      "body": "Further to an earlier post, I am also doing the Race for Life - I've checked the website but can't see if there's a map of the route so I can practice! Has anyone else found one?", 
      "date": "2006-05-23 17:56:00", 
      "id": 4397, 
      "responses": 6, 
      "subject": "Race for Life", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2313"
    }, 
    {
      "body": "Seeing this is so near, i thought some people might be interested - i went to the Mobile Clubbing at Paddington a few weeks ago and it was brilliant fun - all ages and mixes of people there. Can't make this event unfortuantely. The information below is from the emal they send out: LONDON PILLOW FIGHT CLUB 06 Junction of Leadenhall Street and St. Mary Axe, City of London Friday 15th December, 18:12 Have a great time, and don't forget to help clean up the feathers afterwards. THE RULES OF PILLOW FIGHT CLUB Tell everyone about Pillow Fight Club Turn up at Pillow Fight Club venue with a pillow hidden in plastic carrier bag At exact given time, pull pillow from bag and fight Do not fight anyone without a pillow in hand (unless they want it)", 
      "date": "2006-12-15 03:32:00", 
      "id": 3318, 
      "responses": 5, 
      "subject": "Pillow Fight Club", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2834"
    }, 
    {
      "body": "I have been looking on the Barbican Theatre events list and see that Ronnie Birkett is to return with his theatre of marionettes.  I saw his production \"Provenance\" a couple of years ago and still think it is one of the best theatre productions I have ever seen - really, really special. I recommend Barbicantalkers to check it out. And no, I am not Ronnie's mum nor his agent....", 
      "date": "2007-04-02 20:37:00", 
      "id": 4314, 
      "responses": 5, 
      "subject": "Ronnie Birkett at the Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3202"
    }, 
    {
      "body": "Does anyone kow if there's a booksale at the Church this bank holiday ? I remember them being in August but not sure about May... ta", 
      "date": "2007-04-29 11:04:00", 
      "id": 4335, 
      "responses": 5, 
      "subject": "Book Sale at the Church??", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3283"
    }, 
    {
      "body": "Hi all, the Barbican Horticultural Society's summer competition is almost upon us again. As part of this event some of the balconies and window boxes are open to other members from the society. I would like to extend this for my balcony to anyone from this forum who wishes to have a nose around and get some planting ideas. I have a couple of trees and quite a lot of planting that may be of some interest, including a six foot Echium. Another Echium is on its way up and promising to be even bigger. So if you are around on the morning of 2nd July then please do pop in. David 20 Thomas More House", 
      "date": "2006-06-21 16:28:00", 
      "id": 3129, 
      "responses": 4, 
      "subject": "Barbican in Bloom", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2381"
    }, 
    {
      "body": "Last year there was a summer fete in TM gardens i think - is there going to be another one this year, as i've got lots of bric-a-brac that i've cleared out and will hold on to it if it could be used. Anyone know anything about it?", 
      "date": "2006-07-06 14:58:00", 
      "id": 3183, 
      "responses": 4, 
      "subject": "Summer Fete", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2433"
    }, 
    {
      "body": "For some crazy reason I am running the London Marathon next April for the Children's Society. I am currently trying to think of new and exciting ways to raise sponsorship money, but I just wondered what everyone thought about 'touting' (excuse the phrase) for sponsorship around the Barbican? I was planning on offering a car washing service, and potentially organising a cake sale, but any other ideas people have (as well as feedback as to the reception of these) would be gratefully received.", 
      "date": "2006-08-29 07:56:00", 
      "id": 4463, 
      "responses": 4, 
      "subject": "Sponsorship Ideas", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2564"
    }, 
    {
      "body": "OK, I suppose it should probably go in the other thread but being that more people read this one, I'm posting here.  Currently the Switched On London festival is on [url]www.switchedonlondon.com/index.htm[/url] Despite my constant moaning about light pollution in The City this looks rather cool, and definitely worth a stroll one evening. Anyone been yet? [/url]", 
      "date": "2007-02-15 14:47:00", 
      "id": 3261, 
      "responses": 3, 
      "subject": "Switched on?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3060"
    }, 
    {
      "body": "I couldn't find this event on here, and I know it is something that most people would enjoy. So here:   Shame it's going to be so light outside...", 
      "date": "2007-06-20 15:06:00", 
      "id": 3357, 
      "responses": 3, 
      "subject": "Light's out", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3431"
    }, 
    {
      "body": "Our expatriate friends have asked whether there is a celebration of Burn's night around the Barbican.", 
      "date": "2008-01-12 14:28:00", 
      "id": 3557, 
      "responses": 3, 
      "subject": "Burn's Night 25th January", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3924"
    }, 
    {
      "body": "Hey BarbicanTalkers! I'm back in the States for the Holidays. However I am planning to spend New Years in London, can anybody suggest what to do? I have my step daughter and her fiance staying with me...", 
      "date": "2007-12-14 19:10:00", 
      "id": 4180, 
      "responses": 3, 
      "subject": "New Years in London", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3870"
    }, 
    {
      "body": "For me, there are three main reasons for wishing to live in the Barbican 1/ Walk to work (and to South Bank, West End etc) 2/ Pedestrian only 3/ The Barbican Centre on your doorstep We go to The Barbican Centre a lot: pretty much it's the main arts venue in London we go to regularly. I was wondering how often Barbican residents make use of this wonderful venue. Look forward to your responses! What sort of events do you go to, and what have you been to recently?", 
      "date": "2006-10-02 09:23:00", 
      "id": 4276, 
      "responses": 3, 
      "subject": "How often do you attend cultural events at The Barbican?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2649"
    }, 
    {
      "body": "Does anyone know if fireworks on the cards this year by the Barbican lakes? If so, when? Thanks ", 
      "date": "2007-05-08 20:29:00", 
      "id": 4332, 
      "responses": 3, 
      "subject": "Fireworks this year?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3313"
    }, 
    {
      "body": "According to the FT today (\"the way we live now column\" on page 14) a nest of falcons is in the Barbican and the June 6 Mozart fireworks have been cancelled to allow oeace and quiet for hatching.", 
      "date": "2006-05-30 13:31:00", 
      "id": 4428, 
      "responses": 3, 
      "subject": "Barbican peregine falcon", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2327"
    }, 
    {
      "body": "Open House London weekend excepted, do the BA run guided tours of the Barbican?", 
      "date": "2006-02-15 09:51:00", 
      "id": 4581, 
      "responses": 3, 
      "subject": "Guided walks", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2076"
    }, 
    {
      "body": "Anyone going to the \"No Wax\" event at the Barbican? I know we're quite a tech savvy bunch so expect lots of i-Whores shaking their funky thangs and jiggling their funky wheels. So go on, do it. And if you're going to, what's your bag baby.  Parrrrrrrrrrrrrp", 
      "date": "2005-04-21 00:22:00", 
      "id": 2917, 
      "responses": 2, 
      "subject": "Mo' no wax", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1580"
    }, 
    {
      "body": "This season is the Centenery of Southwark Park Bowling Club, Jamaica Road, Rotherhithe, SE16. We hope to start this historic season on Sunday 19th April and we are always on the lookout for new and experienced players.Coaching would be available. Lawn Bowls is a sport that men and women can play on an equal basis, and despite the image of being an \"Old Man's Sport\" this is not always the case as can be seen on T.V.coverage. Opening times are Mon-Fri. 2-4pm                     Plus Tues & Thurs 6-8pm                            Sat & Sun.2-4pm. If you would like more information please do not hesitate to pm me. ", 
      "date": "2008-04-07 16:53:00", 
      "id": 3857, 
      "responses": 2, 
      "subject": "Southwark Park Bowling Club - Centenery.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4206"
    }, 
    {
      "body": "Anyone know what the event is happening in Fore Street this lunchtime? It's all quite exciting -  Darth Vader, Stormtroopers, the Lord Mayor (of London, not a galaxy far far away) and scores of schoolkids.  Lots of fun but what's it about? It's all a lot nicer than writing a report which is what I'm supposed to be doing ", 
      "date": "2006-06-23 12:17:00", 
      "id": 4433, 
      "responses": 2, 
      "subject": "The force is with us", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2387"
    }, 
    {
      "body": "I remember seeing banners announcing book fairs in St Giles last year, before I moved in. Are these regular events and can anyone tell me when the next one will be?  Thanks.", 
      "date": "2006-01-30 15:05:00", 
      "id": 4563, 
      "responses": 2, 
      "subject": "Book fairs", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2052"
    }, 
    {
      "body": "\"Amigos in the Barbican\" - THE social group for all Barbican residents (aged 18+) - will be holding a buffet supper in the upstairs function room of Ye Olde Red Cow in Long Lane EC1 on Tuesday 8th March from 7.00pm.   The cost will be 12.00 (including dessert and coffee) per person.  Everyone is welcome.  Cheques (payable to \"Amigos in the Barbican\") are required no later than 3rd March.  Please bring them to our event on 2nd March or deliver them to 15 Defoe House.  For further information and encouragement, please contact:  Tel: 07913 153410                                ", 
      "date": "2005-02-25 07:29:00", 
      "id": 4655, 
      "responses": 2, 
      "subject": "\"Amigos in the Barbican\" Buffet 08/03/05", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1471"
    }, 
    {
      "body": "Drug, Alcohol and Internet Safety Event  City of London Drug Action Team With parenting, family and social issues such us drug awareness and internet safety at the front of our minds more and more, the Drug Action Team will be hosting two events for parents to attend - offering practical, useful advice on the issues that really matter, please come along and share your concerns with people who care & understand. 1st event Golden Lane Community Centre (Opposite Great Arthur House - Tower Block) Golden Lane Date and time: Tuesday 9th October at 6.30 pm 2nd event Middlesex Street Community Hall Middlesex Street Estate Date and time: Tuesday 17th October at 6.30 pm Both events will feature discussions & questions and will be friendly and informal", 
      "date": "2007-10-02 22:23:00", 
      "id": 5357, 
      "responses": 2, 
      "subject": "Drug / Alcohol and Internet Safety event", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=3707"
    }, 
    {
      "body": "Hi there Normally we live in Defoe House, but this year we decided to rent our flat out and attempt to cycle from the Barbican to Dehli for charity. We are currently in Romania. You can follow our adventure on   John and Sally ps. we are struggling to get a visa for Iran. If anybody has any contacts at the Iranian embassy please drop me a note at ", 
      "date": "2006-06-29 15:07:00", 
      "id": 3177, 
      "responses": 1, 
      "subject": "Cycle trip from London to India", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2415"
    }, 
    {
      "body": "I see we have another three day foodie market starting in Whitecross Street tomorrow. I hope there's more than just a lot of posh bread and jam this time (O.K. and one organic butcher and one fish stall).", 
      "date": "2006-12-06 09:41:00", 
      "id": 3233, 
      "responses": 1, 
      "subject": "Whitecross Street Xmas Market", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2808"
    }, 
    {
      "body": "Do we still have a summer fair in TM Gardens each year?", 
      "date": "2008-02-28 18:32:00", 
      "id": 3525, 
      "responses": 1, 
      "subject": "summer fair", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4068"
    }, 
    {
      "body": "Armagnac-tasting and financial planning talk 8pm 10th April This event hgas been postponed as it clashes with the BA AGM. A fresh date will be notified in the next Barbican Life magazine. Please email me at   if you are intersted provisionaly.", 
      "date": "2008-04-08 06:31:00", 
      "id": 3853, 
      "responses": 1, 
      "subject": "Armagnac-tasting 8pm 10th April POSTPONED", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4211"
    }, 
    {
      "body": "I have just picked up a flyer distributed by the school on Whitecross Street advertising their open days on Saturdays 26 April, 3 May, 10 May and 17 May when they are offering tours of the building between 10am and 11am on those days. It is well worth taking a look inside the building, which is beautiful in my opinion.", 
      "date": "2008-04-22 18:19:00", 
      "id": 3883, 
      "responses": 1, 
      "subject": "GoldenLaneCampus School open day", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4266"
    }, 
    {
      "body": "For those wondering where the Thanksgiving Fireworks are coming from - 9PM on 22 Nov - you'll no doubt be delighted to know some decent resident in the West Half of Ben Jonson is actually launching them of his or her balcony on the 4th floor facing south.", 
      "date": "2007-11-22 21:02:00", 
      "id": 4148, 
      "responses": 1, 
      "subject": "THANKSGIVING FIREWORKS", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3811"
    }, 
    {
      "body": "Just a reminder to all Barbican residents (aged 18+) that our social group \"Amigos in the Barbican\" will be meeting, as usual, on the First Wednesday in the Month (FWITM) at Davy's City Boot, Moorfields Highwalk, from 7 - 9pm on 2nd March.  Everyone welcome - just turn up.  The only costs are whatever drinks/snacks you buy.  Further information and encouragement from:  Tel: 07913 153410 \"Strangers are just friends you haven't yet met\"    ", 
      "date": "2005-02-25 07:20:00", 
      "id": 4554, 
      "responses": 1, 
      "subject": "\"Amigos in the Barbican\" get-together 02/03/05", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1470"
    }, 
    {
      "body": "have just discovered a Barbican news release on a light display projected on london buildings in april 2006 , 10 sculpture court 12 same ,13 waterside, 14 waterside. Does any one know how far this display will spread onto/into surrounding blocks as no info that i know of has been released to B.A. or house groups?", 
      "date": "2006-02-18 16:48:00", 
      "id": 4588, 
      "responses": 1, 
      "subject": "light display", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2086"
    }, 
    {
      "body": "I am having an open Balcony on Sunday 19th June in the morning 10:00 to 12:00 as part of the Barbican Horticultural Society's scheme. If anyone would like to come around from this forum you are most welcome.  I'm at 20 Thomas More, but I must leave on the dot as I have to get to my parents in Buckinghamshire for Father's day.", 
      "date": "2005-06-17 08:09:00", 
      "id": 4748, 
      "responses": 1, 
      "subject": "Barbican in Bloom", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1689"
    }
  ]
}