{
  "summary": [
    {
      "body": "Anyone know what's happening to this pub on the corner of Goswell and Clerkenwell? After years standing empty, there seems to be some refitting going on.", 
      "date": "2006-07-19 20:33:00", 
      "id": 4046, 
      "responses": 36, 
      "subject": "Hat and Feathers", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2462"
    }, 
    {
      "body": "Don't know if anyone else in Ben Jonson or Cromwell Has noticed but boudoir bar in chiswell st applied on the 29/4/05 for a licence extention until 3am mon-sat and 2am Sun. They already wake me on a regular basis as there patrons leave.....   have to get you're objections in to islington within four weeks of the 29/4/05 so this week...", 
      "date": "2005-05-21 22:09:00", 
      "id": 4686, 
      "responses": 27, 
      "subject": "Boudoir late licence application", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1642"
    }, 
    {
      "body": "Hello Neighbours, I live on Golden Lane Estate, and I'm tring to rally up support for objecting to the late license that the Shakepeare pub (on Aldersgate Street) have applied for. Does the noise  reach as far as the Barbican, John Trundle Court perhaps?", 
      "date": "2005-07-29 11:40:00", 
      "id": 2966, 
      "responses": 25, 
      "subject": "Shakespeare pub late license", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1768"
    }, 
    {
      "body": "Work men seem to be refitting it.  Does anyone know if/when it is reopening?", 
      "date": "2006-09-25 13:26:00", 
      "id": 4313, 
      "responses": 23, 
      "subject": "Crowders Well to Re-Open?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2630"
    }, 
    {
      "body": "Can anyone recommend any local watering-holes (non-smoking) that serve brunch (with alcohol, of course...) at weekends? I know, a tall order!  Thanks for any suggestions", 
      "date": "2006-12-29 22:27:00", 
      "id": 4233, 
      "responses": 19, 
      "subject": "brunch at weekends", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2866"
    }, 
    {
      "body": "Looking for a wateringhole with convivial atmosphere with decent good beer as replacement for the Kings Head after a Barbican Friday evening concert. The Two Brewers is next up along Whitecross St.  Recommendations / comments welcomed.  Are there any other pubs close by?", 
      "date": "2008-04-27 11:34:00", 
      "id": 3973, 
      "responses": 14, 
      "subject": "Two Brewers, Whitecross St", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4278"
    }, 
    {
      "body": "The Rising Sun shut at 9pm yesterday.  The Sutton has reverted to being closed on Sats.  The Hand & Shears is never open on Sats.  The Red Cow has closed.  The Butchers Hook and Cleaver only opens for private parties. Questions: where to find a half decent pub in the city for a pint on a saturday night?Anyone know why more of those that are open shut early?", 
      "date": "2007-04-01 19:50:00", 
      "id": 4375, 
      "responses": 14, 
      "subject": "The Rising Sun and saturday eve. drinking in the City", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3197"
    }, 
    {
      "body": "Does anyone know of any independent pubs in the City of London? Pubs that are not owned by big companies, and are not part of a brewery chain. Genuine free houses. I've been looking for one, and I can't find one anywhere. Someone who works in a pub told me that as far as she knows there aren't any - the rents are just too high here. Anyone know if this is true?", 
      "date": "2006-12-06 16:03:00", 
      "id": 3235, 
      "responses": 10, 
      "subject": "Are there any independent pubs in the City?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2811"
    }, 
    {
      "body": "After at least 330 years (!) as the Kings Head (and also the St Pauls) closes next weekend.  In theory the Kings Head will reopen as a pub once the Chiswell Street Brewery has been redeveloped as a hotel.   However, given the abject spinelessness of the City when faced with major developers we could well see the pub converted to become the breakfast bar of the aformentioned hotel, as per the developer's original plans. Meanwhile, there will be a closing party at the Kings Head on the evening of Thursday 21st February.  As I first supped there over thirty three years ago I'll see you there!  Mine's a pint of bitter!", 
      "date": "2008-02-17 18:56:00", 
      "id": 3817, 
      "responses": 10, 
      "subject": "Kings Head closing down next weekend", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4036"
    }, 
    {
      "body": "I wondered whether anyone knew of any wholly non-smoking bars or pubs (or at least ones with a fairly smoke free non-smoking area)? I know there's the Wetherspoons at Farringdon, but it's a bit lacking in character, at least IMHO. Thanks Harry PS Roll on the day they all are!", 
      "date": "2005-12-11 19:13:00", 
      "id": 3008, 
      "responses": 8, 
      "subject": "Non-Smoking Pubs", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1980"
    }, 
    {
      "body": "Does anyone know what might happen with the Crowder's Well? Any chance of it turning into a fab local gastropub?", 
      "date": "2005-05-26 12:40:00", 
      "id": 4720, 
      "responses": 8, 
      "subject": "Crowder's Well Site", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1648"
    }, 
    {
      "body": "i woke up at half past midnight on Tuesday night (or Wednesday morning!!) with drums and bass guitar throbbing through my walls. i first thought it was the upstairs / downstairs neighbours having a late party but the sound was too deep.. (we live in Cromwell Tower). i phoned the porter who suggested it might be the pub next door, The Brewery.. it eventually stopped at around half one.. did any one in Cromwell hear anything? can something be done about it?", 
      "date": "2006-09-21 18:23:00", 
      "id": 4269, 
      "responses": 6, 
      "subject": "NOISE ON TUESDAY NIGHT", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2620"
    }, 
    {
      "body": "Rumoured yesterday that the King's Head on the corner of Chiswell and Silk streets is closing permanently in February for redevelopment of the block......first I heard!", 
      "date": "2007-12-03 13:24:00", 
      "id": 4160, 
      "responses": 5, 
      "subject": "King's Head", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3838"
    }, 
    {
      "body": "The Podium pub next to 125 london wall has opened for sunday lunch 12.00>17.00 full usual menu + roast available for 8.95. Children welcome from 29/04/07.Tel 76285360. Bar open until 20.00. Hope this info is of interest!", 
      "date": "2007-04-20 12:17:00", 
      "id": 4261, 
      "responses": 5, 
      "subject": "sunday lunch", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3249"
    }, 
    {
      "body": "Can anyone recommend a local pub or bar for watching sports in, such as football or A1 Grand Prix? Time Out bar at the Aldersgate end of Long Lane kind of serves this purpose, but surely there must be a better local option. Time Out falls short with its silly small screens, use of mirrors where large screens ought to be and general lacklustre approach. There's simply no joy to be had in there.", 
      "date": "2005-10-26 12:38:00", 
      "id": 4511, 
      "responses": 5, 
      "subject": "Sports Bar suggestions?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1907"
    }, 
    {
      "body": "Anyone know why there is so much noise coming from the Kings Head this evening? There isn't usually a problem from there, but tonight it sounds like there's a riot going on.", 
      "date": "2005-05-25 21:31:00", 
      "id": 4719, 
      "responses": 5, 
      "subject": "Kings Head", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1647"
    }, 
    {
      "body": "Hi A few friends and I were planning a picnic in the park this weekend but, given the weather, we're now thinking of spending a relaxing Sunday afternoon in the pub.  Does anyone have any recommendations for somewhere local which might be appropriate (we're thinking sofas, not too busy, relaxed atmosphere, maybe a spot of lunch...)? I know quite a few of the local venues, but none really seemed to fit the bill. Thanks!", 
      "date": "2006-08-18 12:31:00", 
      "id": 3161, 
      "responses": 4, 
      "subject": "Relaxing pub", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2538"
    }, 
    {
      "body": "I was disappointed to see that the Fox and Anchor has closed as it was a really nice Art Nouveau-ish local pub - and still had Smithfield opening hours so that it did a great breakfast. Anybody know if anybody's got plans to take it over?", 
      "date": "2006-09-30 20:27:00", 
      "id": 4289, 
      "responses": 4, 
      "subject": "Fox and Anchor closed down", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2646"
    }, 
    {
      "body": "Is anybody intending to write any objections?  Just to remind you the LATEST they need to be in is next Wednesday  24 August 2005.", 
      "date": "2005-08-15 12:27:00", 
      "id": 2995, 
      "responses": 3, 
      "subject": "Shakespeare Pub Objection letters reminder", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1808"
    }, 
    {
      "body": "There's a notice at the front entrance to the Brewery (or there was yesterday) about additional entertainment licences (including wrestling)  and extension of opening hours. Because of the traffic problems that occur as a direct result of events at the Brewery, and the subsequent noise (shouting, horns blowing, etc),  I'm amazed they're even considering this. Their customers have no consideration for local residents, and tend to gather on Chiswell St and at the junction by Cromwell Tower, shouting at each other and at passing  taxis.  So I shall be opposing it.", 
      "date": "2006-06-08 20:01:00", 
      "id": 4417, 
      "responses": 3, 
      "subject": "Chiswell St. Brewery - Extension of licensing hours", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2346"
    }, 
    {
      "body": "As one of the objectors to this licence extension I have received notice of the above hearing and now also copies of the application and objectors' communications. At the recent Globe licence hearing it is my understanding that there was a consent order pursuant to agreement between the applicant and objectors for modification to the terms of the extension licence to (broadly) midnight. (If this is incorrect can a BA representative please clarify as to the final outcome). I would like to record here my personal intention to object to any such consent order as regards the Podium application if it would accept closure at midnight Thur-Sat instead of the current 11pm.  It is already the case that there is substantial late night noise and disturbance from the premises which unlike The Globe, are in direct, unimpeded line of sight / hearing of many residential properties.  This noise nuisance is particularly pronounced on Thursdays and Fridays. (I further note from the application that one aspect of the desired extension is to enable there to be \"live music, karaoke and DJ from 18.00-23.00 each day. [sic]\") Based on existing experience of substantial residual noise nuisance as the area clears for at least 30 minutes after stated closing time an extension to midnight will mean excessive noise AFTER MIDNIGHT in addition to the noise pollution to 11pm from the karaoke etc events. I also note from the application under \"General description of premises...\": \"... Traditional city pub... The area is predominantly office and retail space with some [sic] residential located in the Barbican.\"   This statement appears to me imbalanced to say the least.  Some discrete points for comment: 1. is midnight now being considered as the norm for consent orders for adjoining licensed premises in order to buy off the brewers' more extreme demands as regards early morning opening?  2. more generally, is a trend emerging that the Corporation is seeking to treat these late night applications in the same way i.e. is the fear well based that a midnight licence granted to The Globe means it is difficult if not impossible to resist a similar closing time elsewhere? 3. if there is a generalised extension of the licensing hours in premises adjoining the Estate with resultant dimunution in amenity, has any thought been given to the feasibility of seeking diminution in the valuations assigned to properties here with a view to seeking reduction of the council tax charge?  It seems to me there might be potential financial leverage to be used in driving home the message to the Corporation in its various guises that closely adjoining premises and late night licences do not mix. 4. are not all these late night extension applications fatally flawed by at least one recurrent objection, namely that after closing time efficient dispersal is simply not going to be possible if all or the majority of the sought-for extensions are granted because of the absence of late running public transport? Whatever residual means exist (eg minicabs) are simply not going to be able to cope with the extremely large numbers of people who will be present at closing if these licence extensions are granted en masse. (And which means of transport in any event present their own noise nuisance).", 
      "date": "2005-08-18 10:22:00", 
      "id": 2990, 
      "responses": 2, 
      "subject": "Podium licence extension hearing 23 August @3.15", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1812"
    }, 
    {
      "body": "Does anyone know of a localish barbican pub that might be open on Christmas day? Thank you.", 
      "date": "2005-12-12 12:34:00", 
      "id": 3003, 
      "responses": 2, 
      "subject": "Pub on Christmas day", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1982"
    }, 
    {
      "body": "I would be grateful if you and/or the appropriate person from Snow Hill could respond to the following inter-related matters: 1.  As you know given that Corney and Barrow located opposte Willoughby House near Moor Lane cannot use what one can describe as the central piazza of City Point as a place where smokers can drink there has been a tendency for drinkers to stand in the street opposite Willoughby House and sometime directly under Willoughby House.  I understand on occasion the police have been called because despite the best efforts of the management of Corney and Barrow they have not been able to prevent groups congregating on the public highway.  This is quite disturbing to residents of \"'willoughby House and will get worse as the weather becomes warmer. Is there no way smokers cannot use the central piazza?  Is there no way C and B cannot put a notice on the appropriate door near Moor Llane reminding smokers that they cannot smoke in the street or the passageway? This would surely sC and B could lose their licence if complaints continue to mount up. 2.  Have the City of London police responded to the document about the \"greening\" of Fore Street, Moor Lane and Silk Street?  I spoke to the appropriate officer and my understanding is that the police would mwant modifications to the proposal to \"green\" the area opposite Corney and Barrow as it would turn it into a \"beer garden\"?  Has this now been put in writing? Thanks and keep up the good work.", 
      "date": "2008-03-04 14:15:00", 
      "id": 5515, 
      "responses": 2, 
      "subject": "Pub noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=4084"
    }, 
    {
      "body": "Went into the new Parker McMillan place that's opened in place of Boudoir on Chiswell St   Seemed a very low key place, very pleasant female Jazz vocalist was on, seems unlikely to be the short of place that will be turfing out loads of rowdy late night revellers Surprised that its appearance hasn't raised the usual paranoid threads", 
      "date": "2006-07-13 12:26:00", 
      "id": 3241, 
      "responses": 1, 
      "subject": "Boudoir Returns???", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2451"
    }, 
    {
      "body": "I have been going to this pub since 1987. It became very dated. But, this old pub is now vastly improved, and is a proper gastropub. Excellent food and superb wine list. The beers are good (eg, IPA and Pride) although we didnt have beers when we went. Much better than the previous management, but still retaining the lovely interior and photos (including Barts). We had a lovely meal. It is a pity it is only open on weekdays.", 
      "date": "2008-03-21 19:25:00", 
      "id": 3826, 
      "responses": 1, 
      "subject": "Fox and Anchor, new and excellent", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4146"
    }, 
    {
      "body": "Is anyone aware of any pubs local to Barbican that regularly screen live rugby? I'm a Barbican dwelling avid Leic Tigers fan (w/out Sky) and very keen to watch this evening's Tigers v Bath clash on Sky 2. Thanks Paul", 
      "date": "2008-04-15 12:19:00", 
      "id": 3869, 
      "responses": 1, 
      "subject": "Rugby screening pubs near Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4238"
    }, 
    {
      "body": "it looks like like its being done up does anyone remember what it used to be like someone told me its been closed up for twenty odd years?", 
      "date": "2005-11-15 17:12:00", 
      "id": 4528, 
      "responses": 1, 
      "subject": "hat and feathers pub", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1938"
    }, 
    {
      "body": "About 2:15 today, five police and a riot shield standing around outside the Shakespeare pub. Anyone know what was going on?", 
      "date": "2006-10-06 13:53:00", 
      "id": 5039, 
      "responses": 1, 
      "subject": "Police outside the Shakespeare pub", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=2663"
    }
  ]
}