{
  "summary": [
    {
      "body": "Do you remember not all that long ago when one could wander over to the Centre amble up to the seventh floor ( or even take the lift ) and enter the wilds of what at one time was a haven of tranquility surrounded with the lush collection of plants, trees and heaven knows what from all over the world that abounded all about one. Fat old carp merrily swimming about two pools, one situated in a mini jungle and the other in a display pool. At one time all about the visitor were displays of many a colourful variety of named and mystery plants all beautiful in their glory.         On a floor above is situated a collection of cactus growing in all shapes and sizes and if one visits during the blooming period one can admire the hanging baskets filled to overflowing with the cascading variety. Upon leaving this wonderment look down and to the right and see a large grouping of terrapins.           All this was brought to a screetching halt some years ago when the Management of the Centre came to the conclusion that money could be made by barring residents during the week and selected weekends and letting it out, naturally for a price, to functions, receptions bla, bla,bla. Kind of makes one wonder where the priorities lie, with those who it was given to originally years ago or to a profit making group who put profit before resident! ", 
      "date": "2006-08-11 10:07:00", 
      "id": 3148, 
      "sentiment": 3, 
      "subject": "The lost gardens of the conservatory!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2518"
    }, 
    {
      "body": "Hello everyone,  We love the Barbican and have been renting here for a while but now want to buy. However the price of the apartments here are astronomical (and we are looking for a 2 bed flat). We have noticed though that the Golden Lane flats seem to be a lot cheaper. But what is it actually like to live there? Ok I am not expecting it to be as fabulous as the Barbican (chiefly because I suspect nowhere can be!) but what is it like in terms of safety, in terms of neighbours, in terms of flat construction (ie noise problems?), in terms of Estate Office responsibility (ie they are very responsive to Barbican dwellers - is it the same with Golden Lane?). Are there any communal areas like the Barbican Gardens? What is the mix of residents like? Any views or information, positive or negative is welcomed!", 
      "date": "2006-06-19 20:10:00", 
      "id": 4431, 
      "sentiment": 3, 
      "subject": "What's it like living in Golden Lane Estate?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2378"
    }
  ]
}