{
  "summary": [
    {
      "body": "There is a conman operating in the area - we have been approached twice by him now , once by Moorgate Station and once near Cromwell Tower. His blag is that he has been mugged / pickpocketed - he needs 15 to get home and is happy to leave his \"expensive\" leather jacket with you as a deposit.  he's in his late 40's early 50's about 5'8\". We almost fell for it until we quizzed him on his \"mugging\" (it happened at Waterloo and he couldn't explain why he was in Moorgate on the way to Euston Station).  We felt awful for being suspicious but with the second approach obviously vindicated. There 's a similar guy who operates near Euston always dressed in a suit. The worst part is that if it ever happened to me I would hate everyine to treat me with suspicion. Anyway - don't fall for it.", 
      "date": "2007-02-21 23:00:00", 
      "id": 2054, 
      "responses": 75, 
      "subject": "Conman operating in the area", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3076"
    }, 
    {
      "body": "Good Morning I have received infomation on the following mobile telephone scam. People have been receiving calls on their mobiles from the following number, 02920368700 there will be no speech.   DO NOT ANSWER THE CALL AND DO NOT CALL IT BACK.   OFCOM are investigating Regards John", 
      "date": "2006-05-18 07:51:00", 
      "id": 3120, 
      "responses": 8, 
      "subject": "Telephone Scam", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2301"
    }, 
    {
      "body": "People should be aware of the unscrupulous  activity of nPower door-to-door salesman in the area. My wife was recently visited by someone who said that he was just checking that we were on the right electricity tariff. He filled out a form and got her to sign it; she asked specifically if there would be any change to our supplier and he said no. Lo and behold two weeks later (conveniently after the end of the 14-day cancellation period - which he did not mention) a letter comes from nPower saying we have changed our supply to them.  Misselling of this nature is not just scandalous, it is fraudulent. I have reported it to our MP and would urge City of London police also to look into the behaviour of nPower doorstep sellers in the Barbican.", 
      "date": "2008-04-04 09:22:00", 
      "id": 5522, 
      "responses": 5, 
      "subject": "nPower scam", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=4186"
    }, 
    {
      "body": "twice in the last moth i have seen two different people doing this to other people,they will walk past you then aproach with a gold ring saying they have just found it on the ground they get you to take the ring (i think some sort of greed element thing) and ask you for some sort of cash reward for a worthless goldplated brass ring with a hallmark on it ", 
      "date": "2007-05-22 11:26:00", 
      "id": 3324, 
      "responses": 4, 
      "subject": "Gold Ring SCAM!!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3353"
    }, 
    {
      "body": "Someone just rang my bell saying they wanted to inspect my flat for Legionella? They apparently knew names of the people in the estate office and sounded quite convincing. Being sceptical / busy / miserable I put the phone down on them.... Is this a potential scam!!!??? Someone should be told!", 
      "date": "2008-05-23 12:18:00", 
      "id": 3602, 
      "responses": 2, 
      "subject": "Legionella inspection?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4367"
    }
  ]
}