{
  "summary": [
    {
      "body": "I'd be interested in people's constructive comments about their experiences or opinions on refurbishing an original Barbican bathroom, versus replacing it with modern fittings in general keeping with the original Barbican design. I've already approached the BEO about the grade II listing constraints. I've also approached the salvage store to confirm availabilty of materials for the refurb route. Next stage is to make a decision about which route to take.", 
      "date": "2007-11-07 12:33:00", 
      "id": 4184, 
      "responses": 23, 
      "subject": "Pros & cons of refurb vs replacing an original bathroom?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3778"
    }, 
    {
      "body": "First of all, I'm sorry if these have all been asked about a thousand times before, but i did try searching the forum and i couldn't quite get the answers i needed.  Before i consider making a move to the Barbican, i would be very grateful if anyone could answer these questions: 1. Are the blocks, (especially the high rise ones!) up to modern fire safety standards?  I have visited people in the high rise blocks, (and i have seen the flats on Open Buildings Weekend) and the blocks do not seem to have fire alarms or sprinkler systems, which would definitely be necessary in modern blocks of that height today.  I am not unnecessarily fussing, but i can imagine more pleasant things than being stuck 35 floors up in a fire, with only the balconies and their little fire escapes to escape by (!) 2. Estate agents, etc. make out that the Barbican Estate Office is really really strict about alterations, changing door locks, putting things on balconies etc, but are they really that strict?  Would you, for example, get into trouble for putting a new lock on your front door without telling them (and how would they find out anyway?), or how would they punish you? 3.  Can the Estate Office supply original Barbican fixtures and fittings, for example if the garchey system has been removed can they replace it?  I was told that that semicircular block, Frobisher Cresent, was intended to be flats, but they never built them, so they still have all the fixtures in storage. 4. If you want to change the kitchen or bathroom, would the Barbican office ever not grant permission?  Thank you very much", 
      "date": "2005-06-12 15:09:00", 
      "id": 4662, 
      "responses": 6, 
      "subject": "Some General Questions", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1682"
    }, 
    {
      "body": "I am thinking of installing a hot tub on my (tower block) balcony. Has anyone else done this? Any issues with BEO rules or planning permission?", 
      "date": "2007-07-03 00:21:00", 
      "id": 3480, 
      "responses": 5, 
      "subject": "Hot tub", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3466"
    }, 
    {
      "body": "Has anyone recently experienced the consent procedure for mezzanines? Many thanks,", 
      "date": "2006-12-18 18:35:00", 
      "id": 3372, 
      "responses": 4, 
      "subject": "Alterations/consent", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2845"
    }, 
    {
      "body": "Has anyone tried mounting an lcd or plasma tv on the wall of their flat and also chased in the cables?  Was it easy?  Is it even allowed under the terms of the lease?!", 
      "date": "2007-08-21 15:55:00", 
      "id": 3408, 
      "responses": 4, 
      "subject": "Wall mount lcd tv with chased in cables", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3600"
    }, 
    {
      "body": "We're looking to have some fairly minor alterations made to our flat (all very much in keeping with the original Barbican aesthetic, and in some areas restoring what was there before the previous occupiers took issue with the interiors). One of these alterations necessitates the repositioning of a partition wall in the bedroom - effectively to allow us to widen the cupboard and wardrobe space (by moving the bedroom door closer to our structural / boundary wall - at the moment it's half way along a partition wall). From what I've understood from the BEO, there is no formal application process (with triplicate forms and the like) for applying for landlord's permission... I simply need to write to them, supplying our architect's drawings of what's intended. They'll then write back either granting permission (or declining it). I would have thought the process was more bureaucratic than that. Can it really be that simple? Beyond that, I've had no end of grief trying to speak to somebody at the Corporation about planning / listed building consent. Nobody seems to be available to take my calls, and despite leaving several messages, nobody calls back. I have found dozens of forms on the COL website, though they seem to be geared to quite major projects - like demolishing and rebuilding a property (for which environmental statements need preparing, etc). There doesn't seem to be a simple / straightforward guide anywhere that discloses what to do with regard to smaller residential alterations. Does anybody know the process and the approximate timescales? Are there any other parties I need to consult with?", 
      "date": "2007-09-02 10:38:00", 
      "id": 3411, 
      "responses": 4, 
      "subject": "Listed building alterations", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3622"
    }, 
    {
      "body": "Has anyone had any experience or advice on getting planning permission to replace an original kitchen (including a leaking garchey) with a new style kitchen ? Does anyone know how long the process would take if permission is ever granted ?", 
      "date": "2007-03-21 22:27:00", 
      "id": 4354, 
      "responses": 4, 
      "subject": "Planning permission for a new kitchen ?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3170"
    }, 
    {
      "body": "We're moving into a Barbican flat where the original wardrobes have all been stripped out. (That sounds as though it's against the guidelines...) We'd like to replace them with originals or close replicas and would welcome any advice from others who have done the same.  Is there by any chance a mysterious store of wardrobes next to the mythical store of original kitchens somewhere on the Estate??", 
      "date": "2005-05-16 12:16:00", 
      "id": 4710, 
      "responses": 4, 
      "subject": "Original Barbican wardrobes", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1634"
    }, 
    {
      "body": "Hullo I have an original bathroom in my flat which I like very much. My problem is that the sink has a number of cracks in and there are lots of broken tiles.  I want to repair the room but I'm not sure what I'm allowed to do under the listing rules. Is there anywhere obvious to find out? Do I need to ask the Estate Office?  If anyone has an experience of something similar, I'd be really grateful for your advice Thanks", 
      "date": "2006-11-07 17:18:00", 
      "id": 3199, 
      "responses": 1, 
      "subject": "bathroom and listing rules", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2734"
    }, 
    {
      "body": "If my apartment has already been refurbished with consent, does anybody know if  I need to apply again if I want to put extra lighting in the bathroom?", 
      "date": "2008-04-24 20:35:00", 
      "id": 3886, 
      "responses": 1, 
      "subject": "buildings consent", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4271"
    }, 
    {
      "body": "We're thinking of doing some alterations and I'm finding the listed building guidelines a bit confusing. For example, no consent is needed to change the sanitaryware or vanity surfaces in the bathroom unless the \"layout\" is affected - but does that mean that you can only replace things in the same positon (e.g. any new sink has to go in the same place as the original) or does it just refer to the architectual layout i.e. walls and doors. Also does anyone have experience of applying for LBC (some of the changes we're thinking of would definitely require it), and if so how long does it take and is it necessary to get a professional designer/architect to submit the application (the requirements for multiple scale drawings of various elevations to be submitted is rather daunting)? Finally, any recommendations of interior designers/architects and reliable builders/plumbers/decorators would be welcome.", 
      "date": "2007-01-18 22:06:00", 
      "id": 4191, 
      "responses": 1, 
      "subject": "Alterations advice/listed building consent", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2929"
    }
  ]
}