{
  "summary": [
    {
      "body": "Are the \"Henry\" vacuum cleaners with the silly face on the cylinder any good? I bought the Panasonic attempt at a bagless vacuum and it is absolutely useless as the hose clogs up  at every use so sadly, it is going in the skip as neither use nor ornament as they say. (Unless anybody wants it?)", 
      "date": "2007-08-14 12:50:00", 
      "id": 3402, 
      "responses": 13, 
      "subject": "\"Henry\" vacuum cleaners", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3588"
    }, 
    {
      "body": "Hi I have bought a new telly for my bedroom so if anyone wants my old one you are welcome to come and pick it up - no charge.  It's a 14\" Philips.  Has a built-in video player which does not always work.  TV itself works perfectly well. If you'd like it, please post with your number or email address and I'll get in touch. Thanks Matt", 
      "date": "2006-04-19 22:05:00", 
      "id": 3063, 
      "responses": 3, 
      "subject": "14\" TV -- free to pick up", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2206"
    }, 
    {
      "body": "Hello, We have an Epson Perfection 610 A4 flatbed scanner (without leads or software) that works, and a broken Notebook Laptop that we would like to recyle - can anybody recommend a company that will do this? If anybody would like the scanner they are welcome to it, by the way. Thanks, Sam", 
      "date": "2007-05-02 18:02:00", 
      "id": 4330, 
      "responses": 3, 
      "subject": "Giving Away/Would like to Recycle", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3297"
    }, 
    {
      "body": "If you have any unwanted gifts, household items (no electrical goods, no clothes) etc, please bring them along to the Spring Bazaar on Saturday 14th May, 2 - 5pm in the Lauderdale Place Meeting Rooms.  You may drop them off from 1.00pm, or contact me for delivery/collection.  Thank you.", 
      "date": "2005-05-08 18:21:00", 
      "id": 2936, 
      "responses": 2, 
      "subject": "Bric-a-brac wanted for Spring Bazaar", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1614"
    }, 
    {
      "body": "I have an old small B&O TV Beovision MX1500 from the 80s that anyone may have but... recently it developed a fault: the colours are gone and I could get only BBC1. It may be somethgn small or something major. I offered it to the V&A for their 20th century furniture display and they almost took it but then decided that the model was not 'distinctive' enough. Hate to throw it away and would like to find an appreciative home for it. Can email a picture (it is not in the Barbican at the moment). PLease note I am off for a long weekend, back Sunday night 18/5. Liz", 
      "date": "2008-05-15 10:54:00", 
      "id": 3585, 
      "responses": 2, 
      "subject": "DIY on B&O TV?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4343"
    }, 
    {
      "body": "Has anyone got a spare freeview box? I am not ready yet for a digital TV and my box just expired. I saw someone offered one in November but I suppose that one's gone by now.", 
      "date": "2008-02-05 10:22:00", 
      "id": 3780, 
      "responses": 2, 
      "subject": "freeview box", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3982"
    }, 
    {
      "body": "We are removing our original kitchen this week and would be glad to hear from anyone who would like any doors, drawers, or any other bits which may be of use. I was astonished to discover that there is no re-cycling facility for these items and yet apparently people are often ringing the Estate office about it.  Ann George", 
      "date": "2005-03-14 19:21:00", 
      "id": 4656, 
      "responses": 2, 
      "subject": "Kitchen Removal Lauderdale Tower", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1498"
    }, 
    {
      "body": "I have 2 invitations available for Ronnie Barker's Thanksgiving Service 12 noon this Friday at Westminster Abbey. If you would like to go, please email me at  (and it's goodnight from him)", 
      "date": "2006-03-01 15:31:00", 
      "id": 4600, 
      "responses": 1, 
      "subject": "Ronnie Barker", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2107"
    }
  ]
}