{
  "summary": [
    {
      "body": "We have just received the questionnaire about the refurbishment, and I hope that many residents will complete it and return it to the estate office. Overall the refurbishment looks great, and the automatic doors are a big improvement. However, the budget was 190,000 - quite an astonishing amount of money to spend on the podium entrance and car park entrance. The budget apparently did not stretch to the following items which I think residents should consider, as I had understood that they would be included: -- the porters' desk was not renewed and is showing lots of signs of wear and tear -- there is no parcel store - as before, parcels are left on the floor, which I find rather astonishing. Nowadays people order more and more online, and there is no provision for the storage of delivered items. -- the doors at podium level (possibly elsewhere) were poorly repainted. You can see that old layers of paint were not removed, and already the new paintwork is showing signs of damage. I'd be interested in hearing opinions from my neighbours on this. The house committee has been silent, to my knowledge. The whole job took an extraordinary amount of time, and cost an unfathomable amount of money, and I think that in less than 12 months we will all have serious misgivings - if we don't already.", 
      "date": "2007-11-24 20:32:00", 
      "id": 3614, 
      "sentiment": 4, 
      "subject": "Shakespeare lobby refurb questionnaire", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3815"
    }, 
    {
      "body": "Does anyone know why residents do not have a better way of controlling their underfloor heating? Every couple of years or so, the heating in our flat is too much or too little.  This year, for a change, it failed - or, at any rate, it seemed to fail, for the floor never became warm even when we put a cushion on it to test the effect in the morning.  The Estate Office staff were gratifyingly quick to react.   Less gratifyingly, the flat soon became far too hot.  If only we could reach for a control and turn it a few degrees.  Instead we have to ask the office to arrange for someone to turn the heating down.  Then an engineer adjusts something an arbitrary amount (possibly misunderstanding the  direction required), and the office issues official paperwork that we don't really want.  After waiting a few days to see if we can tell the difference we have to start the process again. This morning our bedroom was at 22.5 degrees after the window had been open all night, and we/Estate Office/engineers have been trying to lower it for over a fortnight. The overheating wastes energy, and the primitive but elaborate  procedure for controlling the heating must irk almost everyone who has to play a part.  Is it impossible to equip our flats wth a better control system?", 
      "date": "2006-04-06 13:20:00", 
      "id": 4641, 
      "sentiment": 4, 
      "subject": "Controlling the underfloor heating", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2179"
    }
  ]
}