{
  "summary": [
    {
      "body": "Noticed in the latest BA Newsletter that 2006 membership of the BA now costs 7 if you want to pay by cheque (it is still 5 if you pay by standing order) I know the BA are trying to encourage people to pay by standing order but this is a bit sneaky isn't it? If the sub is 5 it should be 5 for everyone. Residents shouldn't be penalized for the convenience of the BA. The most recent edition of Barbican Life magazine has a membership form in it with no mention of the 7 cheque option, I'd advise people to dig out their copy and pay using that!", 
      "date": "2005-11-19 14:06:00", 
      "id": 3015, 
      "responses": 6, 
      "subject": "BA Membership £7 by cheque", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1941"
    }, 
    {
      "body": "Does any one know of any choirs that are local that might be looking for singers. Preferaly something quite informal. Any hints much appreciated.", 
      "date": "2005-07-12 11:38:00", 
      "id": 1123, 
      "responses": 4, 
      "subject": "choral singing", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1739"
    }, 
    {
      "body": "Hello everyone! Does anyone know of baby or expectant parents clubs (formal or informal) here in the Barbican? We are expecting our first child at the end of March. I know there are a lot of new parents here as we see them in the gardens - it would be great to get to know some of them - anyone any experience of this? Many thanks in advance for any suggestions.", 
      "date": "2006-08-09 20:54:00", 
      "id": 3156, 
      "responses": 4, 
      "subject": "Baby/Expectant Parents Clubs", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2516"
    }, 
    {
      "body": "Does anyone know of a camera club nearby?", 
      "date": "2007-04-11 20:01:00", 
      "id": 4373, 
      "responses": 3, 
      "subject": "Camera Club", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3221"
    }, 
    {
      "body": "...based in St Alphage House. Does anyone have any knowledge of it, and is it a good place to learn to shoot? Thanks for any feedback  ", 
      "date": "2006-02-20 20:55:00", 
      "id": 4591, 
      "responses": 3, 
      "subject": "Marylebone Rifle and Pistol Club.....", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2094"
    }, 
    {
      "body": "Can anyone recommend a good printing company ? Our bowls club is celebrating its centenery this year (see previous postings) and a local historian has compiled a history which we hope to turn into a brochure / booklet to give as a gift to members and opposition teams. Any help appreciated.", 
      "date": "2008-05-05 18:45:00", 
      "id": 3572, 
      "responses": 2, 
      "subject": "Printers.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4302"
    }, 
    {
      "body": "Hi! I'm a twenty year old student and was just wondering if anyone knows of any amateur dramatics groups in the barbican or around, for help backstage? Thanks", 
      "date": "2008-04-04 10:03:00", 
      "id": 3843, 
      "responses": 2, 
      "subject": "Amateur Dramatics", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4188"
    }, 
    {
      "body": "Is the Barbican Book Club still active? And is it extremely high brow or can us lesser mortals be considered for inclusion? (although no Dan Brown or JK Rowling, I promise...)", 
      "date": "2005-04-27 11:25:00", 
      "id": 2926, 
      "responses": 1, 
      "subject": "Reading matter....", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1593"
    }, 
    {
      "body": "This is to back up Perdita's posting on the heating thread about arranging something social on the estate.  I wonder if enough people are aware of Amigos as the social association within the Barbican.  If not, take a look at   and you can see what is currently on offer.  I went on an Amigos walk around Clerkenwell on Sunday with Brian, our very own estate-dwelling Blue Badge Guide who blew me away with his knowledge of the area.  I hope we get to do more of the City with him in time.  Mary Piper does a stirling job of trying to get us together and amigos deserves support.", 
      "date": "2005-10-04 16:50:00", 
      "id": 3109, 
      "responses": 1, 
      "subject": "Just being sociable", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1868"
    }, 
    {
      "body": "Has everyone in the Barbican been added to the mailing list of the Listed Property Owners Club? A few months ago I started receiving their mailshots. Their glossy brochures shows a variety of doorways on the front - Gothic, vernacular medieval, Georgian, Tudor, Art Nouveau - but sadly no Brutalist. And their very attractive magazine has classified ads for companies that offer historic limes and mortars, gilding, pargetting (whatever that is) and sand cast lead. I'm sure there is someone in there who does hammered concrete - just have to look a bit harder . . . The covering letter referred to me as the owner of a listed property, which I suppose I am to some small degree, and I do think the magazine is pretty, but I think this 'organization' (if it really is one and not just a vehicle for marketing) is probably not particularly relevant to us in the Barbican. Not complaining - I just find it all rather amusing.", 
      "date": "2008-03-09 17:04:00", 
      "id": 3539, 
      "responses": 1, 
      "subject": "Listed Property Owners Club?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4101"
    }, 
    {
      "body": "Anyone else go to see Israel Lopez tonight? It was FANTASTIC. Plenty of dancing in the aisles. Now I want to go samba/salsa/latin dancing so if anybody knows where I can do that locally, please tell.", 
      "date": "2007-04-29 21:41:00", 
      "id": 4259, 
      "responses": 1, 
      "subject": "ISRAEL LOPEZ CONCERT", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3286"
    }, 
    {
      "body": "Hi everyone, Are there any local clubs / pubs who play regular footy?  I would be keen to join up.", 
      "date": "2007-04-27 23:30:00", 
      "id": 4262, 
      "responses": 1, 
      "subject": "Football teams looking for players", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3277"
    }, 
    {
      "body": "I am having an open Balcony on Sunday 19th June in the morning 10:00 to 12:00 as part of the Barbican Horticultural Society's scheme. If anyone would like to come around from this forum you are most welcome.  I'm at 20 Thomas More, but I must leave on the dot as I have to get to my parents in Buckinghamshire for Father's day.", 
      "date": "2005-06-17 08:09:00", 
      "id": 4748, 
      "responses": 1, 
      "subject": "Barbican in Bloom", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1689"
    }
  ]
}