{
  "summary": [
    {
      "body": "Why do we bother lobbying to have pubs and clubs around the Barbican controlled for opening hours and noise disruption, when our own neighbours cause such a ruckus? Last night someone in Speed House held a really obnoxiously noisy party. Every few minutes there was some mad screaming until about 2.30 am. The noise enemy is within.", 
      "date": "2005-08-06 10:41:00", 
      "id": 2960, 
      "sentiment": 1, 
      "subject": "Noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1791"
    }, 
    {
      "body": "Received the latest copy of Barbican News this morning. Apart from the usual updates, I was most interested in one article. It was the one about the lift doors in John Trundle and Bunyan. How have these lift doors got into such a state? From what I could make out in the small photograph, they appear to have suffered a lot of vandalism. Do these block suffer from feral youth and other such problems? And if so why has nothing been done. Will be the lifts themselves next?", 
      "date": "2005-07-29 16:04:00", 
      "id": 2961, 
      "sentiment": 1, 
      "subject": "Feral Vandals?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1769"
    }, 
    {
      "body": "Two weeks ago, I decided to cycle along the river. When I went to the car park, my bicycle was not there. I went to see the car park attendant. He told me he would file a report with the estate manager. I heard nothing for two weeks.  I rang the car park attendant today. I was told to ring another number.  Finally, I got through someone who told me that the management of the estate could not be held responsible. I wonder what is the point of having a 24 hours attended car park? R", 
      "date": "2005-08-09 09:46:00", 
      "id": 2968, 
      "sentiment": 1, 
      "subject": "Thomas Moore Car Park", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1799"
    }, 
    {
      "body": "whitbread buildings north side of Chiswell St has aquired a band of squatters (see notices on doors and railings). If any  abuse,noise etc don't forget these should be reported to met police at,I believe Kings Cross,as that side of the road is not a City matter.It seems there is no water as they have been using local pubs for toilets etc.", 
      "date": "2005-09-06 09:21:00", 
      "id": 2996, 
      "sentiment": 1, 
      "subject": "squatters", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1829"
    }, 
    {
      "body": "Was anyone else disturbed in BJH at 11.00 pm last night (23rd) by someone hammering? It went on for about 15-20 minutes and was definitely hammering, not an airlock in the pipes.  Very inconsiderate! ", 
      "date": "2005-12-24 09:40:00", 
      "id": 3016, 
      "sentiment": 1, 
      "subject": "Late night hammering", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1999"
    }
  ]
}