{
  "summary": [
    {
      "body": "Hi!! We have just moved in to John Trundle. I am Sarahjayne, a graphic designer and my partner Jonnie is a Management Consultant. We have been here for a few weeks now and absolutely love it! There are a few things we are unsure of and would appreciate any advice. Is it possible to get Sky +, if so, how? Do we have to use a specific broadband internet provider? If we have visitors, where can they park? Our bathroom occassionally smells - is there a problem with the drains in John Trundle???!!! Where is best to do our food shopping? We have visited Sainsbury's in Angel and weren't impressed!! We don't have car, so ideally would love somewhere nearby other than the 'local' or 'express' variety of supermarkets where the selection is not great. This is probably wishful thinking!!  We look forward to learning more about our new area!! Many thanks", 
      "date": "2005-09-27 15:48:00", 
      "id": 4438, 
      "responses": 7, 
      "subject": "Hello! We've just moved in and have a few questions!!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1858"
    }, 
    {
      "body": "One of the advantages of living in the Barbican is the availability of car parking spaces to all residents (for a fee), and also the availability of spaces for guests (free of charge, for up to 5 hours I think). If the Corporation reduces the number of spaces, and creates scarcity, then first of all it will feel justified in increasing the fees associated with the parking - that's simple economics (cf the huge rent increases they wanted to impose on our underground storage rooms, where there is scarcity).  And secondly new residents may find that a parking space is very difficult to get hold of - thereby potentially reducing the value of our property in the market. When I bought my flat the ease of acquiring a parking space directly below my building was a distinct selling point. It seems to me that the easy availability of parking is a benefit we all currently enjoy (even if we don't have a car), and if we lose that benefit then the Corporation should compensate us.", 
      "date": "2007-11-11 12:49:00", 
      "id": 3468, 
      "responses": 1, 
      "subject": "loss of car parking spaces", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3785"
    }
  ]
}