{
  "summary": [
    {
      "body": "Are there any musical Barbicanites out there who would be interested in forming a string quartet - for a fun once-a-week practice rather than performance? Alternatively, are there any existing chamber music groups in need of a violinist? I am a reasonable amateur (Grade 8-ish) and a fairly good sight-reader, slightly out-of-practice at the moment but that can be rectified!", 
      "date": "2005-08-08 09:20:00", 
      "id": 2992, 
      "sentiment": 3, 
      "subject": "Amateur string quartet in the Barbican?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1795"
    }, 
    {
      "body": "Just seen this barbican themed 'hoax' and it made me laugh. I wish they'd kept the sign up permanently.", 
      "date": "2005-12-17 01:44:00", 
      "id": 3009, 
      "sentiment": 3, 
      "subject": "made me laugh", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1993"
    }, 
    {
      "body": "The latest edition of Barbican Life came out last week and should have been delivered to most blocks over the weekend.  Just trying to ascertain how deliveries have gone - so could anyone who hasn't received a copy yet let me know - either via this forum, or directly to  . I'd also be interested in feedback on editorial topics - current and future - if people have any ideas, constructive comments, likes and dislikes etc.  We are trying to make it a magazine serving the interests of the whole Barbican community so anything that helps us do this in terms of ideas etc. is appreciated. Thanks", 
      "date": "2005-12-14 13:53:00", 
      "id": 3011, 
      "sentiment": 3, 
      "subject": "Barbican Life deliveries", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1988"
    }, 
    {
      "body": "I have 2 tickets for Radio 4's 'Now Show' free for anyone that wants them. They are for this Thursday from 7pm. It's a good time for those who like comedy and current events.  Send me a private message if interested.", 
      "date": "2005-12-20 16:50:00", 
      "id": 3012, 
      "sentiment": 3, 
      "subject": "Free tix for Radio 4 'Now Show' Thurs evening", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1997"
    }, 
    {
      "body": "has anyone spotted the ad for the new observer format?  it includes lovely shots of the barbican... so not only is it the best sunday paper by miles but is also the most tasteful  ", 
      "date": "2006-01-06 23:28:00", 
      "id": 3024, 
      "sentiment": 3, 
      "subject": "lovely ad", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2020"
    }
  ]
}