{
  "summary": [
    {
      "body": "Way back in 1990s I move into ECx as it was close to my work - how much joy I had then when I was seven (yes 7) minutes door to door. There wasn't much around here then - fluid was the only bar and the italian on the corner was the only restaurant but even then the bug had started to bite... after that relationship fell though I rented in whitecross street then (briefly and badly) went to pimlico. After that in '03 into BJ house. Gloomy (east side) but spacious and close to the supermarket. And 65m2 is not to be sniffed at - and I did make it very nice. But now it's in my blood. There is nowhere else in London I want to live; *hams don't do it for me, mayfair is too dull & expensive, whitechappel is too edgy.  I think I've found home. I've moved now from my slightly dark flat in BJ to a little studio in JT and it's wonderful! The light, the big windows. The Barbican was an exceptional piece of '60s / '70s architecture.  When I come in from the east on the train after visting a friend I see so many bleak blocks of badness; some old and plenty new. Small mean windows and cheap construction. Now, just now 30/40 years later the Barbican kitchens are fading... that's a long time compared to the new brick boxes! I feel so at home here - curiously my current JT rented studio is directly opposite the flat I had when I first moved into ECx.  In spite of the influx of clicky heels on a Friday, it still feels good. And the best thing is... there are more blocks to discover! I've only done two so far  :-) B", 
      "date": "2007-04-26 22:05:00", 
      "id": 4256, 
      "sentiment": 5, 
      "subject": "I genuinely can't think of anywhere else I'd rather live", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3274"
    }, 
    {
      "body": "Well, it had to happen. When I first saw it over a year ago, I couldn't stand the place. Concrete as far as the eye could see; stark lines and council-estate environment. Or so I thought. Yet now, a year on, I find myself totally smitten! A true urban village; neighbours who greet each other, societies to join and a real community to become part of. The architecture fascinates me, as it has done my partner who has lived here for the past three or four years. So now it is that I am leaving South-West London suburbia to move here to the Barbican. What more could I ask for: superbly designed living accommodation, service staff who smile and go way beyond the call of duty, views to die for, a cinema and arts centre in the basement, gardens with lakes and waterfalls, beautiful secure gardens, a jungle hothouse to rival Kew, virtually non-existent crime rates, police who really do care, considerate neigbours... and all the benefits of the City on the doorstep. Anyway, with that over, I just wanted to say \"Hi, I'm new here\" - I feel priviledged to be in such a superb place to live. Why would anyone want to live anywhere else? God, I'm gushing now. How embarrassing... Timbo", 
      "date": "2007-04-15 19:27:00", 
      "id": 4323, 
      "sentiment": 5, 
      "subject": "Hullo, I'm new here", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3234"
    }, 
    {
      "body": "Amid all the moans and groans we have living here, which this forum helps to bring to light, I feel we need a thread about all the wonderful things about the Barbican, which I hope you'll all add to so this might become the most prominent thread.  So I'll start the list, and please add to it or extrapulate on the points already made. 1. I love my home, with its corbusian dimensions and its south facing sitting room overlooking a garden. 2. I love being able to walk to work and to the West End, and home again.  3. I love my Sunday Walks though a quiet City of London down to St Paul's (sometimes stopping for evensong and other times walking on) across the bridge and along the river, back up again through the City to home again.  4. I love the wildlife on my door: wrens nesting in my window boxes; ducks, geese; falcons; gulls; ducks; blackbirds; wagtails; coots; moorhens ... to name but a few. 5. I love the gardens. Private, public spaces (especially the wildlife garden.  6. I love feeling safe, and having a police force for the city that respond to complaints about skateboarders with half the police station! 7. I love the Barbican Association; the way it fights on our behalf, produces great publications and most of all makes me feel I'll never have to worry about things going wrong here.  8. I love the Barbican arts center (or the theatre/cinema downstairs as we call it). 9. I love Barbicantalk. We exchange information, help out new residents, winge, moan, complain, have the occasional row, but ultimately, rare among internet forums it remains a place of polite communication.  10. I love the incredible rise of the Smithfields' Clerkenwell area -- we we first moved here there were no restaurants or bars open at the weekend, a total desert, and now we have on our doorstep one of the most vibrant parts of London and some of its great eateries.  11. I love the way people really care about the Barbican, and can become a bit obsessive about it (this threat: QED). 12. I love being equidistant to every London airport.  13. I love the CPA's, porters and cleaners, who always know what's going on; caring above and beyond the call of duty for our senior residents, knocking on doors (and breaking in if necessary if someone's not seen for a while). 14. I love having the corporation as a landlord. Never any problems.  !5. I love being a citizen of London (a freeman). Well, I could go on much longer, but I'll leave it now to others to add to the list.  x", 
      "date": "2006-08-20 01:44:00", 
      "id": 4470, 
      "sentiment": 5, 
      "subject": "Things I love about Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2541"
    }
  ]
}