{
  "summary": [
    {
      "body": "I'm concerned about the notices that have appeared on every single entrance door in the blocks. My understanding was that residential buildings should have some exemption from labeling. Can somebody please quote chapter and verse of the new legislation??? Or has BEO stuck these up just in case? I'm asthmatic and the last thing I want is smoking, but I have never been troubled by it here and dont expect to be. I certainly dont want to arrive home each evening to be forced to think about two things (1) the bossy boots anti-libertarianism of the Government and (2) yes, smoking  its not usually on my mind. I find these officious little stickers every bit as much of a nuisance as a puff of smoke in my face. Otherwise, as there are a few thousand criminal offences on the statute books might I suggest a few more bossy notices? Please tell me Im not alone someone   ", 
      "date": "2007-06-30 17:05:00", 
      "id": 4040, 
      "responses": 74, 
      "subject": "No-Smoking notices - can we get them removed?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3458"
    }, 
    {
      "body": "Whilst you are all banging on about the signage on the doorways to our homes someone has merrily placed three giant ashtray bins just beyond the Pizza restaurant - presumably to serve J P Morgan employees et al? This is a 'substantially enclosed area' so are the city turning a blind eye due to London's importance as a financial centre / fear of another exit to Canary Wharf or are JPM just paying the fines as fringe benefit?  Clearly snitching on the freephone number is an option but the politicians tell me that's not the British way.  So stiff upper lips all round!", 
      "date": "2007-07-19 19:35:00", 
      "id": 4049, 
      "responses": 2, 
      "subject": "Smoking whilst Rome burns", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3513"
    }, 
    {
      "body": "I would be grateful if you and/or the appropriate person from Snow Hill could respond to the following inter-related matters: 1.  As you know given that Corney and Barrow located opposte Willoughby House near Moor Lane cannot use what one can describe as the central piazza of City Point as a place where smokers can drink there has been a tendency for drinkers to stand in the street opposite Willoughby House and sometime directly under Willoughby House.  I understand on occasion the police have been called because despite the best efforts of the management of Corney and Barrow they have not been able to prevent groups congregating on the public highway.  This is quite disturbing to residents of \"'willoughby House and will get worse as the weather becomes warmer. Is there no way smokers cannot use the central piazza?  Is there no way C and B cannot put a notice on the appropriate door near Moor Llane reminding smokers that they cannot smoke in the street or the passageway? This would surely sC and B could lose their licence if complaints continue to mount up. 2.  Have the City of London police responded to the document about the \"greening\" of Fore Street, Moor Lane and Silk Street?  I spoke to the appropriate officer and my understanding is that the police would mwant modifications to the proposal to \"green\" the area opposite Corney and Barrow as it would turn it into a \"beer garden\"?  Has this now been put in writing? Thanks and keep up the good work.", 
      "date": "2008-03-04 14:15:00", 
      "id": 5515, 
      "responses": 2, 
      "subject": "Pub noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=4084"
    }
  ]
}