{
  "summary": [
    {
      "body": "Hello, i write a column for a newspaper and am planning to write it this week on what i suspect Patricia hewitt might say on Question Time this evening. Only problem is that i don't have a television and as i need to write it straight after, can't really trapse around london visiting friends who have a TV. Slightly random, but i was wondering if anyone was planning on watching Question Time tonight and if they'd mind having a guest watch it with them (me). thanks so much.", 
      "date": "2007-05-03 12:20:00", 
      "id": 4327, 
      "responses": 13, 
      "subject": "Does anyone have a television?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3299"
    }, 
    {
      "body": "My mother-in-law, her sister and young son are visiting us from Australia as of Sat 15th Sept and we've come a cropper with accommodation plans - the builders working on our new flat have been delayed and it's now looking very likely they will be homeless!  Unfortunately we can't put them up as we're currently living in a small style studio  Would anyone be away on holiday around this time (they are here for 3 weeks) and like a paying home-sitter?!  We've actually done this before with them (though not last minute!) and they stayed in a lovely flat in Willoughby.  They're Barbican savvy & very well behaved! Fingers crossed someone can help!", 
      "date": "2007-09-05 14:50:00", 
      "id": 3416, 
      "responses": 4, 
      "subject": "Help w/ accommodation crisis!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3633"
    }, 
    {
      "body": "I have been contacted by a Hong Kong based TV company interested in  taking in as a guest for just under a week a Chinese student, whose time with the family and as a tourist in London will be filmed for broadcast in Hong Kong. As they may need to wait some time to register here to place their message themselves, I offered to post it here for them and to put them in touch with anyone interested in participating. I have no information about this beyond the information they have given me, which I have copied below: \"RE: Invitation for home visit to Barbican Estate for filming We are a TV production team of Radio Television Hong Kong (RTHK), please visit:   for more information about us. We produce educational TV programs in Hong Kong, China. We are currently working on a program called \"Youth Travelogue\" and would like ask for our favor to facilitate our filming. Program description: \"Youth Travelogue\" is a 22-minutes TV program about a new way of traveling. In this TV series, a Hong Kong youngster who grows up in Hong Kong's public housing will be arranged to visit other country's public housing.  By showing the presenters home staying with host families in different countries public housing, we hope to broaden audiences horizons and understanding of other countries unique social and cultural contexts. Know more about our presenter: Our presenter for this England episode is a 21-year-old young man, named Raisin, studying Linguistic and Finance in the University of Hong Kong. He is also a double-decker enthusiast. Our trip to England will also consist of the discovery of buses in England. What we need: We are looking for a host family who live in Council House in London. Given the unique architecture and historical background of Barbican Estate, we hope we can have the privilege to arrange a short home stay in the estate. The ideal host family would be open-minded and willing to share their daily life under our camera while they provide our presenter a 4~5 days' home stay with them. A small amount of remuneration will be given to the host family as a token of gratitude. The filming is scheduled to take place around Easter and we do wish this will be a wonderful opportunity for cultural exchange offered to both the host family and the presenter.\" I did point out to them that the Barbican is now almost entirely a private Estate, but it represents highly a successful example of post war public housing and they still want to come to the Barbican, specifically, although Golden Lane ought also to meet their criteria. Please PM me if you are interested, and I can put you in touch with the company concerned.", 
      "date": "2007-02-08 21:46:00", 
      "id": 4223, 
      "responses": 3, 
      "subject": "Barbican Filming Opportunity", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3049"
    }, 
    {
      "body": "I received this message from a new user called Hayley (please reply to her direct using e-mail address   ) who would like to ask Barbican residents, in any flats but particularly in the towers, if they'd be happy to show her partner around their place for a surprise birthday gift. Please see below. ---- Following a telephone conversation with Michael Bailey at the Barbican  Estate Office I am trying to make an unusual request happen re. the  Barbican. My partner is a huge admirer of the Barbican arcitecture  and for years he has toured  the complex, wondering at the interiors of the  various flats, particularly the towers which are his favourite buildings in  London. It is Jonathan's birthday on the 31st May and I am desperately I am trying  to find a tenant/tenants who be prepared to show Jonathan and myself their apartment from the inside as a surprise present for his birthday. I realise this is a rather personal request and wanted to contact tenants in an official capacity rather than randomly knocking on people's doors - I do not want anyone to be in doubt of our good intentions on the visit. My first point of call was the Estate Office who, as I said, could only  refer me to your tenants forum -though I am not sure if you need to give a  Barbican address to register successfully with the website. If this is the case and I am not able to access the forum myself, would it  be possible for you to post a notice on my behalf on the site stating my  request? I would be more than with any appartment that any tenant was kind  enough to show me, so I do not have any specific requirements for the posting other than the date of 31st May. I do sincerely hope you can help me in this matter. Yours, hopefully Hayley ------------- NOTE: please do not reply to me as I am Horseradish, the site administrator. Please reply to Hayley direct using  .", 
      "date": "2007-03-21 14:28:00", 
      "id": 4351, 
      "responses": 1, 
      "subject": "Willing to show a couple round your flat on May 31st?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3168"
    }
  ]
}