{
  "summary": [
    {
      "body": "The Neighbourhood Policing Team has been asked to remind BarbicanTalk members that advice on how to lessen the impact of the current heatwave can be found at   or by phoning nhs direct on Tel: 0845 4647 We would also ask, if your neighbour is elderly or infirm, that you just check on them during this time. Although stormy weather is forecast, the temperature is forecast to remain 'high'. If you are worried about the lack of response from a neighbour's premises, please contact the City Police switchboard (020 7601 2222) as soon as possible. Yours", 
      "date": "2006-07-04 12:29:00", 
      "id": 3248, 
      "sentiment": 1, 
      "subject": "Current Heatwave", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2427"
    }, 
    {
      "body": "Sorry for posting on the main board, but I'm sure you'll agree that this needs to be advertised widely. I'd be obliged if any reader could copy the main text below and ask their workplace if this could be emailed company wide. Thanks. The City of London Police are appealing for witnesses to a murder which took place at SHADANS nightclub on Monday 4th Decemeber 2006 at 01:30.  Anyone who was in the area of SHADANS nightclub, New Bridge Street, London, EC4 at the time or who has any information regarding this incident are urged to contact the City of London Police control room on 020 76012222.  Information can also be given anonymously to Crimestoppers on 0800 555 1111. Your ongoing vigilenece would be appreciated to ensure the City of London remains one of the safest places to live and work. A/DCI CHANDLER Please do not use these numbers to request information.", 
      "date": "2006-12-12 17:30:00", 
      "id": 3306, 
      "sentiment": 1, 
      "subject": "Murder  Appeal", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2826"
    }, 
    {
      "body": "For residents information. 18 Jun 2007  ALLOW EXTRA TIME FOR FORMALITIES IF FLYING TO SPAIN As of 19 June the Spanish authorities will require passengers flying in from the UK to provide personal details prior to departure.  The new security measures are likely to cause delays at check-in; passengers should allow additional time for airport formalities. Some airlines are reportedly enabling travellers to provide the relevant personal details online; personnel should check with their carrier for the availability of such a service, which would reduce delays at the airport. Personnel should comply fully with the request for such information, because failure to do so could result in the airline refusing permission to travel. The Spanish government has introduced the advance passenger information (API) regime as part of its counter-terrorism measures. Passengers are obliged to provide airlines with their name, date and place of birth and passport number; the information will then be sent to the Spanish authorities before the flight is allowed to depart. The rules apply to any passenger travelling from the UK to Spain, irrespective of nationality. Spain is the first member state of the European Union (EU) to introduce the API requirement, which will be rolled across the bloc over the next 12 months. Regards  John", 
      "date": "2007-06-19 08:34:00", 
      "id": 3351, 
      "sentiment": 1, 
      "subject": "FLIGHTS TO SPAIN", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3426"
    }, 
    {
      "body": "Has anybody had any success in trying to stop the relentless influx of unsolicited mail that we seem to get shoved through our letterboxes? I'm fully aware that the Post Office have a statutory duty to deliver anything which has the address on it (hence their legal inability to avoid delivering stuff to \"the occupier\"). But I have registered with the mail preference service and I still get unsolicited, environment-unfriendly **** put through my door. I even have a sign above my letterbox, clearly asking people to avoid giving me flyers, menus and junk mail and yet it is constantly ignored: *     The Guildhall School of Music still chuck unwanted flyers at me, begging me to attend plays I don't want to see, and concerts I don't want to listen to. *     Ken Livingstone's propaganda newspaper, sorry \"mayoral communique\" is also forced upon me, and that rag isn't even absorbent. I can just about cope with taking these unread items and putting them straight in the recycling bin but I would rather be left in peace. Its not a lot to ask. Do any fellow residents have any decent strategies to avoid these annoying environmentally-harmful intrusions? And if not, could our friendly police advise me on the legality of lying in wait for these doorsteppers and dispatching them with harsh language and a water pistol?", 
      "date": "2007-09-01 21:29:00", 
      "id": 3434, 
      "sentiment": 1, 
      "subject": "Junk Mail- How can I stop it?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3621"
    }, 
    {
      "body": "It's 8pm and I've just walked along the podium and come across several beer cans and smashed spirit bottles with puddles of alcohol outside the conservatory. Nearby litres of white paint have been thrown on the paving and splashed over a considerable area.  3 nights ago there were more smashed and discarded alcohol bottles near Bryer Court at about 9pm. WHY do we never see police patrolling the podium at night when these problems occur. Don't tell me they're isolated incidents! Police please respond.", 
      "date": "2008-03-01 20:07:00", 
      "id": 3532, 
      "sentiment": 1, 
      "subject": "Vandalism", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4075"
    }
  ]
}