{
  "summary": [
    {
      "body": "Could ressies please give Paul some feedback in his Welcome section of the Police part of the message board. I think it would be appreciated, not least because  one resident woke him up in the middle of the night to complain about this board! Ta", 
      "date": "2006-10-09 08:40:00", 
      "id": 4281, 
      "sentiment": 2, 
      "subject": "police feedback", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2668"
    }, 
    {
      "body": "Dear Police Forum Is it possible to contain, or restrict, the number of pushers of free newspapers on the narrow pavement outside Barbican Station, by the Bus Stops either side of Aldersgate Street, and in the Beech Street tunnel, and their pro-active direct approach obstructing the pathway of pedestrians? It is somewhat of a hassle, not pleasant to those negotiating a rush hour in the small entrance of the station, or using the bus, nor to those seeking to visit the Barbican. I appreciate fully that the newspapers' war is one applicable to sites at most tube stations in inner London. However its momentum visibly is increasing beyond the novelty value.  The instance of a pusher banging hard on the side of a bus in a traffic jam and indicating I should open the window flap so he could push free papers inside, is a side experience of the aggressive training techniques used. My main concern as a resident is the presentation at Barbican Station. Is there anything practical that can be applied stationwide? Do conditions of pitch differ from those of, say, charity collectors, or sellers of the Big Issue? My understanding is that the pushers on the pavements are not regulated but that there is a bid in hand for one of the papers to obtain a pitch inside the station. I wonder if the matter is suitable for consideration at the City Residents Meeting in January. Please see the thread of this subject on the Discussion Board. Thank you for any advice you are able to give.", 
      "date": "2006-12-15 08:38:00", 
      "id": 5044, 
      "sentiment": 2, 
      "subject": "Newspaper pushers at Barbican Station", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=2835"
    }, 
    {
      "body": "Hello John, In your latest update, you note the four offences involving driving and mobiles.  I understand the last two but what are Cause use of mobile phone while driving motor vehicle on a road Permit use of mobile phone while driving motor vehicle on a road Could you explain please? thanks, Portia", 
      "date": "2007-02-23 19:56:00", 
      "id": 5244, 
      "sentiment": 2, 
      "subject": "Question about mobile phone use while driving", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=3081"
    }, 
    {
      "body": "At a local Ward Panel Meeting held at the YMCA on 29th March 2007, the Ward Constables agreed to investigate and tackle the following issues in the area defined as Cluster 6. (Please click on the website icon below for further information about Cluster 6):  Ward Constables will complete a progress report to be presented on the 10th of MAY 2007. Should you wish further information about Ward Panels and how you could get involved, please e mail me using the cluster 6 e mail address below. Yours", 
      "date": "2007-04-10 20:26:00", 
      "id": 5246, 
      "sentiment": 2, 
      "subject": "Local Policing Priorities:", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=3217"
    }, 
    {
      "body": "Hi Paul/John I wanted to know the Police's view on a car being driven to an MOT Testing Station, if there is a pre-booked appointment, and the old MOT has run out. I've been told anecdotally that it's fine, but I wanted to know if I would need to get it trailered over... I don't want to leave my MOT to run out and then fall foul of the law! Many thanks Tim", 
      "date": "2007-07-17 17:48:00", 
      "id": 5349, 
      "sentiment": 2, 
      "subject": "Car legality - a query!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=3504"
    }
  ]
}