{
  "summary": [
    {
      "body": "Anyone else suddenly being bathed in light from the new building on Chiswell Street called, I think, Milton Place. Seven dirty great floodlights have been switched on - and stay on 24 hours a day! They serve no useful purpose whatever. I no longer enjoy twilight falling softly - in fact, I can't look to the east any more as the lights dazzle so much.  Anyone else willing to join me in a protest to try and get them turned off? Quite apart from the intrustion, they are a supreme example of wasting energy!", 
      "date": "2007-04-16 07:51:00", 
      "id": 4383, 
      "responses": 5, 
      "subject": "Floodlights in Chiswell Street!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3236"
    }, 
    {
      "body": "Hello  Was anyone else disturbed by a very bright light shining from the top of that new building diagonal to Holmes Place on Aldersgate Street.  I live at the top of Bryer Court behind several layers of scaffold sheeting and my flat was as if a searchlight had been shone into it last night.  It went on for hours and hours.  I am afraid this is some dodgy new lighting put on top of that building at night.  Way too bright for comfort. Did anyone else suffer from it...?", 
      "date": "2005-06-09 15:49:00", 
      "id": 4738, 
      "responses": 3, 
      "subject": "STRANGE BRIGHT LIGHT SHINING FROM TOP OF 140 ALDERSGATE", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1675"
    }, 
    {
      "body": "So there I was after watching Madonna's performance at the Live Earth concert from the comfort of my Mountjoy apartment last Saturday, vowing to never leave any electrical item on stand-by ever again, when I close my curtains to try and shut out every bit of light coming from all the office buildings that we're surrounded by.  What's the point in trying to make a difference in order to prevent global warming when all the office buildings around us can happily leave all their lights on 24/7? I don't know if anyone feels the same way, but I'd love to have more darkness outside at night time, so we can occasionally forget we're in the heart of a big city.", 
      "date": "2007-07-09 13:12:00", 
      "id": 3484, 
      "responses": 2, 
      "subject": "Light Pollution after Live Earth Campaign", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3483"
    }
  ]
}