{
  "summary": [
    {
      "body": "Thank you to all the stall-holders, helpers, buyers, sponsors, lenders, entertainers and Corporation staff who made this Fayre happen.  I am extremely grateful to everyone involved before, during and after the Fayre. All our expenses were covered by sponsorship and donations, enabling all the cash taken on the day to be given to charity: that is, a total of nearly 2,000 to the different organisations present, including over 1,000 to the Guild of Bart's Hospital. Once again, many thanks to all who gave their time, effort and money. Same time next year?", 
      "date": "2004-06-21 15:13:00", 
      "id": 2901, 
      "sentiment": 4, 
      "subject": "A big \"Thank you\" from Mary", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1167"
    }, 
    {
      "body": "Jay Bird. Now I've got your attention... Has anyone else noticed the really beautiful Jay Bird(s) that is frequenting the Barbican lately. I never saw anything as nice when I lived outside of London, so I feel its even more amazing to see it here. It is obviously a bit more canny than the other birds as it has mastered my pigeon proof peanut feeder.", 
      "date": "2005-08-31 07:57:00", 
      "id": 2991, 
      "sentiment": 4, 
      "subject": "Naked as a...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1824"
    }, 
    {
      "body": "Tonight's the night!   Our \"First Wednesday in the Month\" meetings resume after the Christmas break with our regular meeting in Davy's City Boot, Moorfields Highwalk.  You'll find us in the restaurant area, 7 - 9pm.  The only cost is the drinks/snacks you buy. See you there! \"Strangers are just friends you haven't yet met\". Amigos in the Barbican - THE social group for all Barbican residents (aged 18 - 118)", 
      "date": "2006-01-04 08:25:00", 
      "id": 3018, 
      "sentiment": 4, 
      "subject": "Amigos in the Barbican - TONIGHT!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2009"
    }, 
    {
      "body": "in the spirit of summer joy, and now that it feels like autumn and i for one am much happier, i thought I would mention that the abseiling window cleaners came recently ... and my windows were spotless... i know this is a tale of no consequence but as we rage about the garchey, and the Ymca, and pink striped geraniums, and children's parties with enough equipment to launch a space ship, I thought some unalloyed good news might be welcome ...  I now have a perfect view of the YMCA in complete darkness - like someone has come along and removed a bit of the planet and forgot to replace it ...   gosh ... now i'm fantasising ...", 
      "date": "2006-08-03 22:51:00", 
      "id": 3136, 
      "sentiment": 4, 
      "subject": "window cleaning", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2505"
    }, 
    {
      "body": "In perusing the many comments on BarbicanTalk I thought I'd introduce to those who on occasion pop a lowly egg into a frying pan ( naughty ) or possibly poach the rascal or whatever a most delightful addition to my cupboard and hopefully yours. Waitrose stocks a large variety of the orb, and not overpriced for those who think our new shop is only for the rich, and in choosing my dozen one day recently I hit upon a sure winner!         In opening the box to check whether any might be broken I came upon a charming description of the product written over the lady's name whose layers laid the goodies,Mrs.Mabel Pearman's Burford Browns!!           I'll impart that message if I may but not before telling the reader that never in my long life have I tasted a more delicious egg, the flavour unsurpassed I do believe. But the colour truly beautiful, not a sallow and pale little yellow thing but almost orange and reminding me of many a sundown just before the heavenly star sank into the sea out there beyond that Greek Island. Oh dear I waffel so onward if you have a moment!            \" Clarence Court Free Range Eggs are special, not only for their superior flavour and quality, but because the poulturer's attention to the health and welfare of her hens , which are free to range and forage on green pasture from dawn till dusk, leading a natural and hapy life.            Our birds enjoy a gererous helping of sun drenched maize corn in their non-GM vegitarian diet, the privacy of warm secluded nest boxes, trees and scrubs for cover, dust baths - in fact, everything that a healthy hen requires for it's freedom of expression and fullness of life, to bring you a truly Free Range Farm Egg! \"               Somehow I feel that I've done the reader a service and I shall forever be in Mrs. Peaman's debt knowing full well that a succession of Burford Browns will be popping pullets for years to come!  ", 
      "date": "2006-08-13 10:21:00", 
      "id": 3151, 
      "sentiment": 4, 
      "subject": "A wonderful discovery via Waitrose!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2523"
    }
  ]
}