{
  "summary": [
    {
      "body": "Hamilton Brooks have just re-instated their third row of flats for sale on their front window - either an ominous sign for the health of the housing market here, or just an indication of things returning back to normal after a crazy few years. I remember Hamilton Brooks always used to have 3 rows of flats for sale, but a couple of years ago, literally every single flat had an 'Under Offer' sign on it. They then reduced it to only showing two rows of flats for sale. Until quite late last year, every flat was still 'Under Offer'. Then the tide changed. Now they've re-instated the third row of flats, and few, if any, are 'Under Offer'.", 
      "date": "2008-04-29 20:27:00", 
      "id": 3574, 
      "sentiment": 1, 
      "subject": "Hamilton Brooks Estate Agency - 3rd row of flats!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4287"
    }, 
    {
      "body": "Has anyone got a spare freeview box? I am not ready yet for a digital TV and my box just expired. I saw someone offered one in November but I suppose that one's gone by now.", 
      "date": "2008-02-05 10:22:00", 
      "id": 3780, 
      "sentiment": 1, 
      "subject": "freeview box", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3982"
    }, 
    {
      "body": "I just came across this item on ebay... just in case anyone is looking for one...", 
      "date": "2006-03-05 20:58:00", 
      "id": 4610, 
      "sentiment": 1, 
      "subject": "Barbican oven", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2113"
    }, 
    {
      "body": "I'm currently looking for a one bedroom flat in the Barbican, preferably over two floors. I'm finding it difficult going round all the different estate agents, and I was wondering if there was a central point where all vacant flats were advertised?", 
      "date": "2005-07-11 10:47:00", 
      "id": 4699, 
      "sentiment": 1, 
      "subject": "Estate Agents", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1736"
    }, 
    {
      "body": "now safeways has stopped selling it, where is the closest place on foot that sells compost? alternatively, does anyone have about four small four bags they'd be prepared to sell?", 
      "date": "2004-09-07 16:47:00", 
      "id": 4766, 
      "sentiment": 1, 
      "subject": "Soil/compost for window boxes", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1252"
    }
  ]
}