{
  "summary": [
    {
      "body": "It's 8pm and I've just walked along the podium and come across several beer cans and smashed spirit bottles with puddles of alcohol outside the conservatory. Nearby litres of white paint have been thrown on the paving and splashed over a considerable area.  3 nights ago there were more smashed and discarded alcohol bottles near Bryer Court at about 9pm. WHY do we never see police patrolling the podium at night when these problems occur. Don't tell me they're isolated incidents! Police please respond.", 
      "date": "2008-03-01 20:07:00", 
      "id": 3532, 
      "responses": 11, 
      "subject": "Vandalism", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4075"
    }, 
    {
      "body": "Does anyone know the name of the company at 48 Chiswell Street, at the bottom of Whitecross Street? Their staff have been banned from smoking around the entrance to the building which means that all they do is cross over the road and smoke around the 02 entrance to Ben Jonson House instead, strewing the area with fag butts. It annoys me, probably more than it should I know...", 
      "date": "2006-09-15 09:54:00", 
      "id": 4495, 
      "responses": 9, 
      "subject": "48 Chiswell Street", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2602"
    }, 
    {
      "body": "I wonder if the complete absence of litter bins on the podium, except for those in the Speed House andd Defore gardens, bothers anyone? There are times that litter accumulates to such a degree that I yearn for that long gone receptical that at one time was seen round about and many time full to overflowing.        I realize our litter bins were removed about the time the IRA were using both litter bins and post boxes to house their explosives in their dastardly campaign in England. But since the troubles, and the long awaited answer to the final solution, things have taken a turn for the better I would assume the recepticals might effect a long awaited return.         I've inquired, of the Corporation on a number of occasions, when   might the bins again appear and on each instance came the reply ' we are in the process of perfecting a bomb proof litter bin '!!! Remembering the year of my first inquiry, 1998 I believe, finding the material and answer to this problem seems so far to escaped their search.          Very possibly I won't have the pleasure of seeing the bins in my lifetime but I hope for those who follow me here on the Estate litter hopefully will if not be a thing of the past at least will be lessened. Am I asking too much and are there any comments out there?", 
      "date": "2007-01-14 13:12:00", 
      "id": 4139, 
      "responses": 2, 
      "subject": "The long absent litter bin!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2905"
    }
  ]
}