{
  "summary": [
    {
      "body": "I desperately need to print something off now for a job interview in the morning and my printer doesn't work. It's a 5 page CV. Please please if anyone has a printer i could use to print it off, i'd be forever grateful. I'm abot to cry, everything is going wrong. Please don't fail me barbicantalk!!", 
      "date": "2007-03-06 22:48:00", 
      "id": 3278, 
      "sentiment": 4, 
      "subject": "Urgent plea for help!!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3114"
    }, 
    {
      "body": "Anybody know to which body I should address a letter of complaint about the music from the keep fit classes in the early evening? It's like having a rave foised upon the area each day. Pub noise I expect and accept within reason but thudding megawatt soundsystems in order to shift a few calories is several steps too far. I'm afraid i'm not going to be satisfied with approaching 'the management' either in this case. They have paying customers to satisfy so there is a conflict of interests for a start.  I want to lodge something with a body that cannot simply turn a blind eye nor file my complaint in a folder marked 'trash'. I'm thinking upon the lines of a local noise abatement officer or similar. Please feel free to PM me with accurate details if you have them  or simply don't want to to broadcast the information. Having said that ,unless i'm the only one ready to pop a valve over this irritant, then i'm sure others may be wish to object or lobby too. Regards, L", 
      "date": "2007-05-21 18:21:00", 
      "id": 3323, 
      "sentiment": 4, 
      "subject": "Enough! YMCA gym music", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3352"
    }, 
    {
      "body": "I have a computer problem which is driving me INSANE but which one of you barbies out there may be able to solve. It is simply that when I am typing in Word or in Hotmail, the wretched cursor jumps suddenly somewhere else in the text and then proceeds to overwrite whatever is there. I have no idea what to do. I know it's not caused by the mouse or any of the keys. AND IT'S JUST HAPPENED AGAIN - BOTHER! Any ideas or suggestions? Thanks", 
      "date": "2006-12-15 20:53:00", 
      "id": 3371, 
      "sentiment": 4, 
      "subject": "COMPUTER GLITCH", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2838"
    }, 
    {
      "body": "Hello All,  I'm about to pull my hair out with my printer.  I've successfully set up my wireless broadband and decided to introduce my printer to my router.  My Mac can now see my printer and trys sending stuff to it, but to no avail.  I suspect it's something to do with the way my security is set up on my router but I've exhausted my limited knowledge of wireless networks.  To add to the confusion, we're using both Mac & PC in our flat hence not just having an airport to run everything from.   Any suggestions anyone? Or better still, does anyone know of anyone who charges to come around and sort such IT matters out?  I seem so near, yet so far! Thanks all!", 
      "date": "2006-09-04 10:10:00", 
      "id": 4471, 
      "sentiment": 4, 
      "subject": "wireless printing hell...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2578"
    }
  ]
}