{
  "summary": [
    {
      "body": "I am seeing riduculously short lifespan of light bulbs. I know that they tend to blow in cold weather. But even allowing for that - two last week and another three this week - all from lights that are only a few months old seems unlikely. Is anyone else seeing this ? (I'm in Willoughby if it makes a difference). I did notice a lot of interference on the television before I put it and the computers on surge blocks - so I'm wondering if we've got spikes in the power.", 
      "date": "2006-11-22 14:01:00", 
      "id": 3218, 
      "responses": 9, 
      "subject": "Dirty Power?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2768"
    }, 
    {
      "body": "I would like to put an electric cable through to outside so that I can put some lights into the flower pots, I'm on the top floor so no-one else will see them but me. Has anyone put a cable through to outside and if so is it best to put it through the side or under the door frame?", 
      "date": "2005-04-29 10:25:00", 
      "id": 4725, 
      "responses": 6, 
      "subject": "Balcony lights", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1599"
    }, 
    {
      "body": "I have inherited refurbished bath and shower rooms in a tower flat. The lighting in both rooms is from a single source placed near the doors above the basins. I find this single source does not light the room adequately and before I start pulling the entire lot to pieces (including wall to ceiling tiling) I'd appreciate some ideas on improving the lighting. Am I correct in assuming that ceiling lighting is not an option due to the underfloor heating in the flat above? I have a horrible feeling that I am going to have to rip all the tiles off and carry the wiring across the wall to add another wall light, but welcome ideas, especially if an old wiring point may be likely to be lurking behind the tiling. I have looked at the photos on Barbicanliving for clues but am none the wiser. Thanks", 
      "date": "2007-08-12 18:29:00", 
      "id": 3395, 
      "responses": 4, 
      "subject": "bathroom lighting", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3584"
    }, 
    {
      "body": "I think our original Barbican oven just \"died\" - flash of white light, bit of a bang, pleasantly toxic odour and all that. The orange indicator lights aren't coming on now suggesting that it has powered itself down, though I wouldn't mind isolating it from the mains power somehow just to be sure that nothing nasty happens while I hunt/wait for somebody to fix it. Does anybody have a clue what the fuses in the kitchen correspond with? We have a bank of eight unlabelled fuses in a panel within a cupboard above the stove - is it likely that one of these will knock the power from the oven? Any other suggestions? (And, does anybody know who to get to repair an original barbican oven? Or is it a lost cause?)", 
      "date": "2006-06-20 19:32:00", 
      "id": 4432, 
      "responses": 4, 
      "subject": "Dead Oven", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2379"
    }, 
    {
      "body": "Despite many hours of searching, I can't find where the BT phone line in my Willoughby House flat enters the premises. The telephone socket is located in the South-side living room wall (dividing my flat from the neighbour's) - though it doesn't seem to enter the property through any of the fuse boxes or the other cabinets near the front door (unless I'm missing it?). A good rattle of the telephone cable in the trunking at the socket also reveals very little.  Does anybody know where / how the phone lines are connected / enter the property? (I need to have it extended / relocated and I'm trying to avoid the splice-and-staple-along-the-skirting effect that the engineer is suggesting).", 
      "date": "2007-08-12 17:17:00", 
      "id": 3392, 
      "responses": 3, 
      "subject": "Telephone wiring question", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3583"
    }, 
    {
      "body": "We are used to getting small electric shocks from the metal light switches.  However, this morning my boyfriend got a slightly nastier, but non life threatening, shock from the red oven switch in the kitchen. We have an original kitchen although I'm not sure if that switch is original.  Does anyone know if this is this something that needs to be looked at by an electrician or is it just one of those Barbican things that you learn to live with (ie don't touch the switch with bare hands?). Thanks!", 
      "date": "2006-04-07 12:10:00", 
      "id": 4649, 
      "responses": 3, 
      "subject": "Electric shocks", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2186"
    }, 
    {
      "body": "I've just moved in to the Barbican, and noticed there's an old style fuse box in my flat - i.e. if they blow, you need to pull the fuse out and replace it with a new fuse (assuming you have one) - similar to 13 amp plugs. Previously where I've lived, there have always been flip switch fuse boxes. What are peoples experiences of replacing the fuse boxes with modern ones? Would you recommend it?", 
      "date": "2006-08-12 13:43:00", 
      "id": 4467, 
      "responses": 2, 
      "subject": "Fuse Box", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2522"
    }, 
    {
      "body": "In light of what was said in the recent issue of Barbican News about old electric circuits in the estate, has anyone had experience of re-wiring their flats? Can it be done without needing to redecorate or repaint the walls? Thanks.", 
      "date": "2005-08-16 10:48:00", 
      "id": 2972, 
      "responses": 1, 
      "subject": "Re-wiring", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1810"
    }
  ]
}