{
  "summary": [
    {
      "body": "Nick Cohen in the Standrd has had a cliched jibe at the Barbican tonight.  I think we should mail in to protest. To quote: \"I went to the Museum of London .....  but spent as much time gawping at the Barbican complex ....   Nothing, not the doomed attempts of the residents to prettify the blocks with window boxes nore the late june sun, could make the brutalist towers look like anything other than an East German Housing project. Because it is in the centre of London and has a nice arts centre  attached, its flats still sell for 350k.  But it will take only one propoerty crash for the Barbican to meet its destiny and become what it was designed to be: a sink estate for the upper-middle class.\" Grrrrrrrrrrrrr............... Letters to   including daytime number, name and address !!!!!", 
      "date": "2006-06-28 21:16:00", 
      "id": 3173, 
      "sentiment": 3, 
      "subject": "Bad press for the Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2411"
    }, 
    {
      "body": "Has the City's planning department been taken over by property developer vampires? Sad news in last week's planning committee meeting about West Smithfield. The meeting gave gave support for the demolition of the market building and the construction of , yes, another dull glass box for office drones to sit in.  Full story on   This is itself a very unsatisfactory result.  But what caught my eye was the revelation that the City Planning officers appeared to be actively collaborating with the developers to get the plans through.  As the story on BD reported it:  In his closing statements for English Heritage, Robert McCracken QC told the planning inspector that a decision in favour of developer Thornfield's proposed demolition would set a dangerous precedent. These applications are an attempt by the applicant and the City to drive a bulldozer preceded by a ball and chain through national and local heritage policies, he said. It raises the question of whether the City is in effect, in the belief of which it appears to have acted, a plan free office zone. He also said, according to the Evening Standard (a daily newspaper), that the City planners had known of secret plans by the developers, but had concealed information from the enquiry.  These people are not our friends.", 
      "date": "2008-01-29 15:19:00", 
      "id": 3616, 
      "sentiment": 3, 
      "subject": "West Smithfield demolition at planning meeting", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3957"
    }, 
    {
      "body": "Just read this on Timesonline   and even though we wouldn't mind a few more shops open on the weekend, we wouldn't want the City to become another West End. The reason we live here is for the peace and quiet. We would hate to see this beautiful part of London spoilt by a mass of high street shops. ", 
      "date": "2008-02-04 20:28:00", 
      "id": 3779, 
      "sentiment": 3, 
      "subject": "Rival to Blue Water Shopping Centre", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3981"
    }, 
    {
      "body": "According to the BBC ( ), Carluccio's pays its waiters just 3.75 per hour - less than minimum wage - expecting them to make up the difference with tips. Disgraceful! Knowing that I'm amazed at how cheerful the staff at Carluccios manage to be. I suggest a boycott of Carluccios until the management change their ways.", 
      "date": "2008-04-18 08:03:00", 
      "id": 3878, 
      "sentiment": 3, 
      "subject": "Boycott Carluccio's!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4245"
    }, 
    {
      "body": "Mail hysterics - or plausible downside for those living here where energy efficiency doesn't come to mind as a prime virtue of the Barbican eco-system?  \"Homeowners who refuse to alter their houses and flats to conserve more heat and power face higher council tax bills, ministers revealed. They plan to encourage town halls to jack up bills for the least energy efficient homes in the name of tackling climate change. A link between council taxes and energy efficiency is on the way after the controversial system of home sellers' information packs comes into force next summer, officials confirmed. Councils will be able to check the green credentials of houses and flats from details contained in 'energy performance certificates' which will be a compulsory element of every information pack.  [etc etc ad nause, ad inf.]", 
      "date": "2006-09-23 22:15:00", 
      "id": 4503, 
      "sentiment": 3, 
      "subject": "Low energy efficiency = higher council tax bills?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2623"
    }
  ]
}