{
  "summary": [
    {
      "body": "I'm currently looking for a one bedroom flat in the Barbican, preferably over two floors. I'm finding it difficult going round all the different estate agents, and I was wondering if there was a central point where all vacant flats were advertised?", 
      "date": "2005-07-11 10:47:00", 
      "id": 4699, 
      "responses": 16, 
      "subject": "Estate Agents", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1736"
    }, 
    {
      "body": "Hi  Does anyone know how to whiten these original Barbican bathtubs.  I am poised to sell/rent my flat and would like a whiter bathtub to be part of the picture. I once had a cleaner from Abracadabra or somewhere come in and they told me something about soaking the tub overnight with bio or non-bio washing powder - dissolved in cold water.  Does anyone know this or any other tricks? Thanks very much, Jeannie", 
      "date": "2007-12-01 14:33:00", 
      "id": 2625, 
      "responses": 11, 
      "subject": "A whiter bathtub", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3831"
    }, 
    {
      "body": "We have a type 21 in the middle of Defoe and are getting ready to rent it out for a year because we are cycling to India from London for charity. I'm thinking of using Frank Harris as managing agent but was wondering if anybody had good/bad experience with any other agents. This is the first time I will have rented out the flat so any advice would be much appreciated.", 
      "date": "2006-03-06 14:03:00", 
      "id": 4556, 
      "responses": 6, 
      "subject": "renting out a flat- any advice", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2115"
    }, 
    {
      "body": "Hello This is my first post here so I hope it's okay to go in asking a question. We're hoping to rent a flat on the Golden Lane estate. Ideally we'd like two bedrooms as we have a child.  I have spoken to Frank Harris and Hamilton Brooks but neither agent seemed very sure of which blocks had two bedrooms although they did say they did exist. Which blocks have two bedrooms? And are any of the one bedroomed flats bigger than others so that we may all be able to squeeze into one (gulp) if need be. And do two-bedroomed flats come up very often or should we snap up a one bed if it comes up (nothing seems to be available at the moment). Any advice would be most welcome. Thank you.", 
      "date": "2007-01-21 21:30:00", 
      "id": 4194, 
      "responses": 2, 
      "subject": "Can you get two bedroomed flats on Golden Lane estate?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2944"
    }, 
    {
      "body": "Dear All, Some time ago I posted a message in the Classified section, seeking to rent a flat or room in the Barbican or nearby for six weeks  (from mid-September to the end of October).  I haven't got  any replies so far and I'm still desperately looking for one.  (By the way, when posting that Classified ad, I inadvertently stole \"andrewes_person's\" nickname - apologies!) Of course, I may not have got any replies, because no one in the Barbican or nearby has a flat or room to rent at that time. It is more likely, though, that  there are relatively few Barbicantalkers (and probably only some of them look at the Classified section) so it's not the best way of advertising such needs. Hence my question - does anybody know of any better way to put up such ads? Is there perhaps an ad board in the Estate Office we can use? As far as I know, we can't put up any private notices on the boards inside the houses, and putting slips of paper through people's mailboxes might not be very well received, either.  I'll be very grateful for any suggestions. Of course, if you do have a room or flat to rent for six weeks from mid-September - or know of someone who does - I'll be more than happy to hear from you at   or (020) 7920 0275. Thanks a lot, Dorota", 
      "date": "2004-07-27 15:20:00", 
      "id": 4770, 
      "responses": 1, 
      "subject": "Flat ads", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1205"
    }
  ]
}