{
  "summary": [
    {
      "body": "Have any other Barbican-based cyclists been hassled recently by the City Police?  So far in a four week period I've been informally cautioned for something that - on investigation - wasn't even an offence and then nearly been knocked off my bike by a motor cycle patrol officer who warned me, in inappropriate language, not to commit an offence that I wasn't going to commit anyway. This latter incident was witnessed by my wife, who was cycling behind me, and who got more annoyed than me because she was sure I was going to be injured. One of the joys of living in the Barbican is not to have to rely on the car all the time. I cycle about 150 miles a week and - yes - I know cyclists can be a real pain and hazard. I try hard to respect all other road users and pedestrians - yes, even the ones permanently glued to mobile phones who cross roads looking the other way - and I wondered whether others have noticed a change in City Police attitudes. I stupidly failed to get the shoulder numbers of both officers involved but I am considering chasing up the details of the motor cycle officer because he was both dangerous and offensive.", 
      "date": "2006-09-01 15:23:00", 
      "id": 4284, 
      "responses": 59, 
      "subject": "CityPoliceHasslingCyclists", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2570"
    }, 
    {
      "body": "Dear Police Forum Is it possible to contain, or restrict, the number of pushers of free newspapers on the narrow pavement outside Barbican Station, by the Bus Stops either side of Aldersgate Street, and in the Beech Street tunnel, and their pro-active direct approach obstructing the pathway of pedestrians? It is somewhat of a hassle, not pleasant to those negotiating a rush hour in the small entrance of the station, or using the bus, nor to those seeking to visit the Barbican. I appreciate fully that the newspapers' war is one applicable to sites at most tube stations in inner London. However its momentum visibly is increasing beyond the novelty value.  The instance of a pusher banging hard on the side of a bus in a traffic jam and indicating I should open the window flap so he could push free papers inside, is a side experience of the aggressive training techniques used. My main concern as a resident is the presentation at Barbican Station. Is there anything practical that can be applied stationwide? Do conditions of pitch differ from those of, say, charity collectors, or sellers of the Big Issue? My understanding is that the pushers on the pavements are not regulated but that there is a bid in hand for one of the papers to obtain a pitch inside the station. I wonder if the matter is suitable for consideration at the City Residents Meeting in January. Please see the thread of this subject on the Discussion Board. Thank you for any advice you are able to give.", 
      "date": "2006-12-15 08:38:00", 
      "id": 5044, 
      "responses": 6, 
      "subject": "Newspaper pushers at Barbican Station", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=2835"
    }
  ]
}