{
  "summary": [
    {
      "body": "I'm looking at covering new (relatively) restaurants in the next issue of Barbican Life magazine, plus those newly into the BA discount scheme.  If any Barbicantalkers care to comment on any of these it would be great in giving me an idea of how residents feel about these establishments. The 'new' restaurants I plan to cover include:  St Julien (Long Lane), Spice Corner (Aldersgate Street), Issus (Charterhouse Street), Warin (Whitecross Street), Portal and Pho (st John street).  Anyone know of any new restaurants I've missed locally?  lso any comments on the refurbished Barbican Bistro in the Barbican Centre. The new BA discounters are:  Coconut Lagoon (Aldersgate Street), Brasserie Malmaison (Charterhouse Square) as well as several of the 'new' restaurants above. Any comments much appreciated - thanks.", 
      "date": "2005-08-02 16:12:00", 
      "id": 2986, 
      "sentiment": 1, 
      "subject": "Restaurants again", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1779"
    }, 
    {
      "body": "As 12th night approaches, I noticed a skip has appeared for Christmas tree recycling outside the (closed) Crowders Well pub on St Giles Terrace, if anyone needs it. There may be others too.", 
      "date": "2006-01-02 13:43:00", 
      "id": 3020, 
      "sentiment": 1, 
      "subject": "Christmas tree recycling", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2003"
    }, 
    {
      "body": "just to let any pensioners who dont already know you can have lunch in the ymca resturant  on saturday and sunday at 1-2 pm it costs 4.50 which is a good deal    by the way residents do not get lunch so you will have a nice quiet meal", 
      "date": "2006-05-11 17:01:00", 
      "id": 3102, 
      "sentiment": 1, 
      "subject": "pensioners lunch ymca every saturday/sunday", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2285"
    }, 
    {
      "body": "Just had it installed and it's very very impressive for those that are interested, now need to have another Sky Cable installed to take full atvantage of the Sky + element, does anyone know how I get this done?", 
      "date": "2006-07-03 09:39:00", 
      "id": 3128, 
      "sentiment": 1, 
      "subject": "SKY HD", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2424"
    }, 
    {
      "body": "Hi all, the Barbican Horticultural Society's summer competition is almost upon us again. As part of this event some of the balconies and window boxes are open to other members from the society. I would like to extend this for my balcony to anyone from this forum who wishes to have a nose around and get some planting ideas. I have a couple of trees and quite a lot of planting that may be of some interest, including a six foot Echium. Another Echium is on its way up and promising to be even bigger. So if you are around on the morning of 2nd July then please do pop in. David 20 Thomas More House", 
      "date": "2006-06-21 16:28:00", 
      "id": 3129, 
      "sentiment": 1, 
      "subject": "Barbican in Bloom", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2381"
    }
  ]
}