{
  "summary": [
    {
      "body": "A Barbican neighbour, whose telephone number begins 020 7588,  has 'lost' his ADSL today.  BT has not yet responded to his calls. Does anyone here know whether there is a telephone exchange problem?  Thank you.", 
      "date": "2008-02-25 11:56:00", 
      "id": 3641, 
      "responses": 178, 
      "subject": "Telephone exchange nos 020 7588 ...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4058"
    }, 
    {
      "body": "Could anyone recommend a good broadband deal and service. I'm with Tiscali and the service has been getting worse and worse recently and they can't offer 8mb in the area. Also now that they are all offering phone packages as well it is getting very confusing. I'm split between BT, Sky and Bulldog at the moment.", 
      "date": "2007-01-11 11:11:00", 
      "id": 4214, 
      "responses": 22, 
      "subject": "Broadband", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2897"
    }, 
    {
      "body": "I've just bought a laptop, but am not sure what I now need to do to go online - sorry for the stupid question!  I have a connector for the phone line, do I need to get connected to someone like Wanadoo?  If so can anyone recommend a good internet provider?", 
      "date": "2005-10-04 13:43:00", 
      "id": 3112, 
      "responses": 17, 
      "subject": "Internet Connection", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1865"
    }, 
    {
      "body": "I was just wondering what kind of broadband statistics people are getting at the moment? I'm particularly interested in the downstream attenuation to the Moorgate exchange on people's lines. I'm currently getting 40 db, which is quite poor, considering that Bunyan Court is only about 500 metres from the exchange. From what I can gather, an attenuation this high is roughly equivalent to about 2.5 km of cable!  It all means that I can only sync at about 4600 kbps and get speeds of about 3560 kbps. This is rather low in comparison to what I used to get. And I know that it is not my provider as they publish the speeds that each of their pipes are currently running at, and it is very rarely below 6500 kbps. I know that there is some work going on at Moorgate at the moment, so this might be causing the poor connection. However, if anyone else could post their statistics for: downstream attenuation; signal to noise ratio (my is 15 db, which is pretty good); sync speed; and  throughput  for Moorgate in particular (but other exchanges would be interesting), I would be very grateful. Thanks, Daryl", 
      "date": "2008-03-16 19:49:00", 
      "id": 3840, 
      "responses": 14, 
      "subject": "Broadband statistics - attenuation and Signal to Noise Ratio", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4130"
    }, 
    {
      "body": "We are currently choosing our broadband provider and wonder if anyone can recommend a provider they're happy with? Many thanks.", 
      "date": "2005-07-19 12:01:00", 
      "id": 4697, 
      "responses": 13, 
      "subject": "Broadband with BT?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1750"
    }, 
    {
      "body": "Hi, can someone please either direct me to a recent thread or offer me the latest advice on broadband, either down the line or wireless? At work I have 100 Mbps, whatever that is, and at home I'm using the phone line which is dire. Help from an expert, please! 'Wendy'  ", 
      "date": "2007-05-30 11:38:00", 
      "id": 3342, 
      "responses": 12, 
      "subject": "Broadband advice please", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3375"
    }, 
    {
      "body": "Our ISP (beeb.net) is terminating its services at the end of June, so we have to find a new service provider. We thought we should update our communications generally at the same time - we dont like BT, and we havent got wireless (though we arent sure we need it  we certainly dont need internet access on the move.) Has anyone any advice on this, particularly on service providers?  Beeb.net charges us 25 a month for broadband access (there are no call charges). Were looking for a provider which can give us at least 2 different email addresses, with the option in the future of hosting a modest business website. We use the internet several times a day, but dont download films and other big items. We dont make many phone calls, so our BT line rental accounts for most of the phone bill - there may be a more efficient way of dealing with this. Ive looked at the websites of the ISPs recommended here, but their range of options is pretty bewildering if you arent up to date with technology. Needless to say we want an ISP with a decent level of technical support.   A big thank you to anyone who can advise!", 
      "date": "2008-04-10 17:23:00", 
      "id": 3870, 
      "responses": 12, 
      "subject": "Phone and internet providers - recommendations?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4220"
    }, 
    {
      "body": "Anyone have problems connecting with BT Broadband last night? I rang them up and was told in a very roundabout way that there was some sort of problem at the exchange. Just wondering if anyone else was experiencing it. thanks", 
      "date": "2007-03-01 08:48:00", 
      "id": 3268, 
      "responses": 11, 
      "subject": "Problem with BT broadband?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3091"
    }, 
    {
      "body": " i have just got a new lap top and playing around with it have just easily connected to the internet for free by logging on to an un secure wireless conection belonging to someone else is it legal to do this as i dont want to get in trouble if it is?can it harm my computer? ", 
      "date": "2005-05-09 15:39:00", 
      "id": 4634, 
      "responses": 11, 
      "subject": "wireless internet", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1618"
    }, 
    {
      "body": "Hi there,  Does anyone else in Lauderdale Tower in particular use Tiscali ? We are with them and although we pay for a 2Mb service, when I recently tested the line speed (see link below) I am getting speeds of 31.70 kpbs for example which means I might as well be dialling up and not paying for broadband !    I've spent many an afternoon on the phone to New Dehli to try and solve the problem and as such have : run anti spyware, switched off the firewall (temporarily of course), moved the wireless phone AND run a defrag ; and guess what - it's no faster. Is anyone else in a similar position or know what the issue might be ? ( I did read with interest the e-mails re broadband stats but am not sure if this is directly related ?). Any thoughts greatly appreciated ! Thanks, Liz", 
      "date": "2008-04-02 13:51:00", 
      "id": 3847, 
      "responses": 8, 
      "subject": "Broadband speed - Tiscali", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4174"
    }, 
    {
      "body": "Has anyone registered for this service widely advertised by Carphone Warehouse or is actually using it? We should like to hear of your experience -upsides and downsides. And to hear of experience with other broadband providers before we desert snailband.", 
      "date": "2006-06-11 11:00:00", 
      "id": 4420, 
      "responses": 8, 
      "subject": "\"Free broadband forever\": Carphone Warehouse", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2357"
    }, 
    {
      "body": "Can anyone advise on fuzzy phone reception on the 25th floor - is this a common problem? I've tried different handsets including digital but can't get rid of the hissing sound. Might it be something to do with Broadband/WiFi? Grateful for any thoughts or advice as it's driving me nuts!", 
      "date": "2007-05-01 19:57:00", 
      "id": 3316, 
      "responses": 7, 
      "subject": "Fuzzy phone reception", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3292"
    }, 
    {
      "body": "Hi all, Just moved into Defoe house and need the get an internet connection. I was hoping to get a 24mb one from Be Unlimited but they refuse to do it for my line, even though the say they cover the moorgate exchange. Does anyone else have an ADSL 2+ connection? Cheers! John", 
      "date": "2008-02-12 11:27:00", 
      "id": 3519, 
      "responses": 7, 
      "subject": "Broadband recommendations - anyone got ADSL 2+?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4011"
    }, 
    {
      "body": "Hello  Reading the below threads it is clear that a number of residents are suffering intermittent broadband faults. Either disconnection or slow speeds. Once again, I am not able to get online via my own connection, and I'm not able to make phone calls.  We understand from the fine work of the Barbican Association that BT has been moving some components related to the exchange, and also that there has been some sort of line fault. I sense from reading our experiences that there may be more going on that we have not been privy to. Firstly, is there anything more the BA can do on our behalf at this time? I am sick of spending hours on hold to BT's various departments, especially when I'm handed off to people in India who are not empowered to change the situation. Secondly, thank you to anyone who is leaving their wireless connections open at this time. I am able to get online, just about, thanks to someone whose connection is not password-protected. Be careful to ensure your connection is firewalled/virus protected and that you are not sharing your computer network along with your wireless internet. But thank you, because otherwise I would be spending most of the day going back and forth to various internet cafes / the library and spending a fortune.", 
      "date": "2008-03-17 12:24:00", 
      "id": 3822, 
      "responses": 7, 
      "subject": "Broadband faults: help from Association? + Wireless sharing", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4132"
    }, 
    {
      "body": "Hi!! We have just moved in to John Trundle. I am Sarahjayne, a graphic designer and my partner Jonnie is a Management Consultant. We have been here for a few weeks now and absolutely love it! There are a few things we are unsure of and would appreciate any advice. Is it possible to get Sky +, if so, how? Do we have to use a specific broadband internet provider? If we have visitors, where can they park? Our bathroom occassionally smells - is there a problem with the drains in John Trundle???!!! Where is best to do our food shopping? We have visited Sainsbury's in Angel and weren't impressed!! We don't have car, so ideally would love somewhere nearby other than the 'local' or 'express' variety of supermarkets where the selection is not great. This is probably wishful thinking!!  We look forward to learning more about our new area!! Many thanks", 
      "date": "2005-09-27 15:48:00", 
      "id": 4438, 
      "responses": 7, 
      "subject": "Hello! We've just moved in and have a few questions!!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1858"
    }, 
    {
      "body": "Anyone else having connection problems? Since yesterday a.m. I've been dropped each time I've gone online (via dial-up) after about 2 minutes. Can't find a reason. I'm an experienced user, but this has completely foxed me! I'm in BJH, being driven slowly mad.... ", 
      "date": "2007-03-17 09:23:00", 
      "id": 3296, 
      "responses": 5, 
      "subject": "Internet problems", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3152"
    }, 
    {
      "body": "Hi is anyone else experiencing difficulties with plus.net broadband or for that matter in Cromwell Tower? I have a desktop pc and a laptop mac, both of which are connected wirelessly to a zyxel router. Over the last couple of weeks, connections have been very slow and unreliable. There have been no changes in our usage of the net, but performance now is rubbish. I don't know whether the problem arises from plus.net or the router, or from interference in the local area so if anyone else is having issues with either of these products or in cromwell generally, pls let me know! And if anyone has any bright ideas for solving the problem, don't be shy!! thanks Mat", 
      "date": "2007-10-16 10:04:00", 
      "id": 3450, 
      "responses": 5, 
      "subject": "Internet Connection Problems with plus.net in Cromwell ?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3729"
    }, 
    {
      "body": "We are considering 'migrating' as it is called from BT Broadband to Waitrose Broadband.  Since Moorgate (628) exchange moved from nearby to London Bridge area, we have experienced failed connections and more recently abysmally low download speeds (as I write it is 224 Kps as reported on ADSL router site); upload speed is fairly constant at normal 448Kps. Occasionally for only a short period upload is registered at about 5.5 Mps. Email to helpline reporting problems produced incomprehensible response and repeated requests for clarification have not been answered.  We wonder if others on BT Broadband on 628 exchange have had similar problems. We are in Brandon Mews. So a migration to Waitrose is on the cards and any comments on experience of migrating from BT and the quality of Waitrose Broadband will be welcome. Help!", 
      "date": "2007-09-06 11:20:00", 
      "id": 3830, 
      "responses": 5, 
      "subject": "Waitrose Broadband", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3636"
    }, 
    {
      "body": "My broadband connection has been down for 2 days and ISP helpline is mystified.  Is anyone else having similar problems?  Joanna", 
      "date": "2008-04-07 15:25:00", 
      "id": 3887, 
      "responses": 5, 
      "subject": "Internet problem", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4204"
    }, 
    {
      "body": "Hey This morning I downloaded all my software updates on my macbook (itunes, safari, quickplaer and the security update). Since then, my internet connection has not worked and the mac support line seem to think that the security update may have something to do with it. However, as the machine is more than a year old, they don't provide complimentary IT support! I know my net connection works as  a) I'm happily using my desktop to dial in here, and b) my work laptop (pc) can also connect to the network wirelessly Anybody have any ideas on how to reset a macbook internet connection? I use both safari and firefox if that makes any difference! ta Matt", 
      "date": "2008-04-26 13:53:00", 
      "id": 3898, 
      "responses": 5, 
      "subject": "Mac Support - help!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4277"
    }, 
    {
      "body": "Out of interest, is anyone experiencing problems with broadband at the moment?  My ISP is working with BT, checking back to the exchange, but I know at least one other person who has lost theirs too. Just wondering if it's coincidence or more widespread.  Don't you just hate dial-up?", 
      "date": "2006-03-05 20:38:00", 
      "id": 4607, 
      "responses": 5, 
      "subject": "Broadband problems?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2112"
    }, 
    {
      "body": "I know there are previous threads on this topic but I am still confused, apologies for being so stupid! We have just had  BT phone line connected, and I am now trying to find out which broadband connection is best for me. However both BT and Wanadoo are saying that my number is not recognised. I have phoned BT and they say that the line is OK.  I am confused as to what to do next!", 
      "date": "2006-01-10 12:00:00", 
      "id": 3032, 
      "responses": 4, 
      "subject": "Internet connection", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2025"
    }, 
    {
      "body": "Hello people, I am moving to the Barbican this week after an exciting 5 months wrangling with estate agents etc. At last! Where i currently live I get broadband (cable modem), Cable TV and phone from NTL.    It seems that NTL do not supply this bundle in the Barbican. I was wondering what people typically did. Do people normally get cable via this communal Sky TV set up? I hear broadband has to be over the phone line - what do people tend to use - ISDN? ASDL?    And most importantly what supplier do people recommend for broadband in the Barbican.  Any recommendations much appreciated! kind regards Hal", 
      "date": "2006-04-24 12:38:00", 
      "id": 3067, 
      "responses": 4, 
      "subject": "Broadband Recommendations?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2217"
    }, 
    {
      "body": "Has anyone had any success getting broadband recently?  Apparently BT need to instal new equipment at the Moorgate exchange and the \"review date\" on whioch they will decide [i]when[/i] they can do this isn't till 5 March. D", 
      "date": "2008-02-25 13:07:00", 
      "id": 3518, 
      "responses": 4, 
      "subject": "Broadband", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4059"
    }, 
    {
      "body": "We have broadband internet via Bulldog which I think has been taken over by Pipex. I have noticed that if I make a telephone call while on the internet the internet signal (although remaining active through the duration of the call) will be broken as soon as I end the call. It is then some minutes before the internet becomes active again. Is this normal? Many thanks  Joe", 
      "date": "2008-02-27 18:11:00", 
      "id": 3520, 
      "responses": 3, 
      "subject": "Internet...yet again", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4066"
    }, 
    {
      "body": "I want to upgrade my phone line to broadband.  My flat has phone/ethernet wiring running from a wiring closet to all rooms in my flat.  I suspect that the best thing would be to put the modem/router in the wiring closet. Does anyone know a firm/person who can do telephone/computer wiring?", 
      "date": "2008-02-20 22:13:00", 
      "id": 3831, 
      "responses": 3, 
      "subject": "Telephone wiring", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4043"
    }
  ]
}