{
  "summary": [
    {
      "body": "any comments on the following neighbour dilemma? New people moved in next door recently and they have  a child who's maybe 6 or 7?  Its not his fault and every kid should be able to play, but how far does his right to play overwhelm my right to peace and quiet?  when he plays he shouts, yells, screams, cries - stuifff kiids do I suppose.  at 7.45am on Satursays and sundays too.  I'm quite a quiet person and its really starting to make living next door unbearable.  I mentioned it to the parents and I think they're trying, but they aslo said that he has every right to make noise in their flat and if i wanted quiet i shouldn't live in the middle of a city.  they didn't say it nastily i must add but now i don't know whether to tell them again and risk warring neighbour time or just go to boots and stock up on earplugs. if you've got kids what's your view on this? or what would anyone else do in  this situation to make living in the peaceful barbican peaceful again without causing neighbour war time?", 
      "date": "2006-04-28 17:45:00", 
      "id": 4408, 
      "responses": 67, 
      "subject": "neighbours children", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2236"
    }, 
    {
      "body": "Hello I am an interloper so I hope it's okay to ask this.  I don't live in the Barbican yet and perhaps never will (as you all no doubt know, there is a dearth of properties) but I wondered if any of you would be generous enough to share your thoughts on living there and good points/bad points. I've lived in flats all my life (we currently live near Old Street and hurrah for the new Waitrose even if, yes, some of the staff are very incongruous for JLP) so I know that properties can differ wildly and that it's also a matter of personal choice. But these are the things I'd like to ask (in no particular order): Am I correct in thinking the biggest flats are in the towers? Is it generally a quiet and safe place to live or does it vary wildly from block to block? What's it like for children? The private gardens seem amazing but in reality what's it like? Is the service charge astronomical (I realise it depends on size of flat)? What will happen when all TV goes digital and the Barbican has no digital cable?? Is the listed building classification a pain if you want to do any work in the flat? Garchey, good or bad? Are parking places readily available to rent or is there a shortage? Anything to look for that an outsider may not know about.  I'd be really grateful for any answers. If I can reciprocate in any way...my specialities are fly fishing, beauty products, nutrition and fashion. I know, ecletic and slightly bizarre! Thank you. AB", 
      "date": "2006-06-05 17:37:00", 
      "id": 3180, 
      "responses": 29, 
      "subject": "What's it like living in the Barbican?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2338"
    }, 
    {
      "body": "Residents will be aware that there is a meeting next Thursday to discuss conversion of the top three floors of Frobisher Crescent into flats. If memory serves correctly, the work schedule includes Saturday mornings - although I am not sure if this includes noisy works (?). Do other residents consider weekend work reasonable given the identity of the site owner and the restrictions accepted by Barbican residents on works in their own flats? It seems fair to me for us to ask for assurances on this issue ....", 
      "date": "2008-05-09 14:08:00", 
      "id": 3697, 
      "responses": 14, 
      "subject": "Frobisher Crescent - conversion - building work on Saturdays", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4317"
    }, 
    {
      "body": "Hello everyone,  We love the Barbican and have been renting here for a while but now want to buy. However the price of the apartments here are astronomical (and we are looking for a 2 bed flat). We have noticed though that the Golden Lane flats seem to be a lot cheaper. But what is it actually like to live there? Ok I am not expecting it to be as fabulous as the Barbican (chiefly because I suspect nowhere can be!) but what is it like in terms of safety, in terms of neighbours, in terms of flat construction (ie noise problems?), in terms of Estate Office responsibility (ie they are very responsive to Barbican dwellers - is it the same with Golden Lane?). Are there any communal areas like the Barbican Gardens? What is the mix of residents like? Any views or information, positive or negative is welcomed!", 
      "date": "2006-06-19 20:10:00", 
      "id": 4431, 
      "responses": 7, 
      "subject": "What's it like living in Golden Lane Estate?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2378"
    }, 
    {
      "body": "I can hear hammering under Speed House. It starts around 8am. Any ideas what it could be? I thought it was the road resurfacing, but that's long finished. It sounds like machinery rather than someone doing DIY. Tube engineering work?", 
      "date": "2006-09-30 07:53:00", 
      "id": 4298, 
      "responses": 5, 
      "subject": "Hammering Speed House", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2642"
    }, 
    {
      "body": "Can anyone else in BJH hear a low, rasping, drilling sound  metal against concrete? It's definitely within the building, not from the school works behind, but I can't work out where it's coming from. It happens quite a lot.", 
      "date": "2006-09-07 12:10:00", 
      "id": 4482, 
      "responses": 5, 
      "subject": "Ben Jonson House drilling", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2583"
    }, 
    {
      "body": "Does anyone know where the loud thumping music which I could hear all Sat & Sun evenings in Mountjoy house is coming from? Sounds like it's from outside the building but I couldn't pinpoint where. Just about coped Saturday but last night was awful.", 
      "date": "2007-09-24 06:42:00", 
      "id": 3382, 
      "responses": 4, 
      "subject": "Music late at night", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3684"
    }, 
    {
      "body": "I'm in Defoe, being kept awake by the base of some very loud music somwhere. Can anyone else hear it?", 
      "date": "2007-12-30 00:32:00", 
      "id": 3489, 
      "responses": 4, 
      "subject": "Loud music", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3892"
    }, 
    {
      "body": "Can anyone please advise what the procedure is for sorting out neighbours with noisy plumbing - as ever it is so hard to know which flat is actually responsible for the noise.  At the moment when one of our neighbours (unsure which) runs their water taps we hear a loud whining noise throughout our flat - the noise seems to be getting worse too. Has anyone else experienced a similiar problem? Is this something the Corporation can deal with - how will they identify the flat?", 
      "date": "2006-08-19 12:15:00", 
      "id": 3162, 
      "responses": 2, 
      "subject": "Noisy Plumbing", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2540"
    }, 
    {
      "body": "I'm sure I could hear something like thunder early on Saturday morning - weekend working on the underground? a delivery of Organic Morello Cherry Preserve to Waitrose? I do the City can stop this.", 
      "date": "2006-09-30 18:15:00", 
      "id": 4278, 
      "responses": 2, 
      "subject": "Sound like Thunder near Bretton House", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2645"
    }, 
    {
      "body": "I'm a bit thick when it come to things like this, so perhaps this is a really obvious GCSE-level plumbing question but... i've noticed that over the past few weeks, the hot water tap in my bathroom has been making a funny whistling sound when it's turned on - like a pressure sort of noise. When it's turned on full blast, the noice disappears. What does this mean? and how can i fix it, as it's quite annoying at times, especially as it's begun to drown out the wonderful sounds of me singing in the shower...", 
      "date": "2006-11-07 21:58:00", 
      "id": 3200, 
      "responses": 1, 
      "subject": "Hot water noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2739"
    }, 
    {
      "body": "Music, Bob Dylan, wafting on the breeze. Does anyone know where it's coming from? Shakespeare Tower? The times they are a changing indeed.", 
      "date": "2007-07-19 20:10:00", 
      "id": 4047, 
      "responses": 1, 
      "subject": "Noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3519"
    }
  ]
}