{
  "summary": [
    {
      "body": "I'm looking to get hold of 3 x original Barbican Kitchen power switches and 1 x light switch, if anybody is getting rid of theirs please do let me know. Thanks.", 
      "date": "2005-01-14 10:48:00", 
      "id": 2941, 
      "sentiment": 2, 
      "subject": "Barbican original kitchen light and power switches", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1419"
    }, 
    {
      "body": "2 pleas for help: 1) Does anyone know of someone who can access some old files on our former computer and make a CD of them to download to our new computer? 2) Re the old computer, does anyone know if there are any charities who might want it (it is pretty old...) Thanks", 
      "date": "2005-07-30 17:06:00", 
      "id": 2948, 
      "sentiment": 2, 
      "subject": "New computer/old computer - help please!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1772"
    }, 
    {
      "body": "Are there any Mac users out there in Barbicanland who could make a suggestion for solving the following problem? Last night, I left my computer sending a rather large 3mb email. When I returned to it the Mail icon was bouncing away in the Dock, the mail hadn't been sent and the activity bar was showing the spinning wheel and the activity 'Copying message.....'. It carried on spinning away for ages so I tried to quit, Mail wouldn't respond to my attempts to quit, so I Force Quit. Restarted, opened mail, and now the activity bar permanently shows 'Reading mailbox file..' and the spinning wheel is whizzing away. I can't quit Mail now and have to Force Quit every time. I've tried opening the Activity Viewer and stopping the action (it says STOPPING, but doesn't stop) and I've run First Aid in Disk Utility, no help) What's going on? Any ideas? I'm so distressed, my Mac is so well behaved usually!  ", 
      "date": "2005-08-05 12:37:00", 
      "id": 2958, 
      "sentiment": 2, 
      "subject": "Mac Mail problem - any ideas?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1788"
    }, 
    {
      "body": "does anyone have any tips on companies/people able to help with moves across the barbican? I'm moving from Andrewes to Brandon Mews, it seems silly to get a full-on moving firm for a move of 200 m and 3 floors, especially since I'll only really need help for a few items of furniture. Alternatively if anyone fancies volunteering for the weekend of the 23rd July, I'll pay in wine.", 
      "date": "2005-07-02 10:24:00", 
      "id": 2973, 
      "sentiment": 2, 
      "subject": "moving across the barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1721"
    }, 
    {
      "body": "It's 6 weeks since I moved house and Plusnet still hasn't managed to give me a working broadband connection. Is there anyone living near Brandon Mews who wouldn't mind me squatting on their wireless network for a while until they sort it out? Networks I can see from my flat are NETGEAR, JamesMHughes, CROMWELL and several others which appear and disappear throughout the day.", 
      "date": "2005-08-26 10:11:00", 
      "id": 2981, 
      "sentiment": 2, 
      "subject": "Broadband blues", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1819"
    }
  ]
}