{
  "summary": [
    {
      "body": "Today Friday July 22 the mains water supply has been off here in Andrewes since at least 0945 and is still off as I write at 21:15.  I have phoned Thames Water twice who the first time said no report showing, on the second occasion some hours later said after a short delay that a mains supply problem had occurred. I have experienced several mains water outages here. In particular there has been a group of outages in the last week or two of which I've noted these:- - 0945 BST Friday 22 July 2005 - no mains water still as of 21:15. - 12.42 BST Monday 18 July 2005. - 14:55BST Sunday 17 July 2005. - noon BST Thursday 14 July 2005, restored at ~1345; Anybody else having similar problems (frequency, dates/times)?  I am just trying to get a handle on whether this flat is particularly accident prone when it comes to utilities supply dependability or whether instead the problem lies further afield.", 
      "date": "2005-07-22 20:20:00", 
      "id": 4703, 
      "responses": 18, 
      "subject": "mains water disruption again", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1756"
    }, 
    {
      "body": "I wonder if anyone could advise me on this. I live on the 5th floor of BJH, and over the last few days the water pressure in the bathroom has dropped considerably such that now the shower is just trickling. Was told by someone from the estate office to ask for a plumber. However, all the taps seem to be affected so I doubt it's a plumbing/ leakage issue. Is it something I need to ask Thames Water about?", 
      "date": "2005-07-20 19:06:00", 
      "id": 4702, 
      "responses": 9, 
      "subject": "low water pressure", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1753"
    }, 
    {
      "body": "I am at the south end of Willoughby House...  I am vaguely aware of how plumbing systems work, but this one has me utterly baffled.  Yesterday afternoon, I noticed that my loo was flushing using hot water (hot enough to be steaming).  And no I havent been making more frequent trips to Chawol. At first I thought I was going mad but it really seems to be true.  I don't know how this could be.  I did, however, hear some plumbing work going on at some point towards the end of last week as it reverberated through the communal service ducts.  Is it possible someone somewhere has done something strange with some pipes?! Any help or suggestions greatfly appreciated!", 
      "date": "2007-09-03 11:02:00", 
      "id": 3423, 
      "responses": 7, 
      "subject": "Toilet flushing with hot water", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3627"
    }, 
    {
      "body": "Anybody else experiencing this??", 
      "date": "2008-03-20 18:09:00", 
      "id": 3824, 
      "responses": 6, 
      "subject": "No water in Andrewes?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4145"
    }, 
    {
      "body": "Yesterday, when I turned on any of the cold taps, or flushed the loo, there was a strange rattling, gurgling noise the first time, as if the pipes were empty and were filling up. After the first time each, they worked fine. But now we can't seem to change the temperature of our shower - it's either hot or (when we turn the hot tap off entirely) cold. We can't seem to mix the hot and cold. I'm wondering if it means the cold water pressure has dropped and so the hot water, under greater pressure, won't let it through. Anyone else found this? What could be causing it? Having showers that are only way too hot or freezing cold is no fun!", 
      "date": "2006-09-13 09:38:00", 
      "id": 4485, 
      "responses": 4, 
      "subject": "Cold water problems?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2596"
    }, 
    {
      "body": "I have signs of water leaking in to my ceiling, but the people upstairs say they can't find any problem? Any suggestions as to what I do now? If water is coming in through upstair flat's window frames, is it the Corporation's problem? Anyone know? Advice welcomed, thanks", 
      "date": "2006-04-29 10:52:00", 
      "id": 3076, 
      "responses": 3, 
      "subject": "water leak", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2237"
    }, 
    {
      "body": "Is it me or is it since the roof works that we have had more flooding in our palaces? I believe that since the roof works and the water drainage system being \"redirected\" on the 6th floor balconies, we are getting flooded every time. Who would like to support my campaign for a real architect and building firm (not a bunch of lads off a boat from Gdansk) to look at the works, along with English Heritage to see if it can be rectified? ..and if I hear from our Estate office that it is to do with Global Warming or Al Gore from I might slap someone. D07", 
      "date": "2007-07-22 23:21:00", 
      "id": 3385, 
      "responses": 3, 
      "subject": "Ben Jonson Campaign", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3530"
    }, 
    {
      "body": "Anyone notice the mains water in Ben Jonson behaving oddly this morning? Was it turned off during the night or something? My kitchen cold tap spat 'orribly at me first thing and the hot just didn't work for a few seconds.  ", 
      "date": "2008-05-13 08:24:00", 
      "id": 3579, 
      "responses": 3, 
      "subject": "Mains water in BJH", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4332"
    }, 
    {
      "body": "Not only has the mains water supply been off here since 0915 yesterday, Wednesday, but as of now (0800 Thursday) nothing coming out of the hot water tap in the bathroom and a reduced flow from the cold (suggesting this is just residue left in local pipework).  Indications are that TW have not maintained enough pressure to replenish the storage tanks overnight. Meantime on a call last night to TW I was told that unless I could show more than one building was affected, the problem possibly lay with pipes/pumps on the Estate(!) There have been problems before with the mains pipework in the Moor Lane/Fore Street vicinity.  Given the numbers of those affected when these outages occur and given the proposals for redevelopment at Milton Court/Frobisher I wonder if it is time that TW surveyed the entire local mains in that vicinity to establish whether it is in a condition to support the local density of population both actual and proposed.", 
      "date": "2007-02-08 08:12:00", 
      "id": 4222, 
      "responses": 3, 
      "subject": "The mains water outage affecting Andrewes, Gilbert & Bra", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3046"
    }, 
    {
      "body": "Anyone else have brown mains water in Ben Jonson, seems to have just started this morning....", 
      "date": "2007-04-21 10:27:00", 
      "id": 4389, 
      "responses": 2, 
      "subject": "Brown Mains water in ben jonson", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3251"
    }, 
    {
      "body": "don't know if anyone experienced similar strange happenings with the water system last night....  at around 11pm the cold water in my bathrooms was extremely hot, to the point of boiling! also the water flushing the loo was piping hot (judged by steam, rather than hand down loo before you ask....) couldn't work out what was going on but then as mysteriously as it had come on, the water grew colder til back to normal", 
      "date": "2006-05-25 13:03:00", 
      "id": 4396, 
      "responses": 1, 
      "subject": "Weird goings on with water", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2316"
    }, 
    {
      "body": "A few weeks ago I received a letter from the estate office regarding a water hammer in our area of Seddon House. I've only just got around to telling them it's not our problem, but I was wondering if anyone in Seddon hears this as well? I do hear some faint, intermittent tapping very late at night - around midnight or so - which can get a little annoying, but I imagine that it is particularly loud for whoever complained about it. Is that what the sound is? Also, at around 7.30 or 8am (on the dot) I hear some hammering but I think it's the people doing the office refurbishment sneaking in early instead and making noises. It sounds like it's coming from above me but I think that's an 'illusion' (although I can't see it, only hear it!). Also, I found this on the internet: Water Hammer Formula:    P = (0.070) (V) (L) / t + P1         Where  P = Increase in pressure               P1 = Inlet Pressure                V = Flow velocity in ft/sec                t = Time in sec.(Valve closing time)                L = Upstream Pipe Length in feet", 
      "date": "2005-05-27 13:33:00", 
      "id": 4721, 
      "responses": 1, 
      "subject": "Water hammer", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1649"
    }
  ]
}