{
  "summary": [
    {
      "body": "I saw that in today's CityAM paper that Wallside has been featured following the buyout of the lease from the Corporation of London (or whatever they are now) to freehold. According to some this adds 30K to this type of property. Mind you they have a valuation of between 1m and 1.2m", 
      "date": "2006-01-12 11:57:00", 
      "id": 3040, 
      "sentiment": 1, 
      "subject": "Leasehold", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2030"
    }, 
    {
      "body": "How much do local newsagents charge for delivering daily papers?", 
      "date": "2006-04-30 11:01:00", 
      "id": 3078, 
      "sentiment": 1, 
      "subject": "Home Newspaper Delivery", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2239"
    }, 
    {
      "body": "I'm in the process of buying a flat in the Barbican. There is no mortage lender involved, and hence it is not strictly necessary to get a survey done. What are other members experiences of building surveys in the Barbican? Have you bothered? Have they shown up anything of use? Which type have you gone for: the cheaper Homebuyers Valuation And Survey Report or the full Building Survey?", 
      "date": "2006-04-20 15:41:00", 
      "id": 3099, 
      "sentiment": 1, 
      "subject": "Building Survey", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2209"
    }, 
    {
      "body": "Dear residents, Went to Steven Dossou-Yovo's \"Perspectives\" exhibition yesterday at Smithfield Gallery (next to Carluccio's) and thought it was great. His stuff fits with the Barbican-walls look perfectly, so if you're in the market, go and take a look. Prices not too over the top. Worth a look anyway. That's all.", 
      "date": "2007-06-07 10:11:00", 
      "id": 3339, 
      "sentiment": 1, 
      "subject": "Smithfield Gallery - recommended exhibition", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3403"
    }, 
    {
      "body": "Hello good Barbican people I am considering renting out my second bedroom and was wondering if anyone could tell me roughly what the going rate is?   (It is a good sized double with lots of wardrobe space; shared bathroom / separate loo; large living room, dining room, study.  Washing machine, dishwasher, tumble dryer.  To include all bills, wifi internet etc.) Thank you in advance Tom", 
      "date": "2007-08-07 08:05:00", 
      "id": 3394, 
      "sentiment": 1, 
      "subject": "Going rate for renting out a room?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3567"
    }
  ]
}