{
  "summary": [
    {
      "body": "My washing machine has been failing to drain at the end of the cycle, so using a recommendationon this site, I contacted 1st Call. Their engineer came yesterday and fitted a new pump and declared that it was now draining properly. There was a call out charge of 55 pounds + 46 for the pump + VAT, total 121 pounds, which I was happy to pay because the service was prompt, polite and apparently efficient. When I came to do my first post-repair wash the drum ended up as before, with the clothes swimming in murky water! I phoned 1st Call, spoke to the engineer and he suggested running the rinse and spin cycle with the garchey raised, to find out if drainage from the garchey bowl was the source of the problem. That seems to do the trick! I'm pretty gutted at forking out over 100 quid unnecessarily, but I wonder if anyone else has had the same problem and why did it suddenly start behaving in this way? I shall be contacting the garchey engineers to see if they can sort it out for me.", 
      "date": "2008-01-01 23:40:00", 
      "id": 431, 
      "sentiment": 2, 
      "subject": "Washing machine problem", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3897"
    }, 
    {
      "body": "Does any one have any idea how much the lower garden flats (the studios) go for in Thomas More? i've never seen inside one, but i like the idea of living in one - does anyone know what they're like inside? Do they actually ever come on the market - i have never seen one for sale - or do the people that live there love them so much they never move?", 
      "date": "2005-08-28 20:19:00", 
      "id": 2985, 
      "sentiment": 2, 
      "subject": "Thomas More Garden Studio Flats", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1823"
    }, 
    {
      "body": "We currently have an old style kitchen, which we'd like to re-furbish back to it's former glory, as it is looking a bit tired. However my question is , is it worth trying to source all the bits and pieces, as nothing is made anymore. Would it be better financially in the long run to install a new kitchen in a modern style in-keeping with the streamlined 60's/ 70's white feel that the originals have? Does anyone have experience of whether this would add value or lessen it?  It does seem that many people are now getting fed up of the crankiness of the old kitchens , and maybe new buyers would also prefer this as they may find out how difficult it is to repair / source original fittings. So is it worth spending money on re-furbishing the original....or on completely re-fitting in a suitable 'in-keeping with' style?", 
      "date": "2005-08-02 13:09:00", 
      "id": 2989, 
      "sentiment": 2, 
      "subject": "Kitchen Dilemma", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1778"
    }, 
    {
      "body": "We're considering letting a small flat in the Barbican as a second property but have no experience of this kind. Does anyone have some advice for us, say, on agents or tax issues to watch out for? Many thanks.", 
      "date": "2005-12-19 10:20:00", 
      "id": 3013, 
      "sentiment": 2, 
      "subject": "Advice on letting", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1994"
    }, 
    {
      "body": "I just been to Crispins, admittedly on a Sunday and a 400gm white loaf cost me 99p. An 800 grm white loaf in Tesco Express costs 38p. Roll on the new Tesco in Aldersgate Street, can't wait!!", 
      "date": "2006-08-13 14:01:00", 
      "id": 3147, 
      "sentiment": 2, 
      "subject": "Crispins", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2525"
    }
  ]
}