{
  "summary": [
    {
      "body": "Hi there Apologies in advance for making my first post a contentious one. We have been thinking about moving to the Barbican for some years. In 2003 it was possible to buy a split level 1 bed flat for about 275K. Unfortunately, for various reasons, we did not take this opportunity. Similar flats now appear to be on the market for 400K and over. Studios for 300K. I would like to ask longer-term residents: do prices tend to reflect the ups and downs of the stock market and the fortunes of the City? Did the prices of Barbican flats fall in the last recession, or did they hold up? If prices continue on their upward spiral, I guess we will have to give up the idea of ever moving here. A third of a million pounds for a single room is a bit steep, even if it's in the best place to live in London! Best wishes to all.", 
      "date": "2006-08-24 11:23:00", 
      "id": 3471, 
      "responses": 49, 
      "subject": "Barbican flat price fluctuations?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2555"
    }, 
    {
      "body": "Past experience suggests that the Frank Harris estate agency acts as a good indicator of Barbican property.  Property hard to sell and prices on the low side = politeness and smiles to all potential buyers.  Property scare and prices on the way up = snotty attitude.  Snottiness at Frank Harris is now reaching such extreme levels it could indicate a turn in the market.  Or maybe I'm just generally less tolerant of rudeness and snotty behaviour than I used to be - obviously getting spoiled by Waitrose.", 
      "date": "2006-07-07 14:51:00", 
      "id": 3247, 
      "responses": 25, 
      "subject": "Frank Harris snottiness barometer", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2436"
    }, 
    {
      "body": "I just spotted on Frank Harris' website that prices for Barbican flats are up. So does this reflect a real increase, with the Barbican bucking the trend for the rest of London, or is that estate agent overvaluing?", 
      "date": "2005-05-23 15:32:00", 
      "id": 4726, 
      "responses": 23, 
      "subject": "property prices", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1644"
    }, 
    {
      "body": "I have just received my Thames Water bill for 2006/07, which has now climbed to 644, and represents a huge increase over the past few years.  I note that there is a process whereby one can apply for a water meter, which I presume in Barbican flats cannot be fitted (?), and then be offered an alternative charging basis, called the 'Average Household Charge'.    Questions that spring to mind: Has anybody gone through this process (especially in a tower flat, like mine)?   Can Thames Water fit meters, or do you end up with the Average Household Charge?  Does it in fact lead to lower water bills?  Any information/thoughts would be gratefully received.  Thanks.", 
      "date": "2006-02-21 10:18:00", 
      "id": 4604, 
      "responses": 16, 
      "subject": "Water Bills/Tower Flats", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2095"
    }, 
    {
      "body": "We currently have an old style kitchen, which we'd like to re-furbish back to it's former glory, as it is looking a bit tired. However my question is , is it worth trying to source all the bits and pieces, as nothing is made anymore. Would it be better financially in the long run to install a new kitchen in a modern style in-keeping with the streamlined 60's/ 70's white feel that the originals have? Does anyone have experience of whether this would add value or lessen it?  It does seem that many people are now getting fed up of the crankiness of the old kitchens , and maybe new buyers would also prefer this as they may find out how difficult it is to repair / source original fittings. So is it worth spending money on re-furbishing the original....or on completely re-fitting in a suitable 'in-keeping with' style?", 
      "date": "2005-08-02 13:09:00", 
      "id": 2989, 
      "responses": 14, 
      "subject": "Kitchen Dilemma", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1778"
    }, 
    {
      "body": "I see today that Frank Harris have a couple of 1 beds, one in BJH , on for 400K  and above  I'm astounded by this,  are they really shifting flats at this level???  Is it all because of Waitrose??", 
      "date": "2007-02-12 13:55:00", 
      "id": 4388, 
      "responses": 14, 
      "subject": "Flat Price Shock", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3056"
    }, 
    {
      "body": "My washing machine has been failing to drain at the end of the cycle, so using a recommendationon this site, I contacted 1st Call. Their engineer came yesterday and fitted a new pump and declared that it was now draining properly. There was a call out charge of 55 pounds + 46 for the pump + VAT, total 121 pounds, which I was happy to pay because the service was prompt, polite and apparently efficient. When I came to do my first post-repair wash the drum ended up as before, with the clothes swimming in murky water! I phoned 1st Call, spoke to the engineer and he suggested running the rinse and spin cycle with the garchey raised, to find out if drainage from the garchey bowl was the source of the problem. That seems to do the trick! I'm pretty gutted at forking out over 100 quid unnecessarily, but I wonder if anyone else has had the same problem and why did it suddenly start behaving in this way? I shall be contacting the garchey engineers to see if they can sort it out for me.", 
      "date": "2008-01-01 23:40:00", 
      "id": 431, 
      "responses": 13, 
      "subject": "Washing machine problem", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3897"
    }, 
    {
      "body": "Hi, could anyone let me know membership fees for Virgin gym at Barbican or City point gym? Have looked on both websites & neither seem to advertise prices. I enjoy classes & swimming but don't particularly use the exercise machines. Any other recommendations locally? Thanks", 
      "date": "2007-10-02 06:44:00", 
      "id": 3448, 
      "responses": 13, 
      "subject": "Gym membership", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3703"
    }, 
    {
      "body": "Can anyone recommend a kitchen design/ installer? I'm looking for a total service including minor building works and tiling with a budget of around 15k. I've seen the Carden Interiors website but no indication of price. Failing any suggestions, it'll be a weary trek up and down Wigmore Street next week!", 
      "date": "2006-05-14 09:49:00", 
      "id": 3781, 
      "responses": 13, 
      "subject": "Kitchens", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2289"
    }, 
    {
      "body": "Sorry that my list below doesn't tabulate properly when it is submitted.  perhaps there is a way, but I don't know it - but I think most readers can work it out! We see from time to time assertions that Waitrose is far more expensive than other supermarkets, but never backed up by hard data.  So, in the interests of good Barbican citizenship I decided to conduct a comparison with the Somerfield by Old Street Station.  The results may surprise some of you - particularly Romi who claims never to have been in Waitrose because it is too expensive.  I compiled a fairly random shopping list and priced it first at Somerfield.  Had to knock a few items off my list because they weren't available.  Then I looked at the same products at Waitrose.  Here are the results: Item                          Som Price/        Wait price/          Wait price diffnce Davidstow Cheddar/      9.40/kg /            8.55/kg /           -0.85/kg/ Colgate Total t'paste /     2.19 /                  1.99/              -0.20/ Persil liquid (1.5l) /         3.49/                   3.25 /             -0.24/ Lurpak spreadable  /       1.09 /                   1.04  /            -0.05/ Lurpak lighter  /              1.19 /                  0.99  /            -0.20/ Little Gem lettuce (2) /      0.69  /                  0.65 /             -0.04/ Cheapst sliced W'meal bd /0.99  /                  0.86  /           -0.13/ Bananas /                        .99/kg /                .89/kg /      - 0.10/kg Kitch Towels (Bountyx2) / 1.69*  /               1.49   /          -0.20 Basmati Rice (kg) /           1.09 /                   .99  /           -0.10 Pepsi - bottle  /                 1.54  /                1.36  /           -0.18 Heinz baked beans  /         0.50  /                0.43  /           -0.07 Heinz Spaghetti  /             0.53  /                 0.40  /          -0.13/ Weetabix (48)  /               3.09  /                 2.78  /          -0.31/ Milk  /                                .34  /                  .33  /          -0.01 2l Evian  /                          .77  /                  .85  /          +.08 Chick Breast fillets  /         7.13/kg*           9.99/kg /       +2.83/kg Pork Chops  /                   3.80/kg             4.99/kg  /      +1.19/kg 6 Free Range Eggs (Lg)  /  1.07   /              1.13  /            +0.06 *=Special Offer So - from the above, meat looks to be quite a lot more expensive at Waitrose - most other things are not, although I suspect if one dug down into the fresh veg, Waitrose may also be more expensive.  But the disparities on some of the other items are perhaps surprising.  None of the items picked at Waitrose were on special offer.  I also appreciate that Somerfield is not the cheapest of Supermarkets, but the idea that people would be priced out because of Waitrose replacing Somerfield is patent rubbish!  If you're worried about cost - source your meat elsewhere, otherwise you might just as well use Waitrose", 
      "date": "2006-07-28 12:59:00", 
      "id": 3135, 
      "responses": 12, 
      "subject": "Waitrose more expensive? - The facts", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2486"
    }, 
    {
      "body": "I saw that in today's CityAM paper that Wallside has been featured following the buyout of the lease from the Corporation of London (or whatever they are now) to freehold. According to some this adds 30K to this type of property. Mind you they have a valuation of between 1m and 1.2m", 
      "date": "2006-01-12 11:57:00", 
      "id": 3040, 
      "responses": 11, 
      "subject": "Leasehold", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2030"
    }, 
    {
      "body": "I can't believe that I have just heard that a Type 25 in Mountjoy went on Friday within 15 minutes of coming to the market through Hurford Salvi Carr!! Couldn't even get to see it, and asking 650,000!! How can anyone get to buy in this super hot market ?[/b]", 
      "date": "2006-08-16 12:13:00", 
      "id": 3160, 
      "responses": 11, 
      "subject": "Property moving So FAST!!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2530"
    }, 
    {
      "body": "I had to pay SCI 500 for the installation of a Sky Plus box - the one with the higher capacity of 100GB. Just wondering if anyone else has had experience with SCI installing a Sky Plus, and if this is a reasonable going rate?", 
      "date": "2006-04-14 13:42:00", 
      "id": 4239, 
      "responses": 10, 
      "subject": "Installation of Sky Plus", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2199"
    }, 
    {
      "body": "Hello good Barbican people I am considering renting out my second bedroom and was wondering if anyone could tell me roughly what the going rate is?   (It is a good sized double with lots of wardrobe space; shared bathroom / separate loo; large living room, dining room, study.  Washing machine, dishwasher, tumble dryer.  To include all bills, wifi internet etc.) Thank you in advance Tom", 
      "date": "2007-08-07 08:05:00", 
      "id": 3394, 
      "responses": 8, 
      "subject": "Going rate for renting out a room?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3567"
    }, 
    {
      "body": "Hello! I am looking for a flat share. It is the first time in my life and I have no clue of how it works. Is Golden lane cheaper?  Thanks for all Strawby", 
      "date": "2008-01-08 05:36:00", 
      "id": 3550, 
      "responses": 8, 
      "subject": "How do I find a flat-share?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3914"
    }, 
    {
      "body": "Further to comments by Maximus regading the roofs visible in the recent Barbican Photo published by the Guardian, one wonders whether the Barbican Estate could - with careful planning and some investment - achieve a 'zero carbon' certification.  Not only would this be environmentally sensitive but could also result in exemption from stamp duty for homes under 500,000.  Does anyone think this might be worth exploring?", 
      "date": "2007-03-22 16:56:00", 
      "id": 4247, 
      "responses": 8, 
      "subject": "Zero Carbon Homes", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3172"
    }, 
    {
      "body": "Please could someone give me an idea of how much a parking bay in the Shakespeare Tower/Defoe car park might sell for?", 
      "date": "2007-03-28 14:39:00", 
      "id": 4350, 
      "responses": 8, 
      "subject": "Going rate for car park bay?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3187"
    }, 
    {
      "body": "Noticed today on Frankharris a couple of benchmark type 20/21s going for 575-620k: if my memory is right, this is 50k less than the asking price about 2 months ago.  Are we over the top and on the way down now?", 
      "date": "2007-12-07 14:40:00", 
      "id": 4173, 
      "responses": 7, 
      "subject": "Barbican property prices down?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3856"
    }, 
    {
      "body": "Dear all,  I am considering buying a large studio (currently renting one). I am doing my \"price discovery\" howework now. There are records of sold prices at nethouseprices.com. However, only flat numbers and prices are available. For example,  Abcd Court, Flat 123, 234,000, 01-Jan-2007. What is the easiest way to determine flat type (e.g., F2B) given flat number? Calling into each of the flats in the appropriate price range and asking \"what is your flat type, please?\" is probably not such a great idea... (I personally would not mind if someone called into my flat with such a question, but this does not mean that I can bother others...) Would the Estate Office be able to provide such information? Or could you recommend another source, please? Thank you.", 
      "date": "2007-02-01 12:06:00", 
      "id": 4216, 
      "responses": 7, 
      "subject": "Block + Flat number ---> Flat type?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3000"
    }, 
    {
      "body": "Hey all a year ago, I managed to get my contents insurance through Sainsbury's bank for the princely sum of GBP 158 . This included the usual new for old, specified items above a grand each, no top limit of total value, legal insurance and a couple of other bells and whistles. This year, having made no claim in the last 12 months (nor in the last 12 years), the scheming rotten mean old sods want GBP 262 for the same cover (2 bed in Cromwell). Could anybody recommend a decent home insurer based on recent quotes ? ta Matt", 
      "date": "2006-12-04 16:11:00", 
      "id": 3303, 
      "responses": 6, 
      "subject": "Contents insurance....", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2799"
    }, 
    {
      "body": "Can anyone recommend someone who can make very beautiful curtains quickly?  Curtains I currently have were made by Interior Options and I am happy with their work but would like to price competition also.   Thanks, JB", 
      "date": "2007-01-15 11:10:00", 
      "id": 4138, 
      "responses": 6, 
      "subject": "Curtains", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2911"
    }, 
    {
      "body": "We have just received from EDF Energy the annual review of our monthly direct debit payment. At the end of the year we owed 25 and it was proposed to increase our monthly direct debit by 8 - 96 in the year to come. After a lengthy freephone call, this was reduced after much haggling to an additional 5 a month - 60 a year. EDF have been overestimating our direct debits in this manner for some years and I once raised the matter with Ofgen. We now contemplate looking for another supplier and will be interested in others' experience of EDF and any other suppliers and any suggestions for an alternative supplier and problems in switching suppliers. Help!  PS. We wish the French SNCF had taken over running our railways rather than dabbling in electricity supply.", 
      "date": "2007-05-01 11:41:00", 
      "id": 4321, 
      "responses": 6, 
      "subject": "Electricity charges", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3289"
    }, 
    {
      "body": "I moved here six months ago and have had two very high electricity bills.  The original oven would appear to be the culprit.  Have those of you who have replaced the original oven noticed a significant reduction in their bills?", 
      "date": "2007-10-20 10:44:00", 
      "id": 3455, 
      "responses": 5, 
      "subject": "Original oven", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3736"
    }, 
    {
      "body": "I am renter, and am wondering if there are manhy people here who have rented their flats over a long period of time, say five or ten years.  If so, what is the usual rent increase each year? Have you found it to be a safe and convenient way to live?  I have assumed I would buy as soon as something came up that I could afford (a large studio), but now am settling into the rental, and wondering if its nuts to stick to this way of life.", 
      "date": "2006-09-19 20:33:00", 
      "id": 4497, 
      "responses": 5, 
      "subject": "Renting in the Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2612"
    }, 
    {
      "body": "Hi - I've a strange question perhaps. I live in Ben Jonson and don't know where my electricity meter is. I've been getting estimated bills since I moved in and they seem high at 80 per month so I'd like to take an actual reading. Can anyone tell me where to find the little devil? Thanks", 
      "date": "2005-05-30 19:48:00", 
      "id": 4746, 
      "responses": 5, 
      "subject": "Electricity Meter reading", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1653"
    }, 
    {
      "body": "Thames Water has sent me a letter asking the size of the flat in order to assess next year's rates 'because we were unable to fit a meter at your property when you requested on'.   I understood we all had some sort of fixed rate because it is not viable to fix meters here.  Was just wondering how I should respond?", 
      "date": "2007-07-15 15:50:00", 
      "id": 4043, 
      "responses": 4, 
      "subject": "water rates query", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3498"
    }, 
    {
      "body": "Can anyone please tell me the going rate for a cleaner?  I was thinking of paying 9 an hour.  I don't want to be stingy so would be grateful for information.", 
      "date": "2007-12-06 02:08:00", 
      "id": 4167, 
      "responses": 4, 
      "subject": "Cleaning rates", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3847"
    }, 
    {
      "body": "My dear BarbicanTalk Has anyone ever attempted or indeed had any double glazing panels replaced?  I have 2 which have gone distinctly cloudy.  Is this something that I should approach the Corporation for and is it expensive?! Thank you", 
      "date": "2007-04-23 15:41:00", 
      "id": 4260, 
      "responses": 4, 
      "subject": "Replacing double glazed windows", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3264"
    }, 
    {
      "body": "Also, and I know this is a difficult question - is 170000 a decent price for an F1A studio flat inward facing in John Trundle. Sorry if this is a bit tastless, but I feel this forum is the best place to find out. Max", 
      "date": "2005-10-12 20:47:00", 
      "id": 4440, 
      "responses": 4, 
      "subject": "new resident  - one more question", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1881"
    }, 
    {
      "body": "About time!  I thought Barbican flats were flying off the shelves? There's a few here that aren't shifting, despite being on the market a couple of months. Hopefully if these reductions continue, in a year or two I might finally be able to afford one!", 
      "date": "2007-06-26 10:50:00", 
      "id": 3364, 
      "responses": 3, 
      "subject": "Price reductions in EC2", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3447"
    }, 
    {
      "body": "Hi everyone, I am in early pregnancy stage now.  The bath tub in our flat in andrewes house is 60cm(equal to 2 feet) tall.  Although i am able to get into the bath tub now, i dont think it will be easy for me to do that in a few months time (i am 160cm tall). i am worried it would be slippery and risky. We rent this flat and are planning to ask the landlord permission to change the bath into a walk in shower. We checked with a plumber to change the bath tub into a walk-in shower, and the estimate he gave is around 6000 pounds. My queries are: 1)does all barbican flats have this tall bathtubs. Landlord/estate agent say this is an original bathtub. what does \"original\" mean....size, shape, material..??? 2)How do pregnant women here manage to get in..any tips? 3)Is there any other less expensive solution available? (like power bath tubs that lifts the user and drop in..like those used by elderly people...are they less expensive to replace the existing normal tubs) 4)what is typically done when some modification effort is undertaken. (other than getting permission from landlord, informing estate office and dropping a note to neighbouring flats about the planned work) we plan to ask the barbican estate office for some contacts of plumbers familiar with barbican issues any suggestion or info or pointers would be useful. Thanks", 
      "date": "2006-06-04 18:48:00", 
      "id": 4410, 
      "responses": 3, 
      "subject": "barbican bath tub query", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2336"
    }, 
    {
      "body": "Can any body recommend a favorable insurance company for the contents of a one bed flat in the barbican. Currently I am paying 345 per year from Morethan. Yet I just went online and had a quote for 180 from Norwich Union. They all seem to start at a minimum content value of 60K which I think is enough.", 
      "date": "2006-03-13 12:38:00", 
      "id": 4613, 
      "responses": 3, 
      "subject": "Content Insurance", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2131"
    }, 
    {
      "body": "On Friday the cashier at M&S told me I was entiltled to a free bottle of Cava as i'd spent over 35 on food shopping. I was astonished when checking my receipt yesterday to find she'd charged me 4-99 for the said bottle!  I must start checking my receipts more carefully at the time. It's difficult with 4 bags of shopping and a queue behind you.", 
      "date": "2006-07-02 09:17:00", 
      "id": 3176, 
      "responses": 2, 
      "subject": "M&S \"Free\" Cava!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2422"
    }, 
    {
      "body": "just to let people know ... searcy's has stopped doing its \"prix fixe\" thing except for pre-performances which is stupidly early ... so the food still looks good but its whoppingly expensive - used to be about 26 for 3 courses before but now the mains alone are about 18-  20 ...  shame because the food is great and its so nice and easy to wander over there ...  funnily enough, it was deserted last night ...  on a brighter note, there's a gourmet burger company opening by St Paul's - the only one of the burger outfits that ever gets me eat that quantity of meat, but they really are the best, healthiest, loveliest burgers in town ... they also do a delicious mushroom burger to salve the conscience ...", 
      "date": "2006-11-16 20:46:00", 
      "id": 3216, 
      "responses": 2, 
      "subject": "searcys", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2755"
    }, 
    {
      "body": "Has anyone in one of the large studios acquired made-to-measure venetian blinds recently? I'm contemplating replacing the ready-mades in my flat since they don't cover the 3 small windows across the top, and the fit over the big windows isn't great either. Any info on costings would be very helpful. Many thanks!", 
      "date": "2007-01-22 11:17:00", 
      "id": 3272, 
      "responses": 2, 
      "subject": "Venetian blinds", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2946"
    }, 
    {
      "body": "Have \"bog standard\" type 20/21s now bubbled up to about half a million ? I took my eye of the Frank Harris site for a couple of months and now that's what it seems to suggest. Or have they been lingering on the site for a while ?", 
      "date": "2007-01-22 15:37:00", 
      "id": 4202, 
      "responses": 2, 
      "subject": "flat prices", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2949"
    }, 
    {
      "body": "First of all, please forgive me - I am not actually a resident of the area, but I'm sure all you Barbican inhabitants may be able to answer my question, which is.. Why has the Barbican become so madly popular recently? I have always considered it on and off, and just a month or two ago nearly every estate agent in town had a vast choice of different Barbican properties, but now there is literally not a single property available, and in a tower block with a view... forget it.  It was always the case for years that there were consistently many Barbican properties available, but now they've all gone.  I saw in another thread that someone recommended calling the estate agent on the day they release details of a new sale, and they're quite right!  This has become like trying to buy a property in Primrose Hill! Prices have skyrocketed too, there is currently a tower block apartment for 700,000 (under offer), whilst this time last year tower apartments were about 550,000 with the desirable views, and much less (400k region) with the north (and west?) aspect.  There was a penthouse in one of the tower blocks that sat on the market for about 3 years, but recently it appears that two newly for sale penthouses in tower blocks have been snapped up in about a month. Are you (Barbican residents) noticing more people in the area? Has anything specific brought about these changes, or are people finally opening their eyes to how magnificant the Barbican estate actually is?  Are the original generation of Barbican dwellers (who perhaps have a second home too, out of London) starting to sell up and move out?   Whatever it is, i'm rather annoyed now!", 
      "date": "2006-06-10 12:40:00", 
      "id": 4416, 
      "responses": 2, 
      "subject": "Current mad popularity of Barbican...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2354"
    }, 
    {
      "body": "Today may be an unlikely day to mention solar energy,BUT--does anyone know how much energy could be generated from solar panels or photo-voltaic cells on the available roof space of the Barbican complex. I would think there must be a hectare or so of roof--but I don't know. Has anyone ever investigated this?   Should they?  Would turbines be useful? How much could be saved if the complex was made more energy efficient? Does anyone care?  Should they?  I know that PV cells generate DC, as opposed to AC voltage, and that inverters need to used to convert to AC. there seems to be no objective info on this: it is a morass of propaganda, and difficult to form a conclusion.  Any website references? Or do you just Google \"deluded enthusiasm\"?", 
      "date": "2006-02-12 16:36:00", 
      "id": 4585, 
      "responses": 2, 
      "subject": "Solar panels", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2069"
    }, 
    {
      "body": "Does any one have any idea how much the lower garden flats (the studios) go for in Thomas More? i've never seen inside one, but i like the idea of living in one - does anyone know what they're like inside? Do they actually ever come on the market - i have never seen one for sale - or do the people that live there love them so much they never move?", 
      "date": "2005-08-28 20:19:00", 
      "id": 2985, 
      "responses": 1, 
      "subject": "Thomas More Garden Studio Flats", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1823"
    }, 
    {
      "body": "How much do local newsagents charge for delivering daily papers?", 
      "date": "2006-04-30 11:01:00", 
      "id": 3078, 
      "responses": 1, 
      "subject": "Home Newspaper Delivery", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2239"
    }, 
    {
      "body": "I just been to Crispins, admittedly on a Sunday and a 400gm white loaf cost me 99p. An 800 grm white loaf in Tesco Express costs 38p. Roll on the new Tesco in Aldersgate Street, can't wait!!", 
      "date": "2006-08-13 14:01:00", 
      "id": 3147, 
      "responses": 1, 
      "subject": "Crispins", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2525"
    }, 
    {
      "body": "Vinoteca on St Johns St has a private room downstairs a do a wonderful job catering for private functions.  We had a fabulous birthday party there and the food, wine, and service were all fantastic.  And the prices are not bad either. It is also a (rather extreme) way of getting to eat there....", 
      "date": "2007-08-22 15:04:00", 
      "id": 3407, 
      "responses": 1, 
      "subject": "Vinoteca - a great venue for parties", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3602"
    }, 
    {
      "body": "I would be grateful to hear from anyone living in a studio flat in the Barbican as to how much they pay Thames Water each year for water rates. Having paid 246.89 for the past year, I queried this high rate for a Breton House studio flat, containing one water-frugal occupant who showers (not bathes) and uses the water-machine just once a week.  Thames Water's response was to close my account (unilaterally), then open a new one with a \"revised\", reduced annual charge of 245.00 (a saving of 1.89!). I understand that Thames Water \"cannot\" fit water meters in the Barbican Estate, but wondered if other studio occupants are paying the same as I?  If you're paying less, then HOW did you swing it?! Thanks Nigel", 
      "date": "2007-10-17 15:34:00", 
      "id": 3453, 
      "responses": 1, 
      "subject": "Water rates (Average Household Charge)", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3732"
    }
  ]
}