{
  "summary": [
    {
      "body": "As those of you who have received the latest Barbican Life will have seen, we did use barbicantalk comments on local establishments.  I am particularly keen to continue doing so, so please do comment in this thread on good, or bad, eating experiences in the general Barbican area.  I'm also keen to learn of reaction to new restaurants - for example I looked in on the new Cardamom Rooms restaurant in Charterhouse Square the other day (has replaced the old Gulshan/Bar Bombay) and it looks really nice and they seemed to be making a great effort - but I haven't eaten there yet.  Any comments would be appreciated. Also the Comptoir Gascon in Charterhouse Street has extended its eating options - anybody tried this yet? Any other new restaurants around that barbicantalkers have sampled?", 
      "date": "2005-09-25 08:56:00", 
      "id": 1375, 
      "responses": 136, 
      "subject": "Restaurants", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1854"
    }, 
    {
      "body": "We tried Spice Corner this evening - takeaway. Food was perfectly good if not spectacular. In our opinion, it is better than Coconut Lagoon and Haweli, but not as good as Cafe Spice Namaste over by the Tower of London. They not only gave us the promised 25% discount, but also threw in a large bottle of beer for free. I asked whether they had had many customers and they said no. Given that this place is actually on the Barbican premises (Aldersgate side), I think everyone who likes Indian food should give it a try - and sooner rather than later. Surely it's in our interest to support a local business - esp. someplace which is open 7 days a week, which is so rare around here. Disclaimer: apart from the aforementioned bottle of beer, I have not received any special treatment from Spice Corner, do not know the proprietor, have never dated his daughter and have no interest in doing so, etc etc.", 
      "date": "2005-05-06 20:59:00", 
      "id": 4743, 
      "responses": 24, 
      "subject": "reporting back on Spice Corner", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1611"
    }, 
    {
      "body": "I have my sister, with her husband and 2 very active boys aged 5 and 9, visiting this weekend. The boys' favourite food are lasagna and spaghetti (preferably with half left on the carpet   ).  Given my pathetic cooking skills, are there any local restaurants you can recommend? Or would you recommend a take away instead?", 
      "date": "2007-01-04 13:56:00", 
      "id": 4133, 
      "responses": 10, 
      "subject": "Restaurants suitable for young kids", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2878"
    }, 
    {
      "body": " were is the best kebab shop round here? ", 
      "date": "2005-04-21 14:55:00", 
      "id": 2919, 
      "responses": 3, 
      "subject": "kebab shop", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1581"
    }, 
    {
      "body": "Hey all,  Does anyone know of any Indian Restaurants around here?  How many are there?  I know that Haweli has been boarded up at present.", 
      "date": "2005-06-09 18:07:00", 
      "id": 4668, 
      "responses": 3, 
      "subject": "Indian Restaurants", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1677"
    }
  ]
}