{
  "summary": [
    {
      "body": "I've just received this notification of another application to turn the turret into a flat. I thought this horrible idea had been defeated! Any insights?", 
      "date": "2008-01-23 13:23:00", 
      "id": 3593, 
      "responses": 54, 
      "subject": "Planning application for John Wesley Highwalk Turret", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3943"
    }, 
    {
      "body": "I have just received a letter from the corporation notifying me about Heron's planning application to convert much of the Speed/Willoughby car parks over to the exclusive use of the new Milton Court developers. Call me a nimby, but I would encourage as many people as possible to object.  - the application involves turning ALL the spaces on Speed 03 and Willoughby 02 over to the exclusive use of Milton Court. That is over 150 spaces to be removed from residents' use. (Together with developments in Lauderdale, there seems to be a trend developing here.) - Milton Court drivers would share the existing entry into 03 level with us, but have their own entrance to 02 level from the existing ramp on Moor Lane. Both entrances will have no CPAs, just electric gates plus CCTV. Pedestrian entry for Milton Court residents into 02 and 03 levels would be by a new door at the corner of silk street and Moor lane, again with electronic entry. In my view the combination of large numbers of people using 03 level together with no CPA leads to an unacceptable reduction in security. Brandon Mews residents have their back doors opening onto the car park plus there are a number of storage lockers there. Given that it's all too easy for someone to slip in before the electric gates close, this greatly increases the scope for intruders. (And I don't put much faith in CCTV - it's only effective if someone's watching it all the time, in which case why not put them in the car park instead of behind a screen?) This also affects flats overlooking Speed Gardens, which can be accessed from the car park directly (the door currently has no lock on the car park side). Note that there will be pedestrian access between the Milton Court and resident parts of the car parks, so security will be compromised for resident car park spaces as well - anyone slipping in behind a Milton Court user will be able to get into the resident areas of 02/03 without having to pass a CPA.  Further the spaces (& CCTV cameras) proposed for 02 level are directly opposite Brandon Mews kitchens/2nd bedrooms, resulting in increased noise and less privacy for residents. The plan is also stupid from the perspective of Milton Court residents who (following the removal of their bridge) would have to cross the road (with no pedestrian crossing) to get to their car park.   Last but not least, if you're opposed to the Milton Court tower, then opposing the parking scheme is another way to scupper it as it could not proceed without the car park.  The deadline for objections is 23 November. Details of the application can be found at ", 
      "date": "2007-11-04 00:16:00", 
      "id": 3684, 
      "responses": 49, 
      "subject": "Milton Court car park proposal", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3770"
    }, 
    {
      "body": "see skyscrapernews.com for \"pretty\" pictures of redevelopment, I hope that even the most ardent down with the old up with the new will be at least slightly taken aback by scale and downright ugliness of this scheme", 
      "date": "2007-02-23 10:30:00", 
      "id": 4365, 
      "responses": 36, 
      "subject": "milton court pics", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3078"
    }, 
    {
      "body": "Great news - the plans for the new GSMD tower and scheme have NOT been passed by the planning committee today. The application was \"sent back\" rather than being rejected, as rejection would rule out any development on the site. But this appears to mean that the plans proposed are dead and it is back to the drawing board.  Well done to everyone who has been involved in objecting and campaigning against this. Perhaps someone that was there can fill in a bit more detail as I only heard this indirectly. Hopefully something that will work for everyone will come out of this in the end.", 
      "date": "2007-05-15 12:35:00", 
      "id": 3729, 
      "responses": 29, 
      "subject": "Milton Court - the tower has been rejected", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3332"
    }, 
    {
      "body": "It is not too late to make a difference. Today (31 October) is the last day to get in your objections for the Milton Court development: a school for the Guildhall School of Music and an enormous residential tower. Reference 06/01160/FULEIA If you haven't got your objection in yet, you can email it to   or you can hand it over in person by going to the 18th floor of St Alphage House. You must ask for a receipt with today's date. Objections received after today will still be taken receipt of, but might not be considered fully. But if you can't make today, you should definitely still send yours in. I have pasted derbyram's points to object on below. It is important that people who object to the proposal to send in a letter of objection. We helped to have the submission rejected before and we can hopefully do it again. Here are the points: The plan submitted in March has been modified in an attempt to satisfy some of the objections raised, but in essence remains the same: a new building with the lower block housing a concert hall and theatre for the GSMD, surmounted by a residential tower.  284 flats in a tower covering half of the existing site, just lower than City Point  residential density over 8x greater than within the Barbican (even Heron note this in their environmental impact study  density will be 1183 units per hectare, compared with a recommended central location maximum of 240-435 as per the Mayors London Plan, which also states that density should respect local context and communities)  the existing Milton Court perimeter wall moved 1.9m closer to the Barbican, resulting in the road carriageway narrowing from 10.4m to 7.3m  buses and other large vehicles will have great difficulty is safely negotiating the Silk Street/Moor Lane junction in the face of oncoming traffic.  Heron still plan to purchase 210 car parking spaces in level 03 and 02 car parks below Willoughby, and convert space under the Moor Lane car-park ramp into secure bicycle parking, all for the exclusive use of Milton Court.  a health spa/club with outside tables will sit on top of the GSMD building (6F), directly opposite upper floor residents bedrooms in Willoughby and Speed.  many flats in north Willoughby and Speed will still suffer from a loss of light, loss of privacy, and be subject to overlooking from the new tower.  loss of the existing public highwalk  note that recent new buildings constructed around the Barbican area have been designed to retain highwalk access  similarly redevelopment of Milton Court should follow the same UDP requirement.  this development will generate 3,705 person trips and 423 vehicle trips per day, which will be in addition to traffic generated by the new Ropemaker Place building.  a caf/restaurant will be located at the SE ground floor corner  expect early morning delivery noise, as experienced with the City Point bars/restaurants.  the contractor has promised to abide by CoL working hours (which differ from Barbican Estate noisy work hours), but note than the contractor has already broken such pledges made while constructing the new lift/staircase.", 
      "date": "2007-10-31 10:07:00", 
      "id": 4154, 
      "responses": 29, 
      "subject": "MILTON COURT FINAL OBJECTIONS", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3755"
    }, 
    {
      "body": "I understand that Heron, the  company owned by Gerald Ronson, has supplied Linklaters with excellent secondary glazing as a form of minimising noise during the demolition/construction opposite. As far as I know the same offer was not made to the residents of Speed and possibly Willoughby who are even closer to the site. Why have the house committees and the BA itself not taken action on behalf of the residents?  Why has there not been any public information?  Heavy and noisy destruction is about to start and nothing has been done. Answer please!", 
      "date": "2008-02-04 08:35:00", 
      "id": 3501, 
      "responses": 21, 
      "subject": "Milton Court:  Failure to protect Speed and Willoughby", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3978"
    }, 
    {
      "body": "There's a planning application by the City to remove some of the car parking spaces beneath Lauderdale Tower on 02 level, and turn it into office space (apparently the Barbican Estate Office have outgrown their offices). This would have a detrimental effect to the look and feel of Lambert Jones Mews, as the new offices would overlook the Mews. There would also, obviously, be a loss of carparking facility for residents not only of Lauderdale Tower but of the estate as a whole. Could I just urge anyone who thinks this is another terrible idea to write a letter opposing this aplication as soon as possible. The case officer is Chhaya Patel and the Planning Portal Reference number is: P40059 and the application reference is: 07/00684/LBC. You can I do this online I think, you can certainly have a look at the proposals via this link:   I think it's a slippery slope if we turn a blind eye to allowing parts of the estate to be turned over to commercial uses in this way, especialy if we end up losing valuable facilities such as parking places, and it affects the character of the estate.", 
      "date": "2007-08-30 16:58:00", 
      "id": 3462, 
      "responses": 19, 
      "subject": "Application to turn part of Lauderdale car park into offices", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3614"
    }, 
    {
      "body": "I understand that plans are now out to redevelop the post office and telephone exchange site on Fore Street.   Also that new plans for Mlton Court are out - seven floors lower than before. Has anyone been to the Planning Department to view them?", 
      "date": "2007-07-25 14:53:00", 
      "id": 4106, 
      "responses": 16, 
      "subject": "Redevelopment of Fore Street Post Office site", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3537"
    }, 
    {
      "body": "for those of you interested but missed the exhibition there are some pics on ", 
      "date": "2007-09-30 09:24:00", 
      "id": 3437, 
      "responses": 14, 
      "subject": "milton court pics", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3700"
    }, 
    {
      "body": "Residents will be aware that there is a meeting next Thursday to discuss conversion of the top three floors of Frobisher Crescent into flats. If memory serves correctly, the work schedule includes Saturday mornings - although I am not sure if this includes noisy works (?). Do other residents consider weekend work reasonable given the identity of the site owner and the restrictions accepted by Barbican residents on works in their own flats? It seems fair to me for us to ask for assurances on this issue ....", 
      "date": "2008-05-09 14:08:00", 
      "id": 3697, 
      "responses": 14, 
      "subject": "Frobisher Crescent - conversion - building work on Saturdays", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4317"
    }, 
    {
      "body": "The following letter is being distributed to residents of the Barbican Estate on Friday 5 January to highlight the submission of the application for the redevlopment of Milton Court. 03/01/2007 Dear Resident Re: Milton Court Redevelopment I hope you enjoyed a peaceful Christmas. I wanted to advise you direct that following the public exhibition, we have submitted the planning application for Milton Court. The application was registered on 20th December 2006 by the City of London and I expect that those of you nearest to the site may receive a letter from them asking for your views. The City could take this application to their planning committee at the end of March at the earliest. We therefore wish to use the next 12 weeks making sure that the scheme is fully understood and that we listen to any issues you might have. We will hold a public exhibition in early February at the Guildhall School of Music & Drama (we will contact you again with the time and date) and will continue via newsletters to keep you informed. If you have any issues at this stage please contact Leanne Parkinson or Jeremy Fraser on 0870 420 3246,jeremy.fraser@fourcomunications.com I wish you a Happy New Year and I look forward to meeting many of you in the coming weeks. Yours sincerely  Ian Blake Heron International", 
      "date": "2007-01-05 10:11:00", 
      "id": 4209, 
      "responses": 14, 
      "subject": "Submission of application for redevelopment of Milton Court", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2880"
    }, 
    {
      "body": "Could the Residents' Meeting be our chance to put our views on St Alphage to the vote? On our RSVP card we have requested that there should be a vote on the current proposals. Should we contact the Chair prior to the meeting to get this officially on the agenda?  Perhaps it would be a good idea that residents attending the meeting refrain from participating in the electronic voting on the issues of the City's choice unless we can vote on a motion, along the lines of \"We reject the current proposals for St Alphage House\".  Of course if we propose such a vote we must win it convincingly. Perhaps we should put up information on block notice boards to make sure there is a good attendance - and give out information to residents as they arrive for the meeting. Is this something that the BA sub committee on St Alphage could co-ordinate? We would hope that asking for a vote is something that our elected representatives - the CCs of the relevant wards and the House Group chairs and committee members would support. Incidentally - isn't it time we heard about the BA St Alphage sub committee's strategy?", 
      "date": "2008-05-20 17:11:00", 
      "id": 3601, 
      "responses": 10, 
      "subject": "2nd June Residents' Meeting - Chance to vote on St Alphage?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4360"
    }, 
    {
      "body": "The following notice is being displayed on notice boards around the Barbican Estate to give notice of some forthcoming site investigative works at Milton Court. Apologies for any inconvenience.... From mid February until the end of April 2007 Ardmore Mace will be undertaking site investigations at Milton Court. The investigations will provide information on site conditions which will help finalise the detailed design. The work will be carried out within the agreed City of London working times: Monday to Friday hours, 08:00-10:00, 12:00-14:00 and 16:00-18:00 Saturday hours, 8:00-13:00 The professional team are in close consultation with the City of London's Engineers and will monitor dust and noise emission at the site perimeter throughout the duration of the works to ensure the works are kept within the agreed parameters. The team will continue to keep you informed on the development of the project and any further planned works over coming months. If you have any concerns or questions about the works please contact Jeremy Fraser of Four Communications on 0870 420 3246.", 
      "date": "2007-01-30 14:16:00", 
      "id": 4210, 
      "responses": 10, 
      "subject": "Milton Court Site Investigation Works", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2979"
    }, 
    {
      "body": "While we're on the subject of planning applications, there has been one made for the \"Void Space\" at the base of Cromwell Tower to be turned into a flat. I mention this as a recent flyer in Cromwell informed that the applicant is already a Cromwell Tower resident...and is also a member of the Cromwell Tower House Group. I would not want to comment on the rights and wrongs of the above, suffice to say that given the huge demand for tower flats, perhaps interested parties would like to contact the Chair of Cromwell Tower sub group, John Tomlinson, to evaluate the proposal. Apparently he is also liasing with David Graves of the BA. My personal view is that either the space should be converted into an apartment for a local key worker (teacher, nurse etc) plus family*, or auctioned by the corporation to the highest bidder with the resultant sum being spent on residential amenities. Either way, there should be more visibility as I suspect non-Cromwellians have not been informed of this. M * I should point out that I have no idea if the applicant - who is named on the flyer - is actually a key worker. For all I know, he might be. For that matter, he might also have already won an auction.", 
      "date": "2008-01-23 20:51:00", 
      "id": 3588, 
      "responses": 7, 
      "subject": "Cromwell Tower new flat being created - planning application", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3945"
    }, 
    {
      "body": "I guess many residents may plan to comment on the application to replace Milton Court with upgraded facilities for the GSMD and for the residential tower above it.  It was confirmed at the recent exhibition of the plans at the GSMD that revised plans are to be submitted at the end of the month. It is not likely that the revised plans will involve any radical changes to the current proposal, but this will mean that there will be extra time for people to write in with comments, which is a good thing. On the other hand, there is a risk that points of detail (at least) made in relation to the present proposal will cease to be valid where they address aspects of the plans that change between now and the end of the month.  My understanding is that the changes, although small, are likely to be beneficial from residents' point of view rather than adverse, but those of you intending to submit comments before the deadline presently advertised may wish to await the delivery of the revised plans and present their comments by reference to the revised plans. This will ensure the comments made continue to be relevant to the plans the Planning Committee will be asked to decide upon.  The BA will be submitting comments, but not before we have had a chance to review the revised plans.", 
      "date": "2007-03-17 17:37:00", 
      "id": 4346, 
      "responses": 6, 
      "subject": "Milton Court PLanning Application", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3153"
    }, 
    {
      "body": "I've found the planning applications for Milton Court.   This first one details the demolition etc    This second one gives details of a new bridge to replace exisiting one    The details show that both applications have been received by the City of London and you are able to submit your comments on both.", 
      "date": "2007-01-15 14:48:00", 
      "id": 3250, 
      "responses": 5, 
      "subject": "Planning application details - MILTON COURT", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2915"
    }, 
    {
      "body": "Please register your dissatisfaction with the St Alphage House redevelopment proposals by signing the   today. We have already collected several hundred signatures in the paper version and are now supplementing this with an online version. We welcome signatures from anyone who cares about the Barbican, whether you live here, work in the area, have some other connection with the Barbican or even none at all.  If you have already signed the paper version, we ask you not to sign again online, as we can only count you once - no matter how strongly you feel. Please ask you neighbours, your friends, or anyone else you know who cares about the Barbican to consider signing too.  Our group is a sub-group of the Barbican Association, and we have been given the task to make explicit residents' strong objections to what has been proposed. We are currently engaged in extensive research so that when the scheme comes to planning, we will be able to make the strongest case for why the scheme should be refused. We will soon have more information and will do our best to keep you informed through this site, through the  , and for Barbican residents, through the BA Newsletter delivered to your letterbox. Tim Macer Chair, Barbican Association St Alphage House Group Tel. (020) 3291 2938", 
      "date": "2008-05-22 20:44:00", 
      "id": 3608, 
      "responses": 5, 
      "subject": "St Alphage House petition - now open online", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4365"
    }, 
    {
      "body": "Just to note that the application for the installation of a new public lift and staircase is about to be considered by the Planning and Transportation Committee on the 23/04/2007 with the recommendation of approval. The report and agenda will be available from the city administrator on 020 7332 3113 five days prior. Members of the public are allowed to address the committee but they must notify 3 working days prior. I can't find anything on the BA site about this change to the structure of the Barbican, which I find amazing. (Apologies if it is there and I couldn't find it but it is easier to find information on the Garchey).  Personally I can't see why we are putting up with this bolt on to the existing structure that doesn't fit in to either the architecture nor concept of the Barbican. As has been said before it is all rather 3rd rate.", 
      "date": "2007-04-11 11:55:00", 
      "id": 4374, 
      "responses": 5, 
      "subject": "Stairway & lift", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3218"
    }, 
    {
      "body": "The Barbican is listed in the Register of Parks and Gardens of Special Interest, where it is registered as II*. (Site reference number 5185), which means that any planning application which affects its setting has to be commented on by English Heritage The defined area clearly includes the bridges. The site rises above street level, with car parking below it, and comprises terraces and buildings built on various levels linked by a network of steps, raised walks, and pedestrian bridges I can provide copies of both the listing statement for the Barbican and the separate statement for the gardens and podium area if you send me a personal message.", 
      "date": "2007-08-31 11:01:00", 
      "id": 3414, 
      "responses": 3, 
      "subject": "The Barbican Podium and Gardens are listed Grade II*", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3615"
    }, 
    {
      "body": "One page flier advertising a one evening consultation meeting posted through Speed House doors today.  Private company to build the flats and sell them but not clear if the freehold will remain with corporation.", 
      "date": "2008-01-24 00:15:00", 
      "id": 3613, 
      "responses": 3, 
      "subject": "Frobisher crescent to be turned in to flats", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3947"
    }, 
    {
      "body": "Heron and the GSMD have distribited a sales memo stating that the application to redevelop Milton Court was deferred because of \"design related reasons\". This is simply not true. I was at that planning application meeting - there were a myriad of reasons given by those who spoke in objection to this plan, and the Planning Committee effectively said \" go back and come up with an entirely new plan\". However - it seems that Heron and the GSMD care not a jot for the concerns of local residents, and believe that those concerns can be \"steamrollered\" away. So much for so-called \"consultation\". As invited by this memo, please do contact  \"leanne.parkinson@fourcommunications.com\"  and let Heron know how Barbican residents feel about such an approach........", 
      "date": "2007-06-06 22:16:00", 
      "id": 3337, 
      "responses": 2, 
      "subject": "Milton Court - Communication from Heron & GSMD", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3401"
    }, 
    {
      "body": "One of the advantages of living in the Barbican is the availability of car parking spaces to all residents (for a fee), and also the availability of spaces for guests (free of charge, for up to 5 hours I think). If the Corporation reduces the number of spaces, and creates scarcity, then first of all it will feel justified in increasing the fees associated with the parking - that's simple economics (cf the huge rent increases they wanted to impose on our underground storage rooms, where there is scarcity).  And secondly new residents may find that a parking space is very difficult to get hold of - thereby potentially reducing the value of our property in the market. When I bought my flat the ease of acquiring a parking space directly below my building was a distinct selling point. It seems to me that the easy availability of parking is a benefit we all currently enjoy (even if we don't have a car), and if we lose that benefit then the Corporation should compensate us.", 
      "date": "2007-11-11 12:49:00", 
      "id": 3468, 
      "responses": 1, 
      "subject": "loss of car parking spaces", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3785"
    }
  ]
}