{
  "summary": [
    {
      "body": "Is it possible to get a residents permit in the city as well as a barbican cark park space?", 
      "date": "2008-04-11 07:55:00", 
      "id": 3871, 
      "responses": 14, 
      "subject": "Do any of you lot have two cars?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4221"
    }, 
    {
      "body": "Hi!! We have just moved in to John Trundle. I am Sarahjayne, a graphic designer and my partner Jonnie is a Management Consultant. We have been here for a few weeks now and absolutely love it! There are a few things we are unsure of and would appreciate any advice. Is it possible to get Sky +, if so, how? Do we have to use a specific broadband internet provider? If we have visitors, where can they park? Our bathroom occassionally smells - is there a problem with the drains in John Trundle???!!! Where is best to do our food shopping? We have visited Sainsbury's in Angel and weren't impressed!! We don't have car, so ideally would love somewhere nearby other than the 'local' or 'express' variety of supermarkets where the selection is not great. This is probably wishful thinking!!  We look forward to learning more about our new area!! Many thanks", 
      "date": "2005-09-27 15:48:00", 
      "id": 4438, 
      "responses": 7, 
      "subject": "Hello! We've just moved in and have a few questions!!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1858"
    }, 
    {
      "body": "I fear this may be a question of spectacular stupidity but can you get a resident's parking permit if you live in the CoL, i.e one that allows you to park on the street? I can't seem to find any information about it on its website, just a 13 week car park permit for certain car parks. Any information most welcome, thank you.", 
      "date": "2007-01-29 15:37:00", 
      "id": 4205, 
      "responses": 2, 
      "subject": "Parking in the City of London", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2969"
    }
  ]
}