{
  "summary": [
    {
      "body": "I fear our list of tropical pests may be extending beyond mosquitos. Walking on the podium this morning, just where the Postern meets the ramp to JP Morgan/Pizza Express, I noticed a rather large (2 inches), brown, fat, hairy and frankly horrendous spider. If someone braver than me spots it again, perhaps they could entice it into a jar and take it off for identificaton? Or failing that, stamp on it?", 
      "date": "2007-05-01 17:14:00", 
      "id": 1391, 
      "sentiment": 3, 
      "subject": "Spider alert", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3291"
    }, 
    {
      "body": "I hate to be a moaning minnie, but the sound of the lady above me marching up and down and up and down her flat is driving me mad! Whats the etiquette here? She must have a wooded/hard floor. I guess I might just need to knock on her door and have a quiet word, but by the sound of her footsteps, she sounds bigger than me!", 
      "date": "2008-03-13 17:47:00", 
      "id": 1597, 
      "sentiment": 3, 
      "subject": "Footsteps driving me crazy!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4119"
    }, 
    {
      "body": "how many gays live on the estate?", 
      "date": "2006-12-10 23:30:00", 
      "id": 1675, 
      "sentiment": 3, 
      "subject": "only straight on the estate", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2821"
    }, 
    {
      "body": "Received the latest copy of Barbican News this morning. Apart from the usual updates, I was most interested in one article. It was the one about the lift doors in John Trundle and Bunyan. How have these lift doors got into such a state? From what I could make out in the small photograph, they appear to have suffered a lot of vandalism. Do these block suffer from feral youth and other such problems? And if so why has nothing been done. Will be the lifts themselves next?", 
      "date": "2005-07-29 16:04:00", 
      "id": 2961, 
      "sentiment": 3, 
      "subject": "Feral Vandals?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1769"
    }, 
    {
      "body": "the other day my partner was on the balcony (we're in bunyan) and saw two large chavettes walking their dog near the lake under bunyan court. they were repeatedly throwing a ball into the water and trying to get their dog to attack the big golden carp in the lake. the dog didn't seem very interested, but they kept trying. my partner yelled out, \"hey! you! leave that fish alone!\" so they sauntered off.  about 20 minutes later, they were back doing the same thing. he shoo'ed them away again. so if anyone's on their balcony in the area, keep an eye out for them. they seemed like they were regular visitors to the lake.  has anyone noticed, btw, that they've added five new goldfish to the bunyan lake? they like to hide under the duck slide. i think the carp is excited to have the company.", 
      "date": "2005-08-27 12:46:00", 
      "id": 2983, 
      "sentiment": 3, 
      "subject": "estate fish in vicious chav dog attack danger!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1820"
    }
  ]
}