{
  "summary": [
    {
      "body": "Why do we bother lobbying to have pubs and clubs around the Barbican controlled for opening hours and noise disruption, when our own neighbours cause such a ruckus? Last night someone in Speed House held a really obnoxiously noisy party. Every few minutes there was some mad screaming until about 2.30 am. The noise enemy is within.", 
      "date": "2005-08-06 10:41:00", 
      "id": 2960, 
      "sentiment": 4, 
      "subject": "Noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1791"
    }, 
    {
      "body": "Two weeks ago, I decided to cycle along the river. When I went to the car park, my bicycle was not there. I went to see the car park attendant. He told me he would file a report with the estate manager. I heard nothing for two weeks.  I rang the car park attendant today. I was told to ring another number.  Finally, I got through someone who told me that the management of the estate could not be held responsible. I wonder what is the point of having a 24 hours attended car park? R", 
      "date": "2005-08-09 09:46:00", 
      "id": 2968, 
      "sentiment": 4, 
      "subject": "Thomas Moore Car Park", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1799"
    }, 
    {
      "body": "Do I live in a particularly socially unable or anti-social staircase?  It amazes me that most of the other residents appear to be completely unaware of other people in the block. Apart from the rubbish smelling on the staircase they seem totally unable to close a door behind them without slamming it extremely loudly. I can close mine just by pushing it to and then turning the latch and it makes no noise at all. Moan, moan, moan, moan!", 
      "date": "2006-04-25 07:54:00", 
      "id": 3074, 
      "sentiment": 4, 
      "subject": "Door Slammers", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2222"
    }, 
    {
      "body": "Have spent an hour this evening looking at the proposals for the redevelopment of Milton Court and am extremely worried.  There was no mention, that I could see, of the impact a 42 storey building would have on the surrounding residential buildings.  In the expensive looking mock ups of every possible aspect of the new building + model, there was no reference to Cromwell Tower for example.  Residents there, and their current views had been conveniently forgotten. There was also minimal reference to Speed House & Willoughby House, unless I am mistaken. Am I the only one concerned about the imposing nature of the building, the impending building noise, light disturbance and additional hassle such a large building will cause? When I asked the City of London representative about the impending planning application & the date it would be submitted, he was reluctant to be specific.  He tried to placate me with \"sometime in June\".  My advice to all residents in the Barbican is to be vigilant about the planning applications and register your objections as soon as possible.  I would be interested in other peoples opinions on the redevelopment plans.....", 
      "date": "2006-04-27 21:38:00", 
      "id": 3075, 
      "sentiment": 4, 
      "subject": "Milton Court - proposed redevelopment", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2233"
    }, 
    {
      "body": "Riots in and outside the YMCA, paint colour wars, satanic children and smashed glass in BJH and drunken hoodies under Bunyan. What's going on on our northern fringes? Is there something in the water? ", 
      "date": "2006-05-06 22:29:00", 
      "id": 3097, 
      "sentiment": 4, 
      "subject": "what's up??", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2266"
    }
  ]
}