{
  "summary": [
    {
      "body": "It was recently brought to my attention that there are absolutely no alert systems in place throughout the estate (for fire etc.) except in Cromwell Tower. I find this to be disconcerting to say the least. Is anyone else concerned - or should I say ALARMED - by this?", 
      "date": "2005-11-08 23:43:00", 
      "id": 4524, 
      "responses": 22, 
      "subject": "Fire Alarms & Bomb Alerts.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1926"
    }, 
    {
      "body": "Ben Jonson fire doors have been smartened up with a white plastic strip, very dinky, but THE FIRE DOORS NO LONGER CLOSE !!! Is this work in progress, powers that be, or do we start to get worried? Answers on a piece of toast, please ... ", 
      "date": "2008-05-06 09:36:00", 
      "id": 3591, 
      "responses": 6, 
      "subject": "Fire doors - slightly missing the point", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4308"
    }, 
    {
      "body": "Does anyone know who has the key to the barrier by Crowders Well? The CPAs don't know, and Central Services weren't very helpful. It is information which should be available in case of an emergency - supposing there was a major incident and and the emergency services had to get on to the Terrace? I'm not very impressed.....", 
      "date": "2005-05-28 11:40:00", 
      "id": 4723, 
      "responses": 4, 
      "subject": "Vehicle access to St Giles Terrace", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1651"
    }, 
    {
      "body": "Twice in recent weeks the new lift at the eastern end of the estate has broken down.  The telephone number posted for emergencies actually leads to the Guildhall switchboard.  They have no record of who is responsible.  The Corporation failed to pass relevant material sent to them from the then builder Ardmore-Mace (now fired by Gerald Ronson for not being tough enough in their dealings with residents and the Environmental Health people when damage was caused to a number of flats due to their work).  Ardmore-Mace says it is not responsible.  So the fire brigade had to be called.  Anyone using the lift should be aware that aside form shouting no help is available.  The Corporation was informed at least a fortnight ago and still no telephone numbers have been posted. They even claimed that the lift should be maintained by the Estate!  News to the Estate and our excellent engineers.  The Estate was unaware of this and, in any case, the Estate would not assume responsibility for a year after construction.  One trusts that the Estate will charge the Corporation for staff time.   So use that lift at your own risk.  If you press the bell no one who can do anything is altered.  If you use the telephone you get the staff at the Guildhall or the new call centre and the reply that the lift does not exist or they know nothing.  The name of the contractor and an emergency telephone number should be there by law.  It is not.  The Corporation has done nothing about this that has led to an improved situation.   However, the alternative of the exit from Willoughby 03 car park is also very uncertain.  The door has been out of action at least twice over the last fortnight nicely coinciding, on occasion, with the lift on the podium being out of action. People in wheelchairs and other people with walking difficulties have no way out from that corner of the estate unless someone with a pass key kindly takes them through Willoughby House and that is a long way around.", 
      "date": "2008-02-03 10:22:00", 
      "id": 3625, 
      "responses": 2, 
      "subject": "Corporation incompetence?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3977"
    }
  ]
}