{
  "summary": [
    {
      "body": "I'm looking at covering new (relatively) restaurants in the next issue of Barbican Life magazine, plus those newly into the BA discount scheme.  If any Barbicantalkers care to comment on any of these it would be great in giving me an idea of how residents feel about these establishments. The 'new' restaurants I plan to cover include:  St Julien (Long Lane), Spice Corner (Aldersgate Street), Issus (Charterhouse Street), Warin (Whitecross Street), Portal and Pho (st John street).  Anyone know of any new restaurants I've missed locally?  lso any comments on the refurbished Barbican Bistro in the Barbican Centre. The new BA discounters are:  Coconut Lagoon (Aldersgate Street), Brasserie Malmaison (Charterhouse Square) as well as several of the 'new' restaurants above. Any comments much appreciated - thanks.", 
      "date": "2005-08-02 16:12:00", 
      "id": 2986, 
      "responses": 22, 
      "subject": "Restaurants again", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1779"
    }, 
    {
      "body": "Nearby bookshop- Books Etc on Cowcross St, just off Charterhouse St, is closing down. Nearly everything is 50% off or more. Big mix of books and some other stuff. Good if you like a rummage! Buy now for Christmas.", 
      "date": "2008-02-12 14:35:00", 
      "id": 3760, 
      "responses": 14, 
      "subject": "local Books etc! closing down sale", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4012"
    }, 
    {
      "body": "For those who enjoy eating out a spate of new restaurants seem to have opened or about to open close by.  This evening I had a long chat to the owner of a new Turkish restaurant and cafe in Charterhouse Street (right next to the Rendezvous) called Issus and he's a real restaurant enthusiast who sold up a place in Tottenham to open one here.  The food I sampled was extremely tasty and was washed down with a Turkish dry white wine which was surprisingly good.  Another ethnic restaurant to add to the diversity of food in the area.  It seems reasonable value and is worth a try and the owner, David, is signing up to the BA Members' Discount scheme and will offer 10% off to BA members.  David may even read your fortune in Turkish Coffee grounds if you ask him nicely!  Service is very friendly.  It's open Monday to Saturday from 12 noon to 11pm.  It also has a Cafe section downstairs open from 2 a.m. to 4 pm.  A lunch special at 8.00 for two starters and one main course is also on offer which seems like good value. On my way back I tried a slight detour and had a talk to the Proprietor/Chef of Le Saint Julien which has replaced one of the two Mustards restaurants in Long Lane.  His name is Francois Jobard and he hails from Avignon in Provence and is bringing an authentic French atmosphere and menu to the restaurant.  Haven't yet persuaded him to join the BA discount scheme, but am working on it.  However my understanding is that they will offer you a free kir on sitting down to a meal.  the atmosphere looks attractive and there is even a set (but rather limited) two course menu at 10.95 I also noticed that the old Bar Bombay - previously the Gulshan - is now rbeing replaced by a new establishnment under new management which reckons to be opening soon. For those of us who enjoy eating out from time to time there is lots of choice of all kinds of food.  Its a good idea to try out new places and if your experiences are good, do recommend them to others here.", 
      "date": "2005-06-23 21:14:00", 
      "id": 4696, 
      "responses": 11, 
      "subject": "New Restaurants", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1711"
    }, 
    {
      "body": "Hey all,  I know some of the people on the board here eat at Spice Corner Indian Restaurant so thought I'd inform you that I've just read in the Classifieds that the Aldersgate restaurant are offering 30% discount to residents throughout summer - please read the classified message board for more details. It's nice that there are special offers for us residents, makes it more 'neighbourly' if you know what I mean. I would highly recommend people who like Indian food to check the place out - food as well as service is very good.", 
      "date": "2005-06-23 01:30:00", 
      "id": 4673, 
      "responses": 2, 
      "subject": "Spice Corner Offers", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1708"
    }, 
    {
      "body": "just to let any pensioners who dont already know you can have lunch in the ymca resturant  on saturday and sunday at 1-2 pm it costs 4.50 which is a good deal    by the way residents do not get lunch so you will have a nice quiet meal", 
      "date": "2006-05-11 17:01:00", 
      "id": 3102, 
      "responses": 1, 
      "subject": "pensioners lunch ymca every saturday/sunday", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2285"
    }, 
    {
      "body": "19.50 two course plus vino", 
      "date": "2007-07-12 14:06:00", 
      "id": 4038, 
      "responses": 1, 
      "subject": "Good offer at Zetter", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3490"
    }, 
    {
      "body": "Anyone who enjoys authentic Japanese food might be interested to know that Matsuri Restaurant, High Holborn has a special deal on Saturday lunch during August - you pay only 50% of normal prices. Normally keenly priced, this is excellent value and highly recommended based on a recent visit. The restaurant is being fairly coy about this promotion but it seems already to be well known to the local Japanese community so make sure they can accommodate you. If you are still hungry, cross the road on the way back and take home one of the excellent cakes from Paul, the highly recommended French baker. For the avoidance of doubt, I have no financial interest whatsoever in either of these establishments.", 
      "date": "2007-08-06 23:35:00", 
      "id": 4115, 
      "responses": 1, 
      "subject": "Half Price Japanese Lunch", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3566"
    }
  ]
}