{
  "summary": [
    {
      "body": "I've just been mulling over some of the figures in the estimates for BJH and here's a thing. Why is the estimated charge for electricity for the common parts and lifts nearly 75 per cent more for 2006-7 than for 2005-6? There's a figure of c.36,000 against c.21,000. What's the justification for a huge rise like that? Have residents in other blocks noticed a similar hike?", 
      "date": "2007-05-30 09:52:00", 
      "id": 3345, 
      "responses": 27, 
      "subject": "Service charge estimate for 2006-7", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3373"
    }, 
    {
      "body": "Fellow residents, I'm intrigued to know how your electricity bills compare to mine - and what your advice is with regard to energy conservation and achieving good value on electricity bills I'm in a one bedroom flat, two residents. We have a fair amount of electrical items, though most are off throughout the day; we keep the water heater switched on 24/7. Lightbulbs are of the energy-saving variety. Our electricity bills came out at something like 220 for the quarter up to August and 260 for the quarter up to now. Averaging about 80 a month. We are doing the occasional meter reading in order to keep their estimates in check. Our electricity supplier is Good Energy - I do expect to pay a premium for renewable energy but have no idea how this compares to other Barbican residents. Any advice gladly accepted.", 
      "date": "2006-11-07 11:19:00", 
      "id": 3378, 
      "responses": 22, 
      "subject": "Your advice on electricity bills please", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2732"
    }, 
    {
      "body": "Can anyone help me with this - i know this sounds really stupid and naieve, but i never really checked how much i pay on bills and stuff before, and then this morning just happened to open my electricity bill and actually looked at it - and it was 229 for a quater. I have no idea if this is expensive or not - it just struck me as quite a lot seeing that i don't have a TV or stereo, i don't cook and i'm only here part time. That seems a lot to me for essentially hot water and running a laptop a few hours a day. Am i wildely out and is this in fact reasonable? I'm with EDF, if that means anything to anyone.", 
      "date": "2007-01-20 23:38:00", 
      "id": 4201, 
      "responses": 21, 
      "subject": "ouch! electricity bill", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2938"
    }, 
    {
      "body": "I am seeing riduculously short lifespan of light bulbs. I know that they tend to blow in cold weather. But even allowing for that - two last week and another three this week - all from lights that are only a few months old seems unlikely. Is anyone else seeing this ? (I'm in Willoughby if it makes a difference). I did notice a lot of interference on the television before I put it and the computers on surge blocks - so I'm wondering if we've got spikes in the power.", 
      "date": "2006-11-22 14:01:00", 
      "id": 3218, 
      "responses": 9, 
      "subject": "Dirty Power?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2768"
    }, 
    {
      "body": "Further to comments by Maximus regading the roofs visible in the recent Barbican Photo published by the Guardian, one wonders whether the Barbican Estate could - with careful planning and some investment - achieve a 'zero carbon' certification.  Not only would this be environmentally sensitive but could also result in exemption from stamp duty for homes under 500,000.  Does anyone think this might be worth exploring?", 
      "date": "2007-03-22 16:56:00", 
      "id": 4247, 
      "responses": 8, 
      "subject": "Zero Carbon Homes", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3172"
    }, 
    {
      "body": "I've just had an electricity bill of 100. It's more than usual as they are usually 60 - 70. The strange thing is that I don't use any more hot water in winter than I do in summer (a bath and a sinkful of water per day) and washing machine on about twice per week. The only items I use more are lights but it seems a lot just for that. How do other peoples bills compare? Has anyone had a timer on their immersion heater which cuts bills significantly? Would be very grateful for any tips..", 
      "date": "2006-01-25 21:38:00", 
      "id": 3046, 
      "responses": 6, 
      "subject": "High Electricity Bill", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2046"
    }, 
    {
      "body": "I've just received the letter notifying of the price increase from EDF.  I've been labouring under the impression that in the Barbican we are \"tied\" to EDF and it isnt possible to change suppliers.  Ideally i'd like to use a green supplier of electricity, and to be able to shop around for a better deal. Can anyone advise on this?  Thanks", 
      "date": "2008-01-29 10:37:00", 
      "id": 3619, 
      "responses": 6, 
      "subject": "EDF Energy", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3955"
    }, 
    {
      "body": "We have just received from EDF Energy the annual review of our monthly direct debit payment. At the end of the year we owed 25 and it was proposed to increase our monthly direct debit by 8 - 96 in the year to come. After a lengthy freephone call, this was reduced after much haggling to an additional 5 a month - 60 a year. EDF have been overestimating our direct debits in this manner for some years and I once raised the matter with Ofgen. We now contemplate looking for another supplier and will be interested in others' experience of EDF and any other suppliers and any suggestions for an alternative supplier and problems in switching suppliers. Help!  PS. We wish the French SNCF had taken over running our railways rather than dabbling in electricity supply.", 
      "date": "2007-05-01 11:41:00", 
      "id": 4321, 
      "responses": 6, 
      "subject": "Electricity charges", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3289"
    }, 
    {
      "body": "In the two years I have been here my monthly payment to EDF has risen from 25 to 40.  I just tried to use the Energy watch site to see if I can change my supplier.  BUT they all quote dual use e.g. gas and electricity and although they say they can save me 300 p.a. the unit charge is higher than EDF. Help has anyone changed, to whom and is it worthwhile?", 
      "date": "2006-08-14 09:46:00", 
      "id": 3155, 
      "responses": 5, 
      "subject": "Electricity charges", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2527"
    }, 
    {
      "body": "I moved here six months ago and have had two very high electricity bills.  The original oven would appear to be the culprit.  Have those of you who have replaced the original oven noticed a significant reduction in their bills?", 
      "date": "2007-10-20 10:44:00", 
      "id": 3455, 
      "responses": 5, 
      "subject": "Original oven", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3736"
    }, 
    {
      "body": "Hi - I've a strange question perhaps. I live in Ben Jonson and don't know where my electricity meter is. I've been getting estimated bills since I moved in and they seem high at 80 per month so I'd like to take an actual reading. Can anyone tell me where to find the little devil? Thanks", 
      "date": "2005-05-30 19:48:00", 
      "id": 4746, 
      "responses": 5, 
      "subject": "Electricity Meter reading", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1653"
    }, 
    {
      "body": "Hello Has anyone switched from London Energy to another supplier? I've just been quoted 68 a year from Southern Electric, which is much lower than my current bill and sounds too good to be true. If you have any horror stories about them (or can allay my suspicions) I'd be grateful to hear from you. Thanks", 
      "date": "2005-09-20 13:04:00", 
      "id": 3052, 
      "responses": 3, 
      "subject": "electricity", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1847"
    }, 
    {
      "body": "Hi there We have been living in a 1 bed (with study off lounge) apartment in speed house for 1 year and we were shocked to find monthly electricity bills are circa 30gbp. granted there are two people living in the apartment but we dont cook that often (ahem), dont shower that often (ahem!   ) so cant see where the electricity is being used. our hot water system is on a timer so is only on for 1-1.5hrs per day any help or personal experience would be greatly appreciated!", 
      "date": "2007-02-15 17:47:00", 
      "id": 3251, 
      "responses": 3, 
      "subject": "Extortionate Electricity Prices in the Barbican!!!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3061"
    }, 
    {
      "body": "I would like to switch from EDF to a 'greener' electricity supplier - could anyone recommend such an energy supplier who has experience of the Barbican (and the whereabouts of its meters) . Not quite ready to live off grid in a yurt yet but every little helps....", 
      "date": "2007-11-10 23:52:00", 
      "id": 4151, 
      "responses": 3, 
      "subject": "green electricity supplier ??", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3783"
    }, 
    {
      "body": "Today may be an unlikely day to mention solar energy,BUT--does anyone know how much energy could be generated from solar panels or photo-voltaic cells on the available roof space of the Barbican complex. I would think there must be a hectare or so of roof--but I don't know. Has anyone ever investigated this?   Should they?  Would turbines be useful? How much could be saved if the complex was made more energy efficient? Does anyone care?  Should they?  I know that PV cells generate DC, as opposed to AC voltage, and that inverters need to used to convert to AC. there seems to be no objective info on this: it is a morass of propaganda, and difficult to form a conclusion.  Any website references? Or do you just Google \"deluded enthusiasm\"?", 
      "date": "2006-02-12 16:36:00", 
      "id": 4585, 
      "responses": 2, 
      "subject": "Solar panels", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2069"
    }, 
    {
      "body": "Read with interest the recent chain discussing the potential for solar energy (not sure if they manufacture panels sufficiently curved to fit over the barrel vault roofs!!) On a similar tack, has anyone tried refurbishing their windows? Seems to me they are a little below modern standards in terms of seals etc- even the glass seems a little thin. Sure the acoustic and thermal insulation could be improved greatly with use of (eg) neoprene seals and thicker glass. Most modern sealed units block out all but the loudest of external noises.  Also, we have noticed that one of glazing panels is cracked on the outside (could be the window cleaners could be the cold weather???) and that another two have been painted over in emulsion on the inside by a previous resident. Has anyone ever had to arrange for reglazing and, if so, could they recommend a glazier?Appreciate that any alterations involving glazing will be subject to listed building consents etc", 
      "date": "2006-03-05 17:59:00", 
      "id": 4605, 
      "responses": 2, 
      "subject": "Windows", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2111"
    }, 
    {
      "body": "I was hearing this morning on the radio about various difficulties people have had getting Energy Performance Certificates done for the Home Information Packs that are now required when buying/selling a house. That made me wonder how the Barbican rated in energy efficiency terms. Would anyone who has seen a Barbican EPC be prepared to divulge what it said? I'm not a buyer/seller, but curious to see how it works nonetheless  and to see if the Barbie is energy efficient of course.  The government's website describes the EPC like this: 'Each rating is based on the performance of the building itself and its services (such as heating and lighting), rather than the domestic appliances within it. This is known as an asset rating. The certificate also lists the potential rating of the building if all the cost-effective measures were installed. The ratings will vary according to the age, location, size and condition of the building. The potential rating on the certificate will take these factors into account, and the suggested measures will be tailored so that they are realistic for the particular building.'", 
      "date": "2008-01-03 13:18:00", 
      "id": 3546, 
      "responses": 1, 
      "subject": "HIPS and Energy Performance Certificate", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3903"
    }
  ]
}