{
  "summary": [
    {
      "body": "Any ideas how to get rid of moths from a standard store room please? I keep my out of season clothes there & the expense of dry cleaning them when I retrieve them, to get rid of moth-ball pong, is getting silly. Am I the only one with moths?? Why don't our flats have any storage space anyway?", 
      "date": "2005-10-04 14:02:00", 
      "id": 3115, 
      "sentiment": 1, 
      "subject": "Moths in store rooms - help", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1866"
    }, 
    {
      "body": "Any thoughts on the trial of extra corridor lighting in Ben Jonson? I know the corridors are gloomy, but was there an urgent need to expend more electricity (albeit low carb) and why oh why is it ORANGE in a colour scheme of blue & white???? Rebecca is circulating a letter in the near future, so please, any one with colour sense, back me up!  ", 
      "date": "2008-05-06 09:34:00", 
      "id": 3704, 
      "sentiment": 1, 
      "subject": "Ben Jonson orange schmorange ...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4307"
    }, 
    {
      "body": "Could we please organize a big gathering with a fake big hammer to get rid of the horrible corridor under Ben Jonson House? What do you think? Or is it more sensible to lobby with the association to protect the barbican...this is the question...", 
      "date": "2007-11-29 16:38:00", 
      "id": 4170, 
      "sentiment": 1, 
      "subject": "Big  Fake Hammer?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3823"
    }, 
    {
      "body": "I would like to start a campaign to destry the horrible passage of the exhibition hall. It is ugly not functional etc not build by the architects etc. Any volunteers? I need to speak to Maged he is the guy.... ", 
      "date": "2006-09-28 08:29:00", 
      "id": 4275, 
      "sentiment": 1, 
      "subject": "Break down the wall!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2638"
    }, 
    {
      "body": "It's not very nice, is it? And the only wildlife it seems to attract is bathing Vicky Pollards. Why don't we have it filled in?", 
      "date": "2005-06-20 19:38:00", 
      "id": 4679, 
      "sentiment": 1, 
      "subject": "The Dolphin Fountain", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1702"
    }
  ]
}