{
  "summary": [
    {
      "body": "Could the Barbican office supply a new garchey unit, if the one in your flat had been removed by the previous owners?", 
      "date": "2005-06-14 13:07:00", 
      "id": 4684, 
      "responses": 50, 
      "subject": "New Garchey?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1685"
    }, 
    {
      "body": "Hello I am an interloper so I hope it's okay to ask this.  I don't live in the Barbican yet and perhaps never will (as you all no doubt know, there is a dearth of properties) but I wondered if any of you would be generous enough to share your thoughts on living there and good points/bad points. I've lived in flats all my life (we currently live near Old Street and hurrah for the new Waitrose even if, yes, some of the staff are very incongruous for JLP) so I know that properties can differ wildly and that it's also a matter of personal choice. But these are the things I'd like to ask (in no particular order): Am I correct in thinking the biggest flats are in the towers? Is it generally a quiet and safe place to live or does it vary wildly from block to block? What's it like for children? The private gardens seem amazing but in reality what's it like? Is the service charge astronomical (I realise it depends on size of flat)? What will happen when all TV goes digital and the Barbican has no digital cable?? Is the listed building classification a pain if you want to do any work in the flat? Garchey, good or bad? Are parking places readily available to rent or is there a shortage? Anything to look for that an outsider may not know about.  I'd be really grateful for any answers. If I can reciprocate in any way...my specialities are fly fishing, beauty products, nutrition and fashion. I know, ecletic and slightly bizarre! Thank you. AB", 
      "date": "2006-06-05 17:37:00", 
      "id": 3180, 
      "responses": 29, 
      "subject": "What's it like living in the Barbican?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2338"
    }, 
    {
      "body": "When the refuse was collected this morning, a brown paper bag was left behind.  Did anyone else get this? What type of refuse is it for? Recycling? Have I missed a new decree from the Estate Office?", 
      "date": "2008-02-11 21:55:00", 
      "id": 3499, 
      "responses": 9, 
      "subject": "Brown Paper Bag", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4009"
    }, 
    {
      "body": "I have two things that i'd be really grateful for some ideas about... Firstly, i want the soil from two of the large 'architectural troughs' outside my window removed. Helping Hands Garden Service appear to be winding down and can't help. Does anyone know of any other gardeners/handymen etc that would be willing to remove and dispose of the soil? Secondly, and related to the first problem, is that the troughs have nothing in them except 2 large plants (one in each trough). I don't know what they are - they look to me to be something like an overgrown ugly aloe vera, although my mum is convinced they're Trifids! They're succulents with little thorns on. And they're green. Anyway, i've noticed them around the estate (although not as big) - there's one in a raised bed at the barbican centre end of Thomas More Gardens, and there are a few in the conservatory. Anyone has any ideas what i should do with them? seems a bit mean to throw them away (and logistically probably quite tricky given their size). I thought about seeing if the gardeners might want them to plant somewhere in the grounds, but don't know how to get hold of them. Any other bright ideas though?", 
      "date": "2006-04-26 17:38:00", 
      "id": 3079, 
      "responses": 8, 
      "subject": "Soil and plant problems", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2228"
    }, 
    {
      "body": "Does anybody know if old video cassettes can be recycled ", 
      "date": "2006-08-02 12:48:00", 
      "id": 3140, 
      "responses": 6, 
      "subject": "Old videos", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2502"
    }, 
    {
      "body": "I know this is a slightly random question but does anyone know if you can recycle photos?", 
      "date": "2006-08-14 08:39:00", 
      "id": 3154, 
      "responses": 6, 
      "subject": "Photos", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2526"
    }, 
    {
      "body": "So I know someone has answered this in the past, but I can't seem to find the answer anywhere.... We have a PC monitor, printer and keyboard which are all in perfectly good working order that we need to dispose of.  Being the tidy kiwi that I am, I am loathe to just chuck it.   Does anyone know of an organisation that will collect (preferably free) to recycle such items?  I seemed to remember reading somewhere that there is that operates within the Barbican - maybe I'm just being hopeful then... Any suggestions welcome as I am sick of seeing them on our floor!", 
      "date": "2007-03-29 17:11:00", 
      "id": 3828, 
      "responses": 5, 
      "subject": "Computer disposal", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3188"
    }, 
    {
      "body": "I am moving one of the cupboards in my flat. I've read that I can add the doors to the architectural salvage collection but don't know where that is.  Can anyone help?", 
      "date": "2007-04-18 12:14:00", 
      "id": 4384, 
      "responses": 5, 
      "subject": "architectural salvage?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3240"
    }, 
    {
      "body": "I have a knackered old sofa that I want to dispose of. Will the estates office take it away? Anyone know the process?", 
      "date": "2005-12-16 10:29:00", 
      "id": 3010, 
      "responses": 4, 
      "subject": "Getting Rid of a sofa", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1990"
    }, 
    {
      "body": "Following on from the brown paper bag thread, does anyone know where I can recycle a load of plastic bags and other polythene items, such as the wrapping from the dry cleaners.  I know the supermarkets (including our own Waitrose) do have small 'bins' for plastic bag recycling but they are only really there for show. They aren't large enough to be practical.  We don't have a polythene recycling skip on the Barbican. Any suggestions?", 
      "date": "2008-02-12 18:43:00", 
      "id": 3500, 
      "responses": 4, 
      "subject": "Polythene Recycling", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4014"
    }, 
    {
      "body": "I've just learnt that we can't put household batteries in the clear recycling bags which are collected daily on the Barbican Estate. Mindful of how hazardous it is for them to end up in landfill sites, does anyone know how best to dispose of household batteries? With thanks Nige", 
      "date": "2008-05-20 19:23:00", 
      "id": 3696, 
      "responses": 4, 
      "subject": "Disposal of household batteries", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4361"
    }, 
    {
      "body": "Does anyone know of any group/organisation which can make use of  (used) Christmas cards?  Or must they simply go in the recycling pile?", 
      "date": "2006-01-06 00:39:00", 
      "id": 3028, 
      "responses": 3, 
      "subject": "Any use for Christmas cards?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2019"
    }, 
    {
      "body": "Can anyone tell me where the nearest clothes recyling bank is? I don't have a car so somewhere walkable would be great. Thanks in advance", 
      "date": "2006-08-07 12:20:00", 
      "id": 3141, 
      "responses": 3, 
      "subject": "Clothes recycling", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2511"
    }, 
    {
      "body": "Hi there I'm sorry because I know this question has been dealt with before but I can't find the thread. Does anyone know of a local place where I can donate books, videos and DVDs (mostly books)? Cheers", 
      "date": "2007-03-16 07:00:00", 
      "id": 3288, 
      "responses": 3, 
      "subject": "Where to donate books/videos/DVDs?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3148"
    }, 
    {
      "body": "Hello, We have an Epson Perfection 610 A4 flatbed scanner (without leads or software) that works, and a broken Notebook Laptop that we would like to recyle - can anybody recommend a company that will do this? If anybody would like the scanner they are welcome to it, by the way. Thanks, Sam", 
      "date": "2007-05-02 18:02:00", 
      "id": 4330, 
      "responses": 3, 
      "subject": "Giving Away/Would like to Recycle", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3297"
    }, 
    {
      "body": "Hi Barbican I am in the process of buying the smallest kind of studio (F1A) in John Trundle (inward facing). I was wondering if there is anything I should be wary of - things like heating and wether it works, and any Garchey related  issues, for example. Or - huge future service charge bills - I know that the roof and lift has recently been done in JT, but the potential overhaul of Garchey and underfloor heating concerns me a bit.  Also, I will be looking for some original kitchen parts, so if anyone is thinking of selling anything, please let me know.  Also - are there any experts on windowbox plant options? Thanks Max", 
      "date": "2005-10-12 20:37:00", 
      "id": 4437, 
      "responses": 3, 
      "subject": "New resident - questions", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1880"
    }, 
    {
      "body": "I'm putting in my winter flowers on the terraces, and don't want to put the old plants in the bin ... anyone know if we \"communally compost\" anywhere?  and i'm not getting a bin myself cos I've read the articles about wormeries and there's enough death and destruction in the world without frying / feeezing worms all year ... any ideas appreciated", 
      "date": "2005-11-19 17:06:00", 
      "id": 3022, 
      "responses": 2, 
      "subject": "old plants for composting", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1943"
    }, 
    {
      "body": "Hello I would like to clean my garchey myself but I forget which way to turn the key. The garchey has previously been 'released' and I have opened it before, but now I am having a hard time opening it up again... it smells RANK... Is it possible for the Garchey to become 'stuck' again and I'll need to get someone in to open it again? I would like to know just in case I get a regular guy to come in and clean it. Do they wear gas masks when they do it? Ugh. thank you!", 
      "date": "2005-10-06 17:36:00", 
      "id": 3113, 
      "responses": 2, 
      "subject": "garchey key", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1870"
    }, 
    {
      "body": "After slowly dying over the past year, my video recorder has finally packed up. Although I guess I could dispose of it in the rubbish skip in the car-park, I was wondering if there was  a special service for recycling electrical items. A lot of local councils run these schemes, partially to stop landfills getting contaminated with nasties, and also to recycle scrap copper etc. On another point, I'm going to replace my elderly computer soon. It seems a pity to just throw it away as it still works perfectly well, although it's not up to the demands of running today's software. Does anybody know if there's any charity or similar who would be interested in taking it? Cheers, Charles.", 
      "date": "2006-05-02 19:47:00", 
      "id": 3080, 
      "responses": 1, 
      "subject": "Recycling electrical items", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2248"
    }, 
    {
      "body": "hello all, can anyone recommend someone who can come and take my useless old car away? it's currently mouldering in the ben jonson car park pointlessly and expensively. could get it up the ramp and out but needs a tow from there as no tax, MOT etc. any tips appreciated. thanks tom.", 
      "date": "2008-03-27 10:26:00", 
      "id": 3832, 
      "responses": 1, 
      "subject": "car recovery", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4156"
    }, 
    {
      "body": "Does anyone know of a charity which can put  old Macs to good use?  I have one to dispose of and Computeraid International only takes PCs.  Joanna", 
      "date": "2007-12-06 02:21:00", 
      "id": 4164, 
      "responses": 1, 
      "subject": "Charity for old Macs?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3848"
    }, 
    {
      "body": "What has anyone else done with their old NTL set-top boxes now we have the new TV system? The woman I spoke to at NTL kept telling me I could \"disregard\" it, which I assume is business speak for \"throw it away\". Seems a waste, but I guess there's no need for these analogue boxes anywhere...?", 
      "date": "2006-02-03 08:52:00", 
      "id": 4564, 
      "responses": 1, 
      "subject": "Old NTL set-top boxes", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2057"
    }
  ]
}