{
  "summary": [
    {
      "body": "WEDS 7TH SEPT 3.30-8.00pm at Fortune Park Campus(the old Prior Weston School) entrance on Whitecross Street just in case you fancy a gander ", 
      "date": "2005-09-02 19:41:00", 
      "id": 3053, 
      "responses": 27, 
      "subject": "GOLDEN LANE CAMPUS  (exibition of plans)", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1826"
    }, 
    {
      "body": "Are we voting today here in the Barbican? I haven't heard anything about it or received a ballot paper, but given reports of post going missing and electoral fraud I thought I'd check.", 
      "date": "2006-05-04 13:29:00", 
      "id": 3098, 
      "responses": 22, 
      "subject": "Local elections", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2252"
    }, 
    {
      "body": "I read with interest in the Mail on Sunday that Mr Harris of Frank Harris has been quoted as follows\" b] Maybe making money is all that is of interest to Mr Harris and his Company!!! Why cant people embrace the fact we have achieved a great thing in securing the 2012 Olympics instead of being negative and disinterested!", 
      "date": "2005-07-11 07:30:00", 
      "id": 4505, 
      "responses": 20, 
      "subject": "\"We dont want the Olympics\" - Frank Harris", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1735"
    }, 
    {
      "body": "Does anybody know where I can find out when and where fireworks are going to happen in the area ? The HAC seem regularly to have VERY loud fireworks displays and it would be nice to have a little warning. Not because I find it disturbing but because I can't see them from my flat and invariably I am wandering around in \"house-slobbing\" gear (trackie bottoms, no teeth in etc) and would never get out to the HAC in time to see them! Likewise the Barbican has displays which I see over the top of the conservatory. It would be much nicer if they were listed in a convenient central web place so I don't have a mad rush to see the last 5 minutes! BAChair - any chance of asking the HAC to inform the BA of when their displays are going to happen ? I understand they already inform some of the Errol Street residents so if we could be added to the list, that would be great.", 
      "date": "2005-06-16 08:41:00", 
      "id": 4517, 
      "responses": 14, 
      "subject": "Fireworks", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1687"
    }, 
    {
      "body": "After at least 330 years (!) as the Kings Head (and also the St Pauls) closes next weekend.  In theory the Kings Head will reopen as a pub once the Chiswell Street Brewery has been redeveloped as a hotel.   However, given the abject spinelessness of the City when faced with major developers we could well see the pub converted to become the breakfast bar of the aformentioned hotel, as per the developer's original plans. Meanwhile, there will be a closing party at the Kings Head on the evening of Thursday 21st February.  As I first supped there over thirty three years ago I'll see you there!  Mine's a pint of bitter!", 
      "date": "2008-02-17 18:56:00", 
      "id": 3817, 
      "responses": 10, 
      "subject": "Kings Head closing down next weekend", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4036"
    }, 
    {
      "body": "Does anyone know when the next St Giles book sale is? I want to donate some books for them to sell.  I can't see anything about it on the St Giles website (although it does have some great photos of the history of the church).", 
      "date": "2008-04-21 11:13:00", 
      "id": 3565, 
      "responses": 8, 
      "subject": "St Giles Book-sale: when is the next one?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4256"
    }, 
    {
      "body": "Do many residents attend GSMD concerts/productions? In general, are they any good?", 
      "date": "2006-01-03 14:25:00", 
      "id": 3023, 
      "responses": 7, 
      "subject": "Guildhall School", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2006"
    }, 
    {
      "body": "There's a notice going around from the Soil Association. Looks like a very good line-up of exhibitors. Sounds like a one-off so we need to give as much attendance as poss. to encourage them to repeat. Should be well worth going. 10:00 till 4:00 on Sunday 8th Jan. Admittance fee not mentioned so assume free. We're defininitely going - see you there  ", 
      "date": "2006-01-04 14:34:00", 
      "id": 3026, 
      "responses": 7, 
      "subject": "Organic farmers' market this Sunday at the Brewery", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2011"
    }, 
    {
      "body": "Does anyone kow if there's a booksale at the Church this bank holiday ? I remember them being in August but not sure about May... ta", 
      "date": "2007-04-29 11:04:00", 
      "id": 4335, 
      "responses": 5, 
      "subject": "Book Sale at the Church??", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3283"
    }, 
    {
      "body": "Any idea what all the fireworks were about tonight.There were some in the early evening and some at a quater to eleven.I'm no killjoy and I like fireworks.....in a big field.... but not outside my window and not at that time of night.Everything these days seems to be all about noise.From the idiots that shout as they walk past to the singers in my block to the noisy fireworks. NOISE NOISE NOISE........ oh well.... And please don't post any negative comments....I was just having my say", 
      "date": "2006-10-07 21:47:00", 
      "id": 4290, 
      "responses": 4, 
      "subject": "Fireworks", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2667"
    }, 
    {
      "body": "is there anywere local to take your children to see fireworks thanks?", 
      "date": "2005-10-20 10:18:00", 
      "id": 4454, 
      "responses": 4, 
      "subject": "GUY FAWKES NIGHT", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1896"
    }, 
    {
      "body": "I've just spotted in Time Out that there are light projections onto Barbican buildings tonight from 19.30-23.00. Also on Weds and Thurs.  Some of you may already might already know... but I haven't been reading anything that's come through my letterbox lately...", 
      "date": "2006-04-10 18:29:00", 
      "id": 4652, 
      "responses": 4, 
      "subject": "Light projections tonight", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2194"
    }, 
    {
      "body": "Did anyone see the former Merril Lynch demolition site building on the weekend? They seemed to have hit a water main on Friday and the whole (former) basement was filled with water!   It was amusing to see the bemused night watchman watching the site filling up. Pumps installed on Saturday morning slowly removed a few million litres over the weekend.", 
      "date": "2005-07-25 14:18:00", 
      "id": 4705, 
      "responses": 4, 
      "subject": "Ropemaker St demolition", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1761"
    }, 
    {
      "body": "Does anyone know when the Barbican Christmas tree goes up? And does it still go up by the stairs overlooking the lake by Willoughby?", 
      "date": "2005-11-30 09:23:00", 
      "id": 184, 
      "responses": 3, 
      "subject": "Christmas", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1964"
    }, 
    {
      "body": "Anyone know what the event is happening in Fore Street this lunchtime? It's all quite exciting -  Darth Vader, Stormtroopers, the Lord Mayor (of London, not a galaxy far far away) and scores of schoolkids.  Lots of fun but what's it about? It's all a lot nicer than writing a report which is what I'm supposed to be doing ", 
      "date": "2006-06-23 12:17:00", 
      "id": 4433, 
      "responses": 2, 
      "subject": "The force is with us", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2387"
    }, 
    {
      "body": "I remember seeing banners announcing book fairs in St Giles last year, before I moved in. Are these regular events and can anyone tell me when the next one will be?  Thanks.", 
      "date": "2006-01-30 15:05:00", 
      "id": 4563, 
      "responses": 2, 
      "subject": "Book fairs", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2052"
    }, 
    {
      "body": "I have just picked up a flyer distributed by the school on Whitecross Street advertising their open days on Saturdays 26 April, 3 May, 10 May and 17 May when they are offering tours of the building between 10am and 11am on those days. It is well worth taking a look inside the building, which is beautiful in my opinion.", 
      "date": "2008-04-22 18:19:00", 
      "id": 3883, 
      "responses": 1, 
      "subject": "GoldenLaneCampus School open day", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4266"
    }, 
    {
      "body": "have just discovered a Barbican news release on a light display projected on london buildings in april 2006 , 10 sculpture court 12 same ,13 waterside, 14 waterside. Does any one know how far this display will spread onto/into surrounding blocks as no info that i know of has been released to B.A. or house groups?", 
      "date": "2006-02-18 16:48:00", 
      "id": 4588, 
      "responses": 1, 
      "subject": "light display", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2086"
    }, 
    {
      "body": "Just to remind people that this weekend you can visit many buildings which are normally closed to the public. Details here:", 
      "date": "2004-09-18 08:26:00", 
      "id": 4767, 
      "responses": 1, 
      "subject": "Open House weekend", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1260"
    }
  ]
}