{
  "summary": [
    {
      "body": "I love my original Barbican bathroom, and have stuck with it as long as I possibly can, but it is now in such a bad state I am afraid I have to do a major renovation. Any spare parts will, of course, be offered for re-use. My questions are: Can anyone recommend a designer? Preferably, one who would stay as close as possible to the original design. Any ideas about how much this will cost and how long it will take? I would appeciate any advice or information.", 
      "date": "2006-01-24 00:02:00", 
      "id": 2882, 
      "responses": 10, 
      "subject": "Renovating a bathroom", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2041"
    }, 
    {
      "body": "Can anyone recommend anyone who could install a new bathroom for me? i.e. fit a new suit, sort out the plumming and new tiling etc? Already chosen the new fittings themselves. Having difficulties with the guys I'm currently talking to (so slow!!!) - also I expect it will help no end to use someone who has experience with the Barbican (and all the associated admin/requirements) ", 
      "date": "2007-09-19 13:18:00", 
      "id": 3426, 
      "responses": 1, 
      "subject": "new bathroom fitter recommendations?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3665"
    }, 
    {
      "body": "Has anyone a used a firm they would recommend for a complete bathroom refit? No advice or warnings about consents  necessary, thanks - it's for a non-barbican property not too far away!", 
      "date": "2007-03-24 12:15:00", 
      "id": 4345, 
      "responses": 1, 
      "subject": "New bathroom", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3180"
    }, 
    {
      "body": "I have inheritaed a rather scabby, semi-original bathroom.  I would like to either renovate or replace it sympathetically.  Has anyone done similar and have recommendations for contractors, fittings, suppliers, unforeseen problems, etc?  Would be most grateful to hear of your experiences...", 
      "date": "2007-03-30 07:38:00", 
      "id": 4352, 
      "responses": 1, 
      "subject": "Bathroom renovation / replacement", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3189"
    }
  ]
}