{
  "summary": [
    {
      "body": "My washing machine has been failing to drain at the end of the cycle, so using a recommendationon this site, I contacted 1st Call. Their engineer came yesterday and fitted a new pump and declared that it was now draining properly. There was a call out charge of 55 pounds + 46 for the pump + VAT, total 121 pounds, which I was happy to pay because the service was prompt, polite and apparently efficient. When I came to do my first post-repair wash the drum ended up as before, with the clothes swimming in murky water! I phoned 1st Call, spoke to the engineer and he suggested running the rinse and spin cycle with the garchey raised, to find out if drainage from the garchey bowl was the source of the problem. That seems to do the trick! I'm pretty gutted at forking out over 100 quid unnecessarily, but I wonder if anyone else has had the same problem and why did it suddenly start behaving in this way? I shall be contacting the garchey engineers to see if they can sort it out for me.", 
      "date": "2008-01-01 23:40:00", 
      "id": 431, 
      "sentiment": 3, 
      "subject": "Washing machine problem", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3897"
    }, 
    {
      "body": "[b]For the people whose balconies look miserable and want to do something at a very reasonable price:[/b] I have seen this morning that the Greengrocer in Goswell Road has increased the numbers of plants and flowers. The prices are very low : a huge orange begonia only  2,20! The quality is very high! The jasmin I bought last year is growing so much that I have to cut it.... They are open from 8,00 a.m. till 5,30 p.m. not Sat or Sun (unfortunately!). They sell also soil fertilizers and organic substances against the white flies etc which infest the Barbican. They will advise you about the plants you can use in your balcony (sun exposure etc) they are very kind... Some empty balconies look awful, and I think is part of your lease to have a lovely balcony... i'n'it? ", 
      "date": "2005-04-22 08:39:00", 
      "id": 2921, 
      "sentiment": 3, 
      "subject": "Plants and flowers", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1582"
    }, 
    {
      "body": " - A source of original Barbican flat fixtures and fittings now exists on the estate - Items are available FREE OF CHARGE to leaseholders  -Check our stock list by calling or emailing us, or visiting the website -Join our wish list and when items become available well call you  -Help maintain our stock levels by donating your removed items to the store -We can collect from your flat and even help with their removal if required  -Call the numbers below and collection of the items will be arranged ASAP -This is vital as residents often leave unwanted fixtures in estate refuse areas  The  is run voluntarily by residents for the benefit of the estate. Fixtures and fittings cover anything from light switches and taps through to wardrobe doors and nearly all kitchen fittings (worktops, hobs, cupboard doors etc).  You can reach us on the numbers below: 1: 020 7638 9967 Martin Brady 2: 020 7638 2645 Cynthia White 3: 020 7628 3073 John McLean 4. 020 7588 6800 Christian Keesing OR email     OR visit ", 
      "date": "2006-01-13 11:08:00", 
      "id": 3036, 
      "sentiment": 3, 
      "subject": "Original Barbican Fixtures & Fittings", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2031"
    }, 
    {
      "body": "just to let any pensioners who dont already know you can have lunch in the ymca resturant  on saturday and sunday at 1-2 pm it costs 4.50 which is a good deal    by the way residents do not get lunch so you will have a nice quiet meal", 
      "date": "2006-05-11 17:01:00", 
      "id": 3102, 
      "sentiment": 3, 
      "subject": "pensioners lunch ymca every saturday/sunday", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2285"
    }, 
    {
      "body": "Just had it installed and it's very very impressive for those that are interested, now need to have another Sky Cable installed to take full atvantage of the Sky + element, does anyone know how I get this done?", 
      "date": "2006-07-03 09:39:00", 
      "id": 3128, 
      "sentiment": 3, 
      "subject": "SKY HD", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2424"
    }
  ]
}