{
  "summary": [
    {
      "body": "The owner of the flat upstairs from ours installed a stone floor. I'm sure it looks great, but it means a lot of noise is transferred downstairs to our flat. For example every time a table or chair is moved or somebody walks across the floor. When we spoke to him he was quite reasonable about it, but has moved out since and rented it out. The new people are probably totally unaware of this. Am I right in thinking there is a rule in the leasehold saying flats must be carpeted. If so, is it ever enforced? Has anybody else encountered this sort of issue before.  Any advice much appreciated.", 
      "date": "2008-05-20 07:27:00", 
      "id": 2812, 
      "responses": 29, 
      "subject": "uncarpeted flats", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4358"
    }, 
    {
      "body": "I can see someone playing with a lapdog in the Barbican small garden. 1. Aren't dogs prohibited in the gardens? 2. Aren't dogs prohibited in the Barbican flats? It's a small dog, but still. Is there a recommended course of action? Lots of children play in the garden everyday.", 
      "date": "2007-05-04 19:18:00", 
      "id": 4338, 
      "responses": 29, 
      "subject": "Dog in the garden", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3304"
    }, 
    {
      "body": "One of the reasons I moved here was the no pets policy as I have asthma.  However I frequently notice a black and white cat with a collar wandering round Thomas More garden and last night a woman was sitting on the grass playing with what looked like a Yorkshire terrier puppy.  I have also seen a man walking a labrador.  Given the number of very small children playing there in the day time I don't think they should be exposed to faeces and urine from these animals, it's bad enough with the Canada geese!  Perhaps if the rules have changed a small area especially for pets could be fenced off although how you tell the geese is problematic.", 
      "date": "2006-06-08 10:18:00", 
      "id": 4424, 
      "responses": 21, 
      "subject": "Pets in the Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2344"
    }, 
    {
      "body": "I hate to be a moaning minnie, but the sound of the lady above me marching up and down and up and down her flat is driving me mad! Whats the etiquette here? She must have a wooded/hard floor. I guess I might just need to knock on her door and have a quiet word, but by the sound of her footsteps, she sounds bigger than me!", 
      "date": "2008-03-13 17:47:00", 
      "id": 1597, 
      "responses": 20, 
      "subject": "Footsteps driving me crazy!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4119"
    }, 
    {
      "body": "Does anybody think that the birthday party celebrations in the gardens are getting a bit out of hand? Right now a huge party is being organised below me, involving trestle tables of food, a large circle of chairs, helium balloons, pirate-themed props, signs fixed to trees and so on and so on. Painstaking and involved planning for the party, little consideration for the neighbours I fear. I don't remember these sort of huge parties happening before this year (but maybe my memory is selective). What troubles me is that I find it rather inconsiderate for other garden users that such a mega-party essentially monopolises such a large segment of the garden.  By the way, I'm not against all parties! But surely they should either be smaller, or in somewhere more isolated like the basketball/tennis court (if only to avoid damaging the trees and grass) which is, after all, an area for child-use and would not impinge on others wanting to enjoy the garden.", 
      "date": "2006-07-29 14:49:00", 
      "id": 5532, 
      "responses": 17, 
      "subject": "Gardens are for communal use", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2488"
    }, 
    {
      "body": "Has anyone else been bothered by a dog barking on  a balcony in Shakespear tower?  I'm in Lauderdale and with the doors open, all I've been hearing today is a regular yapping from what sounds like a puppy.   I think the noise is coming from a flat roundabout the 9th floor, but I'm sure the flats above and below are aware of just which floor the dog is on! I'm hoping that the dog is just a weekend visitor, but does anyone know what the situation would be if it turns out to be a permanent resident?  Keeping pets is not allowed in the lease, but how is this enforced by the Corporation?", 
      "date": "2005-09-10 13:46:00", 
      "id": 2998, 
      "responses": 11, 
      "subject": "Barking dog", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1838"
    }, 
    {
      "body": "As a newcomer, what's the general experience of noise transferance between neighbours? It seems pretty quiet to me, but perhaps my neighbours are never there. Can one turn the hi fi up or does it go straight through the walls? The impression I get is that the solid concrete walls and floors are pretty soundproof - is this the case? The worry about wood floors is that they might be noisy for people living below, but has this actually been the case? Have there actually been complaints to the lease police?", 
      "date": "2005-10-30 19:45:00", 
      "id": 4518, 
      "responses": 10, 
      "subject": "Noise question", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1914"
    }, 
    {
      "body": "After a long time, (almost a year?) and having complained politely (yeah, right) to our neighbors upstairs, we made a formal noise complaint at the Barbican offices. The folks upstairs  (an \"L-shaped 20\", I believe is what they're called,) have two 5 or 6 year olds, and a baby that will soon be old enough to stomp and bang itself. They have laminated floors throughout the entire apartment, and every morning, at precisely the legal time to make noise (7:30-8:00 A.M.) BANG! One jumps from it's bed. in the side front room, joined seconds later by the other child, also in the front room. They race to the parents bedroom and jump around there for a while, and run back and forth (I swear I have heard them call it \"the running and jumping game\") and this goes on until they go to school, and from when they return 3:30-ish (with school freinds, often) to run, jump, bang and wrestle until they all go to bed 11:00ish. Its only running and bouncing and kiddie stuff, you can't fault them, they are only kids having fun. But the parents only gave us blank looks when we went up to ask them to hold it down. In our book of Barbican rules it says \"Carpets must cover all floors, to avoid noise.\" (I'm paraphrasing) So we complained in the Barbican office. They took down the info, and told us not to expect anything to happen \"for a reasonable lenghth of time, which meant sometime in Dec. They then added that since it would be around Christmas time by then, the neighbors probably wouldn't want to be buying and installing carpets then...     In October, a month or so after our complaint, we got a letter from the Barbi Corp asking US to keep a log of THIER noise FOR A MONTH, and  submit it back to them. Um, why is it OUR responsibility to spy and report on our nieghbors? Very Maoist spy-on-your-neighbor policy. We did it, though, making us seem quite petty, writting down everytime they banged on the floor or jumped off the furniture The corp. sent back a notice telling us that most of the noise was \"within noisey hours\" (I said I was paraphrasing, folks!) except for once when it went past midnight, which was aparently our only valid complaint. Whaaa? The complaint is that THEY DO NOT HAVE CARPETS TO CUT DOWN ON NOISE. The reply also said we had \"Screamed at them in April\" (10 months earlier) during one of the brat's (I'm still parapharasing) birthday party. Aparently that was enough to negate our claim. Actually, the Corp had told them to get carpeting, but to give them time to do so, 3 months, and if they don't, we should feel free to complain again.      We are going to get a chimpanzee and a breeding pair of Lorries, a very beautiful and very songful bird. Let THEM complain! We'll tell 'em that carpeting their floors might cut down on some of the noise.     A rule is a rule innit? Does anybody know the \"real\" rules on carpeting floors? I'ver noticed somewhere on Barbican talk that somebody mentioned their wood floors. We've also noticed the Estate Agents sometimes advertise wood floors as a plus when offering Barbican apartments for sale. We wouldn't mind if it was a sweet, lightweight lady like Thelma walking in slippered feet on her cold, cold floor, but it ain't. This is the main reason I got on this site, to find out what the \"unwritten\" rules are. Thanks in advance for your upcoming input!", 
      "date": "2008-02-03 09:04:00", 
      "id": 3778, 
      "responses": 6, 
      "subject": "Barbican bylaws versus Ignoring Barbican bylaws.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3976"
    }, 
    {
      "body": "First of all, I'm sorry if these have all been asked about a thousand times before, but i did try searching the forum and i couldn't quite get the answers i needed.  Before i consider making a move to the Barbican, i would be very grateful if anyone could answer these questions: 1. Are the blocks, (especially the high rise ones!) up to modern fire safety standards?  I have visited people in the high rise blocks, (and i have seen the flats on Open Buildings Weekend) and the blocks do not seem to have fire alarms or sprinkler systems, which would definitely be necessary in modern blocks of that height today.  I am not unnecessarily fussing, but i can imagine more pleasant things than being stuck 35 floors up in a fire, with only the balconies and their little fire escapes to escape by (!) 2. Estate agents, etc. make out that the Barbican Estate Office is really really strict about alterations, changing door locks, putting things on balconies etc, but are they really that strict?  Would you, for example, get into trouble for putting a new lock on your front door without telling them (and how would they find out anyway?), or how would they punish you? 3.  Can the Estate Office supply original Barbican fixtures and fittings, for example if the garchey system has been removed can they replace it?  I was told that that semicircular block, Frobisher Cresent, was intended to be flats, but they never built them, so they still have all the fixtures in storage. 4. If you want to change the kitchen or bathroom, would the Barbican office ever not grant permission?  Thank you very much", 
      "date": "2005-06-12 15:09:00", 
      "id": 4662, 
      "responses": 6, 
      "subject": "Some General Questions", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1682"
    }, 
    {
      "body": "Are they obliged to down tools at any point tonight, or could they be working throughout....? It's rather noisy over here in Defoe", 
      "date": "2007-06-27 21:18:00", 
      "id": 3478, 
      "responses": 5, 
      "subject": "Roadworks in the tunnel", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3450"
    }, 
    {
      "body": "Well, this was the promise from Cantillon  I was woken at 9:23 this morning by pneumatic drilling. More than a little irritated (having worked a 20 hour day on Friday), I eventually went down to complain to the site manager, and find out who had authorised this. His response was that a Richard Lambert from the Corporation had permitted it. According to him, the project manager had asked the Corp how much noise they can make on a Saturday, and this Mr Lambert said \"you can make as much noise as you like between 9:00 and 14:00\". Who are these faceless %!*!wits who are so generous with our ability to have a nice lie-in ? What is the point of us trying to get commitments from Cantillon regading noise when they are discarded like so much jetsam just weeks into the project ?  ", 
      "date": "2008-02-16 10:42:00", 
      "id": 3510, 
      "responses": 2, 
      "subject": "Weekend noise from Milton Court", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4027"
    }, 
    {
      "body": "I would be grateful if you and/or the appropriate person from Snow Hill could respond to the following inter-related matters: 1.  As you know given that Corney and Barrow located opposte Willoughby House near Moor Lane cannot use what one can describe as the central piazza of City Point as a place where smokers can drink there has been a tendency for drinkers to stand in the street opposite Willoughby House and sometime directly under Willoughby House.  I understand on occasion the police have been called because despite the best efforts of the management of Corney and Barrow they have not been able to prevent groups congregating on the public highway.  This is quite disturbing to residents of \"'willoughby House and will get worse as the weather becomes warmer. Is there no way smokers cannot use the central piazza?  Is there no way C and B cannot put a notice on the appropriate door near Moor Llane reminding smokers that they cannot smoke in the street or the passageway? This would surely sC and B could lose their licence if complaints continue to mount up. 2.  Have the City of London police responded to the document about the \"greening\" of Fore Street, Moor Lane and Silk Street?  I spoke to the appropriate officer and my understanding is that the police would mwant modifications to the proposal to \"green\" the area opposite Corney and Barrow as it would turn it into a \"beer garden\"?  Has this now been put in writing? Thanks and keep up the good work.", 
      "date": "2008-03-04 14:15:00", 
      "id": 5515, 
      "responses": 2, 
      "subject": "Pub noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=4084"
    }
  ]
}