{
  "summary": [
    {
      "body": "Have spent an hour this evening looking at the proposals for the redevelopment of Milton Court and am extremely worried.  There was no mention, that I could see, of the impact a 42 storey building would have on the surrounding residential buildings.  In the expensive looking mock ups of every possible aspect of the new building + model, there was no reference to Cromwell Tower for example.  Residents there, and their current views had been conveniently forgotten. There was also minimal reference to Speed House & Willoughby House, unless I am mistaken. Am I the only one concerned about the imposing nature of the building, the impending building noise, light disturbance and additional hassle such a large building will cause? When I asked the City of London representative about the impending planning application & the date it would be submitted, he was reluctant to be specific.  He tried to placate me with \"sometime in June\".  My advice to all residents in the Barbican is to be vigilant about the planning applications and register your objections as soon as possible.  I would be interested in other peoples opinions on the redevelopment plans.....", 
      "date": "2006-04-27 21:38:00", 
      "id": 3075, 
      "sentiment": 1, 
      "subject": "Milton Court - proposed redevelopment", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2233"
    }, 
    {
      "body": "johnbh is right you dont need to be nominated if you are a resident on the local electoral list one year minimum ", 
      "date": "2006-11-29 15:19:00", 
      "id": 3222, 
      "sentiment": 1, 
      "subject": "bringing in the sheep", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2789"
    }, 
    {
      "body": "I've found the planning applications for Milton Court.   This first one details the demolition etc    This second one gives details of a new bridge to replace exisiting one    The details show that both applications have been received by the City of London and you are able to submit your comments on both.", 
      "date": "2007-01-15 14:48:00", 
      "id": 3250, 
      "sentiment": 1, 
      "subject": "Planning application details - MILTON COURT", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2915"
    }, 
    {
      "body": "There was mention in the Milton Court thread about the St Alphage redevelopment plans.  I know these were put on ice some time ago - are they back on? If it involves losing the access via the Highwalk this is serious especially as this is currently the best route through to the Guildhall - try doing it at street level - not funny.  The Moorefields development alao involves a downgrading of the highwalk access to a slim walkway down the side of the building.  Obvioulsy Milton Court if redevloped will also mean losing a walkway but to be honest the difference between stairs by Citypoint and stairs at podium is not huge.   It's the cumulative effect that is worrying. On top of that how much more skyline is going to be filled in - the ghastly pink building on London Wall and it's new neighbour have filled in that section completely - what's St Alphage going to do ?  As it is to the South of the estate it will have far mor impact on light.", 
      "date": "2007-03-11 16:19:00", 
      "id": 3284, 
      "sentiment": 1, 
      "subject": "St Alphage House - any ideas what is happening", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3133"
    }, 
    {
      "body": "Heron and the GSMD have distribited a sales memo stating that the application to redevelop Milton Court was deferred because of \"design related reasons\". This is simply not true. I was at that planning application meeting - there were a myriad of reasons given by those who spoke in objection to this plan, and the Planning Committee effectively said \" go back and come up with an entirely new plan\". However - it seems that Heron and the GSMD care not a jot for the concerns of local residents, and believe that those concerns can be \"steamrollered\" away. So much for so-called \"consultation\". As invited by this memo, please do contact  \"leanne.parkinson@fourcommunications.com\"  and let Heron know how Barbican residents feel about such an approach........", 
      "date": "2007-06-06 22:16:00", 
      "id": 3337, 
      "sentiment": 1, 
      "subject": "Milton Court - Communication from Heron & GSMD", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3401"
    }
  ]
}