{
  "summary": [
    {
      "body": "I note a few messages about Crossrail on another thread - and thought it might make sense to start a new one here.  I think one of the messages says that there is a plan B regarding the Crossover cavern under Defoe House.  There is indeed a Plan B, but that doesn't stop the crossover being constructed - but it might enable the engineers to do away with the proposed surface works on Aldersgate Street as the plan involves removing the muck through the tunnels back to Liverpool street, rather than through a shaft at Aldersgate Street/Beech Street.  Regarding subsidence, residents will be exceedingly unlucky if they are affected at all.  Virtually all underground works make for some subsidence (most of the Barbican falls within a prospective area where up to 10mm of subsidence might be expected) - but if this occurs evenly across the structures it is unlikely that anyone will notice apart from the engineers with their precision monitoring instrumentation.  Bear in mind that the Crossrail route under the Barbican is actually directly underneath the existing Metropolitan Line/Circle line/Thameslink tracks - and for safety reasons any subsidence will have to be very tightly controlled under the existing tracks.  I don't think Defoe residents should have anything to worry about.  Plenty of tunnelling has taken place under London recently without damage to overlying structures. Regarding the Crossover cavern - this is a structure where the twin tunnels are merged effectively into one much wider one so that trains can be switched from one track to the other.  These are necessary for both safety and operational reasons.  I am not sure why such a cavern needs to be directly under Defoe, but it is necessary for it to be somewhere, and in an urban environment it is virtually bound to be under some building and the plans place it  below Defoe and I doubt that that will be changed, but I reiterate that I still don't believe that Defoe, or any other Barbican residents will have anything to worry about from the tunnels themselves as they are 30 m down and modern engineering should be able to cope very well with this kind of problem.  The noise etc. from works in Aldersgate Street is another factor altogether and i think the current plans call for works to be carried out there for up to 43 months! - If we can do anything to get Crossrail to implement Plan B then we should.  Traffic disruption alone will be pretty horrendous, and there will also be major traffic problems in Moorgate where a major sewer has to be diverted and then replaced.  We do live in 'interesting times.'", 
      "date": "2005-04-13 20:06:00", 
      "id": 2909, 
      "sentiment": 2, 
      "subject": "Crossrail", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1560"
    }, 
    {
      "body": "Whilst planting up some planters this week I discovered a white bug in the earth that I have identified as the dreaded Vine Weevil larvea. This bug to those who do not know, will eat the roots of your plants and by the time you normally discover it, your plants are dead. Planters are particularly at risk, so I have ordered some biological pest control, trouble is as always I have enough for 12 square metres arriving and only have 1 if that to do.  If anyone would like some (as it has to all be used once the packet's opened) please let me know. PS if you want to order your own then I found this company from the RHS: ", 
      "date": "2005-05-05 12:44:00", 
      "id": 2930, 
      "sentiment": 2, 
      "subject": "Bug Invasion", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1607"
    }, 
    {
      "body": "I'm looking at covering new (relatively) restaurants in the next issue of Barbican Life magazine, plus those newly into the BA discount scheme.  If any Barbicantalkers care to comment on any of these it would be great in giving me an idea of how residents feel about these establishments. The 'new' restaurants I plan to cover include:  St Julien (Long Lane), Spice Corner (Aldersgate Street), Issus (Charterhouse Street), Warin (Whitecross Street), Portal and Pho (st John street).  Anyone know of any new restaurants I've missed locally?  lso any comments on the refurbished Barbican Bistro in the Barbican Centre. The new BA discounters are:  Coconut Lagoon (Aldersgate Street), Brasserie Malmaison (Charterhouse Square) as well as several of the 'new' restaurants above. Any comments much appreciated - thanks.", 
      "date": "2005-08-02 16:12:00", 
      "id": 2986, 
      "sentiment": 2, 
      "subject": "Restaurants again", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1779"
    }, 
    {
      "body": "As 12th night approaches, I noticed a skip has appeared for Christmas tree recycling outside the (closed) Crowders Well pub on St Giles Terrace, if anyone needs it. There may be others too.", 
      "date": "2006-01-02 13:43:00", 
      "id": 3020, 
      "sentiment": 2, 
      "subject": "Christmas tree recycling", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2003"
    }, 
    {
      "body": "We lost TV reception in Seddon House last night - August 17. Apparently there's something wrong with the 'transformers on the roof' and the techies are trying to fix it. No idea of how long it will take, but at least we now know it's not a Sky problem.", 
      "date": "2006-08-18 08:53:00", 
      "id": 3157, 
      "sentiment": 2, 
      "subject": "TV reception/Seddon House", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2535"
    }
  ]
}