{
  "summary": [
    {
      "body": "I have recently had work carried out on my flats and was most impressed with this. I used Doranlink which I was recommended. A man called Terry Coull runs it.  He has vast experience and knowledge of the Barbican and its flats, as he only does work on the Barbican estate - which came in handy with an aspestos problem and the removal of my garchey I had in the kitchen. The overall look to my bathrooms and kitchens was finished to a very high standard and all work was passed by Barbican regulations, ie plumbing and electrics and is fully licensed. I would recommend him to anyone who needs any work carried out. His number is 07768 311 277.", 
      "date": "2008-04-27 21:21:00", 
      "id": 3894, 
      "sentiment": 4, 
      "subject": "Excellant, reliable builder", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4285"
    }, 
    {
      "body": "Anyone who enjoys authentic Japanese food might be interested to know that Matsuri Restaurant, High Holborn has a special deal on Saturday lunch during August - you pay only 50% of normal prices. Normally keenly priced, this is excellent value and highly recommended based on a recent visit. The restaurant is being fairly coy about this promotion but it seems already to be well known to the local Japanese community so make sure they can accommodate you. If you are still hungry, cross the road on the way back and take home one of the excellent cakes from Paul, the highly recommended French baker. For the avoidance of doubt, I have no financial interest whatsoever in either of these establishments.", 
      "date": "2007-08-06 23:35:00", 
      "id": 4115, 
      "sentiment": 4, 
      "subject": "Half Price Japanese Lunch", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3566"
    }, 
    {
      "body": "i am routinely baffled by some of the technical posts on here so forgive the simple approach but ... i had long battled with a simple freeview box and trying to record things on a dvd recorder ... it just never seemed to work, the wires always seemed to be in the wrong place etc ... when the freeview box just packed up over night, i went and bought a \"digital terrestrial TV receiver / recorder\" by Sagem ... it lets me watch all the channels like BBC 24 etc but the great thing is ... it took seconds to install and recording anything and everything is miraculously simple ... it cost about 120 from the shop in moorgate (Currys or Dixons or whatever) and its worth every penny ...  no doubt you have all had one for ages but if you haven't and ur not that interested in techy things but want to tape Film 4 etc I thought the tip might be helpful", 
      "date": "2007-01-29 23:15:00", 
      "id": 4207, 
      "sentiment": 4, 
      "subject": "freeview", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2975"
    }
  ]
}