{
  "summary": [
    {
      "body": "I have two things that i'd be really grateful for some ideas about... Firstly, i want the soil from two of the large 'architectural troughs' outside my window removed. Helping Hands Garden Service appear to be winding down and can't help. Does anyone know of any other gardeners/handymen etc that would be willing to remove and dispose of the soil? Secondly, and related to the first problem, is that the troughs have nothing in them except 2 large plants (one in each trough). I don't know what they are - they look to me to be something like an overgrown ugly aloe vera, although my mum is convinced they're Trifids! They're succulents with little thorns on. And they're green. Anyway, i've noticed them around the estate (although not as big) - there's one in a raised bed at the barbican centre end of Thomas More Gardens, and there are a few in the conservatory. Anyone has any ideas what i should do with them? seems a bit mean to throw them away (and logistically probably quite tricky given their size). I thought about seeing if the gardeners might want them to plant somewhere in the grounds, but don't know how to get hold of them. Any other bright ideas though?", 
      "date": "2006-04-26 17:38:00", 
      "id": 3079, 
      "responses": 8, 
      "subject": "Soil and plant problems", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2228"
    }, 
    {
      "body": "Does anyone know a company or person who will deliver compost and gravel to the Barbican?   We want to replace most of our 160 feet of window boxes so need a lot. thanks", 
      "date": "2008-05-11 08:05:00", 
      "id": 3723, 
      "responses": 8, 
      "subject": "Compost Deliveries", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4328"
    }, 
    {
      "body": "We are going on holiday for two weeks shortly and I don't want my lovely plants to die - does anyone know of a watering service (not too pricey!) as unfortunately I don't know any of our neighbours.", 
      "date": "2006-06-27 08:34:00", 
      "id": 4238, 
      "responses": 8, 
      "subject": "Plants", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2398"
    }, 
    {
      "body": "Hello Does anyone know of a company/someone who offers a service of putting plants/mini trees into the planters on balconies?  I tried searching this site (thought had seen some suggestions in the past) but couldn't find anything.  Some relations of mine have always done it in the past but can't this year (in case you were wondering...!) Thanks v much (ps. yes, I know, I'm lazy)", 
      "date": "2007-05-19 19:51:00", 
      "id": 3320, 
      "responses": 6, 
      "subject": "Balcony plants", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3344"
    }, 
    {
      "body": "I'm a newcomer to TMH, and I've inherited a number of derelict planters. I'm no gardener. On consultation, the Estate Office who gave me a flyer for  Helping Hands Garden Services. Has anyone else used them please; if so, are they as helpful as their name suggests? If not, can anyone recommend a firm I can use. And is April a good month to replant? All advice welcomed. (My intention is to stick strictly to low maintenance planting.)", 
      "date": "2006-02-23 23:52:00", 
      "id": 4603, 
      "responses": 6, 
      "subject": "Advice re planters", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2098"
    }, 
    {
      "body": "Hello, We are tempted to grow a Virginia Creeper on our terrace. Has anyone tried growing one in a north-facing pot? Oh and is there anyone out there delivering pots and plants to the Barbican? Many thanks!", 
      "date": "2007-10-04 09:14:00", 
      "id": 3444, 
      "responses": 5, 
      "subject": "Virginia Creeper delivered to the Barbican?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3708"
    }
  ]
}