{
  "summary": [
    {
      "body": "I are aware of the latest postings on barbican talk with links to adult content.  The links to one of the sites requests a download of windows media player. I would strongly advise against downloading anything from this link unless you trust the source completely. It would seem, in the first instance that no laws have been broken as the actual content is not posted on the site, only a link which the viewer has the choice to click on or not. However, we will look into the matter and fully support any prosecution / action should any offences be discovered and an official complaint recieved. Yours Paul Gilmour", 
      "date": "2007-01-31 09:44:00", 
      "id": 4217, 
      "responses": 26, 
      "subject": "Adult content postings", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2984"
    }, 
    {
      "body": "I am very surprised that people choose not to identify themselves.  Whilst I am told that this is frequent in \"chats\" where there are real and compelling reasons for people not to identify themselves I find it unacceptable within a community such as the Barbican. I find it difficult to take seriously any message where the person does not write in their real name.  CM Posner[/b]", 
      "date": "2006-08-14 11:11:00", 
      "id": 3152, 
      "responses": 15, 
      "subject": "Identity", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2528"
    }, 
    {
      "body": "Thought I would create a new thread for this so it is easier for the Owner/Administrator/Bill Payer to delete it! Why was Guest's post deleted this morning? I don't get what the problem was with it. It wasn't an ad hominem attack (the usual reason for horseradish to get his blue pencil out) The mass deletions a few days ago, which I affectionately refer to as the Strawberry Affair, were kinda understandable although I fear they may have resulted in one of our number leaving the forum for good. Shame, Strawberry was always good value. So to get things clear ... Saying 'no comment' about a fellow forum user - BAD Impersonating a real Barbican resident - GOOD (no, DuckLady is not THE duck lady!  ) Guest leaving a facetious post in response to a previous facetious post - BAD The previous facetious post - GOOD Right, I've got it .... I think.", 
      "date": "2005-10-14 13:23:00", 
      "id": 4522, 
      "responses": 14, 
      "subject": "Censorship sucks/rocks (delete as applicable)", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1885"
    }, 
    {
      "body": "To all BarbicanTalk users I'm the administrator of this site and would like your assistance in a small matter, plus your feedback on ways to deal with it. As some of you have already been discussing, there are falcon chicks nesting within the Estate. This is quite unusual as apparently most falcons do not last long in urban areas. I have received a phone call from the City of London's Wildlife Officer, who is vociferous that the location of the birds should not be revealed. This is so that the birds can have the best shot at survival, without attracting attention from people who might want to steal the chicks' eggs (which are apparently relatively rare and valuable.) There is an additional danger that people could be injured trying to get up to watch the birds close up, or to steal the eggs - apparently something similar happened elsewhere last year. For the meantime, I have edited out all references to the location of the birds. Amending text is not something I have done often in the five years or so that this site has been around, but in this case I hope there's not too much serious injustice involved. What's more, I think most people would agree that we don't want to be attracting burglars (or birdwatchers!) onto the estate. In turn you could help by agreeing not to reveal the location in your postings. Ultimately it may prove academic if more mainstream media (newspapers/ TV etc) mention the exact location. In that case, of course, we can re-assess the situation. Please feel free to give me your feedback on this approach. Hopefully you'll agree this is a fair solution, but I'm happy to read any discussion.", 
      "date": "2006-06-19 15:50:00", 
      "id": 3170, 
      "responses": 10, 
      "subject": "Important - for all readers - bird issue", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2377"
    }, 
    {
      "body": "I have removed the entire pigeon thread. One thing that I think is particularly unnecessary is quoting from other users' private messages. Please do not do this. Also I hope we can continue discussions - on any subject - in a civil fashion without resorting to personal jibes.", 
      "date": "2006-10-05 12:18:00", 
      "id": 4283, 
      "responses": 6, 
      "subject": "Pigeon thread removed", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2656"
    }
  ]
}