{
  "summary": [
    {
      "body": "I need to find somebody to clean my Garchey from time to time. I have heard of somebody called Terry; does any body have experience of using him? Is he reliable? I am slightly paranoid about giving key permission to people I don't know. Any experiences?", 
      "date": "2008-03-07 08:25:00", 
      "id": 3545, 
      "responses": 11, 
      "subject": "Garchey Cleaning", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4092"
    }, 
    {
      "body": "Can anyone recommend a cleaner /ironer.  Abracadabra's rates are extortionate at 13.56 an hour.  Main chore is ironing (16 shirts a week!). Alternatively does someone know of a reasonably priced ironing service ?", 
      "date": "2006-07-11 15:43:00", 
      "id": 4465, 
      "responses": 10, 
      "subject": "Cleaner / Ironer recommendastions", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2446"
    }, 
    {
      "body": "Could anyone recommend a good, local cleaner for a neurotic? My last one shipped herself back to Poland, first class. D07", 
      "date": "2008-02-24 09:18:00", 
      "id": 1324, 
      "responses": 6, 
      "subject": "Cleaner Recommendation", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4054"
    }, 
    {
      "body": "Can anyone recommend a good window cleaner? The sun's showing up my filfthy windows! ", 
      "date": "2006-04-06 08:02:00", 
      "id": 3065, 
      "responses": 6, 
      "subject": "Window cleaners", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2178"
    }, 
    {
      "body": "..we need one badly. any recommendations?", 
      "date": "2007-01-21 22:33:00", 
      "id": 4200, 
      "responses": 6, 
      "subject": "CLEANERS", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2945"
    }, 
    {
      "body": "I want to get my carpet professionally cleaned - can anyone recommend someone? I've just got one room i want cleaned so it's not a big job.", 
      "date": "2005-11-05 14:23:00", 
      "id": 4514, 
      "responses": 5, 
      "subject": "Carpet Cleaning", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1920"
    }, 
    {
      "body": "Hi, can anyone recommend a good carpet cleaner please? I have a flyer for Martyn Everett (if you've used his services, let me know please if he was any good/ how much he charges!) but I usually like to get a couple of quotes. Any advice about carpet dry cleaning generally - it sounds better, but is it smelly?", 
      "date": "2008-05-06 09:45:00", 
      "id": 3583, 
      "responses": 4, 
      "subject": "Carpet cleaner rec please", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4309"
    }, 
    {
      "body": "All of the good cleaners i have had in the past seemed to have been shipped off.  I did try Claribel who gets a lot of PR on here, although she was very friendly.  The cleaning was not great. Can anyone highly recommend someone they are currently using and really rate. I am getting desperate. Many thanks Wendy", 
      "date": "2008-04-12 09:39:00", 
      "id": 3885, 
      "responses": 4, 
      "subject": "Need New and Updated Cleaner Info", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4227"
    }, 
    {
      "body": "Hello, Could someone recommend a same day dry cleaner close to the Barbican? I must have passed lots of them - just can't remember where! Thanks, Simon", 
      "date": "2007-09-19 07:21:00", 
      "id": 3425, 
      "responses": 3, 
      "subject": "Same day dry cleaners?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3663"
    }, 
    {
      "body": "Anyone used a good carpet cleaning service (steam or pref dry cleaning)  lately please? Or had a good experience with DIY hire cleaner?", 
      "date": "2007-03-19 18:56:00", 
      "id": 3298, 
      "responses": 2, 
      "subject": "carpet cleaning wanted", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3163"
    }, 
    {
      "body": "Can anyone recommend a cleaner who is looking for an immediate start 3 hours per week for cleaning and ironing?", 
      "date": "2007-06-24 14:09:00", 
      "id": 3481, 
      "responses": 2, 
      "subject": "Cleaner recommendations?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3440"
    }, 
    {
      "body": "Lovely Terry Budgen, some of you may know him, used to be an estate cleaner in Andrewes House.  He has been doing some private cleaning jobs for the past few years since he retired from the estate but sadly has had a stroke and it looks very unlikely that he will be able to work again.  If you know Terry and want me to pass on good wishes, please pm me as I am going to visit him in hospital on Sunday.    Sadly this means that I need to find a new cleaner and so does someone else in my block that Terry used to clean for.  If you have/know/are a cleaner that is honest, reliable and may be willing to take on two new (fortnightly)clients, please let me know. Thanks.", 
      "date": "2007-11-23 16:02:00", 
      "id": 4162, 
      "responses": 2, 
      "subject": "need a cleaner", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3814"
    }, 
    {
      "body": "Does anyone have the number of someone who will come around monthly to clean the Garchey?  I find it very unwieldy to take the thing apart so I'd like to use this service.  I did have the number of someone called Brian a while ago but he was impossible to contact. Thanks for any suggestions.", 
      "date": "2006-10-25 14:39:00", 
      "id": 4301, 
      "responses": 2, 
      "subject": "Garchey cleaner", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2702"
    }, 
    {
      "body": "We've been using Helping Hand cleaners. Our current cleaner \"Jola\" is competent, and although I've some reservations about Helping Hand, they are by-and-large OK. Now I get a letter from Helping Hand saying they are closing down on Aug 31st and handing over \"the network\" to \"Reme McGurn Trading as Sparkling Touch\". I have to create a contract with her to continue the service we get. I am not atall sure about this. Has anyone any experience of \"Reme McGurn trading as Sparkling Touch\"? In particular, do they know the Barbican, provide photo id,show up on time  and clean the place OK?  Has anyone else had this letter from Helping Hand? Can anyone recommend another cleaning company/cleaner?", 
      "date": "2007-08-21 18:29:00", 
      "id": 3403, 
      "responses": 1, 
      "subject": "Helping Hand cleaner/Reme McGurn", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3601"
    }, 
    {
      "body": "Hi, I have done a search for both, but there seems to be some discrepancy. Can I get some up to date recommendations for (a) Cleaners (once a week, couple of hours) and (b) Basic re-grout (on 2 original bathrooms). If anyone's got a minute. Much appreciated in advance.", 
      "date": "2008-01-16 00:07:00", 
      "id": 3554, 
      "responses": 1, 
      "subject": "Cleaner/Grouter", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3933"
    }, 
    {
      "body": "The posts I searched were pretty old can anyone recomend a good cleaner  couple of hours a week", 
      "date": "2007-07-20 12:09:00", 
      "id": 4051, 
      "responses": 1, 
      "subject": "Recommed a cleaner?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3520"
    }, 
    {
      "body": "I'm moving flats again within the barbican at the end of the month & wonder if anyone can recommend a cleaner for a one off clean (unfurnished at one flat) at both ends. I did this myself last time & was worn out! Thanks", 
      "date": "2007-04-25 14:03:00", 
      "id": 4255, 
      "responses": 1, 
      "subject": "One off clean", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3271"
    }
  ]
}