{
  "summary": [
    {
      "body": "Is BA membership on a personal or a per-flat basis? If the latter, is it possible to get extra membership cards issued so that e.g. my wife (who has a different surname to me) doesn't try and persuade the dentist that she's me to get her discount?", 
      "date": "2005-04-26 22:22:00", 
      "id": 2925, 
      "sentiment": 1, 
      "subject": "BA membership", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1591"
    }, 
    {
      "body": "anyone else notice that 02 lift in ben jonson needs just a splash of paint to get rid of the graffiti? its all begining to look a lttle tatty and it shouldn't", 
      "date": "2005-04-20 21:31:00", 
      "id": 2939, 
      "sentiment": 1, 
      "subject": "service charges, somerfield, and a splash of paint", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1579"
    }, 
    {
      "body": "Can anyone please advise what the procedure is for sorting out neighbours with noisy plumbing - as ever it is so hard to know which flat is actually responsible for the noise.  At the moment when one of our neighbours (unsure which) runs their water taps we hear a loud whining noise throughout our flat - the noise seems to be getting worse too. Has anyone else experienced a similiar problem? Is this something the Corporation can deal with - how will they identify the flat?", 
      "date": "2006-08-19 12:15:00", 
      "id": 3162, 
      "sentiment": 1, 
      "subject": "Noisy Plumbing", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2540"
    }, 
    {
      "body": "I'd be interested in hearing what others think about the latest estate initiative we are being consulted on -- this time about providing residents meeting rooms. If I understand it correctly the idea is that we are being asked to pay for the renovation and the upkeep on our service charge, but then also pay rent to use the facilities -- although it's difficult to say given the paucity of information provided in the flyer. If that's the case, it seems a bit much to me. Surely if we are going to have rooms we can rent then the estate  should fund the refurbishment cost and the annual upkeep, we shouldn't have to pay twice. And I thought local authorities were supposed to provide these facilities, not the estate office. I'd also love to know whose great idea this was.  ", 
      "date": "2006-10-27 17:29:00", 
      "id": 3201, 
      "sentiment": 1, 
      "subject": "residents meeting rooms consulation", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2706"
    }, 
    {
      "body": "Does anyone have any details please?  Is there a talk and presentation - in which case there is no point going except from the start at 6 p.m., or is it an open exhibition with people around to answer questions?", 
      "date": "2007-09-20 11:33:00", 
      "id": 3431, 
      "sentiment": 1, 
      "subject": "Tonight's meeting (20/09) about Milton Court", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3668"
    }
  ]
}