{
  "summary": [
    {
      "body": "there are bags of original white tiles at 03 Willoughby Car park  which have been dumped. I also saw a completed kitchen lying on Golden Lane by the car park entrance yesterday. I don't understand why the estates office can't  put aside a store to keep some of these pieces for those trying to restore their interiors.", 
      "date": "2005-01-18 15:07:00", 
      "id": 2943, 
      "sentiment": 2, 
      "subject": "white bathroom tiles dumped in willoughby car park", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1423"
    }, 
    {
      "body": "I have signs of water leaking in to my ceiling, but the people upstairs say they can't find any problem? Any suggestions as to what I do now? If water is coming in through upstair flat's window frames, is it the Corporation's problem? Anyone know? Advice welcomed, thanks", 
      "date": "2006-04-29 10:52:00", 
      "id": 3076, 
      "sentiment": 2, 
      "subject": "water leak", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2237"
    }, 
    {
      "body": "We're looking to have some fairly minor alterations made to our flat (all very much in keeping with the original Barbican aesthetic, and in some areas restoring what was there before the previous occupiers took issue with the interiors). One of these alterations necessitates the repositioning of a partition wall in the bedroom - effectively to allow us to widen the cupboard and wardrobe space (by moving the bedroom door closer to our structural / boundary wall - at the moment it's half way along a partition wall). From what I've understood from the BEO, there is no formal application process (with triplicate forms and the like) for applying for landlord's permission... I simply need to write to them, supplying our architect's drawings of what's intended. They'll then write back either granting permission (or declining it). I would have thought the process was more bureaucratic than that. Can it really be that simple? Beyond that, I've had no end of grief trying to speak to somebody at the Corporation about planning / listed building consent. Nobody seems to be available to take my calls, and despite leaving several messages, nobody calls back. I have found dozens of forms on the COL website, though they seem to be geared to quite major projects - like demolishing and rebuilding a property (for which environmental statements need preparing, etc). There doesn't seem to be a simple / straightforward guide anywhere that discloses what to do with regard to smaller residential alterations. Does anybody know the process and the approximate timescales? Are there any other parties I need to consult with?", 
      "date": "2007-09-02 10:38:00", 
      "id": 3411, 
      "sentiment": 2, 
      "subject": "Listed building alterations", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3622"
    }, 
    {
      "body": "Please register your dissatisfaction with the St Alphage House redevelopment proposals by signing the   today. We have already collected several hundred signatures in the paper version and are now supplementing this with an online version. We welcome signatures from anyone who cares about the Barbican, whether you live here, work in the area, have some other connection with the Barbican or even none at all.  If you have already signed the paper version, we ask you not to sign again online, as we can only count you once - no matter how strongly you feel. Please ask you neighbours, your friends, or anyone else you know who cares about the Barbican to consider signing too.  Our group is a sub-group of the Barbican Association, and we have been given the task to make explicit residents' strong objections to what has been proposed. We are currently engaged in extensive research so that when the scheme comes to planning, we will be able to make the strongest case for why the scheme should be refused. We will soon have more information and will do our best to keep you informed through this site, through the  , and for Barbican residents, through the BA Newsletter delivered to your letterbox. Tim Macer Chair, Barbican Association St Alphage House Group Tel. (020) 3291 2938", 
      "date": "2008-05-22 20:44:00", 
      "id": 3608, 
      "sentiment": 2, 
      "subject": "St Alphage House petition - now open online", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4365"
    }, 
    {
      "body": "Ok, people, here's another hardy perennial. It's now getting VERY COLD.  I feel the cold quite badly and am at home much of the time (like many others in the Barbican) and the free-standing electric heaters which we have just don't do the job properly. Not to mention the fact that we've already spent a small fortune this summer on using them because the weather was so cold some of the time. I rang the BEO to be given the usual \"oh, we never turn the heating on until October\". I pointed out that if it gets cold before the beginning of October, and enough people request it, then it can be turned on earlier (as has happened in previous years) so I was getting my request in early this year. This went down like the proverbial lead balloon. Apart from being cold, I'm also very annoyed. It seems to escape the notice of BEO staff that RESIDENTS PAY FOR THEIR HEATING through the service charge and if we need it turned on slightly earlier then we're perfectly entitled to have it. It's always a rather worrying situation when those in charge of your heating system a) don't live here and b) have a vested interest in keeping the cost down. I know that our heating system is an ongoing concern because of its incredibly complicated time/temperature triggers (nothing like a simple thermostat here) and also because it is hopelessly antiquated but it shouldn't be such a battle to get it turned on every year. I don't want to knock the BEO staff because usually they provide a very good service - but this one really gets me going   So, please - ring your House Officers and request that we have access to our own heating. It still takes about a month for the buildings to warm up properly so, even if it goes on now, it will some time before we really start to feel it. House Officers' telephone numbers are:-   Andrewes, Brandon, Cromwell, Gilbert, Speed and Willoughby - Helen Davinson on 7029 3963 Defoe, Lambert Jones, Lauderdale, Mountjoy, Postern, Seddon, Thomas More and Wallside - Sarah Styles on 7029 3962 BJH, Breton, Bryer, Bunyan, John Trundle and Shakespeare - Rebecca Marshall on 7029 3964. Yours in scarves and sweaters etc. etc.", 
      "date": "2007-09-26 15:09:00", 
      "id": 3804, 
      "sentiment": 2, 
      "subject": "HEATING!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3692"
    }
  ]
}