{
  "summary": [
    {
      "body": "What's the established practice for Christmas gift giving/tipping of Barbican staff - porters, window cleaners etc? Having only lived in the Barbican since May this year, this is my first Christmas here. Is the consensus to take the attitude that we already pay enough service charge, so do nothing? Or are people more generous than this? What gifts might people give? I don't want to innocently contribute towards overloading the Shakespeare porters with mince pies and Quality Street.", 
      "date": "2005-12-07 13:06:00", 
      "id": 2999, 
      "sentiment": 2, 
      "subject": "Established practice for Christmas tipping of BBcan staff?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1973"
    }, 
    {
      "body": "I know it's cryptic but if anyone received a rather strange letter from their cleaner today, can you please PM me to discuss the allegations.  I'm wondering whether to believe it or not and if so, what to do about it.", 
      "date": "2007-01-15 17:24:00", 
      "id": 3252, 
      "sentiment": 2, 
      "subject": "Did anyone get a letter from their cleaner today?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2917"
    }, 
    {
      "body": "Been out of the swim for a while, but since my return Ive noticed a bit of a cabinet reshuffle with the car park staff. What gives? I know one of our chaps retired recently, decent sort; sorry to see him go. Anyone heard anything?", 
      "date": "2007-09-06 19:30:00", 
      "id": 3430, 
      "sentiment": 2, 
      "subject": "Shake-up down below.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3638"
    }, 
    {
      "body": "Has anyone else lost their tv signal? I'm an Andrewes House resident and have been without a signal since at least Friday. I've played with the cable, connections and turned everyone on and off a few times but to no avail. I suspect it's the signal because the tv actually works fine in watching pre-recorded items off my freeview box. Although my quality of life has probably improved as a result, it would be nice to know whether the problem is localised to me or if anyone else has been affected? Secondly does anyone know if there's a standard e-mail address for the estate office or repairs to which we can send queries such as this to? Thanks.", 
      "date": "2007-04-15 15:00:00", 
      "id": 4380, 
      "sentiment": 2, 
      "subject": "TV signal down?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3233"
    }
  ]
}