{
  "summary": [
    {
      "body": "Apparently someone in Brandon Mews had some wine stolen from their kitchen windowsill (where it was cooling) a few days ago - it seems whoever took it just carried a ladder into Willoughby 03 car park, climbed up and took it. Fortunately whoever did it ignored my large pot of red cabbage chilling on my own kitchen sill (thieves these days have no taste), but this is a worrying development, since if someone can climb up to a window with a ladder without being challenegd it is only a minor further step to break in.  It seems likely to me that this would not  have happened if the Willoughby 03 CPA office was properly manned - these days it is empty 95% of the time. The Corp have said it will be replaced with an electric gate controlled by the 01 CPA but while the gate has been installed it's not yet in operation. How long until this lacuna is filled?", 
      "date": "2005-12-30 15:27:00", 
      "id": 3019, 
      "sentiment": 3, 
      "subject": "Brandon mews theft", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2002"
    }, 
    {
      "body": "whilst reading about the mendohlson tree, i wondered ...  whilst recognising that we are indeed very lucky in our police resources, is there a specific reason why the bored-out-of-their-minds security staff from the arts centre can't cast their net wider ... ? I ask because the  lovely gardens by bunyan / jt / bryer are a bit of an attraction for the \"malcontents\" because they're so lovely and lush and screen things from public view ... the group of youths, for example, referred to in previous posts i think, have taken to drinking under bunyan - having re-located from jt ...  presumably the answer is the security guards are employed by the arts centre but i wonder how whether the financial equation to extend their duties to the rest of the estate would be a cheaper option than using the police and the cost of repairs (when things can be repaired, that is, unlike the tree sculpture...) just a thought", 
      "date": "2006-05-01 23:08:00", 
      "id": 3084, 
      "sentiment": 3, 
      "subject": "security", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2244"
    }, 
    {
      "body": "Has anyone any info on several of the staff being taken away by the poice/immigration as illegal immigrants.I know this work is now contracted out,but surely Barbican management cannot be unaware they are using \"illigals\" and if not why not?", 
      "date": "2006-08-05 07:46:00", 
      "id": 3150, 
      "sentiment": 3, 
      "subject": "porters", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2508"
    }, 
    {
      "body": "Having dispersed with the manned CPA box at Willoughby 03 and replaced the personnel with a remote control operated gate for security purposes it rather defeats the object when the gate is stuck open all day as it has been today.  At the time of writing its been stuck wide open for about seven hours (on a Friday).  It has been reported to the Estate maintenance staff but nothing seems to have been done about it so far.  Hopefully it will be repaired before the weekend - or nighttime.  A number of the Brandon Mews apartments have direct access doors to the 03 Level.  I know one of my neighbours has been disturbed enough by the security aspects to install an additional steel door into his property - but this was even before the CPA box was unmanned.  There is only limited cctv in the 03 level - mostly directed at the gates.  If gate operation is going to be a problem then surely there needs to be additional cctv surveillance of the Car Park area or the Estate should bring back the CPAs.", 
      "date": "2006-02-17 14:26:00", 
      "id": 4583, 
      "sentiment": 3, 
      "subject": "Security - Willoughby 03/Brandon Mews", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2084"
    }
  ]
}