{
  "summary": [
    {
      "body": "Two weeks ago, I decided to cycle along the river. When I went to the car park, my bicycle was not there. I went to see the car park attendant. He told me he would file a report with the estate manager. I heard nothing for two weeks.  I rang the car park attendant today. I was told to ring another number.  Finally, I got through someone who told me that the management of the estate could not be held responsible. I wonder what is the point of having a 24 hours attended car park? R", 
      "date": "2005-08-09 09:46:00", 
      "id": 2968, 
      "sentiment": 4, 
      "subject": "Thomas Moore Car Park", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1799"
    }, 
    {
      "body": "Has any body else stop receiving TV Saturday morning from 0130hr following a power failure. I have called the Bunyan court CPA who was going to look into it, so I then called the resident Engineer, only to have the phone answered by Defoe house CPA who said his TV works alright and he would connect me to the Bunyan CPA who would deal with my problem. The Bunyan CPA did call back with a telephone no. of the TV / satellite people under contract to the Barbican Estate, I call the number and listened to an answer machine message requesting our contract number with them (to which I don't know, only the Barbican office knowns, and they are not back for 3 days, so I could not leave any information). I have decided that Life dose not revolve around TV, so thanks to the BEO and there contract with an answer service I am now cancelling my subscription to rip off sky and going to buy a free view box which will work when the BEO get the TV people to switch back on the trip switch (shame the resident engineers dont know where this switch is!). Sorry about the rant, but missing all my favourite TV programmes this weekend. AHHHHHHHHHHHHHHHHHHHHH -0", 
      "date": "2008-05-05 19:40:00", 
      "id": 3566, 
      "sentiment": 4, 
      "subject": "TV Bunyan Court - May Day Bank Holiday weekend without TV", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4304"
    }, 
    {
      "body": "Whilst generally very helpful \"I\" had a bad experience involving a rude attendant and involving bad language (him having been very inconsiderately woken up).  There is one grumpy attendant who has however in the past been okay once you have got past the grumpiness.  Not sure if it was him.  This however seemed a bit uncalled for.   It happened to a friend  - otherwise I would be complaining and hence the vagueness about who/what was involved.  I just wondered whether anyone else had any bad experiences recently. Thanks.", 
      "date": "2007-02-06 11:14:00", 
      "id": 4220, 
      "sentiment": 4, 
      "subject": "andrewes car park attendant", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3039"
    }, 
    {
      "body": "I rang central services today and needless to say I'm not impressed with the response they gave me for my query. I've recently had damp coming through the toilet wall and rang to enquire if someone, probably a Barbican engineer could come round and tell me where the pipes were located. But I was told to ring a plumber! This begs the question, why I'm paying so much for a service charge when an engineer can't even be bothered to tell me the location of the pipes! Instead I was offered a list of plumbers' telephone numbers. I'm not going to let this go and pretty angry about it. It's not like I'm asking them to diagnose the problem.", 
      "date": "2005-11-21 13:41:00", 
      "id": 4533, 
      "sentiment": 4, 
      "subject": "Water Pipes in Toilet", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1946"
    }, 
    {
      "body": "Well, just one member of staff, but it's the first time I've had someone speak to me in that way from the Estate Office.  I rang the main Estate switchboard and asked for Technical Services, expecting to be asked the reason for my call and to be directed to the right person.  Instead, a very belligerent man asked who I wanted to talk to. When I started saying I didn't know, he barked that there were over 400 people working for Technical Services so how could he decide who to put me through to. I was so flabbergasted by his sarcastic tone I didn't bother explaining the reason for my call, and simply said I'd call back and try to find someone more helpful. Luckily when I called back I got a normal person who asked the reason for my call and put me through to the repairs line. She seemed a bit confused though....so perhaps I was asking for something unusual??  Seeing as I was calling because I'd reported a fault with a fire door about a month ago, and nothing had been done about it, it wasn't a particularly good experience. Especially as the fault was caused by a previous dodgy and unfinished repair, which in itself was necessary after the door was (allegedly) damaged by Estate staff renovating a rental flat in the corridor.  I wish I'd got the switchbaord man's name ... obviously someone who shouldn't have been let loose on the general public.", 
      "date": "2005-11-28 10:51:00", 
      "id": 4541, 
      "sentiment": 4, 
      "subject": "Rude Estate Office Staff", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1958"
    }
  ]
}