{
  "summary": [
    {
      "body": "Received the latest copy of Barbican News this morning. Apart from the usual updates, I was most interested in one article. It was the one about the lift doors in John Trundle and Bunyan. How have these lift doors got into such a state? From what I could make out in the small photograph, they appear to have suffered a lot of vandalism. Do these block suffer from feral youth and other such problems? And if so why has nothing been done. Will be the lifts themselves next?", 
      "date": "2005-07-29 16:04:00", 
      "id": 2961, 
      "sentiment": 3, 
      "subject": "Feral Vandals?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1769"
    }, 
    {
      "body": "the other day my partner was on the balcony (we're in bunyan) and saw two large chavettes walking their dog near the lake under bunyan court. they were repeatedly throwing a ball into the water and trying to get their dog to attack the big golden carp in the lake. the dog didn't seem very interested, but they kept trying. my partner yelled out, \"hey! you! leave that fish alone!\" so they sauntered off.  about 20 minutes later, they were back doing the same thing. he shoo'ed them away again. so if anyone's on their balcony in the area, keep an eye out for them. they seemed like they were regular visitors to the lake.  has anyone noticed, btw, that they've added five new goldfish to the bunyan lake? they like to hide under the duck slide. i think the carp is excited to have the company.", 
      "date": "2005-08-27 12:46:00", 
      "id": 2983, 
      "sentiment": 3, 
      "subject": "estate fish in vicious chav dog attack danger!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1820"
    }, 
    {
      "body": "whitbread buildings north side of Chiswell St has aquired a band of squatters (see notices on doors and railings). If any  abuse,noise etc don't forget these should be reported to met police at,I believe Kings Cross,as that side of the road is not a City matter.It seems there is no water as they have been using local pubs for toilets etc.", 
      "date": "2005-09-06 09:21:00", 
      "id": 2996, 
      "sentiment": 3, 
      "subject": "squatters", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1829"
    }, 
    {
      "body": "Was anyone else disturbed in BJH at 11.00 pm last night (23rd) by someone hammering? It went on for about 15-20 minutes and was definitely hammering, not an airlock in the pipes.  Very inconsiderate! ", 
      "date": "2005-12-24 09:40:00", 
      "id": 3016, 
      "sentiment": 3, 
      "subject": "Late night hammering", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1999"
    }, 
    {
      "body": "Apparently someone in Brandon Mews had some wine stolen from their kitchen windowsill (where it was cooling) a few days ago - it seems whoever took it just carried a ladder into Willoughby 03 car park, climbed up and took it. Fortunately whoever did it ignored my large pot of red cabbage chilling on my own kitchen sill (thieves these days have no taste), but this is a worrying development, since if someone can climb up to a window with a ladder without being challenegd it is only a minor further step to break in.  It seems likely to me that this would not  have happened if the Willoughby 03 CPA office was properly manned - these days it is empty 95% of the time. The Corp have said it will be replaced with an electric gate controlled by the 01 CPA but while the gate has been installed it's not yet in operation. How long until this lacuna is filled?", 
      "date": "2005-12-30 15:27:00", 
      "id": 3019, 
      "sentiment": 3, 
      "subject": "Brandon mews theft", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2002"
    }
  ]
}