{
  "summary": [
    {
      "body": "We have wood flooring in our flat (I think it's \"engineered wood\" floorboards, rather than solid wood or laminate). Some of it by one of the floor-ceiling doors/windows has started buckling, and there's a mouldy smell -- I think something's wet under there. I can't tell if water's coming in from outside, so I guess we'll have to try and take some of the floor up to see what's happening. Rather than do it myself and cause stupid damage, does anyone have good experience with a company or person who have laid wooden flooring in the Barbican? Any suggestions appreciated, thanks. (Yes, I know wooden flooring isn't allowed so please don't start going down that route, thanks. The floor was installed by the people we bought the flat from, and we always take our shoes off when we get home.)", 
      "date": "2006-11-20 14:53:00", 
      "id": 3224, 
      "responses": 21, 
      "subject": "Wooden floor companies/people?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2761"
    }, 
    {
      "body": "I have been through all the  flooring options for my flat, and am dead keen on getting a fawn coloured resin coating, or screed, highly polished. See this   link for a view of what I am after  I am convinced that this could be the ultimate flooring solution for the Barbiacan style of flat. Has anyone had any experience of this service? Max", 
      "date": "2005-12-09 00:20:00", 
      "id": 3037, 
      "responses": 14, 
      "subject": "floor screed", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1978"
    }, 
    {
      "body": "I am very much looking forward to moving into a large-style studio later next month.  It currently has a badly-laid, cheap, laminate floor throughout.  I realise this is in breach of the lease, and shall be removing it. I'm considering stripping the floor back to its original concrete, and painting it white.  Has anyone already done this in their flat?  Any tips or warnings?  Is special paint required because of the under-floor heating?  Being a DIY-loser, could you recommend someone who knows how to make good, paint and seal a concrete floor? Any sage words would be much appreciated! Nigel", 
      "date": "2006-08-24 10:31:00", 
      "id": 4461, 
      "responses": 6, 
      "subject": "Concrete floor", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2554"
    }, 
    {
      "body": "Does anyone have any experience of Amtico floor tiles? We would like to put them on the kitchen floor and are concerned about the effect of the underfloor heating on the tiles.", 
      "date": "2005-08-27 18:08:00", 
      "id": 2987, 
      "responses": 5, 
      "subject": "Amtico flooring", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1822"
    }, 
    {
      "body": "Sorry I feel as if I am taking over Barbicantalk recently! I was just wondering, does anybody know whether you can lay lino over underfloor heating, or does it crack? Can anybody reccommend some nice (easy to lay!)  flooring that could go over underfloor heating?", 
      "date": "2007-04-12 20:47:00", 
      "id": 4377, 
      "responses": 5, 
      "subject": "Lino on underfloor heating?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3225"
    }, 
    {
      "body": "I am looking at different options for an alternative to carpet. I've been recommended rubber flooring: it doesn't create noise like wooden floors, and it's meant to look very nice. Has anyone installed this in their flat? I'd be interested in knowing a) how hard wearing it is b) how easy to clean c)whether it insulates the underfloor heating too much. Thanks for any advice", 
      "date": "2005-08-15 11:42:00", 
      "id": 2974, 
      "responses": 4, 
      "subject": "Anyone tried rubber flooring?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1807"
    }, 
    {
      "body": "Hi, I am about to invest in quite an expensive floor for my flat. I was wondering what the chances are of needing the underfloor heating servicing, as I understand this is quite an intrusive job. Or, is it possible to get it serviced prior to having the floor put down? All help appreciated Max", 
      "date": "2006-01-04 16:25:00", 
      "id": 3030, 
      "responses": 4, 
      "subject": "underfloor heating / servicing", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2012"
    }, 
    {
      "body": "It seems like there are mini-volcanoes growing from my living room floor, under my carpet.  I'm wondering if it's something to do with the underfloor heating / concrete. They are very hard, and there seem to be quite a lot of them. I've only noticed them in the last few months, having lived here for 14 years. Before I pull up the carpet or contact the Estate Office, I'm wondering if  anyone else has had anything like this happen?", 
      "date": "2006-02-09 11:40:00", 
      "id": 4572, 
      "responses": 4, 
      "subject": "Bumps under carpet", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2063"
    }, 
    {
      "body": "Hi I was thinking of changing the flooring in my kitchen and loo as the old vinyl (I think?) is looking a bit worn.  Does anyone have any suggestions as to what to replace it with or have any recommendations as to where  to buy?   I'm looking for something dark (ish), sleek and modern that won't be damaged by my jupming washing machine... Thanks very much.", 
      "date": "2006-07-29 16:53:00", 
      "id": 3125, 
      "responses": 3, 
      "subject": "Flooring for kitchen and loo", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2489"
    }, 
    {
      "body": "I have recently moved here to a virtually original flat.  The oven door no longer closes fully and heat is escaping.  Is there an alternative to a new oven? Can someone let me know what the original kitchen floors were and if there is a modern day equivalent. Thanks", 
      "date": "2007-07-28 16:47:00", 
      "id": 4107, 
      "responses": 3, 
      "subject": "Oven door and kitchen floor", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3540"
    }, 
    {
      "body": "Hi We're looking into changing our floor from (a worn-out) carpet to something fresh-looking (and hopefully long-lasting) like rubber. Has anyone got any good advice on suitable rubber flooring? In particular, can anyone recommend a system which is as good as carpet for stopping sound transmission to the floor below? I don't want to annoy the neighbours!", 
      "date": "2006-05-08 06:48:00", 
      "id": 3090, 
      "responses": 2, 
      "subject": "Rubber floors", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2271"
    }, 
    {
      "body": "Has anyone ever experienced a hot spot on the floor related to underfloor heating? If so, how hot is it, what kind of area would it be, and what are the implicatins? Thanks Max", 
      "date": "2006-03-10 09:05:00", 
      "id": 4609, 
      "responses": 2, 
      "subject": "underfloor heating - hotspot", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2125"
    }, 
    {
      "body": "Has anyone had experience of fitting rubber flooring in their flat. If so, can I ask if it is practical, and the name of a tradesman who can do a good job of fitting it? Thanks in advance Max", 
      "date": "2005-11-15 15:31:00", 
      "id": 4527, 
      "responses": 1, 
      "subject": "rubber flooring", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1936"
    }
  ]
}