{
  "summary": [
    {
      "body": "Last night I watched 13 young men of about 18-19 years old break into the gardens. They arrived in several groups and spent about an hour shouting, hanging around by the lake and climbing up and down a section of fence. This is a cause for concern, especially for residents at ground level. I have often thought that it's all too easy to access the gardens from outside. Obviously others know this too.", 
      "date": "2006-10-27 08:45:00", 
      "id": 4306, 
      "responses": 12, 
      "subject": "Security in the gardens", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2704"
    }, 
    {
      "body": "Why has the escalator and its surrounds at the Moorgate Station entrance to the Barbican Estate been allowed to fall into such a bad state of repair? Paint peeling from the ceiling, strange damage to some of the tiling from damp(?) and usually in a pretty filthy state particularly at street level hardly gives a good impression to visitors to the Arts Centre and we residents. Is there some reason for the rundown appearance?", 
      "date": "2007-12-01 12:44:00", 
      "id": 3513, 
      "responses": 5, 
      "subject": "Escalator from Moorgate Station to Barbican Estate", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3830"
    }, 
    {
      "body": "Does anyone know who has the key to the barrier by Crowders Well? The CPAs don't know, and Central Services weren't very helpful. It is information which should be available in case of an emergency - supposing there was a major incident and and the emergency services had to get on to the Terrace? I'm not very impressed.....", 
      "date": "2005-05-28 11:40:00", 
      "id": 4723, 
      "responses": 4, 
      "subject": "Vehicle access to St Giles Terrace", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1651"
    }, 
    {
      "body": "Twice in recent weeks the new lift at the eastern end of the estate has broken down.  The telephone number posted for emergencies actually leads to the Guildhall switchboard.  They have no record of who is responsible.  The Corporation failed to pass relevant material sent to them from the then builder Ardmore-Mace (now fired by Gerald Ronson for not being tough enough in their dealings with residents and the Environmental Health people when damage was caused to a number of flats due to their work).  Ardmore-Mace says it is not responsible.  So the fire brigade had to be called.  Anyone using the lift should be aware that aside form shouting no help is available.  The Corporation was informed at least a fortnight ago and still no telephone numbers have been posted. They even claimed that the lift should be maintained by the Estate!  News to the Estate and our excellent engineers.  The Estate was unaware of this and, in any case, the Estate would not assume responsibility for a year after construction.  One trusts that the Estate will charge the Corporation for staff time.   So use that lift at your own risk.  If you press the bell no one who can do anything is altered.  If you use the telephone you get the staff at the Guildhall or the new call centre and the reply that the lift does not exist or they know nothing.  The name of the contractor and an emergency telephone number should be there by law.  It is not.  The Corporation has done nothing about this that has led to an improved situation.   However, the alternative of the exit from Willoughby 03 car park is also very uncertain.  The door has been out of action at least twice over the last fortnight nicely coinciding, on occasion, with the lift on the podium being out of action. People in wheelchairs and other people with walking difficulties have no way out from that corner of the estate unless someone with a pass key kindly takes them through Willoughby House and that is a long way around.", 
      "date": "2008-02-03 10:22:00", 
      "id": 3625, 
      "responses": 2, 
      "subject": "Corporation incompetence?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3977"
    }, 
    {
      "body": "Is the Barbican slowly becoming an island? Two Wood Street access point have been lost and I found hoarding blocking my way at the Andrew's end of the estate yesterday. I suppose it makes us more secure in some ways but it looks as though the estate is becoming cut off and the corporation must be making money out of giving rights of access away for office space?", 
      "date": "2005-10-11 09:58:00", 
      "id": 3117, 
      "responses": 1, 
      "subject": "Island Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1876"
    }
  ]
}