{
  "summary": [
    {
      "body": "I intend to buy a flat pack wardrobe system from IKEA and to have it delivered, as I don't drive. The puzzle is whether a 236cm x 50cm pack (plus a little extra for the packaging) will fit in the lift at BJH. If not, it's a long haul up all those stairs! Can anyone with experience of this situation advise me, please?", 
      "date": "2006-12-10 01:16:00", 
      "id": 3307, 
      "responses": 5, 
      "subject": "Flat pack wardrobe conundrum", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2818"
    }, 
    {
      "body": "Question: is a 2300 x 850mm sofa likely to fit in the Barbican lifts? I suppose there must be a way of measuring but I'm not good on these things.", 
      "date": "2006-02-27 16:35:00", 
      "id": 4198, 
      "responses": 4, 
      "subject": "sofa question", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2105"
    }, 
    {
      "body": "I don't know if anyone can help... I'm due down to our flat (5th floor Andrewes House) on Tuesday and want to bring some flower pots down for our balcony overlooking the lake. I foolishly forgot to take a measurement before we came away and wanted to buy the plots tomorrow. I wondered if anyone might be able to take a quick measurement and let me know the max. diameter we'd be able to fit between the glass planel and the wires across the front. Thanks in advance! Simon", 
      "date": "2007-08-05 08:19:00", 
      "id": 4113, 
      "responses": 2, 
      "subject": "Max. width of flowerpot?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3562"
    }, 
    {
      "body": "I know this is deathly, but could some kind soul tell me the dimensions of the window space in the larger of the two bedrooms in a type 21. (As it's for curtain purposes I should probably ask to include the door area too). I do not have access to the property at present but I need to organise curtains or some other method of protecting our modesty - suggestions encouraged! Many thanks", 
      "date": "2007-01-12 16:21:00", 
      "id": 4190, 
      "responses": 2, 
      "subject": "Window measurements", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2902"
    }
  ]
}