{
  "summary": [
    {
      "body": "I discovered recently that Holmes Place Barbican has significantly reduced its off-peak hours (but of course without any corresponding reduction in its membership fee). They've also introduced a new rule that off-peak members aren't admitted more than 30min before the end of the off-peak period and need to leave before it ends - before so long as you entered within the off-peak time you could stay as long as you liked. Aside from meaning they now offer considerably worse value for money for off-peak members, this is plainly in breach of their membership conditions (which do not mention them having any right to vary off peak hours). I strongly urge any off-peak members to write to the manager, Andy Francis, and ask him to reinstate the previous rules, or at least offer a significant reduction in price.", 
      "date": "2005-09-09 18:18:00", 
      "id": 3234, 
      "sentiment": 1, 
      "subject": "Holmes Place hours change", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1835"
    }, 
    {
      "body": "One of the advantages of living in the Barbican is the availability of car parking spaces to all residents (for a fee), and also the availability of spaces for guests (free of charge, for up to 5 hours I think). If the Corporation reduces the number of spaces, and creates scarcity, then first of all it will feel justified in increasing the fees associated with the parking - that's simple economics (cf the huge rent increases they wanted to impose on our underground storage rooms, where there is scarcity).  And secondly new residents may find that a parking space is very difficult to get hold of - thereby potentially reducing the value of our property in the market. When I bought my flat the ease of acquiring a parking space directly below my building was a distinct selling point. It seems to me that the easy availability of parking is a benefit we all currently enjoy (even if we don't have a car), and if we lose that benefit then the Corporation should compensate us.", 
      "date": "2007-11-11 12:49:00", 
      "id": 3468, 
      "sentiment": 1, 
      "subject": "loss of car parking spaces", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3785"
    }, 
    {
      "body": "OK, this is a bit belated, but I'm up to the August post now. In the September service charge statement, it says we got a Refund of Supervision and management Charges for the period 01/04/1999 to 31/03/2007. This amounts to 170 for our flat.  My question is this (for the more legally minded I expect): are we expected or required to pay the previous owners of the flat their share? For example, if we bought the flat on 01/04/2003, would the previous owner get 4 years of the refund (50%)? Or is it all mine?", 
      "date": "2007-11-12 20:12:00", 
      "id": 3472, 
      "sentiment": 1, 
      "subject": "Refund of Supervision and Management Charges", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3790"
    }, 
    {
      "body": "IF you are disturbed by the current illegal cable laying in Aldersgate street, please call the guidhall to complain 606 3030.  They then tell environmental health. They've just run away, leaving all their kit but they are the kelley group, and the more complaints the better my big question is why is there no enforcement of the rules on raod works?", 
      "date": "2008-02-25 22:29:00", 
      "id": 3527, 
      "sentiment": 1, 
      "subject": "Aldersgate St roadworks 10 pm", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4060"
    }, 
    {
      "body": "One page flier advertising a one evening consultation meeting posted through Speed House doors today.  Private company to build the flats and sell them but not clear if the freehold will remain with corporation.", 
      "date": "2008-01-24 00:15:00", 
      "id": 3613, 
      "sentiment": 1, 
      "subject": "Frobisher crescent to be turned in to flats", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3947"
    }
  ]
}