{
  "summary": [
    {
      "body": "I saw that in today's CityAM paper that Wallside has been featured following the buyout of the lease from the Corporation of London (or whatever they are now) to freehold. According to some this adds 30K to this type of property. Mind you they have a valuation of between 1m and 1.2m", 
      "date": "2006-01-12 11:57:00", 
      "id": 3040, 
      "sentiment": 3, 
      "subject": "Leasehold", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2030"
    }, 
    {
      "body": "I know that the following is going to cause a stir. I swear I am writing this with no intention whatsoever of provoking anyone but to canvass views on the subject. I have a friend whose dream is to move to the Barbican. His only \"problem\" is that he owns a little, cute, lovely and well trained dog.  The dog does bark every now and then. But, having said that the new born baby opposite screams keeping me awake most nights and the next door neighbour blows her hair dry at 6.30-6.45 every morning (saturdays and sundays included)!   My friend fully understand that keeping a dog in a block of flats requires extra care to minimise the impact on other residents (e.g. he would never let the dog running around in the gardens fouling the grass-mind the geese already do!). In fact, he already lives in a \"well-to-do\" block of flats in Clerkenwell and has never had any complaints about the dog. Most residential leases of blocks of flats contain restrictive covenants about the keeping of pets. However, these are generally regarded as \"old fashioned\" and as such largey ignored and seldom enforced. Why cannot be the same in the Barbican? Why people have to be deprived of the joy of having a pet? Why cannot pets be allowed (perhaps subject to introducing \"ad hoc\" rules)?   I am also thinking here of the elderly residents to whom the company of a cat and/or small dog could make such a difference.", 
      "date": "2006-08-18 11:19:00", 
      "id": 3167, 
      "sentiment": 3, 
      "subject": "Pets", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2537"
    }, 
    {
      "body": "Forgive the rant... Today I put my Volvo S60 into the Volvo main dealer (yes I know they're dearer, but the car's quite new and I wanted to maintain the Volvo Service History). Usual thing - they were to give me a call with the prices of the work that was required. Well, the list was as long as the arm of a really tall person (possibly even an orang-utan) and included a number of things that struck me as a bit iffy. 30 quid for a windscreen wiper blade - when I have recently driven the car in the rain and the wiper worked perfectly - struck me as both overpriced and also as an attempt to take advantage. There were a number of other fiddles that I spotted, but the crowning glory was the quote of 225 quid to replace engine coolant. Now I'm not a mechanic, but even I know its nowhere near that expensive, so I rang the ever friendly Batt Bros who usually do my MOT. After collapsing in giggles, they suggested I have a chat with their friends at Cremer Street garages (just off Hackney Road, a 10 minute drive from the Barbican). I took the car there just now and was a) shown how to check the engine coolant myself, and how to change it if it ever needed changing (a 15 minute job, tops) b) shown categorically that the engine coolant was completely full and that, assuming normal usage, there will be no need to top up any further unless we anticipate UK weather being below - 25 to -31 degrees centigrade So on that basis, I would like to suggest that  a) drivers avoid Volvo main dealers like the plague,  b) any lawyers who can advise me if this is attempted fraud get in touch, and  c) that the chaps at Cremer Street and Batt Bros on Cambridge Heath Road are top fellas and deserve our custom. (see recommendation on classified board).", 
      "date": "2007-04-02 17:49:00", 
      "id": 4357, 
      "sentiment": 3, 
      "subject": "A tale of two garages...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3201"
    }, 
    {
      "body": "I am very much looking forward to moving into a large-style studio later next month.  It currently has a badly-laid, cheap, laminate floor throughout.  I realise this is in breach of the lease, and shall be removing it. I'm considering stripping the floor back to its original concrete, and painting it white.  Has anyone already done this in their flat?  Any tips or warnings?  Is special paint required because of the under-floor heating?  Being a DIY-loser, could you recommend someone who knows how to make good, paint and seal a concrete floor? Any sage words would be much appreciated! Nigel", 
      "date": "2006-08-24 10:31:00", 
      "id": 4461, 
      "sentiment": 3, 
      "subject": "Concrete floor", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2554"
    }
  ]
}