{
  "summary": [
    {
      "body": "the other day my partner was on the balcony (we're in bunyan) and saw two large chavettes walking their dog near the lake under bunyan court. they were repeatedly throwing a ball into the water and trying to get their dog to attack the big golden carp in the lake. the dog didn't seem very interested, but they kept trying. my partner yelled out, \"hey! you! leave that fish alone!\" so they sauntered off.  about 20 minutes later, they were back doing the same thing. he shoo'ed them away again. so if anyone's on their balcony in the area, keep an eye out for them. they seemed like they were regular visitors to the lake.  has anyone noticed, btw, that they've added five new goldfish to the bunyan lake? they like to hide under the duck slide. i think the carp is excited to have the company.", 
      "date": "2005-08-27 12:46:00", 
      "id": 2983, 
      "sentiment": 2, 
      "subject": "estate fish in vicious chav dog attack danger!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1820"
    }, 
    {
      "body": "Apparently someone in Brandon Mews had some wine stolen from their kitchen windowsill (where it was cooling) a few days ago - it seems whoever took it just carried a ladder into Willoughby 03 car park, climbed up and took it. Fortunately whoever did it ignored my large pot of red cabbage chilling on my own kitchen sill (thieves these days have no taste), but this is a worrying development, since if someone can climb up to a window with a ladder without being challenegd it is only a minor further step to break in.  It seems likely to me that this would not  have happened if the Willoughby 03 CPA office was properly manned - these days it is empty 95% of the time. The Corp have said it will be replaced with an electric gate controlled by the 01 CPA but while the gate has been installed it's not yet in operation. How long until this lacuna is filled?", 
      "date": "2005-12-30 15:27:00", 
      "id": 3019, 
      "sentiment": 2, 
      "subject": "Brandon mews theft", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2002"
    }, 
    {
      "body": "Riots in and outside the YMCA, paint colour wars, satanic children and smashed glass in BJH and drunken hoodies under Bunyan. What's going on on our northern fringes? Is there something in the water? ", 
      "date": "2006-05-06 22:29:00", 
      "id": 3097, 
      "sentiment": 2, 
      "subject": "what's up??", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2266"
    }, 
    {
      "body": "Apropos to the subject raised ( Barbican Demographics ) by Edward Dudley on this site a short time ago I wondered whether the glut of shopping trolleys found round the Barbican might be added to the research he's asking for. It seems since time began, or at least looking back to the time Safeway cast it shadow on Whitecross Street, the humble shopping trolley has become part of Barbican life. It's so wonderfuly easy to take one that's cooling it's heels on the Estate and bring it back to where it belongs, fill it with goodies at source...but to wheel it back home!...doesn't that take a lot of guts? Especially to be seen on the streets with the thing that belongs to someone else? Doesn't it feel WRONG?      Nicking them from the market, on the other hand, certainly helps every plumber, carpenter, electrician, painter et al that works in our behalf here but with what they charge they could have a custom built one to their own specifications I would think.       It seems that one of the largest employers in the lovely city of Wells is one that churns out 250,000 of the things per year, one of the few things actually made in this country any more. One day when Waitrose realizes that adding a coin addoition to their trolley this saga might peter out somewhat. If those who are the perpetrators would journey up to Old Street and check the selection of shopping trolleys at Argos it would do away once and for all with sneaking someone elses out of the store!        I've seen trolleys from as far a field as Tesco, Sommerfield, Sainsbury and for heavans sake Liverpool Street Station, ho hum! ", 
      "date": "2006-11-20 14:58:00", 
      "id": 3207, 
      "sentiment": 2, 
      "subject": "The humble shopping trolley", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2762"
    }, 
    {
      "body": "Does anyone know why there were dogs barking, yelping and whining for over an hour at around 4am this morning? I had a broken nights sleep as the noise was so loud.  When they came nearer to Andrewes House car park I heard voices and it sounded like the dogs were being trained, it occurred to me perhaps as police dogs? Does anyone know if this sounds likely, or was I getting delirious in my slumbers?!  I hope it doesnt happen againwhy cant they do it during more sociable hours? Does anyone have any explanations? Thanks Joni", 
      "date": "2008-05-14 14:43:00", 
      "id": 3592, 
      "sentiment": 2, 
      "subject": "Dogs Barking!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4339"
    }
  ]
}