{
  "summary": [
    {
      "body": "whilst reading about the mendohlson tree, i wondered ...  whilst recognising that we are indeed very lucky in our police resources, is there a specific reason why the bored-out-of-their-minds security staff from the arts centre can't cast their net wider ... ? I ask because the  lovely gardens by bunyan / jt / bryer are a bit of an attraction for the \"malcontents\" because they're so lovely and lush and screen things from public view ... the group of youths, for example, referred to in previous posts i think, have taken to drinking under bunyan - having re-located from jt ...  presumably the answer is the security guards are employed by the arts centre but i wonder how whether the financial equation to extend their duties to the rest of the estate would be a cheaper option than using the police and the cost of repairs (when things can be repaired, that is, unlike the tree sculpture...) just a thought", 
      "date": "2006-05-01 23:08:00", 
      "id": 3084, 
      "sentiment": 3, 
      "subject": "security", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2244"
    }, 
    {
      "body": "We are about to complete on a purchase in the Barbican, a part of London I never appreciated until becoming a parent last year. It's manifest safety and quiet, compared to anywhere else I've lived in London, are now much more important than the stained futuristic penal-colony exterior which so turned me off in the past and which I now find merely bleak. I've lurked here for a few months (and am familiar with the state of play of the \"kids will be kids\" versus the \"stop the rot\" positions) but going on the evidence of barbicantalk.com alone there is a distinct heating up of crime and disorder. The Barbican seems, to this outsider, to be a nigh-on perfect place to live if you've got small children, but drunks (of any age) shouting and smashing windows at BJH can overturn that in a trice. I'm with the 'stop the rot' faction. You can be young and hang around with your mates and get drunk without shouting and wrecking.", 
      "date": "2006-10-09 11:45:00", 
      "id": 3208, 
      "sentiment": 3, 
      "subject": "Violence, noise (and vermin) - just another day in EC2Y ?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2669"
    }, 
    {
      "body": " We were made aware last weekend of complaints listed on this website about actions by us or our contractors. I immediately started an investigation as we take these complaints very seriously. We have spoken at length, prior to being allowed on site, to all workers about a number of issues including hours of working, attitude when working and respecting that this is a residential neighbourhood. I have repeated this following last weekend to ensure that all workers know that any failure to respect these rules will mean they risk disciplinary measures and dismissal from the site. Following my investigation I received an apology from the scaffolder who swore, he is the foreman and it was out of character. He denies the incident happened at the time stated and was clear that he was not present on site at that time and neither were his team. I cannot prove he was there but have given him a final warning over the swearing. He is going to write to the resident who first made us aware of the complaint (this has been made possible by your Chair asking the complainant for his address). The second issue was my email address, it is working now but was not last weekend and I apologise. Thirdly I delayed this statement to you until after we had met with your representative's on Thursday night as part of our regular consultation on the planning and construction of Milton Court. This was to ensure that we had covered all the issues and had made ourselves accountable. Fourthly I was asked if we could repeat the hours of working we are keeping to, these are: Monday to Friday hours, 08:00-10:00, 12:00-14:00 and 16:00-18:00 Saturday hours, 9:00-2:00pm with no noisy works Sunday, No work Fifthly for ease here are the ways of contacting me. I hope you will not need to but would prefer that you had it easily to hand. Please contact me on 07823 442024 or   Finally I wanted to update you on the fire that occurred on the Milton Court site on Thursday. The fire was restricted to the fire station training tower in the courtyard area of the site and was caused as a result of the burning operations that were being undertaken by Cantillon on the steel sections of the tower. Once the fire was detected, the Emergency Plan was put into effect by Cantillon - the site was evacuated and the emergency services contacted. The emergency services arrived within minutes and the fire was very quickly put under control. The sheeting around the site did its job in containing the fire for longer allowing for safe exit from the site and the arrival of the fire services. The sheeting shrank and melted on the upper floors, without giving off toxic fumes or separating from the structure.  The roads around the immediate site were sealed off by the police as a precaution. Once the dousing down was completed, the scaffold to the tower were inspected by Cantillon and the District Surveyor and it was found that there was no apparent structural damage caused to the scaffold itself. The scaffold sheeting is now being removed and a more thorough inspection of the scaffold has taken place along with the clean up operations generally. No one suffered any injuries and no evacuation of adjacent premises was necessary. No delay to the project is anticipated and the whole episode was dealt with over the space of a couple of hours. This incident has of course been reported to the statutory authorities. Thank you for your understanding over both these incidents. I hope I have given a helpful explanation and that as we go forward with this project we can be a good neighbour to you. Yours faithfully Andy Dyson", 
      "date": "2008-01-13 15:22:00", 
      "id": 3559, 
      "sentiment": 3, 
      "subject": "Statement from Andy Dyson, Project Director for Cantillon", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3926"
    }, 
    {
      "body": "Not the furry kind but the shop variety. I finally had the excuse to go into the lovely shop Fox by Moorgate and London Wall and it was worth the wait. Although I couldn't find everything I needed the service was brilliant and I've now got matching belt and shoes... gorgeous! If ever you find yourself with an excuse (& cash) or just curious I can certainly recommend it. Stark contrast to my encounter in Ede and Ravenscroft (Cambridge branch) last week when buying clothes for my Civil Ceremony. Having gone through the whole measuring and trying bit for 1/2 hour, the shop assistant (boring dry personality) asked what the suit was for. When I told him, it was just like the scene of the conservative lady in Little Britian, I thought he was going to ask to wash his hands! Needlessly to say I just left.", 
      "date": "2008-04-25 11:00:00", 
      "id": 3891, 
      "sentiment": 3, 
      "subject": "Fox", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4274"
    }, 
    {
      "body": "I wonder if the complete absence of litter bins on the podium, except for those in the Speed House andd Defore gardens, bothers anyone? There are times that litter accumulates to such a degree that I yearn for that long gone receptical that at one time was seen round about and many time full to overflowing.        I realize our litter bins were removed about the time the IRA were using both litter bins and post boxes to house their explosives in their dastardly campaign in England. But since the troubles, and the long awaited answer to the final solution, things have taken a turn for the better I would assume the recepticals might effect a long awaited return.         I've inquired, of the Corporation on a number of occasions, when   might the bins again appear and on each instance came the reply ' we are in the process of perfecting a bomb proof litter bin '!!! Remembering the year of my first inquiry, 1998 I believe, finding the material and answer to this problem seems so far to escaped their search.          Very possibly I won't have the pleasure of seeing the bins in my lifetime but I hope for those who follow me here on the Estate litter hopefully will if not be a thing of the past at least will be lessened. Am I asking too much and are there any comments out there?", 
      "date": "2007-01-14 13:12:00", 
      "id": 4139, 
      "sentiment": 3, 
      "subject": "The long absent litter bin!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2905"
    }
  ]
}