{
  "summary": [
    {
      "body": "We were amazed and thrilled last night at around 9:30 to see a fox slinking along the podium under Speed House. We followed him along the podium, up the stairs to the conservatory where he (or she) pattered off towards the Golden Lane Estate. Even though it was a bit of a scrawny specimen, it still struck us as rather grand to be living amongst wild mammals in the heart of the city. Or are there any horrendous down-sides to sharing our homes with  ?", 
      "date": "2004-07-11 20:12:00", 
      "id": 1506, 
      "sentiment": 3, 
      "subject": "Fox on the podium", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&hilit=foxes&t=1190"
    }, 
    {
      "body": "We were amazed and thrilled last night at around 9:30 to see a fox slinking along the podium under Speed House. We followed him along the podium, up the stairs to the conservatory where he (or she) pattered off towards the Golden Lane Estate. Even though it was a bit of a scrawny specimen, it still struck us as rather grand to be living amongst wild mammals in the heart of the city. Or are there any horrendous down-sides to sharing our homes with foxes?", 
      "date": "2004-07-11 20:12:00", 
      "id": 2902, 
      "sentiment": 3, 
      "subject": "Fox on the podium", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1190"
    }, 
    {
      "body": "All As you might have seen the postal service of leaving parcels and letters with CPA's was restored following our meeting on Friday.  Thanks must go to Nicola Baker and Richard Morrison who led the meeting and discussions with the Post Office and Sharon McLaughlin from the BEO who pushed the issue from the Estate Office perspective. The resumption is however tempororary and was made possible by the BA making a formal request for the service to be resumed.  The Post Office wanted indemnities from us absolving them of responsibility for non deliveries which we refused to give as this would let the Post Office off the hook for non delivery of items due to their negligence (which is the usual cause). We will have to look for a longer term solution which will probably take the form of an opt out register of those people who do not want mail left with CPA's and would rather trek to Mount Pleasant.  I envisage a bureaucratic quagmire with this but we will probably have to go through the motions to keep the Post Office on side. We will keep on top of this.  Hopefully however we will not get a repeat of this nonsense for another 15 years (when I gather it happenned before). Stephen Horrocks PS  Sorry to leave you in suspense all weekend - I've been recuperating from a operation", 
      "date": "2004-12-13 08:17:00", 
      "id": 2905, 
      "sentiment": 3, 
      "subject": "Postal Service Restored", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1382"
    }, 
    {
      "body": "when i went for a walk earlier to admire the rain stained concrete, there were three of the orange carp (?) lying by the side of the lake at the top end near brandon ... one was being pecked by a seagull and much to my horror i discovered the poor thing was still alive (it swam off when i slipped it back into the lake - i like a happy ending) the other two had been more than partially eaten ...  what do people think is fishing the fish out?  is it the manic seagulls? the murderous geese? the heron - but i thought that would just swallow them? the feral youth? the noisy neighbours' children?  i know they're only fish but it was quite a sad sight ...", 
      "date": "2006-05-06 20:31:00", 
      "id": 3085, 
      "sentiment": 3, 
      "subject": "lake casualties", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2263"
    }, 
    {
      "body": "Andrewes House pond-side, the nasty Canadian geese have produced 6 of the fluffiest goslings ever. Worth a look.  I'll be watching the ducks to see if they exact revenge on the little ones.", 
      "date": "2006-05-11 08:46:00", 
      "id": 3101, 
      "sentiment": 3, 
      "subject": "Canadian goslings", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2282"
    }
  ]
}