{
  "summary": [
    {
      "body": "Although there have been a few posts on bike parking, I thought that - before approaching the Estates Office - it would be helpful to see whether there is support for better ( ) facilities to lock up bikes in the car parks. Although the bike park coffins are available, at 70 p/a these are fairly pricey ... Would anybody else support me in asking for just some basic racks that took up a couple of (empty) car park spaces that we could actually lock bikes to? This would cost virtually nothing.  Surely the Corporation could do this to enhance its green credentials?", 
      "date": "2007-08-16 18:06:00", 
      "id": 3432, 
      "sentiment": 2, 
      "subject": "Support for basic bike rack in car park?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3594"
    }, 
    {
      "body": "Yesterday, I have learned that the we can have the plants of the flowerbeds for free , only ask the gardeners.  I would like to exhort the BEO  a) to create a system to recycle at least the geraniums that overwinter in the Barbican without no problems and to offer the plants that otherwise will be thrown away to the residents in order to make the Barbican a greener place. b) use the a. m. geraniums to embellish Frobisher Crescent that looks complete concrete to me. Love Strawby", 
      "date": "2007-10-15 13:56:00", 
      "id": 3449, 
      "sentiment": 2, 
      "subject": "Plants of flower beds", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3727"
    }, 
    {
      "body": "Are people in favour of having compost bins discretely dotted around the Barbican for us to put our green waste into? The resulting compost could then be used on the gardens. Having composters would reduce the amount of rubbish we are generating and would solve the paper v. plastic bin bag discussion - the paper bags won't get soggy because the rotting veg will be in your compost bin.", 
      "date": "2008-02-16 17:56:00", 
      "id": 3507, 
      "sentiment": 2, 
      "subject": "Compost in the Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4029"
    }, 
    {
      "body": "Ok, people, here's another hardy perennial. It's now getting VERY COLD.  I feel the cold quite badly and am at home much of the time (like many others in the Barbican) and the free-standing electric heaters which we have just don't do the job properly. Not to mention the fact that we've already spent a small fortune this summer on using them because the weather was so cold some of the time. I rang the BEO to be given the usual \"oh, we never turn the heating on until October\". I pointed out that if it gets cold before the beginning of October, and enough people request it, then it can be turned on earlier (as has happened in previous years) so I was getting my request in early this year. This went down like the proverbial lead balloon. Apart from being cold, I'm also very annoyed. It seems to escape the notice of BEO staff that RESIDENTS PAY FOR THEIR HEATING through the service charge and if we need it turned on slightly earlier then we're perfectly entitled to have it. It's always a rather worrying situation when those in charge of your heating system a) don't live here and b) have a vested interest in keeping the cost down. I know that our heating system is an ongoing concern because of its incredibly complicated time/temperature triggers (nothing like a simple thermostat here) and also because it is hopelessly antiquated but it shouldn't be such a battle to get it turned on every year. I don't want to knock the BEO staff because usually they provide a very good service - but this one really gets me going   So, please - ring your House Officers and request that we have access to our own heating. It still takes about a month for the buildings to warm up properly so, even if it goes on now, it will some time before we really start to feel it. House Officers' telephone numbers are:-   Andrewes, Brandon, Cromwell, Gilbert, Speed and Willoughby - Helen Davinson on 7029 3963 Defoe, Lambert Jones, Lauderdale, Mountjoy, Postern, Seddon, Thomas More and Wallside - Sarah Styles on 7029 3962 BJH, Breton, Bryer, Bunyan, John Trundle and Shakespeare - Rebecca Marshall on 7029 3964. Yours in scarves and sweaters etc. etc.", 
      "date": "2007-09-26 15:09:00", 
      "id": 3804, 
      "sentiment": 2, 
      "subject": "HEATING!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3692"
    }, 
    {
      "body": "Sometimes I sit in the dead of night thinkng how terribly unfair life is when one thinks of what the government squeezes from our earnings each and every year, four months for the dastardly chancellor and what's left on the table as a tip for those who continue to labour in the fields. It all seems such a rip off when one consideres what we get in return. I try my very best to save a bit here and and a wee bit there but at the end of the day to no avail.  And then I harken back to a subject that has rumbled through my mind since first I moved to the Barbican a long time ago, the water meter or lack of same! I was told by the Corporation that for some reason that at this writing escapes me  meters can't be installed here but to compound the felony another fact arises out of the mire that I've just been made privy too...Britain has allowed itself to become the only country in Europe that does not meter it's domestic water supply!  Take a family of two here on the estate who knows full well that when their water bill arrives they will be forced to pay EXACTLY the same total as a family of five! I don't know whether the readeris at all interested in my thoughts but somehow if by a miracle each and every flat is issued a meter I would think the resident would be gob smacked when the next bill arrived. Comments?   ", 
      "date": "2006-09-23 14:52:00", 
      "id": 4265, 
      "sentiment": 2, 
      "subject": "Is it past time for a water meter?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2621"
    }
  ]
}