{
  "summary": [
    {
      "body": "One of the nice things about the Barbican gardens has been the fact that they are free of mess.  At the weekend I went to the Defoe garden and couldn't believe how much crap there was on the ground.  It wasn't hard to see why since there were two geese and five half-grown geese parading up and down.  Seven big and quite aggressive geese is beyond a joke and stepping around mounds of goose turds is not funny either.  I seem to remember reading that the Corporation hadn't received enough complaints to justify the hassle of getting rid of the geese.", 
      "date": "2006-06-27 14:18:00", 
      "id": 3144, 
      "responses": 19, 
      "subject": "Goose crap in the gardens", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2400"
    }, 
    {
      "body": "Is anyone as fed up as I am with the dreary sight of this abandoned establishment?  Whilst believing that this is no place for a public eatery, with late night carousing et al (NIMBY!!), surely the Barbican powers that be owe it to the residents to clean up the appearance of the empty store. I am sick and tired of looking at dead plants, dirty windows and broken furniture.  It is years since the last owners cleared out - or did not clear out as the case may be.  Can't someone creative take down the signs and cover the windows (I have seen this done to effect with old doors elsewhere) as it certainly does nothing for the aesthetics around here!", 
      "date": "2008-05-14 13:44:00", 
      "id": 3599, 
      "responses": 8, 
      "subject": "Pinxtos Bar", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4338"
    }, 
    {
      "body": "Over the past year or so my wife and I have watched the planters, adjacent to Willoughby House and gardened by the BHS, deteriorate to such an extent that we wondered whether they no longer were attended by it's members. Many have become an absolute eyesore which is a shame since they at one time were a pleasure to view. In the past, and talking to the gardner/members upon seeing them at their labours, made the mini planters doubly interesting. It's unfortunate that this situation has taken place since the 'log' planters were given to the BHS years ago by the Corporation of London with the idea that adding colour to the walkway could only add to rather neuter area. Any member or officer of the Society care to comment?  ", 
      "date": "2007-07-21 14:15:00", 
      "id": 4057, 
      "responses": 6, 
      "subject": "Barbican Horticultural Society podium planters.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3526"
    }, 
    {
      "body": "Why has the escalator and its surrounds at the Moorgate Station entrance to the Barbican Estate been allowed to fall into such a bad state of repair? Paint peeling from the ceiling, strange damage to some of the tiling from damp(?) and usually in a pretty filthy state particularly at street level hardly gives a good impression to visitors to the Arts Centre and we residents. Is there some reason for the rundown appearance?", 
      "date": "2007-12-01 12:44:00", 
      "id": 3513, 
      "responses": 5, 
      "subject": "Escalator from Moorgate Station to Barbican Estate", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3830"
    }, 
    {
      "body": "Compared with the planting around the rest of the estate these beds look a bit tired and scruffy - does anyone know who I should contact to find out if they are due to be refurbished and when?", 
      "date": "2006-03-26 17:40:00", 
      "id": 4633, 
      "responses": 5, 
      "subject": "Lakeside shrub beds in front of the arts centre", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2157"
    }, 
    {
      "body": "what is happening to the tree stump that was kicked down?  can burn it?", 
      "date": "2006-12-10 23:33:00", 
      "id": 4124, 
      "responses": 3, 
      "subject": "art", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2822"
    }, 
    {
      "body": "Has anyone else noticed that for the past two weeks or so the water aeration system in the middle of the lake has been making an extremely loud sloshing and slurping noise? It is irregular, and can suddenly stop for a short while, but it usually happens every 20-30 seconds, from early in the morning until late at night. The system has made a noticeable and annoying noise since the day it was put in, but this is totally new and ten times worse.", 
      "date": "2005-06-01 20:29:00", 
      "id": 4732, 
      "responses": 3, 
      "subject": "Water aeration system noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1658"
    }, 
    {
      "body": "as our environment around us changes rapidly, somewhat closer to home, does anyone else think the portacabins on the sculpture court are an absolute disgrace?   I know I'm a delicate bloom, but I was genuinely shocked", 
      "date": "2008-01-29 20:17:00", 
      "id": 3618, 
      "responses": 2, 
      "subject": "sculpture jim, but not as we know it", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3961"
    }, 
    {
      "body": "Has anyone else noticed how nice the high walk is looking at the moment.  The planting is especially good this year with swathes of same colour planting trather than the normal polkadot effect that most local authorities.  The new gardeners are to be congratulated I think .......", 
      "date": "2005-04-18 08:26:00", 
      "id": 2914, 
      "responses": 1, 
      "subject": "Spring Flowers on the High Walk", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1570"
    }, 
    {
      "body": "As I remember, when the Girls School was getting permission to replace the grass on their playing surface with a synthetic all-weather surface, one of the blandishments tossed up to nearby residents was that the planting around the field would be renovated. There's a strip of planters along the southern edge, and a larger, wilder section above the playing surface on the northern side (with numerous lost tennis balls amongst the wild flowers and shrubbery).  I can't see that any new landscaping has happened, especially on the planters on the southern side. I realize that I should be asking the CoL School about this, but before I do, I wonder if anyone has any inside news, or better ideas? (ps: Tuesday nights seems to be football night for a bunch of large hairy men, who play seven a side football on the all weather surface. I've no problem with that, but I'm surprised that a girl's school can furnish a team for a competition like that).", 
      "date": "2008-05-06 21:15:00", 
      "id": 3570, 
      "responses": 1, 
      "subject": "Gardening around CoL Girls School all weather play surface", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4312"
    }, 
    {
      "body": "I do hope that as well as retiling the waterfront the scruffy bushes on the edge of the pond will be replaced too.  The rest of the gardens are kept immaculate.", 
      "date": "2007-07-23 19:46:00", 
      "id": 4053, 
      "responses": 1, 
      "subject": "Replanting Lakeside", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3535"
    }, 
    {
      "body": "Sorry if I've missed a discussion re. this... But I wondered why the waterfall in from of Willoughby doesn't seem to be running during the day? Thanks, Simon", 
      "date": "2007-11-17 09:44:00", 
      "id": 4144, 
      "responses": 1, 
      "subject": "Waterfall by Willoughby?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3798"
    }
  ]
}