{
  "summary": [
    {
      "body": "For information, Standard Chartered have their \"Great City Race\" on the evening of 20 July. Some roads on the periphery of the Estate (Aldersgate, London Wall, Moorgate) will be closed, between approx 6.30pm and 8.30pm. All roads will be closed inside a rectangle bounded by London Wall, Old Broad St, Threadneedle St, Cheapside, Newgate St, King Edward St and Montague St.", 
      "date": "2006-07-09 12:42:00", 
      "id": 3187, 
      "sentiment": 1, 
      "subject": "Road Closures - 20 July: Standard Chartered Great City Race", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2441"
    }, 
    {
      "body": "The Milton Court Project Team would like to ensure that Barbican residents are aware that there are currently notices up on the Milton Court site from the City of London.  These notices are to inform people of the closure of the walkway through Milton Court from next week. The new stairs and lift by Willoughby House are now fully operational for you to use.  A newsletter will be sent out next week to those Barbican residents in closer proximity to the site to inform you of the planned works for the next few weeks.  Should you have any problems with the works on site, please contact Cantillon's Project Manger, Andy Dyson on 07823 442024 or ", 
      "date": "2008-01-04 16:07:00", 
      "id": 3531, 
      "sentiment": 1, 
      "subject": "Milton Court", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3907"
    }, 
    {
      "body": "Please use the link below to find out all you need to know (hopefully!) about this years Lord Mayor's Show. .  A general guide to road closures can be found on the 'residents' tab. There's also a discussion forum to ask questions or raise points about the show Yours Paul Gilmour", 
      "date": "2006-09-12 14:07:00", 
      "id": 4479, 
      "sentiment": 1, 
      "subject": "Lord Mayor's Show 2006", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2595"
    }, 
    {
      "body": "Passing by One Milton Court, the big green glass building, I noted that the contractors have signs up giving advanced warning of a Generator Test on Saturday the 11th of September between 10:00 and 12:00. I have popped in to remind the contractors of the period of  silence at 11:00 and have requested that the generator and all other noisey equipment is not used between 10:55 to 11:05.", 
      "date": "2006-11-10 12:42:00", 
      "id": 5042, 
      "sentiment": 1, 
      "subject": "GENERATOR TEST - ONE MILTON COURT", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=2747"
    }
  ]
}