{
  "summary": [
    {
      "body": "The Neighbourhood Policing Team has been asked to remind BarbicanTalk members that advice on how to lessen the impact of the current heatwave can be found at   or by phoning nhs direct on Tel: 0845 4647 We would also ask, if your neighbour is elderly or infirm, that you just check on them during this time. Although stormy weather is forecast, the temperature is forecast to remain 'high'. If you are worried about the lack of response from a neighbour's premises, please contact the City Police switchboard (020 7601 2222) as soon as possible. Yours", 
      "date": "2006-07-04 12:29:00", 
      "id": 3248, 
      "sentiment": 2, 
      "subject": "Current Heatwave", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2427"
    }, 
    {
      "body": "Barbican Library will be closed to the public between Friday 21 March and Wednesday 9 April whilst the first phase of the programme to replace the Librarys minor electrical wiring and lighting is carried out.  The work will continue in phases throughout the summer and early autumn and will include not only the replacement of existing circuits but also some welcome improvements in terms of increased lux levels and improved provision in areas where, by contemporary standards, lighting levels are inadequate. In a separate piece of work during this closed period new fiction shelving will be installed and the shelf signage for all areas of the General Library replaced with the aim of providing a more welcoming and easily comprehensible layout. I look forward to your feedback on the improvements and apologise for any inconvenience caused by the closure of the Library over the above period.  John Lake Librarian, Barbican Library", 
      "date": "2008-03-11 18:29:00", 
      "id": 3807, 
      "sentiment": 2, 
      "subject": "Barbican Library Closure Period", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4111"
    }, 
    {
      "body": "Tope of Long lane is blocked off with police car and tape, for one block.  I was told there was a murder in the early hours of this morning, Sat 27th and the area is going down!", 
      "date": "2007-01-27 10:23:00", 
      "id": 4211, 
      "sentiment": 2, 
      "subject": "Murder?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2964"
    }, 
    {
      "body": "take care crossing the streets in Feb....!  Shell backs Ferrari F1 with world's costliest ad (from Marketing mag 23 Jan) LONDON - Shell is to seal off the City of London and turn it into a mini Grand Prix-style racing circuit, as part of the filming of an ad highlighting its partnership with the Ferrari Formula One team. The TV execution, whose production cost 2m, making it the most expensive ad ever, will promote Shell's high-performance V-Power fuel. It is intended to support Shell's positioning as the most innovative fuel brand.  The ad will feature Ferrari F1 cars racing through some of the world's most famous cities, including New York and Sydney. The London leg of the ad, being created by JWT London, will be shot on 17 February, with the execution set to air globally in March.", 
      "date": "2007-01-27 22:45:00", 
      "id": 4230, 
      "sentiment": 2, 
      "subject": "Formula 1 in the City: 17 Feb", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2966"
    }, 
    {
      "body": "I was just sitting down listening to a play on radio 4 when i noticed a young boy, perhaps mid teens, wearing a baseball cap and big puffer jacket race down the stairs from Defoe house to Lauderdale place. I'm on the ground floor and clearly he didn't expect anyone to be watching. He run down the flight of stairs by Lambert Jones mews - which is the fire exit for the store rooms i think. I was a bit suspicious and i peered out of my window, and after a few minutes he emerged back up from the stair case by Lambert Jones mews - this made me think that he'd been hiding down there. he raced off and i opened my window and jumped out (like i said, i'm on the ground floor!) and gave chase across Lauderdale Place. I half expected him to have a totally legitimate reason for his behaviour, but instead he pelted it up Goswell Road and i gave up and returned to my flat, as my window was still wide open.  Did anyone else see anything suspicious? Perhaps the radio 4 play has made me unnecessarily paranoid - it was about cops and robbers!", 
      "date": "2006-03-03 21:40:00", 
      "id": 4557, 
      "sentiment": 2, 
      "subject": "suspicious boy", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2110"
    }
  ]
}