{
  "summary": [
    {
      "body": "0620 on a Sunday morning is -not- the time to be racing cars around a residential building! Is anyone else awake? People have been driving up and down the tunnel at at least 60mph in clusters; some with modified exhaust pipes that make them sound like mopeds. After twenty minutes or so, the circuit seemed to be extended to include Aldersgate as well. I tried COL police non-emergency number, but no answer. It just rings and rings. I'm not even sure; is there actually any law broken if they drive around in circles in a residential area? Other than speeding, I mean. It's happened before quite a few times.  I felt rather pleased a few months ago when one of them, whilst speeding outrageously through the tunnel, burst a tyre on the kerb. No damage done except for the tyre; it seemed like just deserts so I allowed myself a small smile. Sadly, there was no such luck today. I wouldn't mind terribly much if they did it during the day, but it's only ever between 0100 and 0730 in the morning. Which is rather antisocial. I want to go back to sleep and when I started writing this message after an hour it seemed to have calmed down, but they are back again now. 0620 to 0715 so far.", 
      "date": "2007-01-21 07:24:00", 
      "id": 4370, 
      "responses": 9, 
      "subject": "Tunnel-racing", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2939"
    }, 
    {
      "body": "I rent a parking space on level 01 of Willoughby and in the past 6 months I have found a screw(same type of screw on both occassions) embedded in one of my tyres. I am sure that nobody who lives in the Barbican would be responsible for this, however for it to happen once is an incovenience but twice begins to make me feel a little suspicious. Has anyone else who rents a space in a Barbican car park faced a similar problem?", 
      "date": "2006-09-18 08:33:00", 
      "id": 4494, 
      "responses": 6, 
      "subject": "Parking problems", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2609"
    }
  ]
}