{
  "summary": [
    {
      "body": "My kettle ran out of steam recently and after replacing it with a nice eco-friendly model - 29-50 from the Ethical Superstore.com - I thought I would maintain continuity by taking the old boiler to the recycling bins mentioned on pages 22 & 23 of that solid and, er-herm, much respected publication,  (merciless bit of compounding). It is stated therein that bins designated for electrical and electronic equipment are located at the following places: o03 Willoughby Car Park, space 202 oBunyan Court Car Park, Bridgewater Sq. entrance, space 1877 However, my good intentions proved to be nothing but an exercise in futility since it transpires that no such bins actually exist. On arrival at space 202, I noticed that someone else had had a similar experience, and frustratedly dumped their dead kettle in the spot where the bin should have been. You will be glad to learn, dear reader, that I did not follow suit. What can possibly be going on? Is Mother Corp embarking upon a bit of greenwashing, and am I hugging up the wrong tree, or is there something  sinister afoot? Chuck", 
      "date": "2008-05-11 07:33:00", 
      "id": 3578, 
      "sentiment": 2, 
      "subject": "Have waste, will travel.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4327"
    }, 
    {
      "body": "Does anyone know where this website has gone?  Quite recently I used it to access flat plans, but it seems to have disappeared into cyberspace. Geoffrey", 
      "date": "2007-04-21 14:08:00", 
      "id": 4251, 
      "sentiment": 2, 
      "subject": "www.barbicanliving.co.uk", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3253"
    }, 
    {
      "body": "Over the past month or so, a cab company distributed flyers around the Barbican flats with some very low prices to London airports including Stanstead. Did anyone pick one of these up? Do you happen to have the company name / phone number handy? I need to call them but can't find the flyer.", 
      "date": "2006-05-31 15:25:00", 
      "id": 4402, 
      "sentiment": 2, 
      "subject": "Recent cab company to flyer Barbican with airport prices?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2329"
    }, 
    {
      "body": "Does anyone have a good map of the Barbican I can email people I want to find my flat in Andrewes - ie, showing entrances from street to podium. I've googled it, but most links use multimap which isn't detailed enough.", 
      "date": "2005-12-07 21:26:00", 
      "id": 4567, 
      "sentiment": 2, 
      "subject": "Good pedestrian map of Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1974"
    }
  ]
}