{
  "summary": [
    {
      "body": "Does anyone know if there are plans anywhere showing where the cables for the underfoor heating are?  I only ask because I am being woken uo at some god forsaken hour with boiling hot feet and then I can't get back to sleep.  No I don't sleep on the floor but hot air rises.  My bread is also hot as the heat must go up the table the bread box is on.  I could move bed setee and table if I could find a cool spot.", 
      "date": "2006-11-03 10:33:00", 
      "id": 3191, 
      "sentiment": 3, 
      "subject": "Baked feet", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2721"
    }, 
    {
      "body": "Can anyone point me in the direction of a good walkers map of the Barbican estate and nearby streets? I need to be able to email it to friends and visitors, so it needs to be digital. I've exhausted the potential of google to find me one. A useful map like this would show the pedways and staircases. Most of the maps I've found show where the buildings are, but not how they're connected. What's needed is a topological representation, not a topographical one The Corporation's Estate Map. This is pretty useless as it doesn't show the pedways and staircases to street level. <http://www.cityoflondon.gov.uk/NR/rdonlyres/87B1EAA2-EB91-4983-BDF4-046B951FCBD0/0/barbican_estate_map.jpg> The Arts Centre directions map is also useless for residents  and their visitors: <http://www.barbican.org.uk/visitor-information> Mutlimap and Googlemap are just for drivers  so useless. <http://uk8.multimap.com/map/> <http://maps.google.co.uk/maps> There must be one somewhere, but it eludes me. Any help gratefully received.", 
      "date": "2006-11-03 11:39:00", 
      "id": 3192, 
      "sentiment": 3, 
      "subject": "Estate Map", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2722"
    }, 
    {
      "body": "Apologies if this is obvious. Since my last question about maps of the estate, we have been provided with magnificent new maps to guide vistors to our happy homes. These are very nice, especially as they show the high walks and the relation between levels.  Does anyone know where to find an online copy of the new map. The CoL site still gives the old and useless one (useless becuase it doesn't show the high walks). The old map is at <http://www.cityoflondon.gov.uk/Corporation/our_services/barbican_estate/estate_map.htm>. Thanks ps: I think it is a bit odd that the new maps are reoriented in each location they are displayed, so that the supposed way ahead is up. This strikes me as both idiotic and condescending: idiotic because in most locations there are numerous destinations one might be travelling from and to, and condescending, because it presupposes that the readers of the maps can't reorient it themselves.", 
      "date": "2007-08-08 21:55:00", 
      "id": 3405, 
      "sentiment": 3, 
      "subject": "More on maps of the estate", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3575"
    }
  ]
}