{
  "summary": [
    {
      "body": "Anyone any idea about the crazy barking dog that was making such a racket about 8am this morning on the Speed side of things? Or was it just a mad bird that sounds like a dog? I've heard pigeons in the barbican that make a noise like a gorilla, so it's not out of the question.", 
      "date": "2007-06-30 14:34:00", 
      "id": 3475, 
      "responses": 3, 
      "subject": "Mad barking dog", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3457"
    }, 
    {
      "body": "Does anyone know why there were dogs barking, yelping and whining for over an hour at around 4am this morning? I had a broken nights sleep as the noise was so loud.  When they came nearer to Andrewes House car park I heard voices and it sounded like the dogs were being trained, it occurred to me perhaps as police dogs? Does anyone know if this sounds likely, or was I getting delirious in my slumbers?!  I hope it doesnt happen againwhy cant they do it during more sociable hours? Does anyone have any explanations? Thanks Joni", 
      "date": "2008-05-14 14:43:00", 
      "id": 3592, 
      "responses": 3, 
      "subject": "Dogs Barking!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4339"
    }, 
    {
      "body": "Does anyone know why there were dogs barking, yelping and whining for over an hour at around 4am this morning? I had a broken nights sleep as the noise was so loud.  When they came nearer to Andrewes House car park I heard voices and it sounded like the dogs were being trained, it occurred to me perhaps as police dogs? Does anyone know if this sounds likely, or was I getting delirious in my slumbers?! I clearly heard praising of the dogs, which suggests they were being trained. I will speak to the car park attendant, as it sounded like they were close to his box.  I hope it doesnt happen againthe time of day was very unsociable. Does anyone have any explanations?  Thanks  Joni", 
      "date": "2008-05-14 18:06:00", 
      "id": 5528, 
      "responses": 1, 
      "subject": "Dogs Barking", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=4340"
    }
  ]
}