{
  "summary": [
    {
      "body": "I have signs of water leaking in to my ceiling, but the people upstairs say they can't find any problem? Any suggestions as to what I do now? If water is coming in through upstair flat's window frames, is it the Corporation's problem? Anyone know? Advice welcomed, thanks", 
      "date": "2006-04-29 10:52:00", 
      "id": 3076, 
      "responses": 3, 
      "subject": "water leak", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2237"
    }, 
    {
      "body": "Can anyone please advise what the procedure is for sorting out neighbours with noisy plumbing - as ever it is so hard to know which flat is actually responsible for the noise.  At the moment when one of our neighbours (unsure which) runs their water taps we hear a loud whining noise throughout our flat - the noise seems to be getting worse too. Has anyone else experienced a similiar problem? Is this something the Corporation can deal with - how will they identify the flat?", 
      "date": "2006-08-19 12:15:00", 
      "id": 3162, 
      "responses": 2, 
      "subject": "Noisy Plumbing", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2540"
    }, 
    {
      "body": "Twice in recent weeks the new lift at the eastern end of the estate has broken down.  The telephone number posted for emergencies actually leads to the Guildhall switchboard.  They have no record of who is responsible.  The Corporation failed to pass relevant material sent to them from the then builder Ardmore-Mace (now fired by Gerald Ronson for not being tough enough in their dealings with residents and the Environmental Health people when damage was caused to a number of flats due to their work).  Ardmore-Mace says it is not responsible.  So the fire brigade had to be called.  Anyone using the lift should be aware that aside form shouting no help is available.  The Corporation was informed at least a fortnight ago and still no telephone numbers have been posted. They even claimed that the lift should be maintained by the Estate!  News to the Estate and our excellent engineers.  The Estate was unaware of this and, in any case, the Estate would not assume responsibility for a year after construction.  One trusts that the Estate will charge the Corporation for staff time.   So use that lift at your own risk.  If you press the bell no one who can do anything is altered.  If you use the telephone you get the staff at the Guildhall or the new call centre and the reply that the lift does not exist or they know nothing.  The name of the contractor and an emergency telephone number should be there by law.  It is not.  The Corporation has done nothing about this that has led to an improved situation.   However, the alternative of the exit from Willoughby 03 car park is also very uncertain.  The door has been out of action at least twice over the last fortnight nicely coinciding, on occasion, with the lift on the podium being out of action. People in wheelchairs and other people with walking difficulties have no way out from that corner of the estate unless someone with a pass key kindly takes them through Willoughby House and that is a long way around.", 
      "date": "2008-02-03 10:22:00", 
      "id": 3625, 
      "responses": 2, 
      "subject": "Corporation incompetence?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3977"
    }
  ]
}