{
  "summary": [
    {
      "body": "Hello.  Does anyone know why two free newspapers, their flag indicating they published by the same thisislondon.co.uk that issues the 50p Evening Standard, now seem to need to employ five or more people to push them directly at pedestrians along both sides of the road at Barbican Station?  Is it possible to restrict this form of harassment?  I seem to be a target even when carrying a Standard. Pushers now operate in the Beech Street tunnel; one of those haunts the Bus Stop thrusting at those getting off and those waiting; two block the Station entrance, and another has pitched outside the new Tesco.  Metal stands similar to the Metro paper stands are available for anyone simply to pick up a paper if they want it.  The mess left by residual papers on the pavement is also getting worse.", 
      "date": "2006-12-13 19:00:00", 
      "id": 3314, 
      "responses": 14, 
      "subject": "Newspaper pushers at Barbican Station", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2830"
    }, 
    {
      "body": "TfL has started piping music into the booking hall at Barbican Station (and elsewhere). You can register your views (objections, I hope) at  . On their Home page click Contact (top right corner), select Tube from the blue list, fill in their Incident form, selecting Ambience/Environment. There is space for comments.  The station staff don't like it either.", 
      "date": "2008-03-08 10:11:00", 
      "id": 3810, 
      "responses": 14, 
      "subject": "Piped Music", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4098"
    }, 
    {
      "body": "We residents of Brandon Mew plus, I believe, some in Willoughby House and Defoe House, do suffer from tube rumble exacerbated by what I always thought was trains going over a set of points by Moorgate Station.  However, talking to one of the Estate Agents recently, I was told that he'd been talking to a railway engineer who said the clackety clack noise, that is more disturbing than the general rumble, was due to faulty track and that Metronet Rail, or whoever is reponsible for track maintenance, knows all about this.  They won't do anything about it because nobody complains, but if a body like the BA complained strongly enough, they might be forced to do so.  I know this is all hearsay, but does anyone know if there are any grounds to this and, if so, is it something we could reasonably expect the BA to take up on our behalf.", 
      "date": "2006-02-25 13:08:00", 
      "id": 3232, 
      "responses": 12, 
      "subject": "Tube rumble and noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2099"
    }, 
    {
      "body": "I complained to Transport for London that only one of the two platforms at Barbican Station was cleared of graffiti after Christmas. I have just received a phone call from Metronet, who say that their contractor has instructions to clean the other platform but cannot do so without access permission from Network Rail - which is not forthcoming. Network Rail's website states that Barbican Station is managed by TfL.   Who knows.  Who cares.  Just join me in bombarding them all with complaints until something happens!", 
      "date": "2008-02-01 14:27:00", 
      "id": 3809, 
      "responses": 10, 
      "subject": "Barbican Station update", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3973"
    }, 
    {
      "body": "Dear Police Forum Is it possible to contain, or restrict, the number of pushers of free newspapers on the narrow pavement outside Barbican Station, by the Bus Stops either side of Aldersgate Street, and in the Beech Street tunnel, and their pro-active direct approach obstructing the pathway of pedestrians? It is somewhat of a hassle, not pleasant to those negotiating a rush hour in the small entrance of the station, or using the bus, nor to those seeking to visit the Barbican. I appreciate fully that the newspapers' war is one applicable to sites at most tube stations in inner London. However its momentum visibly is increasing beyond the novelty value.  The instance of a pusher banging hard on the side of a bus in a traffic jam and indicating I should open the window flap so he could push free papers inside, is a side experience of the aggressive training techniques used. My main concern as a resident is the presentation at Barbican Station. Is there anything practical that can be applied stationwide? Do conditions of pitch differ from those of, say, charity collectors, or sellers of the Big Issue? My understanding is that the pushers on the pavements are not regulated but that there is a bid in hand for one of the papers to obtain a pitch inside the station. I wonder if the matter is suitable for consideration at the City Residents Meeting in January. Please see the thread of this subject on the Discussion Board. Thank you for any advice you are able to give.", 
      "date": "2006-12-15 08:38:00", 
      "id": 5044, 
      "responses": 6, 
      "subject": "Newspaper pushers at Barbican Station", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=2835"
    }, 
    {
      "body": "Over Christmas Barbican tube station was subject to a serious graffiti attack.  Transport for London moved swiftly to remove the graffiti from the north side of the station, but have left it untouched on the now unused, southern platform. I really do not see the point of a job half finished.  The southern platform is now a total mess.   Before Christmas I had been trying to drum up support from members of the Barbican Horticultural Society to take over the planters on that platform and tidy the station up. No chance now I am afraid ", 
      "date": "2008-01-21 19:25:00", 
      "id": 3562, 
      "responses": 3, 
      "subject": "Graffiti at Barbican Station", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3941"
    }, 
    {
      "body": "We were surprised to find that the station was closed this weekend - not because of the consequences of recent bombings, but because of planned track replacement. Fair enough, maintenance needs to be done. However, no replacement bus service was supplied. I asked about this and was told \"there is never a replacement bus from this station\". I pointed out that I had taken replacement buses dozens of times from Barbican station, and was just met with shrugged shoulders and advice to walk to St Paul's station - which, apart from being a good 10 minutes away, is of course on a totally different line. I've called London Underground to ask why this stretch of line no longer qualifies for replacement bus service. There always seemed to be plenty of people on those buses and if this is going to be policy in future, it will cause a lot of inconvenience.", 
      "date": "2005-07-31 07:48:00", 
      "id": 2949, 
      "responses": 1, 
      "subject": "Barbican station closure this weekend", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1773"
    }
  ]
}