{
  "summary": [
    {
      "body": "Just before Xmas I had an infestation of clothes/carpet moths.  It was HORRID and I commenced the festivities with my entire flat in disarray as Toxic Tony, as I fondly think of him, from the pest control company, sprayed all my carpets and wardrobes with something too poisonous to think about.  It worked after two treatments but the upheaval of taking everything out of all the cupboards and wardrobes in the flat was enormous. Apparently, unless we have nesting birds in our flats, whose faeces carry moth lavae, we get these infestations through...wait for it... leaving our windows open! They just fly in and lay their eggs.  With the summer here, it is unthinkable to follow Toxic's advice to keep all my windows shut all of the time. All was well until a short while ago when I smelled the unmistakeable aroma of mothballs from a flat on a lower floor in my block and I realised the moths were close by once more.  Now they have reappeared in my flat and I am beside myself as once they are here, it is so difficult to get rid of them.  I think it is possible that there may be an estate-wide problem.  I am in Andrewes and I know people in Defoe and Thos More who have had problems.   Any comments?", 
      "date": "2005-06-10 22:05:00", 
      "id": 4675, 
      "responses": 8, 
      "subject": "clothes/carpet moths", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1678"
    }, 
    {
      "body": "I have some moths or flying insects coming in from the vent in my toilet. Has anyone else had this problem ?", 
      "date": "2007-02-26 20:34:00", 
      "id": 3264, 
      "responses": 4, 
      "subject": "moths or flying insects in toilet", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3084"
    }, 
    {
      "body": "i seem to have, what i think are, silverfish in my flat (particularly the kitchen) - has anybody else been afflicted and does anyone know of an environmentally friendly way to eradicate them? thanks", 
      "date": "2007-07-16 14:32:00", 
      "id": 4045, 
      "responses": 4, 
      "subject": "Silverfish", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3501"
    }, 
    {
      "body": "So according to the BEO, the insects swarming from the lake are mainly mayflies which don't bite, make excellent food for birds and bats, and should die off at the beginning of June. Any ressies near the lake care to comment?", 
      "date": "2005-06-03 12:45:00", 
      "id": 4729, 
      "responses": 1, 
      "subject": "Lake Insects", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1662"
    }
  ]
}