{
  "summary": [
    {
      "body": "Sorry to interrupt the Waitrose debate. Back on the subject of the YMCA, and I hope it doesn't get out of hand this time. I am in conversation with the Environmental Health and Snow Hill regarding what we can do about the noise from the YMCA  the (temporary) noisy residents that on Fridays and Saturdays congregate on Fann Street at 1am or so in large crowds before going out. In anticipation that this is going to become more and more frequent in the summer I really want to sort this out before it gets out of control. If any of you are disturbed by the noise, I have been instructed by Snow Hill to report it to them where complaint will be logged. We need to keep a diary and gather up some evidence. Please back me up so I can enjoy the summer without being woken up to the sounds of Viva Espana!", 
      "date": "2006-03-20 18:19:00", 
      "id": 4285, 
      "responses": 206, 
      "subject": "YMCA noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2148"
    }, 
    {
      "body": "I fear I might be sounding like a winger  but does anybody else get diturbed by the noise from the YMCA and some of its (foreign) residents?", 
      "date": "2005-10-18 13:43:00", 
      "id": 4218, 
      "responses": 61, 
      "subject": "YMCA noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1894"
    }, 
    {
      "body": "Hello I am an interloper so I hope it's okay to ask this.  I don't live in the Barbican yet and perhaps never will (as you all no doubt know, there is a dearth of properties) but I wondered if any of you would be generous enough to share your thoughts on living there and good points/bad points. I've lived in flats all my life (we currently live near Old Street and hurrah for the new Waitrose even if, yes, some of the staff are very incongruous for JLP) so I know that properties can differ wildly and that it's also a matter of personal choice. But these are the things I'd like to ask (in no particular order): Am I correct in thinking the biggest flats are in the towers? Is it generally a quiet and safe place to live or does it vary wildly from block to block? What's it like for children? The private gardens seem amazing but in reality what's it like? Is the service charge astronomical (I realise it depends on size of flat)? What will happen when all TV goes digital and the Barbican has no digital cable?? Is the listed building classification a pain if you want to do any work in the flat? Garchey, good or bad? Are parking places readily available to rent or is there a shortage? Anything to look for that an outsider may not know about.  I'd be really grateful for any answers. If I can reciprocate in any way...my specialities are fly fishing, beauty products, nutrition and fashion. I know, ecletic and slightly bizarre! Thank you. AB", 
      "date": "2006-06-05 17:37:00", 
      "id": 3180, 
      "responses": 29, 
      "subject": "What's it like living in the Barbican?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2338"
    }, 
    {
      "body": "It is not too late to make a difference. Today (31 October) is the last day to get in your objections for the Milton Court development: a school for the Guildhall School of Music and an enormous residential tower. Reference 06/01160/FULEIA If you haven't got your objection in yet, you can email it to   or you can hand it over in person by going to the 18th floor of St Alphage House. You must ask for a receipt with today's date. Objections received after today will still be taken receipt of, but might not be considered fully. But if you can't make today, you should definitely still send yours in. I have pasted derbyram's points to object on below. It is important that people who object to the proposal to send in a letter of objection. We helped to have the submission rejected before and we can hopefully do it again. Here are the points: The plan submitted in March has been modified in an attempt to satisfy some of the objections raised, but in essence remains the same: a new building with the lower block housing a concert hall and theatre for the GSMD, surmounted by a residential tower.  284 flats in a tower covering half of the existing site, just lower than City Point  residential density over 8x greater than within the Barbican (even Heron note this in their environmental impact study  density will be 1183 units per hectare, compared with a recommended central location maximum of 240-435 as per the Mayors London Plan, which also states that density should respect local context and communities)  the existing Milton Court perimeter wall moved 1.9m closer to the Barbican, resulting in the road carriageway narrowing from 10.4m to 7.3m  buses and other large vehicles will have great difficulty is safely negotiating the Silk Street/Moor Lane junction in the face of oncoming traffic.  Heron still plan to purchase 210 car parking spaces in level 03 and 02 car parks below Willoughby, and convert space under the Moor Lane car-park ramp into secure bicycle parking, all for the exclusive use of Milton Court.  a health spa/club with outside tables will sit on top of the GSMD building (6F), directly opposite upper floor residents bedrooms in Willoughby and Speed.  many flats in north Willoughby and Speed will still suffer from a loss of light, loss of privacy, and be subject to overlooking from the new tower.  loss of the existing public highwalk  note that recent new buildings constructed around the Barbican area have been designed to retain highwalk access  similarly redevelopment of Milton Court should follow the same UDP requirement.  this development will generate 3,705 person trips and 423 vehicle trips per day, which will be in addition to traffic generated by the new Ropemaker Place building.  a caf/restaurant will be located at the SE ground floor corner  expect early morning delivery noise, as experienced with the City Point bars/restaurants.  the contractor has promised to abide by CoL working hours (which differ from Barbican Estate noisy work hours), but note than the contractor has already broken such pledges made while constructing the new lift/staircase.", 
      "date": "2007-10-31 10:07:00", 
      "id": 4154, 
      "responses": 29, 
      "subject": "MILTON COURT FINAL OBJECTIONS", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3755"
    }, 
    {
      "body": "Hello Neighbours, I live on Golden Lane Estate, and I'm tring to rally up support for objecting to the late license that the Shakepeare pub (on Aldersgate Street) have applied for. Does the noise  reach as far as the Barbican, John Trundle Court perhaps?", 
      "date": "2005-07-29 11:40:00", 
      "id": 2966, 
      "responses": 25, 
      "subject": "Shakespeare pub late license", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1768"
    }, 
    {
      "body": "This morning I was woken up, in the west end of Ben Jonson, at 5.25 by an electronic alarm followed by a recorded woman's voice saying \"Can I have your attention please. Can I have your attention please.\" There was a further message after that which I couldn't hear. This repeated for nearly ten minutes before stopping part-way through. I assume it's an alarm from some nearby building, and I've heard it occasionally in the past too. Very annoying, and I'm wondering if anyone knows where it comes from?", 
      "date": "2006-05-03 07:51:00", 
      "id": 4400, 
      "responses": 16, 
      "subject": "\"Can I have your attention please\"", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2249"
    }, 
    {
      "body": "Has anyone else noticed a grinding squealing noise at night ?  Any ideas where it is coming from ?", 
      "date": "2005-08-07 08:36:00", 
      "id": 2970, 
      "responses": 14, 
      "subject": "Squealing noise near speed house", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1794"
    }, 
    {
      "body": "Residents will be aware that there is a meeting next Thursday to discuss conversion of the top three floors of Frobisher Crescent into flats. If memory serves correctly, the work schedule includes Saturday mornings - although I am not sure if this includes noisy works (?). Do other residents consider weekend work reasonable given the identity of the site owner and the restrictions accepted by Barbican residents on works in their own flats? It seems fair to me for us to ask for assurances on this issue ....", 
      "date": "2008-05-09 14:08:00", 
      "id": 3697, 
      "responses": 14, 
      "subject": "Frobisher Crescent - conversion - building work on Saturdays", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4317"
    }, 
    {
      "body": "TfL has started piping music into the booking hall at Barbican Station (and elsewhere). You can register your views (objections, I hope) at  . On their Home page click Contact (top right corner), select Tube from the blue list, fill in their Incident form, selecting Ambience/Environment. There is space for comments.  The station staff don't like it either.", 
      "date": "2008-03-08 10:11:00", 
      "id": 3810, 
      "responses": 14, 
      "subject": "Piped Music", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4098"
    }, 
    {
      "body": "Has anyone heard that Tescoo is not now coming to the corner of Aldersgate Street and Carthusian Street?  The paper shop people have collected a petition and written to three councillors and two MP's about not wanting them there due to noise, congestion and the fact that they will have to close.", 
      "date": "2006-07-18 15:07:00", 
      "id": 4236, 
      "responses": 14, 
      "subject": "Tesco cancels", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2461"
    }, 
    {
      "body": "We residents of Brandon Mew plus, I believe, some in Willoughby House and Defoe House, do suffer from tube rumble exacerbated by what I always thought was trains going over a set of points by Moorgate Station.  However, talking to one of the Estate Agents recently, I was told that he'd been talking to a railway engineer who said the clackety clack noise, that is more disturbing than the general rumble, was due to faulty track and that Metronet Rail, or whoever is reponsible for track maintenance, knows all about this.  They won't do anything about it because nobody complains, but if a body like the BA complained strongly enough, they might be forced to do so.  I know this is all hearsay, but does anyone know if there are any grounds to this and, if so, is it something we could reasonably expect the BA to take up on our behalf.", 
      "date": "2006-02-25 13:08:00", 
      "id": 3232, 
      "responses": 12, 
      "subject": "Tube rumble and noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2099"
    }, 
    {
      "body": "I apologise in advance if this sounds too much like a moan, ramblings or some form of un-interpretable nonsenseit is 4am in the morning! I went to bed last night.  (Saturday 9, June) to what I have become accustomed. late night music, people shouting over the music and drunken people walking by on Aldersgate.  Several times now, it has been the Barbican YMCA in which they were throwing items out of their windows, screaming and yelling at which time we notified the police and all was calmed down. This time, it was the Cathedral House on Aldersgate that decided to host a roof top in house concert.  Woken up by a new DJ at 3:00am on Sunday morning. I called the city of London police (non-emergency for all those who might need it in the future: 020 7601 2222) and reported this, to which he said, Is that the music I hear in the background?.  YES! I then called back at 3:30 to report nothing had been done.  To which he gave me a number 02077041212 (supposedly environmental services), which it is not, it is the same department, (I had just called). To which I was given another number 02075273229 for environmental services.  Which I called and spoke with a woman gave her my details and she asked several times for me to repeat them, as she too could hear the music in the background; she would notify someone, BUT unfortunately the officer has to hear the music him/herself.  BUT, someone would be calling me back.  What?  Are you serious, the problem is that I dont want to speak to anyone at 3:30am in the morning!  How does them ringing me back solve this?   This is not rocket science.EVERYONE can hear the music.  My partner has to work tomorrow; I have things that I would like to do as well. None of which (at this point seem realistic unless I get a long nap in the day) will happen without me being a tad bit grumpy for loosing several hours sleep. I have got a really innovative idea, GO there, and tell them to shut it down, OR SHUT IT DOWN FOR THEM! Seriously, are you serious?  This is the most back-asswards concept I have come across.  Get it together City of London! I am tired.  I am grumpy and least of all do I want to hear a load of bureaucratic bull crap telling me why, a roof top terrace party could not be dismantled orderly. Dont get me wrong, I love living here in the Barbican.  AND I fully understand that our tax money goes to other places than policing our neighboursBUT seriouslythis is city living, not some backyard barn in which the neighbours across the field can't hear if someone is having a barnyard party! ARG!  Thank you for listening, at least this way, even if you completely disagree with me and want to shout at the top of your lungs it will have to be done in all caps.  (At least it wont be off your balconies). PS The environmental office just called 4:24am to say they are on there way to come visit me  I relayed to them that it would be a better idea to  visit the neighbours? Hey, as she said, how they work is that they have to hear it from MY balcony.. To all those sleepless nights.. PSS Don't you just know that as soon as they show up...it will all stop!", 
      "date": "2007-06-10 03:45:00", 
      "id": 3343, 
      "responses": 12, 
      "subject": "Are you serious?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3412"
    }, 
    {
      "body": "The language in what follows is not mine.  I have taken it straight from the back right hand side of the newly-distributed PODIUM which claims - in its stap line - to be \"From the Barbican Centre for Residents\".  It is death by a thousand cuts (taken in conjunction with all the other development works around and invading the quality of life of the Estate) and written in the kind of jargon that makes NEWSPEAK warm, cuddly and comprehensible. \"As part of the Frobisher Redevelopment works, staff on Level 6 of the Barbican Centre are required to decant to other office spaces. The majority of Level 6 staff will be moving to a temporary site in Bonhill Street and the remainder, who cannot leave the site due to the nature of their work, will be located in two modular buildings located on the Sculpture Court.\" \"The delivery of the modular buildings is currently scheduled for Sunday 18 November. The delivery is certified as an abnormal load, due to its size, therefore the Metropolitan Police will only allow this to take place overnight or on a Sunday. With the residents in mind, the Barbican Centre did want want the delivery to be overnight and therefore Sunday was chosen as the only other option.\" For those of you old enough to remember BEYOND THE FRINGE in 1961 you may already hear the cackle of Dudley Moore in the background as I continue in my best Alan Bennett (or Peter Cook or Jonathan Miller voice) because this piece of idiocy would have been fought over by all the cast as it is such a gem. \"It is necessary to close Silk Street to allow the delivery to take place; road closure will be between the hours of 9am and 6pm. The modular buildings will then be craned into the Sculpture Court.\" \"The mobile crane will arrive on Silk Street at 8am and will be set up in preparation for the first lift at 9am. Units will then be unpacked and attached to the crane which will lift the unit from Silk Street on to Level 3. Power pallet trucks will then be used to skate the units into position on the Sculpture Court.\" \"There will be a total of 14 lifts taking place throughout the day and they will take approximately five minutes each....To address the environmental issue of noise, delivery vehicles will switch off engines between arrival and departure and the crane's engine will be switched off when not in operation.\" I've checked my blood pressure. Yes....it is up.  I do not want to use bad language on this site so I will let others scream the words for me as they read this (or as they react to the PODIUM delivery through their letterboxes). The convenient fiction - and it is one the City of London and our representatives on it to go along with -  seems to be that people do not live in the Barbican Estate, not really. And - if they do - then they bugger off at the weekend. And for those who stay then \"Hey, you'll wish you hadn't.\" The interest I declare - in this posting - is that, living in a flat in Shakespeare looking out over the Sculpture Court, means that Calypso and I will have to live through the stated (and probably under-estimated)14 lifts on that Sunday and we are being treated as if we were not here and shouldn't be here.  The trouble is it makes me want to hire a mobile crane and some modular buildings and to go and spend a weekend - maybe over the Christmas/New Year period of goodwill - doing exactly this close to the people who think this is OK....but that way lies madness, war and the destruction of civilisation.  I'd better get back in my box and keep taking the tablets.", 
      "date": "2007-11-04 23:53:00", 
      "id": 4149, 
      "responses": 12, 
      "subject": "Just when you thought it was safe to sleep in", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3772"
    }, 
    {
      "body": "Is there anything more irritating than having one hover and circle over you when you're at home? It seems to be happening quite frequently. And before anyone shouts SECURITY, what can you possibly see that's any use from a helicopter that you can't see from the ground? If they're there for traffic purposes why would they hover over the Barbican? They must be very expensive to run. A friend once rang the police to ask the reason, and was told \"you don't think we're going to tell you do you?\". Well I think we should be told more about this sort of thing.. does anyone know what they're doing up there?", 
      "date": "2005-09-24 11:30:00", 
      "id": 4448, 
      "responses": 12, 
      "subject": "Helicopters", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1852"
    }, 
    {
      "body": "Has anyone else been bothered by a dog barking on  a balcony in Shakespear tower?  I'm in Lauderdale and with the doors open, all I've been hearing today is a regular yapping from what sounds like a puppy.   I think the noise is coming from a flat roundabout the 9th floor, but I'm sure the flats above and below are aware of just which floor the dog is on! I'm hoping that the dog is just a weekend visitor, but does anyone know what the situation would be if it turns out to be a permanent resident?  Keeping pets is not allowed in the lease, but how is this enforced by the Corporation?", 
      "date": "2005-09-10 13:46:00", 
      "id": 2998, 
      "responses": 11, 
      "subject": "Barking dog", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1838"
    }, 
    {
      "body": "Being woken up yet again by my neighbours noisy toilet and water pipes I got up and put the light on and saw five or six silverfish fleeing across the carpet.  Needless to say they didn't last long. But can anyone tell me please where they come from and how I can stop them?  The flat is clean, honest!  I live on the ground floor so are they coming in from the garden?  ugh, ugh.", 
      "date": "2006-09-12 09:36:00", 
      "id": 4490, 
      "responses": 11, 
      "subject": "Silverfish ugh", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2594"
    }, 
    {
      "body": "As a newcomer, what's the general experience of noise transferance between neighbours? It seems pretty quiet to me, but perhaps my neighbours are never there. Can one turn the hi fi up or does it go straight through the walls? The impression I get is that the solid concrete walls and floors are pretty soundproof - is this the case? The worry about wood floors is that they might be noisy for people living below, but has this actually been the case? Have there actually been complaints to the lease police?", 
      "date": "2005-10-30 19:45:00", 
      "id": 4518, 
      "responses": 10, 
      "subject": "Noise question", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1914"
    }, 
    {
      "body": "Another Saturday, another 8 a.m. start for jackhammering. Skanska/EDF is digging up Whitecross St. outside the school for \"emergency\" cable work so the curb can be installed. Obviously the companies have figured out there is no enforcement, so they can call everything an \"emergency\" and do what they like. I have contacted the city environmental services but the work may be in Islington and the duty officer wasn't well versed in the work rules.", 
      "date": "2008-02-23 10:43:00", 
      "id": 3523, 
      "responses": 9, 
      "subject": "Saturday noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4049"
    }, 
    {
      "body": "Around 7am, 3 mornings a week a man can be heard in the Ben Jonson/Breton House/Cripplegate Free Library area shouting at the top of his voice: 'Hello' and 'oh dear oh dear oh dear oh dear oh dear'. It continues for about a minute then stops. Occasionally another person joins him, but I'm not sure what they're shouting. Can anyone fill me in?!", 
      "date": "2007-08-06 09:55:00", 
      "id": 4118, 
      "responses": 9, 
      "subject": "shouting", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3564"
    }, 
    {
      "body": "Hello everyone,  We love the Barbican and have been renting here for a while but now want to buy. However the price of the apartments here are astronomical (and we are looking for a 2 bed flat). We have noticed though that the Golden Lane flats seem to be a lot cheaper. But what is it actually like to live there? Ok I am not expecting it to be as fabulous as the Barbican (chiefly because I suspect nowhere can be!) but what is it like in terms of safety, in terms of neighbours, in terms of flat construction (ie noise problems?), in terms of Estate Office responsibility (ie they are very responsive to Barbican dwellers - is it the same with Golden Lane?). Are there any communal areas like the Barbican Gardens? What is the mix of residents like? Any views or information, positive or negative is welcomed!", 
      "date": "2006-06-19 20:10:00", 
      "id": 4431, 
      "responses": 7, 
      "subject": "What's it like living in Golden Lane Estate?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2378"
    }, 
    {
      "body": "Does anyone else find the noise of lifts intrusive? I was wondering if we just had a poorly serviced one in our block. It's seems to emanate from the winding gear (perhaps the cables). Sound level is variable but when I first heard it thought it was distant roadworks!", 
      "date": "2005-12-30 14:03:00", 
      "id": 3027, 
      "responses": 6, 
      "subject": "Lift noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2001"
    }, 
    {
      "body": "Anybody know what the hell is going on with these trucks taking in new machinery to Holmes place, the noise is hellish!", 
      "date": "2007-05-24 22:22:00", 
      "id": 3326, 
      "responses": 6, 
      "subject": "virgin active refurb - noise!!!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3363"
    }, 
    {
      "body": "i woke up at half past midnight on Tuesday night (or Wednesday morning!!) with drums and bass guitar throbbing through my walls. i first thought it was the upstairs / downstairs neighbours having a late party but the sound was too deep.. (we live in Cromwell Tower). i phoned the porter who suggested it might be the pub next door, The Brewery.. it eventually stopped at around half one.. did any one in Cromwell hear anything? can something be done about it?", 
      "date": "2006-09-21 18:23:00", 
      "id": 4269, 
      "responses": 6, 
      "subject": "NOISE ON TUESDAY NIGHT", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2620"
    }, 
    {
      "body": "about 3pm on Friday - lots of rumblings; sounds like buildings being demolished nearby. anyone know what all the noise is?", 
      "date": "2005-07-22 13:57:00", 
      "id": 2953, 
      "responses": 5, 
      "subject": "what is all that noise?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1755"
    }, 
    {
      "body": "Are they obliged to down tools at any point tonight, or could they be working throughout....? It's rather noisy over here in Defoe", 
      "date": "2007-06-27 21:18:00", 
      "id": 3478, 
      "responses": 5, 
      "subject": "Roadworks in the tunnel", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3450"
    }, 
    {
      "body": "Does anyone know why a helicopter circles for hours every Sunday afternoon and in to the early evening?  Yesterday afternoon the concert which was being broadcast live from St Giles was ruined by some idiot up there.  John Tusa even found it necessary to apologise to listeners.  There was no road accident or riot.  The helicopter is black and it's a good job I did not have a ground to air missile on me..... Yes I'm cross!", 
      "date": "2007-01-15 10:18:00", 
      "id": 4188, 
      "responses": 5, 
      "subject": "b***** helicopter", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2909"
    }, 
    {
      "body": "Anyone know why there is so much noise coming from the Kings Head this evening? There isn't usually a problem from there, but tonight it sounds like there's a riot going on.", 
      "date": "2005-05-25 21:31:00", 
      "id": 4719, 
      "responses": 5, 
      "subject": "Kings Head", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1647"
    }, 
    {
      "body": "{Expired Message}", 
      "date": "2007-11-01 10:31:00", 
      "id": 3464, 
      "responses": 4, 
      "subject": "Willoughby House noise driving me nuts", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3761"
    }, 
    {
      "body": "A number of people have been disturbed by construction noise from the Islington side of the border. The Environmental Health Department in the borough of Islington is not as effective as our own.  They do not work at weekends which is when it appears that most of the problems have occurred.  In fact, they actually asked the City to monitor the behaviour of British Land at the Ropemaker", 
      "date": "2008-03-18 15:22:00", 
      "id": 3834, 
      "responses": 4, 
      "subject": "Islington construction noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4136"
    }, 
    {
      "body": "Sunday - from at least 9am until 12:45 last - hammering from the old green glass fronted building on Moor Lane/Chiswell St - fed up by 11am - went down to the site - Polish builder very reluctantly directed me to the site office, - he said  \"I am  just wasting my time now\" - I signed the site visitors book, since no-one there to complain to - and called the CoL environmental health line 7606-3030. Apparently I was not the first person to complain about this specific noise today - and the environmental health officer had already visited the site - but unable to find any perpetrators - and yet STILL (12:55) the noise goes on - not really very reassuring when Willoughby/Speed residents  are asked to accept promises from a new developer (Heron) about noise associated with the redevelopment of Milton Court, which will be monitoted by the CoL........(CoL terms -no work allowed after 13:00 Saturday, no work allowed Sunday) - message to CoL - your/our terms are being breached deliberately - what means do you propose to enforce the mutually agreed terms ??", 
      "date": "2007-03-04 13:07:00", 
      "id": 4250, 
      "responses": 4, 
      "subject": "NOISE from One Moor Lane construction site on Sunday", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3102"
    }, 
    {
      "body": "Any idea what all the fireworks were about tonight.There were some in the early evening and some at a quater to eleven.I'm no killjoy and I like fireworks.....in a big field.... but not outside my window and not at that time of night.Everything these days seems to be all about noise.From the idiots that shout as they walk past to the singers in my block to the noisy fireworks. NOISE NOISE NOISE........ oh well.... And please don't post any negative comments....I was just having my say", 
      "date": "2006-10-07 21:47:00", 
      "id": 4290, 
      "responses": 4, 
      "subject": "Fireworks", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2667"
    }, 
    {
      "body": "Has anyone else at the Speed end noticed a grinding noise in the evening.  It sounds like a a wheel spinning on a rusty axle.  Any ideas which building has got noisy air conditioning ?  With the echo effect in the quad it is so hard to tell where it is coming from.", 
      "date": "2006-08-23 13:52:00", 
      "id": 4457, 
      "responses": 4, 
      "subject": "Grinding Noise at East End of Estate", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2551"
    }, 
    {
      "body": "Why do we bother lobbying to have pubs and clubs around the Barbican controlled for opening hours and noise disruption, when our own neighbours cause such a ruckus? Last night someone in Speed House held a really obnoxiously noisy party. Every few minutes there was some mad screaming until about 2.30 am. The noise enemy is within.", 
      "date": "2005-08-06 10:41:00", 
      "id": 2960, 
      "responses": 3, 
      "subject": "Noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1791"
    }, 
    {
      "body": "At risk of sounding like Disgusted of Willoughby, not only did we have the police drama in the night on Sunday, but we also had noisy building work going on all through Sunday morning and afternoon from the Austral House site at London Wall/Coleman Street. It finally finished at 3.30pm That has been 7 days of construction noise from three sites within view of our balcony ALL week.  I did log my complaint with Guildhall on Sunday, and the Environmental Health duty office did call me back. He told me that the Austral House site work had been authorised becuase they had applied for a permit and been granted one. On a Sunday! It is likely they have applied for and been granted others too. Can anyone else bothered by this please also log their complaint with the City. During the week, speak to the Pollution Team on 020 7332 3630. At the weekends, when the noise nusiance is happening, call Guildhall switchboard on 020 7606 3030 and say you have a noise nusiance complaint. We really must bring pressure to bear on the City to not issue noisy works permits for Sundays so close to the Barbican Estate.", 
      "date": "2006-04-24 22:26:00", 
      "id": 3068, 
      "responses": 3, 
      "subject": "Weekend Constuction", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2221"
    }, 
    {
      "body": "Anybody know to which body I should address a letter of complaint about the music from the keep fit classes in the early evening? It's like having a rave foised upon the area each day. Pub noise I expect and accept within reason but thudding megawatt soundsystems in order to shift a few calories is several steps too far. I'm afraid i'm not going to be satisfied with approaching 'the management' either in this case. They have paying customers to satisfy so there is a conflict of interests for a start.  I want to lodge something with a body that cannot simply turn a blind eye nor file my complaint in a folder marked 'trash'. I'm thinking upon the lines of a local noise abatement officer or similar. Please feel free to PM me with accurate details if you have them  or simply don't want to to broadcast the information. Having said that ,unless i'm the only one ready to pop a valve over this irritant, then i'm sure others may be wish to object or lobby too. Regards, L", 
      "date": "2007-05-21 18:21:00", 
      "id": 3323, 
      "responses": 3, 
      "subject": "Enough! YMCA gym music", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3352"
    }, 
    {
      "body": "Anyone any idea about the crazy barking dog that was making such a racket about 8am this morning on the Speed side of things? Or was it just a mad bird that sounds like a dog? I've heard pigeons in the barbican that make a noise like a gorilla, so it's not out of the question.", 
      "date": "2007-06-30 14:34:00", 
      "id": 3475, 
      "responses": 3, 
      "subject": "Mad barking dog", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3457"
    }, 
    {
      "body": "If anyone else was awakened by the 4 a.m. construction choir on Whitecross St. today, or any of the other rulebreaking activities by our neighbours to the north, may be worth filling out an online noise diary at   Noise Record Diary is the last option in the blue box Do it online on the right I have tried leaving voice messages before with no response so I don't expect any from this either, but somehow it makes me feel better.", 
      "date": "2008-04-14 11:43:00", 
      "id": 3864, 
      "responses": 3, 
      "subject": "Islington noise complaint", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4236"
    }, 
    {
      "body": "Does anybody know the purpose of the very loud bell that rings outside the Barbican entrance/Speed House every now and then.  It rang this Friday at about 8.30am but we sometimes hear it on a Saturday...", 
      "date": "2007-01-20 14:34:00", 
      "id": 4192, 
      "responses": 3, 
      "subject": "The ringing bell", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2936"
    }, 
    {
      "body": "There's a notice at the front entrance to the Brewery (or there was yesterday) about additional entertainment licences (including wrestling)  and extension of opening hours. Because of the traffic problems that occur as a direct result of events at the Brewery, and the subsequent noise (shouting, horns blowing, etc),  I'm amazed they're even considering this. Their customers have no consideration for local residents, and tend to gather on Chiswell St and at the junction by Cromwell Tower, shouting at each other and at passing  taxis.  So I shall be opposing it.", 
      "date": "2006-06-08 20:01:00", 
      "id": 4417, 
      "responses": 3, 
      "subject": "Chiswell St. Brewery - Extension of licensing hours", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2346"
    }, 
    {
      "body": "Last night Wednesday night a car alarm kept going off about every 20 minutes . This is unacceptable and what are the Police doing about it , or the Corporation . Nothing . Please ring 0207 601 2222 and complain now to the Police this practice / problem must stop now . One doesnt want to go over the top but these people who just let these alarms keep going are a nuisance . We are entitled to a good nights sleep are we not .", 
      "date": "2005-10-13 09:30:00", 
      "id": 4443, 
      "responses": 3, 
      "subject": "Car Alarms Noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1883"
    }, 
    {
      "body": "Have any other Andrewes House residents been disturbed by late night noise from the Salters Hall in Fore street recently? On Saturday night I was woken up at 2.30 am by large crowds of noisy people leaving Salters Hall, revving cars, shouting in Fore Street. It happened again last night, at about quarter to twelve. Is this due to a new use of the hall for events? Could it be as a result of the new licensing laws? I've never had noise coming from there before.", 
      "date": "2005-11-30 11:01:00", 
      "id": 4552, 
      "responses": 3, 
      "subject": "Salters Hall: Noise disturbance", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1966"
    }, 
    {
      "body": "Has anyone else noticed that for the past two weeks or so the water aeration system in the middle of the lake has been making an extremely loud sloshing and slurping noise? It is irregular, and can suddenly stop for a short while, but it usually happens every 20-30 seconds, from early in the morning until late at night. The system has made a noticeable and annoying noise since the day it was put in, but this is totally new and ten times worse.", 
      "date": "2005-06-01 20:29:00", 
      "id": 4732, 
      "responses": 3, 
      "subject": "Water aeration system noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1658"
    }, 
    {
      "body": "As one of the objectors to this licence extension I have received notice of the above hearing and now also copies of the application and objectors' communications. At the recent Globe licence hearing it is my understanding that there was a consent order pursuant to agreement between the applicant and objectors for modification to the terms of the extension licence to (broadly) midnight. (If this is incorrect can a BA representative please clarify as to the final outcome). I would like to record here my personal intention to object to any such consent order as regards the Podium application if it would accept closure at midnight Thur-Sat instead of the current 11pm.  It is already the case that there is substantial late night noise and disturbance from the premises which unlike The Globe, are in direct, unimpeded line of sight / hearing of many residential properties.  This noise nuisance is particularly pronounced on Thursdays and Fridays. (I further note from the application that one aspect of the desired extension is to enable there to be \"live music, karaoke and DJ from 18.00-23.00 each day. [sic]\") Based on existing experience of substantial residual noise nuisance as the area clears for at least 30 minutes after stated closing time an extension to midnight will mean excessive noise AFTER MIDNIGHT in addition to the noise pollution to 11pm from the karaoke etc events. I also note from the application under \"General description of premises...\": \"... Traditional city pub... The area is predominantly office and retail space with some [sic] residential located in the Barbican.\"   This statement appears to me imbalanced to say the least.  Some discrete points for comment: 1. is midnight now being considered as the norm for consent orders for adjoining licensed premises in order to buy off the brewers' more extreme demands as regards early morning opening?  2. more generally, is a trend emerging that the Corporation is seeking to treat these late night applications in the same way i.e. is the fear well based that a midnight licence granted to The Globe means it is difficult if not impossible to resist a similar closing time elsewhere? 3. if there is a generalised extension of the licensing hours in premises adjoining the Estate with resultant dimunution in amenity, has any thought been given to the feasibility of seeking diminution in the valuations assigned to properties here with a view to seeking reduction of the council tax charge?  It seems to me there might be potential financial leverage to be used in driving home the message to the Corporation in its various guises that closely adjoining premises and late night licences do not mix. 4. are not all these late night extension applications fatally flawed by at least one recurrent objection, namely that after closing time efficient dispersal is simply not going to be possible if all or the majority of the sought-for extensions are granted because of the absence of late running public transport? Whatever residual means exist (eg minicabs) are simply not going to be able to cope with the extremely large numbers of people who will be present at closing if these licence extensions are granted en masse. (And which means of transport in any event present their own noise nuisance).", 
      "date": "2005-08-18 10:22:00", 
      "id": 2990, 
      "responses": 2, 
      "subject": "Podium licence extension hearing 23 August @3.15", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1812"
    }, 
    {
      "body": "Over the last week or more, have you been persistently disturbed by noisy out of hours drilling in Lauderdale Tower? It has been discovered to be coming from the hairdressers Cissor's Palace under Lauderdale. The owner has been given written details of the permissible hours for noisy work but continues to flout them. Last week drilling went on until 6.30pm and then was only stopped by the porter. On Sunday there was crashing and hammering that went on all afternoon and into the early evening and today the porters had to go round again to stop him using a power saw at 5.30pm. The porters are asking that Lauderdalers report any further infractions both to them and to Sheila Delaney at the estate office.", 
      "date": "2005-09-13 16:58:00", 
      "id": 3051, 
      "responses": 2, 
      "subject": "Out of Hours Noise at Cissor's Palace", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1841"
    }, 
    {
      "body": "Riots in and outside the YMCA, paint colour wars, satanic children and smashed glass in BJH and drunken hoodies under Bunyan. What's going on on our northern fringes? Is there something in the water? ", 
      "date": "2006-05-06 22:29:00", 
      "id": 3097, 
      "responses": 2, 
      "subject": "what's up??", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2266"
    }, 
    {
      "body": "Is anyone else getting a liitle hacked off with the seemingly endless deliveries at the newly opened Tesco? There have been half a dozen juggernauts so far today (Sunday), and each time they arrive the tailgate is allowed to hit the road making an incredibly loud noise. Then theres the clanking of the storage cages as theyre dragged along the pavement. Its bad enough during the day but they also do it before dawn! Does anyone know if there are any restrictions on this kind of noise? I must be really noisy for people living in John Trundle Court.", 
      "date": "2006-11-19 18:28:00", 
      "id": 3212, 
      "responses": 2, 
      "subject": "Noisy Tesco", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2760"
    }, 
    {
      "body": "Well, this was the promise from Cantillon  I was woken at 9:23 this morning by pneumatic drilling. More than a little irritated (having worked a 20 hour day on Friday), I eventually went down to complain to the site manager, and find out who had authorised this. His response was that a Richard Lambert from the Corporation had permitted it. According to him, the project manager had asked the Corp how much noise they can make on a Saturday, and this Mr Lambert said \"you can make as much noise as you like between 9:00 and 14:00\". Who are these faceless %!*!wits who are so generous with our ability to have a nice lie-in ? What is the point of us trying to get commitments from Cantillon regading noise when they are discarded like so much jetsam just weeks into the project ?  ", 
      "date": "2008-02-16 10:42:00", 
      "id": 3510, 
      "responses": 2, 
      "subject": "Weekend noise from Milton Court", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4027"
    }, 
    {
      "body": "Once again British Land was working illegally on Saturday afternoon.  If the exceed the normal working hours the City of London Environmental Health Department can intervene, as they did. Technically only Islington Council can take action but as they do not work at weekends the City can step in.  Islington has long suspected that British Land were working beyond agreed hours and on Monday the City will contact them so action can be taken. If the same problem occurs again in Whitecross Street please ring the City on 7606 3030 and get the switchboard to contact the duty environmental health officer.  They can take action.", 
      "date": "2008-03-09 03:07:00", 
      "id": 3813, 
      "responses": 2, 
      "subject": "Ropermaker St. construction and spin off for Whitecross", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4100"
    }, 
    {
      "body": "Was anyone else aware that work was going to start at 6am this morning?  I'm wondering if I missed a mailshot.  Apparently the police gave permission for vehicles to be moved in early, and Islington Council were aware it was going to happen, but the news didn't reach me.  If I'd known it was a planned one-off event, I might have gone to bed earlier to compensate. I might not have got so annoyed about it, taken photos from my balcony, phoned Islington Council several times, or marched onto the site to talk to the manager. Both Wilmott  Dixon and Islington Council seemed surprised we hadn't been informed. Presumably one of them is responsible for doing it.", 
      "date": "2006-05-31 11:20:00", 
      "id": 4405, 
      "responses": 2, 
      "subject": "Early morning construction work on Fortune Park campus", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2328"
    }, 
    {
      "body": "Does anyone know who / where the drilling noise in Speed House is coming from ? It seems almost impossible to pinpoint since it resonates through the concrete, but it's been happening most days on and off for about a month and it's driving me potty ! They do seem to keep reasonably close to the 10-4 time limit, but I can't imagine what can be taking so long !", 
      "date": "2006-04-04 14:44:00", 
      "id": 4640, 
      "responses": 2, 
      "subject": "Speed House drilling ?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2171"
    }, 
    {
      "body": "I would be grateful if you and/or the appropriate person from Snow Hill could respond to the following inter-related matters: 1.  As you know given that Corney and Barrow located opposte Willoughby House near Moor Lane cannot use what one can describe as the central piazza of City Point as a place where smokers can drink there has been a tendency for drinkers to stand in the street opposite Willoughby House and sometime directly under Willoughby House.  I understand on occasion the police have been called because despite the best efforts of the management of Corney and Barrow they have not been able to prevent groups congregating on the public highway.  This is quite disturbing to residents of \"'willoughby House and will get worse as the weather becomes warmer. Is there no way smokers cannot use the central piazza?  Is there no way C and B cannot put a notice on the appropriate door near Moor Llane reminding smokers that they cannot smoke in the street or the passageway? This would surely sC and B could lose their licence if complaints continue to mount up. 2.  Have the City of London police responded to the document about the \"greening\" of Fore Street, Moor Lane and Silk Street?  I spoke to the appropriate officer and my understanding is that the police would mwant modifications to the proposal to \"green\" the area opposite Corney and Barrow as it would turn it into a \"beer garden\"?  Has this now been put in writing? Thanks and keep up the good work.", 
      "date": "2008-03-04 14:15:00", 
      "id": 5515, 
      "responses": 2, 
      "subject": "Pub noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=4084"
    }, 
    {
      "body": "No one else has probably noticed, but the Arts Centre have installed a couple of new chillers on the roof for the air conditioning for the art Gallery (over by the conservatory). I'm not fussed about what they look like but when the winds in the wrong direction they make a terrible racket which I can hear from my flat. Does any one else in the east & south facing Shakespeare flats and Gilbert hear it? It's a short .. er .. farting sound as the fans start and stop, every 20 seconds or so. Most annoying.  Checking out the planning application, it seems as if they should have an acoustic enclosure and be modified not to start and stop so abrupty. But this has not been done yet. Does anyone know who I should write to in the arts centre to jolly them along and discharge their planning conditions? Ta BB", 
      "date": "2007-09-25 17:55:00", 
      "id": 3433, 
      "responses": 1, 
      "subject": "Strange noises from the roof of the Arts Centre", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3689"
    }, 
    {
      "body": "Has anyone else noticed that there are now a couple of loose manhole covers on Aldersgate Street (on on the northbound side and the other on the southbound by the pedestrian crossing) that now make a considerable racket when cars/buses run over them? I reported the first of these to the Corporation a few weeks ago but nothing was done and now the problem has doubled. It's just about tolerable when we have our windows shut but is going to be hell once the warmer weather comes.....", 
      "date": "2008-04-14 11:53:00", 
      "id": 3868, 
      "responses": 1, 
      "subject": "Noisy manhole covers on Aldersgate Street", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4237"
    }, 
    {
      "body": "For those wondering where the Thanksgiving Fireworks are coming from - 9PM on 22 Nov - you'll no doubt be delighted to know some decent resident in the West Half of Ben Jonson is actually launching them of his or her balcony on the 4th floor facing south.", 
      "date": "2007-11-22 21:02:00", 
      "id": 4148, 
      "responses": 1, 
      "subject": "THANKSGIVING FIREWORKS", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3811"
    }, 
    {
      "body": "I heard some odd bird noises this morning - are the falcons from last summer back on the estate?", 
      "date": "2007-03-25 12:15:00", 
      "id": 4349, 
      "responses": 1, 
      "subject": "Bird question", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3182"
    }, 
    {
      "body": "A few weeks ago I received a letter from the estate office regarding a water hammer in our area of Seddon House. I've only just got around to telling them it's not our problem, but I was wondering if anyone in Seddon hears this as well? I do hear some faint, intermittent tapping very late at night - around midnight or so - which can get a little annoying, but I imagine that it is particularly loud for whoever complained about it. Is that what the sound is? Also, at around 7.30 or 8am (on the dot) I hear some hammering but I think it's the people doing the office refurbishment sneaking in early instead and making noises. It sounds like it's coming from above me but I think that's an 'illusion' (although I can't see it, only hear it!). Also, I found this on the internet: Water Hammer Formula:    P = (0.070) (V) (L) / t + P1         Where  P = Increase in pressure               P1 = Inlet Pressure                V = Flow velocity in ft/sec                t = Time in sec.(Valve closing time)                L = Upstream Pipe Length in feet", 
      "date": "2005-05-27 13:33:00", 
      "id": 4721, 
      "responses": 1, 
      "subject": "Water hammer", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1649"
    }
  ]
}