{
  "summary": [
    {
      "body": " who deleted the smokkie meat thread and why?", 
      "date": "2005-05-08 23:15:00", 
      "id": 2934, 
      "sentiment": 1, 
      "subject": "smokkie meat thread", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1616"
    }, 
    {
      "body": "Where is Strawby? I miss her contributions to the discussions.", 
      "date": "2005-08-11 16:06:00", 
      "id": 2980, 
      "sentiment": 1, 
      "subject": "Strawberry", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1800"
    }, 
    {
      "body": "I have just realised that the third page of the \"Heating\" tread has been removed. Why should anyone have the right to decide which messages can remain in here and which have to be deleted? Is this in line with the users policy, assuming there is one? Where have freedom of expression and democracy gone?", 
      "date": "2005-10-07 11:38:00", 
      "id": 3116, 
      "sentiment": 1, 
      "subject": "Democracy", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1872"
    }, 
    {
      "body": "I am very surprised that people choose not to identify themselves.  Whilst I am told that this is frequent in \"chats\" where there are real and compelling reasons for people not to identify themselves I find it unacceptable within a community such as the Barbican. I find it difficult to take seriously any message where the person does not write in their real name.  CM Posner[/b]", 
      "date": "2006-08-14 11:11:00", 
      "id": 3152, 
      "sentiment": 1, 
      "subject": "Identity", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2528"
    }, 
    {
      "body": "I sent, or thought I did, a private message yesterday, but when I viewed my message boxes, it appeared in my Outbox only, not my Sentbox. Can someone clarify this for me, please? I wrote the message and clicked on Submit, do I need to do anything else?", 
      "date": "2007-09-22 15:54:00", 
      "id": 3386, 
      "sentiment": 1, 
      "subject": "Private message boxes", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3679"
    }
  ]
}