{
  "summary": [
    {
      "body": "The Barbican Association has now launched its website,  , although it will be a while before it reaches its full state.  I am the webmaster.  A bulletin board for this website is clearly a possibility, but with barbicantalk already active it seems a little pointless to reinvent the wheel. I need, however, to discuss the question of linkage with the administrator of barbicantalk.com andto my surprise I have not found a \"contact us\" email linkage - something I thought was conventional if not mandatory on websites. Could the administrator get in contact with me and let me know his/her thoughts? Geoffrey Rivett", 
      "date": "2004-11-30 15:27:00", 
      "id": 2904, 
      "sentiment": 2, 
      "subject": "barbican association web site and linkages", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1361"
    }, 
    {
      "body": "so its seems that access has now been restricted to registered members only. so what did i miss? (maybe i shouldnt ask this question and risk banishment to the nuclear family gulag ?!)", 
      "date": "2005-04-13 22:20:00", 
      "id": 2915, 
      "sentiment": 2, 
      "subject": "no more guests", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1561"
    }, 
    {
      "body": "To all BarbicanTalk users I'm the administrator of this site and would like your assistance in a small matter, plus your feedback on ways to deal with it. As some of you have already been discussing, there are falcon chicks nesting within the Estate. This is quite unusual as apparently most falcons do not last long in urban areas. I have received a phone call from the City of London's Wildlife Officer, who is vociferous that the location of the birds should not be revealed. This is so that the birds can have the best shot at survival, without attracting attention from people who might want to steal the chicks' eggs (which are apparently relatively rare and valuable.) There is an additional danger that people could be injured trying to get up to watch the birds close up, or to steal the eggs - apparently something similar happened elsewhere last year. For the meantime, I have edited out all references to the location of the birds. Amending text is not something I have done often in the five years or so that this site has been around, but in this case I hope there's not too much serious injustice involved. What's more, I think most people would agree that we don't want to be attracting burglars (or birdwatchers!) onto the estate. In turn you could help by agreeing not to reveal the location in your postings. Ultimately it may prove academic if more mainstream media (newspapers/ TV etc) mention the exact location. In that case, of course, we can re-assess the situation. Please feel free to give me your feedback on this approach. Hopefully you'll agree this is a fair solution, but I'm happy to read any discussion.", 
      "date": "2006-06-19 15:50:00", 
      "id": 3170, 
      "sentiment": 2, 
      "subject": "Important - for all readers - bird issue", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2377"
    }, 
    {
      "body": "Because of the spamming that occurred last week, I have temporarily suspended new signups. Anyone who has attempted to sign up will find that they have not been approved - in the next week or so I may start to approve them so that genuine residents can sign up once again. Apologies for this inconvenience - please bear with us. I have received literally dozens of e-mails from people saying that they have received a blank instant message from my account on this site. It appears to have happened only once and I can't source exactly why. But there's no need to e-mail me to inform me of this, and please do not expect a response. I answered the first dozen but after that it became impossible! In the next couple of weeks I will be refreshing the board software to better guard it against spam. In the meantime please continue to use it.  Thanks Horseradish - administrator", 
      "date": "2007-02-08 08:47:00", 
      "id": 3256, 
      "sentiment": 2, 
      "subject": "Notice to all users", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3047"
    }, 
    {
      "body": "Dear BarbicanTalk users Apologies for my absence as administrator over the past couple of months. I'm now back and will be keeping a far closer eye on things. However, if anyone would like to volunteer to join in some basic moderation of the site please drop me a note via mail AT barbicantalk DOT COM. I have upgraded the site to a more recent version of the forum software which I hope will be more secure. Accordingly I have removed the signup blocks that were previously in place and new members should now be able to sign themselves up.  Today I am authorising the accounts of all those people who have written in to me asking why their accounts were not approved! Please spread the word and let your friends and neighbours know that they are very welcome here.  Because I have been absent there may well be plenty of messages that need moderating - please mail me on the above address to let me know if you see anything that shouldn't be here. Thanks Horseradish - administrator", 
      "date": "2008-01-22 17:31:00", 
      "id": 3558, 
      "sentiment": 2, 
      "subject": "Apologies for absence of administrator", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3942"
    }
  ]
}