{
  "summary": [
    {
      "body": "A new neighbour asked me how long the board had been running, and it encouraged me to see how far back I had posted, I seem to be sixth in line, but remember that you changed over to PHP and the original dates are no longer shown. Do you remember how far back the board actually goes ? I also wanted to say \"thank you\" for hosting this forum, something I sometimes think gets forgotten, you've given up a lot of time and space on your business website to enable BarbicanTalk, and it is very much appreciated by a great many of us ! OK, on to the special request, I wondered (and feel free to say \"no, I don't agree\" or \"no, I don't have time\" etc. ) but I wondered if you would consider adding a couple of new entries on the Forum Index? I was thinking specifically of maybe adding 'Your Neighbourhood Policing Thread', because I think we are extremely lucky that the local Police, especially Paul Gilmour, are willing to take so much time and effort to communicate to the community, something that doesn't happen in many other boroughs. I also thought perhaps, doing the same for the BA-CHAIR ? And one, close to my heart, 'Resident Recommendations', to highlight those who provide A1 services to the estate, from Garchey cleaners to removal men. Feel free to tell you have a lot of better things to do then set this up, but no matter what, \"thanks\", really, for supporting all of us.  Rich.", 
      "date": "2006-06-27 18:03:00", 
      "id": 3168, 
      "sentiment": 4, 
      "subject": "Horseradish, a special request !", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2402"
    }, 
    {
      "body": "Hi all Just wanted to say how much I enjoy reading Barbican talk.  Residents show a good sense of humour, and some messages leave me in stitches (choice of vocabulary, jokes, usernames etc). I don't go on this site regularly (once a month or so), but every time it's good fun. This site is also very helpful, full of practical tips. Glad I have access to it. Violet    ", 
      "date": "2007-02-13 21:26:00", 
      "id": 4229, 
      "sentiment": 4, 
      "subject": "Sense of humour", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3057"
    }, 
    {
      "body": "Hi! I just wanted to say how fantastic I think this site is! I've just moved over  from the States and I am really excited about living in the Barbican. I plan to spruce up my flat a little as its somewhat dated, and this site is such a great source of all kinds of information... its fantastic!", 
      "date": "2007-03-15 22:31:00", 
      "id": 4243, 
      "sentiment": 4, 
      "subject": "New to the Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3147"
    }
  ]
}