{
  "summary": [
    {
      "body": "It was recently brought to my attention that there are absolutely no alert systems in place throughout the estate (for fire etc.) except in Cromwell Tower. I find this to be disconcerting to say the least. Is anyone else concerned - or should I say ALARMED - by this?", 
      "date": "2005-11-08 23:43:00", 
      "id": 4524, 
      "responses": 22, 
      "subject": "Fire Alarms & Bomb Alerts.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1926"
    }, 
    {
      "body": "First of all, I'm sorry if these have all been asked about a thousand times before, but i did try searching the forum and i couldn't quite get the answers i needed.  Before i consider making a move to the Barbican, i would be very grateful if anyone could answer these questions: 1. Are the blocks, (especially the high rise ones!) up to modern fire safety standards?  I have visited people in the high rise blocks, (and i have seen the flats on Open Buildings Weekend) and the blocks do not seem to have fire alarms or sprinkler systems, which would definitely be necessary in modern blocks of that height today.  I am not unnecessarily fussing, but i can imagine more pleasant things than being stuck 35 floors up in a fire, with only the balconies and their little fire escapes to escape by (!) 2. Estate agents, etc. make out that the Barbican Estate Office is really really strict about alterations, changing door locks, putting things on balconies etc, but are they really that strict?  Would you, for example, get into trouble for putting a new lock on your front door without telling them (and how would they find out anyway?), or how would they punish you? 3.  Can the Estate Office supply original Barbican fixtures and fittings, for example if the garchey system has been removed can they replace it?  I was told that that semicircular block, Frobisher Cresent, was intended to be flats, but they never built them, so they still have all the fixtures in storage. 4. If you want to change the kitchen or bathroom, would the Barbican office ever not grant permission?  Thank you very much", 
      "date": "2005-06-12 15:09:00", 
      "id": 4662, 
      "responses": 6, 
      "subject": "Some General Questions", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1682"
    }
  ]
}