{
  "summary": [
    {
      "body": "Two weeks ago, I decided to cycle along the river. When I went to the car park, my bicycle was not there. I went to see the car park attendant. He told me he would file a report with the estate manager. I heard nothing for two weeks.  I rang the car park attendant today. I was told to ring another number.  Finally, I got through someone who told me that the management of the estate could not be held responsible. I wonder what is the point of having a 24 hours attended car park? R", 
      "date": "2005-08-09 09:46:00", 
      "id": 2968, 
      "sentiment": 1, 
      "subject": "Thomas Moore Car Park", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1799"
    }, 
    {
      "body": "Has anyone any info on several of the staff being taken away by the poice/immigration as illegal immigrants.I know this work is now contracted out,but surely Barbican management cannot be unaware they are using \"illigals\" and if not why not?", 
      "date": "2006-08-05 07:46:00", 
      "id": 3150, 
      "sentiment": 1, 
      "subject": "porters", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2508"
    }, 
    {
      "body": "I know it's cryptic but if anyone received a rather strange letter from their cleaner today, can you please PM me to discuss the allegations.  I'm wondering whether to believe it or not and if so, what to do about it.", 
      "date": "2007-01-15 17:24:00", 
      "id": 3252, 
      "sentiment": 1, 
      "subject": "Did anyone get a letter from their cleaner today?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2917"
    }, 
    {
      "body": "Has any body else stop receiving TV Saturday morning from 0130hr following a power failure. I have called the Bunyan court CPA who was going to look into it, so I then called the resident Engineer, only to have the phone answered by Defoe house CPA who said his TV works alright and he would connect me to the Bunyan CPA who would deal with my problem. The Bunyan CPA did call back with a telephone no. of the TV / satellite people under contract to the Barbican Estate, I call the number and listened to an answer machine message requesting our contract number with them (to which I don't know, only the Barbican office knowns, and they are not back for 3 days, so I could not leave any information). I have decided that Life dose not revolve around TV, so thanks to the BEO and there contract with an answer service I am now cancelling my subscription to rip off sky and going to buy a free view box which will work when the BEO get the TV people to switch back on the trip switch (shame the resident engineers dont know where this switch is!). Sorry about the rant, but missing all my favourite TV programmes this weekend. AHHHHHHHHHHHHHHHHHHHHH -0", 
      "date": "2008-05-05 19:40:00", 
      "id": 3566, 
      "sentiment": 1, 
      "subject": "TV Bunyan Court - May Day Bank Holiday weekend without TV", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4304"
    }, 
    {
      "body": "I rang central services today and needless to say I'm not impressed with the response they gave me for my query. I've recently had damp coming through the toilet wall and rang to enquire if someone, probably a Barbican engineer could come round and tell me where the pipes were located. But I was told to ring a plumber! This begs the question, why I'm paying so much for a service charge when an engineer can't even be bothered to tell me the location of the pipes! Instead I was offered a list of plumbers' telephone numbers. I'm not going to let this go and pretty angry about it. It's not like I'm asking them to diagnose the problem.", 
      "date": "2005-11-21 13:41:00", 
      "id": 4533, 
      "sentiment": 1, 
      "subject": "Water Pipes in Toilet", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1946"
    }
  ]
}