{
  "summary": [
    {
      "body": "whilst reading about the mendohlson tree, i wondered ...  whilst recognising that we are indeed very lucky in our police resources, is there a specific reason why the bored-out-of-their-minds security staff from the arts centre can't cast their net wider ... ? I ask because the  lovely gardens by bunyan / jt / bryer are a bit of an attraction for the \"malcontents\" because they're so lovely and lush and screen things from public view ... the group of youths, for example, referred to in previous posts i think, have taken to drinking under bunyan - having re-located from jt ...  presumably the answer is the security guards are employed by the arts centre but i wonder how whether the financial equation to extend their duties to the rest of the estate would be a cheaper option than using the police and the cost of repairs (when things can be repaired, that is, unlike the tree sculpture...) just a thought", 
      "date": "2006-05-01 23:08:00", 
      "id": 3084, 
      "sentiment": 3, 
      "subject": "security", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2244"
    }, 
    {
      "body": "Whilst generally very helpful \"I\" had a bad experience involving a rude attendant and involving bad language (him having been very inconsiderately woken up).  There is one grumpy attendant who has however in the past been okay once you have got past the grumpiness.  Not sure if it was him.  This however seemed a bit uncalled for.   It happened to a friend  - otherwise I would be complaining and hence the vagueness about who/what was involved.  I just wondered whether anyone else had any bad experiences recently. Thanks.", 
      "date": "2007-02-06 11:14:00", 
      "id": 4220, 
      "sentiment": 3, 
      "subject": "andrewes car park attendant", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3039"
    }, 
    {
      "body": "If any of the Ben Jonson staff are reading this...you all do a great job. Thanks.", 
      "date": "2005-11-09 16:25:00", 
      "id": 4520, 
      "sentiment": 3, 
      "subject": "Wonderful CPAs and cleaners", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1928"
    }, 
    {
      "body": "Does anyone know why residents do not have a better way of controlling their underfloor heating? Every couple of years or so, the heating in our flat is too much or too little.  This year, for a change, it failed - or, at any rate, it seemed to fail, for the floor never became warm even when we put a cushion on it to test the effect in the morning.  The Estate Office staff were gratifyingly quick to react.   Less gratifyingly, the flat soon became far too hot.  If only we could reach for a control and turn it a few degrees.  Instead we have to ask the office to arrange for someone to turn the heating down.  Then an engineer adjusts something an arbitrary amount (possibly misunderstanding the  direction required), and the office issues official paperwork that we don't really want.  After waiting a few days to see if we can tell the difference we have to start the process again. This morning our bedroom was at 22.5 degrees after the window had been open all night, and we/Estate Office/engineers have been trying to lower it for over a fortnight. The overheating wastes energy, and the primitive but elaborate  procedure for controlling the heating must irk almost everyone who has to play a part.  Is it impossible to equip our flats wth a better control system?", 
      "date": "2006-04-06 13:20:00", 
      "id": 4641, 
      "sentiment": 3, 
      "subject": "Controlling the underfloor heating", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2179"
    }
  ]
}