{
  "summary": [
    {
      "body": "It is not too late to make a difference. Today (31 October) is the last day to get in your objections for the Milton Court development: a school for the Guildhall School of Music and an enormous residential tower. Reference 06/01160/FULEIA If you haven't got your objection in yet, you can email it to   or you can hand it over in person by going to the 18th floor of St Alphage House. You must ask for a receipt with today's date. Objections received after today will still be taken receipt of, but might not be considered fully. But if you can't make today, you should definitely still send yours in. I have pasted derbyram's points to object on below. It is important that people who object to the proposal to send in a letter of objection. We helped to have the submission rejected before and we can hopefully do it again. Here are the points: The plan submitted in March has been modified in an attempt to satisfy some of the objections raised, but in essence remains the same: a new building with the lower block housing a concert hall and theatre for the GSMD, surmounted by a residential tower.  284 flats in a tower covering half of the existing site, just lower than City Point  residential density over 8x greater than within the Barbican (even Heron note this in their environmental impact study  density will be 1183 units per hectare, compared with a recommended central location maximum of 240-435 as per the Mayors London Plan, which also states that density should respect local context and communities)  the existing Milton Court perimeter wall moved 1.9m closer to the Barbican, resulting in the road carriageway narrowing from 10.4m to 7.3m  buses and other large vehicles will have great difficulty is safely negotiating the Silk Street/Moor Lane junction in the face of oncoming traffic.  Heron still plan to purchase 210 car parking spaces in level 03 and 02 car parks below Willoughby, and convert space under the Moor Lane car-park ramp into secure bicycle parking, all for the exclusive use of Milton Court.  a health spa/club with outside tables will sit on top of the GSMD building (6F), directly opposite upper floor residents bedrooms in Willoughby and Speed.  many flats in north Willoughby and Speed will still suffer from a loss of light, loss of privacy, and be subject to overlooking from the new tower.  loss of the existing public highwalk  note that recent new buildings constructed around the Barbican area have been designed to retain highwalk access  similarly redevelopment of Milton Court should follow the same UDP requirement.  this development will generate 3,705 person trips and 423 vehicle trips per day, which will be in addition to traffic generated by the new Ropemaker Place building.  a caf/restaurant will be located at the SE ground floor corner  expect early morning delivery noise, as experienced with the City Point bars/restaurants.  the contractor has promised to abide by CoL working hours (which differ from Barbican Estate noisy work hours), but note than the contractor has already broken such pledges made while constructing the new lift/staircase.", 
      "date": "2007-10-31 10:07:00", 
      "id": 4154, 
      "responses": 29, 
      "subject": "MILTON COURT FINAL OBJECTIONS", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3755"
    }
  ]
}