{
  "summary": [
    {
      "body": "Hi there Apologies in advance for making my first post a contentious one. We have been thinking about moving to the Barbican for some years. In 2003 it was possible to buy a split level 1 bed flat for about 275K. Unfortunately, for various reasons, we did not take this opportunity. Similar flats now appear to be on the market for 400K and over. Studios for 300K. I would like to ask longer-term residents: do prices tend to reflect the ups and downs of the stock market and the fortunes of the City? Did the prices of Barbican flats fall in the last recession, or did they hold up? If prices continue on their upward spiral, I guess we will have to give up the idea of ever moving here. A third of a million pounds for a single room is a bit steep, even if it's in the best place to live in London! Best wishes to all.", 
      "date": "2006-08-24 11:23:00", 
      "id": 3471, 
      "responses": 49, 
      "subject": "Barbican flat price fluctuations?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2555"
    }, 
    {
      "body": "Past experience suggests that the Frank Harris estate agency acts as a good indicator of Barbican property.  Property hard to sell and prices on the low side = politeness and smiles to all potential buyers.  Property scare and prices on the way up = snotty attitude.  Snottiness at Frank Harris is now reaching such extreme levels it could indicate a turn in the market.  Or maybe I'm just generally less tolerant of rudeness and snotty behaviour than I used to be - obviously getting spoiled by Waitrose.", 
      "date": "2006-07-07 14:51:00", 
      "id": 3247, 
      "responses": 25, 
      "subject": "Frank Harris snottiness barometer", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2436"
    }, 
    {
      "body": "I just spotted on Frank Harris' website that prices for Barbican flats are up. So does this reflect a real increase, with the Barbican bucking the trend for the rest of London, or is that estate agent overvaluing?", 
      "date": "2005-05-23 15:32:00", 
      "id": 4726, 
      "responses": 23, 
      "subject": "property prices", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1644"
    }, 
    {
      "body": "We currently have an old style kitchen, which we'd like to re-furbish back to it's former glory, as it is looking a bit tired. However my question is , is it worth trying to source all the bits and pieces, as nothing is made anymore. Would it be better financially in the long run to install a new kitchen in a modern style in-keeping with the streamlined 60's/ 70's white feel that the originals have? Does anyone have experience of whether this would add value or lessen it?  It does seem that many people are now getting fed up of the crankiness of the old kitchens , and maybe new buyers would also prefer this as they may find out how difficult it is to repair / source original fittings. So is it worth spending money on re-furbishing the original....or on completely re-fitting in a suitable 'in-keeping with' style?", 
      "date": "2005-08-02 13:09:00", 
      "id": 2989, 
      "responses": 14, 
      "subject": "Kitchen Dilemma", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1778"
    }, 
    {
      "body": "I see today that Frank Harris have a couple of 1 beds, one in BJH , on for 400K  and above  I'm astounded by this,  are they really shifting flats at this level???  Is it all because of Waitrose??", 
      "date": "2007-02-12 13:55:00", 
      "id": 4388, 
      "responses": 14, 
      "subject": "Flat Price Shock", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3056"
    }, 
    {
      "body": "I saw that in today's CityAM paper that Wallside has been featured following the buyout of the lease from the Corporation of London (or whatever they are now) to freehold. According to some this adds 30K to this type of property. Mind you they have a valuation of between 1m and 1.2m", 
      "date": "2006-01-12 11:57:00", 
      "id": 3040, 
      "responses": 11, 
      "subject": "Leasehold", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2030"
    }, 
    {
      "body": "I can't believe that I have just heard that a Type 25 in Mountjoy went on Friday within 15 minutes of coming to the market through Hurford Salvi Carr!! Couldn't even get to see it, and asking 650,000!! How can anyone get to buy in this super hot market ?[/b]", 
      "date": "2006-08-16 12:13:00", 
      "id": 3160, 
      "responses": 11, 
      "subject": "Property moving So FAST!!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2530"
    }, 
    {
      "body": "Further to comments by Maximus regading the roofs visible in the recent Barbican Photo published by the Guardian, one wonders whether the Barbican Estate could - with careful planning and some investment - achieve a 'zero carbon' certification.  Not only would this be environmentally sensitive but could also result in exemption from stamp duty for homes under 500,000.  Does anyone think this might be worth exploring?", 
      "date": "2007-03-22 16:56:00", 
      "id": 4247, 
      "responses": 8, 
      "subject": "Zero Carbon Homes", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3172"
    }, 
    {
      "body": "Noticed today on Frankharris a couple of benchmark type 20/21s going for 575-620k: if my memory is right, this is 50k less than the asking price about 2 months ago.  Are we over the top and on the way down now?", 
      "date": "2007-12-07 14:40:00", 
      "id": 4173, 
      "responses": 7, 
      "subject": "Barbican property prices down?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3856"
    }, 
    {
      "body": "Dear all,  I am considering buying a large studio (currently renting one). I am doing my \"price discovery\" howework now. There are records of sold prices at nethouseprices.com. However, only flat numbers and prices are available. For example,  Abcd Court, Flat 123, 234,000, 01-Jan-2007. What is the easiest way to determine flat type (e.g., F2B) given flat number? Calling into each of the flats in the appropriate price range and asking \"what is your flat type, please?\" is probably not such a great idea... (I personally would not mind if someone called into my flat with such a question, but this does not mean that I can bother others...) Would the Estate Office be able to provide such information? Or could you recommend another source, please? Thank you.", 
      "date": "2007-02-01 12:06:00", 
      "id": 4216, 
      "responses": 7, 
      "subject": "Block + Flat number ---> Flat type?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3000"
    }, 
    {
      "body": "Also, and I know this is a difficult question - is 170000 a decent price for an F1A studio flat inward facing in John Trundle. Sorry if this is a bit tastless, but I feel this forum is the best place to find out. Max", 
      "date": "2005-10-12 20:47:00", 
      "id": 4440, 
      "responses": 4, 
      "subject": "new resident  - one more question", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1881"
    }, 
    {
      "body": "About time!  I thought Barbican flats were flying off the shelves? There's a few here that aren't shifting, despite being on the market a couple of months. Hopefully if these reductions continue, in a year or two I might finally be able to afford one!", 
      "date": "2007-06-26 10:50:00", 
      "id": 3364, 
      "responses": 3, 
      "subject": "Price reductions in EC2", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3447"
    }, 
    {
      "body": "Have \"bog standard\" type 20/21s now bubbled up to about half a million ? I took my eye of the Frank Harris site for a couple of months and now that's what it seems to suggest. Or have they been lingering on the site for a while ?", 
      "date": "2007-01-22 15:37:00", 
      "id": 4202, 
      "responses": 2, 
      "subject": "flat prices", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2949"
    }, 
    {
      "body": "First of all, please forgive me - I am not actually a resident of the area, but I'm sure all you Barbican inhabitants may be able to answer my question, which is.. Why has the Barbican become so madly popular recently? I have always considered it on and off, and just a month or two ago nearly every estate agent in town had a vast choice of different Barbican properties, but now there is literally not a single property available, and in a tower block with a view... forget it.  It was always the case for years that there were consistently many Barbican properties available, but now they've all gone.  I saw in another thread that someone recommended calling the estate agent on the day they release details of a new sale, and they're quite right!  This has become like trying to buy a property in Primrose Hill! Prices have skyrocketed too, there is currently a tower block apartment for 700,000 (under offer), whilst this time last year tower apartments were about 550,000 with the desirable views, and much less (400k region) with the north (and west?) aspect.  There was a penthouse in one of the tower blocks that sat on the market for about 3 years, but recently it appears that two newly for sale penthouses in tower blocks have been snapped up in about a month. Are you (Barbican residents) noticing more people in the area? Has anything specific brought about these changes, or are people finally opening their eyes to how magnificant the Barbican estate actually is?  Are the original generation of Barbican dwellers (who perhaps have a second home too, out of London) starting to sell up and move out?   Whatever it is, i'm rather annoyed now!", 
      "date": "2006-06-10 12:40:00", 
      "id": 4416, 
      "responses": 2, 
      "subject": "Current mad popularity of Barbican...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2354"
    }, 
    {
      "body": "Does any one have any idea how much the lower garden flats (the studios) go for in Thomas More? i've never seen inside one, but i like the idea of living in one - does anyone know what they're like inside? Do they actually ever come on the market - i have never seen one for sale - or do the people that live there love them so much they never move?", 
      "date": "2005-08-28 20:19:00", 
      "id": 2985, 
      "responses": 1, 
      "subject": "Thomas More Garden Studio Flats", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1823"
    }
  ]
}