{
  "summary": [
    {
      "body": "There was a parade of men, many wearing orange sashes and accompanied by bands & banners in the city this afternoon. I spotted them in the Smithfield area & later on London Wall & Aldersgate, but couldn't see what their banners said. I suspect that they were orange men - does anybody know what was going on?", 
      "date": "2005-04-23 17:41:00", 
      "id": 2920, 
      "sentiment": 1, 
      "subject": "orange parade in city???", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1584"
    }, 
    {
      "body": "My brother in law called me up tonight to tell me a team from the Barbican was on University Challenge competing against one from the Society for the Preservation of Ancient Buildings.  However, i missed the start and would like to write a news item on this for Barbican Life.  Can anyone who may have watched, or happens to know, whether the Barbican team was drawn from the staff of the Barbican Centre, or from residents?  I also only managed to pick up the team's surnames - can anyone supply me with their forenames too? Thanks", 
      "date": "2005-08-15 20:14:00", 
      "id": 2971, 
      "sentiment": 1, 
      "subject": "University Challenge", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1809"
    }, 
    {
      "body": "So.. what happened?  London Wall is closed now.", 
      "date": "2006-05-03 11:38:00", 
      "id": 3086, 
      "sentiment": 1, 
      "subject": "Moorgate fire", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2250"
    }, 
    {
      "body": "Police have closed off Long Lane and Aldersgate Street.", 
      "date": "2005-10-01 06:18:00", 
      "id": 3111, 
      "sentiment": 1, 
      "subject": "What's going on?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1862"
    }, 
    {
      "body": "Anyone notice the steam coming out of the drains on the corner of Beach St and Aldersgate? Just curious as to where the heat is coming from as it looks like the streets in New York.", 
      "date": "2006-08-22 09:28:00", 
      "id": 3166, 
      "sentiment": 1, 
      "subject": "Steam", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2549"
    }
  ]
}