{
  "summary": [
    {
      "body": "any comments on the following neighbour dilemma? New people moved in next door recently and they have  a child who's maybe 6 or 7?  Its not his fault and every kid should be able to play, but how far does his right to play overwhelm my right to peace and quiet?  when he plays he shouts, yells, screams, cries - stuifff kiids do I suppose.  at 7.45am on Satursays and sundays too.  I'm quite a quiet person and its really starting to make living next door unbearable.  I mentioned it to the parents and I think they're trying, but they aslo said that he has every right to make noise in their flat and if i wanted quiet i shouldn't live in the middle of a city.  they didn't say it nastily i must add but now i don't know whether to tell them again and risk warring neighbour time or just go to boots and stock up on earplugs. if you've got kids what's your view on this? or what would anyone else do in  this situation to make living in the peaceful barbican peaceful again without causing neighbour war time?", 
      "date": "2006-04-28 17:45:00", 
      "id": 4408, 
      "responses": 67, 
      "subject": "neighbours children", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2236"
    }, 
    {
      "body": "Last night I watched 13 young men of about 18-19 years old break into the gardens. They arrived in several groups and spent about an hour shouting, hanging around by the lake and climbing up and down a section of fence. This is a cause for concern, especially for residents at ground level. I have often thought that it's all too easy to access the gardens from outside. Obviously others know this too.", 
      "date": "2006-10-27 08:45:00", 
      "id": 4306, 
      "responses": 12, 
      "subject": "Security in the gardens", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2704"
    }, 
    {
      "body": "Do I live in a particularly socially unable or anti-social staircase?  It amazes me that most of the other residents appear to be completely unaware of other people in the block. Apart from the rubbish smelling on the staircase they seem totally unable to close a door behind them without slamming it extremely loudly. I can close mine just by pushing it to and then turning the latch and it makes no noise at all. Moan, moan, moan, moan!", 
      "date": "2006-04-25 07:54:00", 
      "id": 3074, 
      "responses": 10, 
      "subject": "Door Slammers", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2222"
    }, 
    {
      "body": "0620 on a Sunday morning is -not- the time to be racing cars around a residential building! Is anyone else awake? People have been driving up and down the tunnel at at least 60mph in clusters; some with modified exhaust pipes that make them sound like mopeds. After twenty minutes or so, the circuit seemed to be extended to include Aldersgate as well. I tried COL police non-emergency number, but no answer. It just rings and rings. I'm not even sure; is there actually any law broken if they drive around in circles in a residential area? Other than speeding, I mean. It's happened before quite a few times.  I felt rather pleased a few months ago when one of them, whilst speeding outrageously through the tunnel, burst a tyre on the kerb. No damage done except for the tyre; it seemed like just deserts so I allowed myself a small smile. Sadly, there was no such luck today. I wouldn't mind terribly much if they did it during the day, but it's only ever between 0100 and 0730 in the morning. Which is rather antisocial. I want to go back to sleep and when I started writing this message after an hour it seemed to have calmed down, but they are back again now. 0620 to 0715 so far.", 
      "date": "2007-01-21 07:24:00", 
      "id": 4370, 
      "responses": 9, 
      "subject": "Tunnel-racing", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2939"
    }, 
    {
      "body": "Was anyone else disturbed in BJH at 11.00 pm last night (23rd) by someone hammering? It went on for about 15-20 minutes and was definitely hammering, not an airlock in the pipes.  Very inconsiderate! ", 
      "date": "2005-12-24 09:40:00", 
      "id": 3016, 
      "responses": 7, 
      "subject": "Late night hammering", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1999"
    }, 
    {
      "body": "We were woken again by a late and loud party in Defoe House last night. A week or so ago there was another loud party late in the night in Seddon. Do people have no consideration for sleeping children and extremely tired neighbours? I wish the Estate office would enforce the noise rules.", 
      "date": "2005-09-24 09:52:00", 
      "id": 4439, 
      "responses": 7, 
      "subject": "Late loud parties", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1851"
    }, 
    {
      "body": "After a long time, (almost a year?) and having complained politely (yeah, right) to our neighbors upstairs, we made a formal noise complaint at the Barbican offices. The folks upstairs  (an \"L-shaped 20\", I believe is what they're called,) have two 5 or 6 year olds, and a baby that will soon be old enough to stomp and bang itself. They have laminated floors throughout the entire apartment, and every morning, at precisely the legal time to make noise (7:30-8:00 A.M.) BANG! One jumps from it's bed. in the side front room, joined seconds later by the other child, also in the front room. They race to the parents bedroom and jump around there for a while, and run back and forth (I swear I have heard them call it \"the running and jumping game\") and this goes on until they go to school, and from when they return 3:30-ish (with school freinds, often) to run, jump, bang and wrestle until they all go to bed 11:00ish. Its only running and bouncing and kiddie stuff, you can't fault them, they are only kids having fun. But the parents only gave us blank looks when we went up to ask them to hold it down. In our book of Barbican rules it says \"Carpets must cover all floors, to avoid noise.\" (I'm paraphrasing) So we complained in the Barbican office. They took down the info, and told us not to expect anything to happen \"for a reasonable lenghth of time, which meant sometime in Dec. They then added that since it would be around Christmas time by then, the neighbors probably wouldn't want to be buying and installing carpets then...     In October, a month or so after our complaint, we got a letter from the Barbi Corp asking US to keep a log of THIER noise FOR A MONTH, and  submit it back to them. Um, why is it OUR responsibility to spy and report on our nieghbors? Very Maoist spy-on-your-neighbor policy. We did it, though, making us seem quite petty, writting down everytime they banged on the floor or jumped off the furniture The corp. sent back a notice telling us that most of the noise was \"within noisey hours\" (I said I was paraphrasing, folks!) except for once when it went past midnight, which was aparently our only valid complaint. Whaaa? The complaint is that THEY DO NOT HAVE CARPETS TO CUT DOWN ON NOISE. The reply also said we had \"Screamed at them in April\" (10 months earlier) during one of the brat's (I'm still parapharasing) birthday party. Aparently that was enough to negate our claim. Actually, the Corp had told them to get carpeting, but to give them time to do so, 3 months, and if they don't, we should feel free to complain again.      We are going to get a chimpanzee and a breeding pair of Lorries, a very beautiful and very songful bird. Let THEM complain! We'll tell 'em that carpeting their floors might cut down on some of the noise.     A rule is a rule innit? Does anybody know the \"real\" rules on carpeting floors? I'ver noticed somewhere on Barbican talk that somebody mentioned their wood floors. We've also noticed the Estate Agents sometimes advertise wood floors as a plus when offering Barbican apartments for sale. We wouldn't mind if it was a sweet, lightweight lady like Thelma walking in slippered feet on her cold, cold floor, but it ain't. This is the main reason I got on this site, to find out what the \"unwritten\" rules are. Thanks in advance for your upcoming input!", 
      "date": "2008-02-03 09:04:00", 
      "id": 3778, 
      "responses": 6, 
      "subject": "Barbican bylaws versus Ignoring Barbican bylaws.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3976"
    }, 
    {
      "body": "Why do we bother lobbying to have pubs and clubs around the Barbican controlled for opening hours and noise disruption, when our own neighbours cause such a ruckus? Last night someone in Speed House held a really obnoxiously noisy party. Every few minutes there was some mad screaming until about 2.30 am. The noise enemy is within.", 
      "date": "2005-08-06 10:41:00", 
      "id": 2960, 
      "responses": 3, 
      "subject": "Noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1791"
    }, 
    {
      "body": "Anyone any idea about the crazy barking dog that was making such a racket about 8am this morning on the Speed side of things? Or was it just a mad bird that sounds like a dog? I've heard pigeons in the barbican that make a noise like a gorilla, so it's not out of the question.", 
      "date": "2007-06-30 14:34:00", 
      "id": 3475, 
      "responses": 3, 
      "subject": "Mad barking dog", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3457"
    }, 
    {
      "body": "Does anyone know why there were dogs barking, yelping and whining for over an hour at around 4am this morning? I had a broken nights sleep as the noise was so loud.  When they came nearer to Andrewes House car park I heard voices and it sounded like the dogs were being trained, it occurred to me perhaps as police dogs? Does anyone know if this sounds likely, or was I getting delirious in my slumbers?!  I hope it doesnt happen againwhy cant they do it during more sociable hours? Does anyone have any explanations? Thanks Joni", 
      "date": "2008-05-14 14:43:00", 
      "id": 3592, 
      "responses": 3, 
      "subject": "Dogs Barking!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4339"
    }, 
    {
      "body": "Riots in and outside the YMCA, paint colour wars, satanic children and smashed glass in BJH and drunken hoodies under Bunyan. What's going on on our northern fringes? Is there something in the water? ", 
      "date": "2006-05-06 22:29:00", 
      "id": 3097, 
      "responses": 2, 
      "subject": "what's up??", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2266"
    }, 
    {
      "body": "There seems to be someone on the podium serenading the east end of Ben Jonson on a trumpet. For the last half hour. Mainly doing scales. Has anyone else been disturbed by this? It started around midnight and was amusing at first, but now its stopping me sleeping and I have work to do tomorrow, so I have been a real killjoy and alerted our local bobbies who are apparently sending someone to ask them to put a sock in it...", 
      "date": "2008-04-04 23:34:00", 
      "id": 3846, 
      "responses": 2, 
      "subject": "trumpet involuntary", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4191"
    }, 
    {
      "body": "This is a Shakespeare Tower problem that others - elsewhere on the Estate - may have experienced. If so, help, guidance and advice would be appreciated. It is driving us mad. At 0600 each morning the bedroom wall behind our bed broadcasts the  Radio 4 time pips and then - for an hour - we get the TODAY programme. On the other side of that wall is a stairwell and not the wall of an adjacent flat.  We have no objection the programme - one of us normally gets out of bed to listen to it on the radio in the bathroom at around 0620 before going off to work - but the other needs to go on sleeping and cannot because of the noise from the wall. The two of us have to suffer it at the weekend. It is a real and intrusive problem. We have (as informally as is possible as 0600, gumpy, wearing pyjamas and carrying tumblers to improve the accoustics by resting them against front doors) checked the neighbours flats. It does not seem to be those immediately above or below us.  God know what they would have done if they had seen us. The noise is coming from somewhere else on our side of the tower (we are an 8B: **2 flat). It seems to be travelling up (or down) the wall from a flat where someone has the radio on a timer that lasts for exactly one hour.  Then there is peace. Is anyone else suffering - we are finding this noise is seriously intrusive - and what do we need to do?", 
      "date": "2006-05-07 21:45:00", 
      "id": 3091, 
      "responses": 1, 
      "subject": "Broadcasting Wall", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2270"
    }, 
    {
      "body": "Does anyone know why there were dogs barking, yelping and whining for over an hour at around 4am this morning? I had a broken nights sleep as the noise was so loud.  When they came nearer to Andrewes House car park I heard voices and it sounded like the dogs were being trained, it occurred to me perhaps as police dogs? Does anyone know if this sounds likely, or was I getting delirious in my slumbers?! I clearly heard praising of the dogs, which suggests they were being trained. I will speak to the car park attendant, as it sounded like they were close to his box.  I hope it doesnt happen againthe time of day was very unsociable. Does anyone have any explanations?  Thanks  Joni", 
      "date": "2008-05-14 18:06:00", 
      "id": 5528, 
      "responses": 1, 
      "subject": "Dogs Barking", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=4340"
    }
  ]
}