{
  "summary": [
    {
      "body": "don't know if it's a practical joke or a sign of an attempted break-in, but I found a heavy iron rod on my balcony (in andrewes) and a bamboo rod stuck in one of the flower pots. Also one of the balcony partitions from the next flat was not properly shut. Maybe someone looking for windows open due to the heat?", 
      "date": "2005-07-18 12:06:00", 
      "id": 3055, 
      "sentiment": 2, 
      "subject": "prowlers", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1747"
    }, 
    {
      "body": "Been away for a couple of weeks but heard 3rd hand that there had been a \"spate\" of break ins on the estate,    is this true??", 
      "date": "2007-08-24 16:50:00", 
      "id": 3413, 
      "sentiment": 2, 
      "subject": "Bulglaries?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3606"
    }, 
    {
      "body": " We were made aware last weekend of complaints listed on this website about actions by us or our contractors. I immediately started an investigation as we take these complaints very seriously. We have spoken at length, prior to being allowed on site, to all workers about a number of issues including hours of working, attitude when working and respecting that this is a residential neighbourhood. I have repeated this following last weekend to ensure that all workers know that any failure to respect these rules will mean they risk disciplinary measures and dismissal from the site. Following my investigation I received an apology from the scaffolder who swore, he is the foreman and it was out of character. He denies the incident happened at the time stated and was clear that he was not present on site at that time and neither were his team. I cannot prove he was there but have given him a final warning over the swearing. He is going to write to the resident who first made us aware of the complaint (this has been made possible by your Chair asking the complainant for his address). The second issue was my email address, it is working now but was not last weekend and I apologise. Thirdly I delayed this statement to you until after we had met with your representative's on Thursday night as part of our regular consultation on the planning and construction of Milton Court. This was to ensure that we had covered all the issues and had made ourselves accountable. Fourthly I was asked if we could repeat the hours of working we are keeping to, these are: Monday to Friday hours, 08:00-10:00, 12:00-14:00 and 16:00-18:00 Saturday hours, 9:00-2:00pm with no noisy works Sunday, No work Fifthly for ease here are the ways of contacting me. I hope you will not need to but would prefer that you had it easily to hand. Please contact me on 07823 442024 or   Finally I wanted to update you on the fire that occurred on the Milton Court site on Thursday. The fire was restricted to the fire station training tower in the courtyard area of the site and was caused as a result of the burning operations that were being undertaken by Cantillon on the steel sections of the tower. Once the fire was detected, the Emergency Plan was put into effect by Cantillon - the site was evacuated and the emergency services contacted. The emergency services arrived within minutes and the fire was very quickly put under control. The sheeting around the site did its job in containing the fire for longer allowing for safe exit from the site and the arrival of the fire services. The sheeting shrank and melted on the upper floors, without giving off toxic fumes or separating from the structure.  The roads around the immediate site were sealed off by the police as a precaution. Once the dousing down was completed, the scaffold to the tower were inspected by Cantillon and the District Surveyor and it was found that there was no apparent structural damage caused to the scaffold itself. The scaffold sheeting is now being removed and a more thorough inspection of the scaffold has taken place along with the clean up operations generally. No one suffered any injuries and no evacuation of adjacent premises was necessary. No delay to the project is anticipated and the whole episode was dealt with over the space of a couple of hours. This incident has of course been reported to the statutory authorities. Thank you for your understanding over both these incidents. I hope I have given a helpful explanation and that as we go forward with this project we can be a good neighbour to you. Yours faithfully Andy Dyson", 
      "date": "2008-01-13 15:22:00", 
      "id": 3559, 
      "sentiment": 2, 
      "subject": "Statement from Andy Dyson, Project Director for Cantillon", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3926"
    }, 
    {
      "body": "I complained to Transport for London that only one of the two platforms at Barbican Station was cleared of graffiti after Christmas. I have just received a phone call from Metronet, who say that their contractor has instructions to clean the other platform but cannot do so without access permission from Network Rail - which is not forthcoming. Network Rail's website states that Barbican Station is managed by TfL.   Who knows.  Who cares.  Just join me in bombarding them all with complaints until something happens!", 
      "date": "2008-02-01 14:27:00", 
      "id": 3809, 
      "sentiment": 2, 
      "subject": "Barbican Station update", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3973"
    }, 
    {
      "body": "There seems to be someone on the podium serenading the east end of Ben Jonson on a trumpet. For the last half hour. Mainly doing scales. Has anyone else been disturbed by this? It started around midnight and was amusing at first, but now its stopping me sleeping and I have work to do tomorrow, so I have been a real killjoy and alerted our local bobbies who are apparently sending someone to ask them to put a sock in it...", 
      "date": "2008-04-04 23:34:00", 
      "id": 3846, 
      "sentiment": 2, 
      "subject": "trumpet involuntary", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4191"
    }
  ]
}