{
  "summary": [
    {
      "body": "NOT PROTECTIVELY MARKED Community Update Thursday, 24 April 2008 Night time parking services Two civil enforcement officers will be working alongside City of London Police officers on Thursday, Friday and Saturday nights to enforce parking restrictions in the City.  They will work from 10pm until 7am each night, patrolling all areas of the City, and working in conjunction with colleagues from the police they will have the power to issue tickets and remove vehicles. Sixteen months for laptop thief A thief who stole a laptop from an office premises in the City was sentenced to sixteen months at the Old Bailey this week. The man was stopped by Met officers, outside the City, on suspicion of stealing a bike.  The officers discovered a cutting from the Evening Standard in his pocket.  The article was an appeal for witnesses issued by the City of London Police following the theft of a laptop.  The appeal included a picture of the suspect, which officers recognised as the man they had stopped.   New forced-marriage helpline launched Support is now available for victims of honour-based violence thanks to the launch of a new national helpline. The Honour Network is a dedicated forced-marriage and honour-based violence helpline, staffed by survivors offering emotional and practical support.  The number is 0800 5999 247. The helpline, run by the charity Karma Nirvana, is designed to identify survivors to help support each other. It also aims to raise awareness of the issues of forced-marriage and honour-based violence, given that most of the problems remain underground. The Forced Marriage (Civil Protection) Act will be implemented in the autumn. The Act will give courts powers to make Forced Marriage Protection Orders to stop someone forcing another person into marriage. Where a forced marriage has taken place, the courts would also be able to make orders to protect the victim and help remove them from that situation. Pissoir for Charterhouse Street A 'Pissoir' (portable multi-provision public toilet) is to be trialled at Charterhouse Street within the next two weeks to help resolve urination problems in that area.  The City Environmental Services are also reviewing the provision of public toilets in the City of London. New and variations to licensed premises New or variation of license applications were received in the past two weeks in respect of; 1) Variation - Pitcher & Piano, Bishopsgate - to change the occupancy figure and remove duplicitous or irrelevant conditions on the licence. 2) New Premises Licence - Eversheds LLP, 1 Wood Street, EC2V 7JB - sale/supply of alcohol 0000 - 2359 Mon - Sun.  For employees only, not open to public. 3) Variation - Victoria House, 23-27 Tudor Street, EC4Y 0DD - to Sunday hours for late night refreshment from 2300 - 0000 to nil, and for sale of alcohol from 1200 - 2300. Cluster and ward meetings April 2008  23 April Cluster 5 meeting (Bread Street, Cheap, Cordwainer, Queenhithe) Time and location:  contact your local ward officer Cluster 3 meeting (Aldgate, Lime Street, Portsoken, Tower) Time:  10.00am Location:  Allianze, 27 Leadenhall St, EC3A  May 2008 2 May  Farringdon Within ward meeting (a part of Cluster 4) Time:  11.00 am Location:  Snow Hill Police Station 15 May  Cluster 4 ward panel meeting (Castle Baynard, Farringdon Within and Farringdon Without Wards) Time:  3.00 pm Location:  Unilever House, 100 Victoria Embankment, London, EC4Y Ward surgeries April 2008 30 April  Ward Surgery with PC John Levey and PC Sharon Herbert  Cluster 6 Aldersgate Ward Time:  12.00 pm to 1.00 pm Location:  Golden Lane Estate Office, Golden Lane, London EC1 May 2008 01 May  Ward Surgery with PC Dean Stanhope Cluster 4 Cheap Ward Time:  6.30pm - 7.30pm (subject to Operational Commitments) including a Church Service Location:  St Andrews by The Wardrobe, Queen Victoria Street, London EC4 07 May Ward Surgery with PC Machin/PC Di-Giuseppe Cluster 4 Time:  12.00 to 13.00 pm Location:  Shoe Lane Library, Shoe Lane, London EC4 Ward Surgery with PC John Levey and PC Sharon Herbert Cluster 6 Aldersgate Ward Time:  12.00 pm to 1.00 pm Location:  Golden Lane Estate Office, Golden Lane, London EC1 08 May Ward Surgery with PC Dean Stanhope/PC Mark Dilliway Cluster 4 Time:  10.00 - 11.00 (subject to Operational Commitments) Location:  St Vedast Church, Foster Lane, London EC4 14 May Ward Surgery with PC John Levey and PC Sharon Herbert Cluster 6 Aldersgate Ward Time:  12.00 pm to 1.00 pm Location:  Golden Lane Estate Office, Golden Lane, London EC1 15 May  Ward Surgery with PC Dean Stanhope Cluster 4 Cheap Ward Time:  6.30pm - 7.30pm (subject to Operational Commitments) including a Church Service Location:  St Andrews by The Wardrobe, Queen Victoria Street, London EC4 21 May Ward Surgery with PC John Levey and PC Sharon Herbert Cluster 6 Aldersgate Ward Time:  12.00 pm to 1.00 pm Location:  Golden Lane Estate Office, Golden Lane, London EC1 22 May  Ward Surgery with PC Dean Stanhope/PC Mark Dilliway Cluster 4 Time:  10.00 - 11.00 (subject to Operational Commitments) Location:  St Vedast Church, Foster Lane, London EC4 28 May   Ward Surgery with PC John Levey and PC Sharon Herbert Cluster 6 Aldersgate Ward Time:  12.00 pm to 1.00 pm Location:  Golden Lane Estate Office, Golden Lane, London EC1 29 May   Ward Surgery with PC Dean Stanhope Cluster 4 Cheap Ward Time:  6.30pm - 7.30pm (subject to Operational Commitments) including a Church Service Location:  St Andrews by The Wardrobe, Queen Victoria Street, London EC4 Watch meetings April 2008 30 April Pub Watch meeting for Cluster 4 (Castle Baynard, Farringdon Within, Farringdon Without) Time:  15.00 to 17.00 Location:  Snow Hill Police station, 5 Snow Hill Pub Watch meeting for Cluster 3 (Aldgate, Lime Street, Portsoken, Tower) Time:  10.00am Location:  Pause Bar, 80 Leadenhall Street Pub Watch meeting for Cluster 6 (Aldersgate, Cripplegate, Coleman Street) Time:  11.00am Location:  Contact your Ward Constable for the venue   May 2008 7 May Gym Watch meeting for Cluster 6 (Aldersgate, Cripplegate, Coleman Street) Time:  10.30am Location:  Contact your Ward Constable for the venue Road closure There will be road closures in place around Ludgate Hill and St Paul's Churchyard on Wednesday 7 May, from 4.30pm until approx 10pm, for an organised event.  Street works  A full list of all current and future highway activities on the Citys road network can be found on the City Corporations web site:   <http://www.cityoflondon.gov.uk/streetworks>, Details of works on the Transport for London Road Network (the Red Routes) can be found on TfLs web site:   <http://www.tfl.gov.uk/streets> - Travel Information. Contact us Visit   <http://www.cityoflondon.police.uk> for more information on the above stories and information or call 020 7601 2222. This fortnightly email is sent to residents and business contacts throughout the City. If you have information you would like included in the next Community Update, please contact either Orna Joseph (x2285) or Catriona Mackie (x2258). The deadline inclusion in the next Update is 12pm, Thurs 24 April. Catriona Mackie Press and PR Officer City of London Police 37 Wood Street London  EC2P 2NQ Tel: 020 7601 2258 Fax: 020 7601 2236", 
      "date": "2008-04-25 09:39:00", 
      "id": 5526, 
      "responses": 3, 
      "subject": "COMMUNITY E-MAIL 24TH APRIL 2008", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=4273"
    }, 
    {
      "body": "City of London Police Information Update National Threat Level  The current threat level is SEVERE The Security Service offer two e-mail lists to provide subscribers with updates on the national threat level and notifications of new items being published on the Security Service website. Further information can be obtained from  . If you have any information, The Anti-Terrorist hotline can be called on 0800 789321. Further information regarding press releases can be obtained from the police uk website at    International Terrorism The City of London Police are investigating a small number of incidents of suspected hostile reconnaissance.  These incidents are currently being assessed to establish the exact nature of the behavior.   The City of London Police request that you remain vigilant and report any suspicious activity or behavior promptly. Sri Lankan Tamil Tigers (LTTE) have carried out attacks on Colombo in Sri Lanka. The rebels have been fighting the armed forces of the predominantly Sinhalese government for much of the past twenty years.  They want to establish an independent homeland for the minority Tamils in the north and east of the country.  Domestic Terrorism & Extremism SHAC protests have continued in London over the past week, and in particular two protests in the City of London.  Demonstrations were peaceful, low in numbers, and compliant with Police requests.  Information has emerged that a demonstration is being planned for the 27th April 2007, to be titled March Against the Money Men II.  At this time the City of London Police has no information on anticipated numbers for the event, however at this stage it is not expected to be a large event.  A similar event last year passed off without significant incident.   On 26th March, Sinn Fein & the Democratic Unionist Party held an unprecedented face-to-face meeting in which they committed to sharing power in a devolved Northern Ireland Assembly to be reconvened on 8th May.  This is a major step forward in the restoration of peace in Northern Ireland. Dissident republican groups are still committed to disrupting the efforts of Sinn Fein/PIRA and the Unionists to restore peace and shared power in Northern Ireland. All Dissident Groups have the aspiration to remount an attack on the UK mainland.  The threat from Irish Dissident Republicans remains Real and Credible.  Images of England Images of England, is an English Heritage, Lottery Funded project, which aims to create and make accessible via the Internet a point in time photographic record of Englands listed buildings.  A website, featuring photographs taken for the project is available at   Volunteers from camera clubs will take the photographs.  Each has a signed identification card, with their photograph.  They will also carry leaflets for occupiers of listed buildings, which include contact details, if they have any questions about the project.  Local press campaigns will advertise the event.  Occupiers uncomfortable with the idea of photographs of their premises appearing on the Internet may apply to have the publication of the photograph to be postponed until September 2013. The City of London Police advise that the community be aware of the possibility for hostile reconnaissance, and report all suspicious activity promptly.  City of London Police named Lead on Fraud The Attorney General, Lord Goldsmith has announced the creation of a National Fraud Strategic Authority and National Fraud Reporting Centre, extending the remit and providing an increased role for City of London Police. In a response to the Fraud Review consultation, the Government has set out a range of next steps in tackling fraud:  Setting up a new fraud-busting body, a National Fraud Strategic Authority, to co-ordinate and lead fraud prevention work;  Designing a National Fraud Reporting Centre to gather intelligence and measure fraud, and provide a one-stop shop for victims from across the public, private industry, and government departments;  Support extending the remit of the City of London Police to become the national lead police force on fraud (presently lead force for fraud in the South-East);  Create a Programme Board made up of key stakeholders in the fight against fraud to drive forward progress;  Review of how fraud is dealt with in the courts, looking at the potential benefits of a financial courts jurisdiction with specialist judges so that all aspects of fraud proceedings can be dealt with in one place;  Explore a way of encouraging early guilty pleas through a safe legal framework, which protects defendants rights but also improves the experience of victims.  The findings of an independent report commissioned by the Association of Chief Police Officers Economic Crime Portfolio Group, consisting of representatives from both public and private bodies, estimated that fraud costs the UK nearly 14 billion per year.  Fraud advice, call the Fraud Desk 0207 601 2229 The Fraud Desk operates between 0800 and 1800 hours Monday to Friday.  It is a telephone-based service to take initial action concerning fraud within the jurisdiction of the City of London Police.  They will be your first point of contact.  (Outside these hours, in an emergency only, call 020 7601 2222).  They respond to all initial allegations of fraud, liaise with other forces and agencies, assist with 'in-force' requests for advice and offers fraud prevention advice.  Early recognition of a fraud can be vital to reducing the loss and maximising the recovery of assets and prosecution of the offender(s).  If you require advice, want to report a crime, or even discuss a suspicion that a crime is being carried out call the Fraud Desk on 0207 601 2229.  Do not delay - waiting could make the investigation more difficult. City companies who would like a presentation on preventing fraud, given by City of London Police officers using a specially prepared presentation pack, should also phone Fraud Desk to enquire about arrangements. Forthcoming Events 3rd April 2007 - A demonstration is expected at St Pauls Cathedral by Friends of the Earth.  No significant incidents are currently anticipated as a result of this demonstration.  Traffic Bulletin MAJOR WORKS THIS WEEKEND: FRIDAY 30/3/2007 to SUNDAY 1/4/2007 Thus (a telecommunications company) are currently working in the southbound bus lane in FARRINGDON ST undertaking remedial works.  Works are expected to continue until early Sat morning. CHEAPSIDE will be closed eastbound between New Change and Gutter Lane, with a diversion via New Change, Cannon St, Queen Victoria St, and Queen St (8am Sat to 6pm Sun). A crane operation will close the junction of OLD BROAD ST and THREADNEEDLE ST, with northbound / eastbound traffic diverted via King William St, Gracechurch St and Bishopsgate, and southbound / westbound traffic via Wormwood St, Camomile St, Outwich St, Houndsditch, Bishopsgate, Gracechurch St and King William St to Bank. TfL will close UPPER THAMES ST eastbound between Puddle Dock and Arthur St for a crane operation from 8am on Sat to 6pm on Sun.  Traffic will be diverted via Blackfriars Bridge and Southwark St to London Bridge. LB Islington will close CHISWELL STREET between Moor Lane and Finsbury St for a crane operation on Fri (evening), Sat, and Sun. Minor road closures expected this weekend include Beehive Passage, Playhouse Yard, Plumtree Court, St Bride Street, Bread St (Cannon St to Watling St), Lime St and Austin Friars. Filming will take place this Saturday in Lombard St and Princes St around Bank junction, with parking in Lombard St, Nicholas Lane, and George Yard.   MAJOR WORKS NEXT WEEK: MONDAY 2/4/2007 to THURSDAY 5/4/2007 LONDON WALL west of Old Broad St has been reduced to one lane westbound for south footway improvements until April 2007.   LUDGATE HILL - Works continue in Ludgate Hill on temporary lights until mid April. BISHOPSGATE / CAMOMILE ST / WORMWOOD ST : Lane closures expected to last until late May.  Camomile St and Wormwood St reduced to one lane eastbound and Bishopsgate to two lanes southbound.  Heavy traffic disruption is anticipated. QUEEN ST / QUEEN VICTORIA ST  Queen St is closed southbound for kerb works by FM Conway until 31 March. Long-term road closures include Great Winchester St, Southampton Buildings, Foster Lane, Salisbury Court, Old Jewry, Lombard St, Carter Lane, St Bride Street, Whitehorse Yard, Throgmorton St, Charterhouse Square, Wood St south of Gresham St (s/b), Tudor St (w/b) at Kingscote St and Bow Lane. TfL will close VICTORIA EMBANKMENT SLIP ROAD FROM BLACKFRIARS BRIDGEHEAD for anti-skid resurfacing from 8pm each evening, Mon to Thurs night.  LIME ST between Leadenhall St and Fenchurch Ave will be closed for crane operations from 7pm each evening from Mon to Fri. Following the completion of works on Lower Thames St, Clancy for Thames Water have re-established their site at CANNON ST by WALBROOK.  This requires the use of temporary traffic lights and will be in place until June. THAMES WATER VICTORIAN MAINS RENEWAL PROGRAMME Thames Waters contractor, Clancy Docwra, can be contacted direct at  , and continue to work in the following locations: Road Closures: Mansion House St, Tudor St, Rood Lane, Idol Lane, Dorset Rise and St Mary Axe Free movement: Salisbury Court, Great St Helens, Fleet St, Whitefriars St, Temple Ave, Devonshire Sq, Victoria Embankment, Gravel Lane, Middlesex St, Bury St, Cutler St, Gloucester Ct, Fenchurch St, Mincing Lane and Bishopsgate / Camomile St / Wormwood St. Traffic Lights: Cannon St by Walbrook ADVANCE WARNING For the first time in several years, the underside of 125 LONDON WALL at the junction with Wood St will be cleaned and repaired over the four day Easter weekend.  This involves the use of a contra-flow along London Wall from Noble St to Coleman St, and the closure of either Wood St north of London Wall, or Wood St south of London Wall, depending on which side of the London Wall carriageway works are taking place at the time.  Further details will be included in next weeks bulletin. Dates for your diary  major events this year include: 22 April  London Marathon 3 June  Race for Life Road Race 8 July  Tour de France  19 July  Great City Race 10 November Lord Mayors Show A full list of all current and future highway activities on the Citys road network can be found on the City Corporations web site:   Details of works on the Transport for London Road Network (the Red Routes) can be found on TfLs web site:   PLEASE NOTE: The City of London Police is unable to guarantee the timeliness of the community e-mail system due to current technological difficulties with the system.  This may mean that some recipients may not receive this message as quickly as we would wish.  We hope to rectify this problem within the next month.  For active messaging, we will continue to use the Pager Alert system.  This message was originated at 1435 hours on 30.03.07 for your information.", 
      "date": "2007-03-30 13:49:00", 
      "id": 5245, 
      "responses": 2, 
      "subject": "Community Infomation Update 30/03/07", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=3190"
    }, 
    {
      "body": "The following community e-mail was sent to the business and residential community today:- COMMUNITY E MAIL 30TH AUGUST, 2007 PROJECT GRIFFIN TEAM LAUNCH NEW E-LEARNING PACKAGE The success of Project Griffin continues to grow here in the City and nationally, being recognised as good partnership working between the police and the security industry.  On the 3rd September, the City of London Police together with Skills for Security will launch a new e-learning based package which will enable all personnel who have received awareness training under Project Griffin to be remotely refreshed on key topics such as hostile reconnaissance, suspect vehicles and suspect people.  If you want to find out more information about Project Griffin please contact    PEDAL CYCLE THEIVES - HOW DO THEY WORK? Although crime remains low in the City of London, we still suffer from minor crimes such as pedal cycle thefts. Yesterday the City of London Police ran a pro-active operation to arrest pedal cycle thieves. A group of four juveniles, all on pedal cycles appeared at a pedal cycle bay, where police were keeping observations. They very quickly identified the bike they wanted to steal (overheard by plain clothes officers). One of the gang left his bike behind in the rack and the group spent some time in the general area, to check that police were not around. The police eventually managed to arrest the one youth on foot, whilst the other three made off on their bikes.  When we interviewed the suspect it transpired that the group of four had left home that morning on foot, with no bikes. They had travelled from Hoxton to the Angel, Aldgate and Victoria during which time they had managed to steal the four bikes. They ended up back in the City where they were going to replace one of the four bikes for a higher specification one. The one bike that was recovered we managed to return to the owner within two hours of it being stolen as she had registered it on Immobilise.  What can you do to protect your bike:- Register your pedal cycle on   If it is not registered the police cannot trace the owner.  Make sure you purchase the most expensive lock you can afford for your pedal cycle.  Report any suspicious activity immediately to the police. UNSURE ABOUT AN E-MAIL YOU HAVE RECEIVED? It is an unfortunate fact that the internet is widely misused by fraudsters carrying out e-mail scams. Some very common forms of fraud are: false claims that people have won on a national / state lottery (known as fake lottery scams) false claims that people have been left money in a will (known as will frauds) false requests from banks or other financial institutions for customers to verify their security details (known as phishing frauds)  false requests for help from people to assist in moving large sums of money from one jurisdiction to another, in return for a high percentage fee (known as advanced fee, or 419 frauds) false requests to people using internet auction sites to remit monies owed via routes other than the official settlement system run by the genuine internet site.  If you receive any of these kinds of e-mails - BE AWARE! - THEY MAY BE FRAUDS! If you are unsure about any e-mail you receive, the best general advice we can give is DO NOT RESPOND TO IT IN ANY WAY. Delete the e-mail without replying to it, or forwarding it on to anyone else, or downloading it to your own computer, or printing it.  If you are still unsure about what to do with an e-mail youve received, please feel free to contact us. The City of London Police is aware that names of our officers and departments have been used by fraudsters to try to legitimise their scam e-mails. The e-mail may purport to originate from the City of London Police or contain a reference that suggests it has been sent from the Force, for example an address of a police building. More likely, potential victims will be directed to contact an officer or department of the Force to whom they may be required to pay an advance fee to obtain a much larger sum. The fraudsters may claim that the advance fee will be to pay taxes, or obtain a clearance certificate, or some other purpose. These e-mails are false and have not originated from the Force. Fraudsters widely appropriate the identities of companies, government bodies and legal organisations to try to legitimise their scams. If you receive an e-mail or other communication that claims to be from the City of London Police, or any of its officers or departments or if you require advice on this subject, please contact our Fraud Desk:- Fraud Desk 21, New Street, London, EC2M 4TP United Kingdom Telephone: 0044 207 601 6999 E-mail:   FREE HOME FIRE SAFETY CHECK WITH THE LONDON FIRE BRIGADE You have an opportunity to save lives. Could you live with yourself if you didn't? The London Fire Brigade supplies and installs smoke alarms in your borough. These are free of charge for older people. If you or someone you know needs a smoke alarm call the LFB free on: 08000 28 44 28. PLEASE QUOTE: REFERRED BY DOWGATE FIRE STATION LOCK UP DONT LOSE OUT Open doors and windows around the home, during summer months, can be a welcome invitation for an opportunist thief. It is important to ensure all windows and doors are locked before leaving your property, however long you are going to be out.  Any suspicious behavior should be reported to the police immediately on 020 7601 2222. For further advice on safety and security at home please contact your local Wards Policing team. SAFETY THIRST QUIZ (500 First Prize)  Following the launch of the 2007 Safety Thirst scheme, details of which appeared in a recent community e-mail ,the City of London CDRP is next week launching the Safety Thirst quiz on Thursday 23rd August 2007. This will be used to publicise those premises that achieved accreditation to the 2006 scheme and are therefore considered to have achieved higher standards in crime reduction and customer safety. There are 94 premises listed in the quiz book (available from each of the premises) and a question and answer is listed under each name.  First prize is 500 and there are other great prizes such as meals for two, bottles of wine etc. To enter you need to pick up a quiz book from any of the premises listed or from City libraries and residential estate offices and complete 40 questions and answers and a tiebreaker. The book will also be available for download from the City of London web site listed below. Answers can be obtained by visiting the premises and looking around or in a couple of cases by asking the bar staff.  The closing date for entries is 30 November 2007 and winners will be notified in writing by 27 December 2007. Major prizewinners will be invited to the Safety Thirst Awards ceremony to be held in January 2008 at The Guildhall.  This is a fun and informative way of seeing parts of the City that you may not normally visit but please be reassured that we are not encouraging you to drink excessively or drink in every premises listed. Advice on responsible drinking is on the back page of the quiz book and we would encourage you to read this. Enjoy seeing parts of the City you didn't know existed and good luck.  Further information on Safety Thirst can be obtained by visiting   or    or from the Safety Thirst Administrator on 0207 456 9800  DATES FOR YOUR DIARY CUT THE CARBON MARCH- CHRISTIAN AID Saturday 14th July, 2007 - Tuesday 2nd October - Christian Aid are calling for people to walk the walk on climate change, the longest ever protest march in UK history. The march is scheduled to start on Saturday 14th July 2007 from Bangor, Northern Ireland and finish at the London Stock Exchange on Tuesday 2nd October, followed by a celebration service at St Pauls.  THAMES FESTIVAL Friday 14th September, 2007, to Sunday 16th September - The Thames Festival will take place. There will be disruption to the City around the Southwark Bridge area. More specific information will follow in due course. AVIVA WALK LONDONSaturday 8th September In aid of Breakthrough Breast Cancer - Sponsored walk to walk 44 kilometres through London. The following roads in the City will be affect between 0800 and 1800 hours Minories, Aldgate, Leadenhall Street, Cornhill, Poultry, Cheapside, Newgate Street, Rest Stop at paternoster Square, Holborn Viaduct, New Fetter Lane, Fetter Lane, Fleet Street .  5TH ANNUAL DIAN FOSSEY GORILLA CHARITY FUN RUN Saturday 22nd September, 2007 - The Great Gorilla Run. Sponsored charity run with 750 - 1000 participants dressed in full gorilla costumes. Four mile route which will be run on pavements along the following route:- Dunster Court, Mark Lane, Great Tower Street, Byward Street, Tower Hill, down the slip to pass under Tower Bridge via the subway, up stairs east side of Tower Bridge, Queens Walk, London Bridge, Lower Thames Street, Upper Thames Street, Southwark Bridge, Bankside, Blackfriars Bridge, St Pauls Walk, Peters Hill, Queen Victoria Street, Bank, Cornhill, Leadenhalll Street, Billiter Street, Fenchurch Street, Mincing Lane, Dunster Court. THERE WILL BE NO ROAD CLOSURES - for information only. LONDON FREEWHEEL Sunday 23rd September, 2007 - London Freewheel. A mass bike ride for 50,000 plus riders. The following route will be closed:- Victoria Embankment, Upper Thames Street, Lower Thames Street, Byward Street, Tower Hill, Tower Bridge and Tooley Street - a circuit route both east and westbound. LORD MAYORS SHOW  Saturday 10th November, 2007 - Normal road closures can be expected. More information nearer the time.", 
      "date": "2007-08-30 12:13:00", 
      "id": 5355, 
      "responses": 2, 
      "subject": "COMMUNITY E MAIL 30TH AUGUST 2007", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=3613"
    }, 
    {
      "body": "DEPARTMENT OF ENVIRONMENTAL SERVICES Traffic Management, PO Box 270, Guildhall, London, EC2P 2EJ Tel: 020 7606 3030 Ex 2345 E-mail:   Date: 17 April 2008 MAJOR WORKS THIS WEEKEND: FRIDAY 18/4/2008 to SUNDAY 20/4/2008 MOORGATE will be closed between Lothbury and Telegraph St for a crane operation by Select.  Northbound traffic will be diverted via Lothbury, Gresham St, Wood St and London Wall, with buses diverted from Bank via Threadneedle St, Old Broad St to Liverpool St Bus Station or London Wall. Southbound traffic will be diverted via London Wall, Aldersgate St, St Martin's Le Grand, Cheapside, and Poultry to Bank, with buses via South Place, Eldon St, Blomfield St, London Wall, Old Broad St and Threadneedle St (8am Sat to 6pm Sun).   LEADENHALL ST between St Mary Axe and Aldgate may be closed for a large office move. Eastbound traffic will be diverted via St Mary Axe, Camomile St, Outwich St and Houndsditch, and westbound traffic via Fenchurch St, Gracechurch St and King William St (7am to 6pm Sat). WOOD ST will be closed between London Wall and Monkwell Square for a crane operation by Premier Lifting for 125 London Wall (8am Sat to 6pm Sun).  Works will finish at 6pm Sat and restart at 9am Sun, and the Moor Lane gate will be opened to maintain access to Wood St north of Monkwell Square.  This operation is the first of four possible weekends, including 26/27 April, 10/11 May and 17/18 May. LONDON WALL will continue be closed eastbound over the weekend between Moorgate and Throgmorton Avenue for Verizon and Morrisons to install telecommunications apparatus.  Traffic will be diverted via Moorgate, South Place, Eldon St and Blomfield St.  Traffic control and lane closures include Beck & Pollitzer Cranes in Cheapside (stop / go boards), Southern Contract Lifting in Lower Thames St o/s Tower Hill car park (stop / go boards), and FM Conway in Cannon St by Dowgate Hill (traffic lights). Minor road closures expected this weekend include:  West City:  Pemberton Row, Tudor St (east), Bread St (north), Queen St (Queen Victoria St  Cheapside) and Foster Lane. East City:  Gt Winchester Street, Old Jewry, Dowgate Hill and Lombard St (east). MAJOR WORKS NEXT WEEK: MONDAY 21/4/2008 to THURSDAY 24/4/2008 As notified before, major streetworks are currently taking place in the following locations: PRIMROSE ST  FM Conway streetscene works until the end of Sept.  Road closure. LONDON WALL closed eastbound between Moorgate and Throgmorton Avenue for Verizon and Morrisons until 25 April. SOUTHWARK BRIDGE  Full bridge redecoration for several months. Temporary traffic lights. City Lifting will be standing a small mobile crane in ALDERSGATE ST to lift steelwork into position onto the Museum of London site.  The crane will stand on the footway behind a hoarding just north of Shaftsbury Place from Monday 14 April for about a month, working Monday to Friday only. Roadside interview surveys will take place in SNOW HILL on Mon between 7am and 10pm. TfL will be undertaking night-time works on GRACECHURCH ST at the junctions with Leadenhall St and Fenchurch St on Tue and Wed.  Temporary traffic lights will be used and no diversions will be required. Thames Waters Victorian Mains Replacement Programme is currently affecting the following streets: Wilson St, Finsbury Circus, Moorgate, Cursitor St, Breams Buildings, Chancery Lane, Plumtree Court, Shoe Lane, Gt Tower St, Cannon St, Lower Thames St, Eastcheap, Cousin Lane, Cheapside, New Change, Lambeth Hill, Little Trinity Lane, College Hill, Deans Court, St Pauls Churchyard, Queen St, Bow Lane, Aldgate and Bevis Marks. For full details of Thames Waters VMR programme, contact  . Long term road closures include Bush Lane (south), Lime St, Southampton Bldgs, Pemberton Row, Kings Arms Yd, Foster Ln, Lombard St, Carter Ln, Thameside Walk, Swan Ln, Throgmorton St, Lime St, Bow Ln (north), New St, Tudor St (eastern end, W/B), Ironmonger Ln, Walbrook, Wood St south of Goldsmith St, Stoney Lane, Copthall Avenue, Angel Passage, Great St Helens, College St/College Hill, Great St Thomas Apostle, Little Trinity Ln, Ludgate Sq, Pilgrim St, Skinners Ln, Queenhithe, Creechurch Ln, Telegraph St, St Swithins Ln, Deans Ct, Grants Quay Walk, Watling St and All Hallows Ln. ADVANCE WARNING Special Events with Road Closures: 7 May  Major St Pauls Cathedral Event 26 May  BUPA 10k race (BH Monday, City area) 1 June  Race for Life (central City) 7 June  Smithfield Nocturne cycle event  6 July  British 10k race (west City) 17 July  Great City Race (Thursday evening, central City)  8 Nov  Lord Mayors Show. FURTHER DETAILS A full list of all current and future highway activities on the Citys road network can be found on the City Corporations web site:  , Details of works on the Transport for London Road Network (the Red Routes) can be found on TfLs web site:   - Travel Information.", 
      "date": "2008-04-18 07:57:00", 
      "id": 5523, 
      "responses": 2, 
      "subject": "MAJOR ROAD WORKS 18/04/2008 TO 20/04/2008", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=4244"
    }
  ]
}