{
  "summary": [
    {
      "body": "As those of you who have received the latest Barbican Life will have seen, we did use barbicantalk comments on local establishments.  I am particularly keen to continue doing so, so please do comment in this thread on good, or bad, eating experiences in the general Barbican area.  I'm also keen to learn of reaction to new restaurants - for example I looked in on the new Cardamom Rooms restaurant in Charterhouse Square the other day (has replaced the old Gulshan/Bar Bombay) and it looks really nice and they seemed to be making a great effort - but I haven't eaten there yet.  Any comments would be appreciated. Also the Comptoir Gascon in Charterhouse Street has extended its eating options - anybody tried this yet? Any other new restaurants around that barbicantalkers have sampled?", 
      "date": "2005-09-25 08:56:00", 
      "id": 1375, 
      "sentiment": 3, 
      "subject": "Restaurants", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1854"
    }, 
    {
      "body": "I love my original Barbican bathroom, and have stuck with it as long as I possibly can, but it is now in such a bad state I am afraid I have to do a major renovation. Any spare parts will, of course, be offered for re-use. My questions are: Can anyone recommend a designer? Preferably, one who would stay as close as possible to the original design. Any ideas about how much this will cost and how long it will take? I would appeciate any advice or information.", 
      "date": "2006-01-24 00:02:00", 
      "id": 2882, 
      "sentiment": 3, 
      "subject": "Renovating a bathroom", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2041"
    }, 
    {
      "body": "Please help ,I am looking for quality personal trainer..I have heard about someone at holmes place(his name is marek)appareantly very good but not sure if he is doing home visits.[/b]", 
      "date": "2006-06-23 22:21:00", 
      "id": 3126, 
      "sentiment": 3, 
      "subject": "looking for quality personal trainer(home visits)", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2388"
    }, 
    {
      "body": "Can anyone tell me who to use - or who not to use - when replacing my original bathrooms? I've searched the archives but thought someone might have more up-to-date information. And I've seen the ad in Barbican Life for Really Useful Handyman and wondered whether anyone has used them. Grateful for any tips people here can provide. Shaker", 
      "date": "2006-07-09 10:45:00", 
      "id": 3238, 
      "sentiment": 3, 
      "subject": "bathroom renovation - need recommendation", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2440"
    }, 
    {
      "body": "Try Amelia on 07875419367.  I pay her by the hour (8.50) for cleaning and ironing - mostly ironing.  She's young and Chinese and her ironing is pretty good.  She also teaches Chinese in case you'd like to broaden your language skills.  She'll come very early morning if you need someone before you go to work, but I find her totally trustworthy and very pleasant.  She lives just up near Old Street tube so is local.", 
      "date": "2006-07-11 21:16:00", 
      "id": 3240, 
      "sentiment": 3, 
      "subject": "Cleaner/ironer", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2447"
    }
  ]
}