{
  "summary": [
    {
      "body": "It seems that someone in the sorting office doesn't always notice the difference between Ben Jonson House and Bunyan Court. Twice this week I have received letters addressed to my number but at Bunyan Court. This is not the first time it has happened. I wonder whether others at Ben Jonson and at Bunyan have had the same experience. I think there must be about 90 corresponding flat numbers for the two blocks and obviously the confusion could occur either way. If letters are wrongly delivered to flats where the occupants are away for any length of time it could cause great inconvenience. Certainly I was expecting an important letter before Christmas and I now wonder whether it is languishing in a  Bunyan Court letterbox.", 
      "date": "2007-01-17 23:16:00", 
      "id": 3255, 
      "responses": 29, 
      "subject": "Post confusion", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2927"
    }, 
    {
      "body": "Are we voting today here in the Barbican? I haven't heard anything about it or received a ballot paper, but given reports of post going missing and electoral fraud I thought I'd check.", 
      "date": "2006-05-04 13:29:00", 
      "id": 3098, 
      "responses": 22, 
      "subject": "Local elections", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2252"
    }, 
    {
      "body": "Sorry to raise this afresh, but recently at least four mail items that I have been awaiting have not been delivered, including a credit card statement. Is there any other circumstantial evidence that former delivery problems have returned?  (I am in Breton)", 
      "date": "2006-04-20 08:28:00", 
      "id": 3082, 
      "responses": 14, 
      "subject": "Postal deliveries", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2207"
    }, 
    {
      "body": "Have just received yellow pages dumped outside my front door.I really object to this as it gives anyone the knowledge that the flat is unoccupied especially if they remain there for days. This is particularly obvious on corridor blocks.", 
      "date": "2006-07-01 11:51:00", 
      "id": 3182, 
      "responses": 6, 
      "subject": "deliveries", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2418"
    }, 
    {
      "body": "Twice this week we've received misdelivered items in the post.  I've passed them on to the correct addresses (I realise not everyone would bother to do this) - but am now wondering how much of our own post is also sitting in the wrong letterbox.  Has anyone else had this problem?", 
      "date": "2005-08-06 16:21:00", 
      "id": 2964, 
      "responses": 4, 
      "subject": "post going astray (again) in Ben Jonson", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1792"
    }, 
    {
      "body": "I see that according to a tiny notice fixed to the post boxes, there will be no Sunday collections after October 28th  from all Barbican boxes and the others in the vicinity.   So much for \"consultation\".....", 
      "date": "2007-10-12 19:34:00", 
      "id": 3446, 
      "responses": 1, 
      "subject": "postal collections", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3719"
    }
  ]
}