{
  "summary": [
    {
      "body": "Has anyone noticed a strange chemical type smell pervading the air around the Barbican today? It smells quite toxic - I wonder whether it can be coming from the new building going up on London Wall.", 
      "date": "2006-09-09 11:29:00", 
      "id": 4486, 
      "responses": 10, 
      "subject": "Strange smell", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2587"
    }, 
    {
      "body": "We live in a type 21 flat in Speed House which had the garchey removed a couple of years ago [thankfully]. However we still find that charming garchey smell makes it's way through the plumbing into our flat - meaning we have to rememeber to put the plugs in the sinks and fill them with water before we go out. Can anyone tell me if this problem is enedemic to the estate or is there perhaps just a problem with one garchey on the services column that we share?  Or to put it another way, is this something that might be solved by helping a neighbour get their garchey cleaned, or is it just something we are going to have to live with?", 
      "date": "2008-02-09 13:32:00", 
      "id": 3502, 
      "responses": 9, 
      "subject": "Garchey smells", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4001"
    }, 
    {
      "body": "Due to necessity (and I'm sure I'm not alone) I have been sleeping with my window/balcony door open, because the combination of the heating and the hot weather renders my sleeping erratic to say the least! I don't want to be a sanctimonious ex-smoker, but the smell of smoke wafting in from someone chuffing on another balcony at 730am is pretty disgusting. I appreciate there's little one can do, but just wanted to have a moan and wondered whether anyone else experiences this and has any thoughts.", 
      "date": "2007-05-05 06:53:00", 
      "id": 4328, 
      "responses": 7, 
      "subject": "Alarm Call", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3306"
    }, 
    {
      "body": "FAO: Breton House residents From 10pm some evenings, I get a strong and constant waft of tobacco smoke coming from behind my kitchen sink area. Does anyone else suffer from this sort of invasion? My investigations have led me to believe that the utility-pipes shaft running up/down the centre of Breton House leads right down to some kind of staff-/smoking-room in Exhibition Hall 1. I've blocked up all visible holes round pipes (with expanding foam) best I can, but am still plagued (not pleasant to be woken in the night by a strong smell of ciggies). If there are any fellow sufferers, I'd appreciate any advice. Thanks Nigel", 
      "date": "2006-11-09 16:34:00", 
      "id": 3206, 
      "responses": 3, 
      "subject": "Tobacco smoke inside Breton House", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2746"
    }, 
    {
      "body": "Can anyone explain please the mushrooming of deodorant blocks along the corridors in BJH and by the lifts? Ive never noticed a problem, so why are we getting these little white pong-pods? How does it help to have us breathing in cheap scented chemicals? As an asthmatic, Id like to know. Answers on a kipper, please . . .", 
      "date": "2007-11-23 10:28:00", 
      "id": 3491, 
      "responses": 3, 
      "subject": "Ben Jonson stinks - it's official!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3812"
    }, 
    {
      "body": "Hi, I've recently moved into Andrewes House, and there's often a nasty smell around the kitchen - almost like someone's old Sunday Roast. I've thoroughly drenched my kitchen sink in bleach, so I don't think it can be coming from there. There is a large metal contraption above the electric hobs - like an air vent - and that is encrusted in slimey dust. It seems an original part, and is solid steel - I cannot find a way of taking it apart. Can anyone else share their experience of this kitchen air vent - how to go around cleaning it - or have you had it ripped out or boarded up? Thanks Paul.", 
      "date": "2006-09-15 11:48:00", 
      "id": 4489, 
      "responses": 1, 
      "subject": "Smells from Air Vent above Kitchen hobs", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2603"
    }
  ]
}