{
  "summary": [
    {
      "body": "I've just noticed in the \"exclusion of the public\" section of the Barbican Centre Committee public agenda for Wednesday 23rd Nov. 2005 that item 12 is: \"Conversion to Residential Use of Levels 7, 8 & 9 Frobisher Crescent Joint Evaluation Report (circulated) for the Conversion to Residential Use of levels 7, 8 & 9 Frobisher Crescent.\" Oh ... also discussed under \"summary of matters considered with the public excluded\" was point 9 (a) Barbican Area - (Highwalk) Yellow Lines ! Do Darth T's minions really believe this stuff is so commercially sensitive as to warrant the attempt at secrecy ? ... or is there something they're trying to avoid the residents finding out ... ? ! Still if Frobisher Crescent goes ahead, we may finally find out if there really is a stash of perfectly preserved kitchens and bathrooms ready-and-waiting to be installed !!", 
      "date": "2005-11-21 19:43:00", 
      "id": 4546, 
      "responses": 22, 
      "subject": "Frobisher Crescent  to be converted to residential use ?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1949"
    }, 
    {
      "body": "Could the Residents' Meeting be our chance to put our views on St Alphage to the vote? On our RSVP card we have requested that there should be a vote on the current proposals. Should we contact the Chair prior to the meeting to get this officially on the agenda?  Perhaps it would be a good idea that residents attending the meeting refrain from participating in the electronic voting on the issues of the City's choice unless we can vote on a motion, along the lines of \"We reject the current proposals for St Alphage House\".  Of course if we propose such a vote we must win it convincingly. Perhaps we should put up information on block notice boards to make sure there is a good attendance - and give out information to residents as they arrive for the meeting. Is this something that the BA sub committee on St Alphage could co-ordinate? We would hope that asking for a vote is something that our elected representatives - the CCs of the relevant wards and the House Group chairs and committee members would support. Incidentally - isn't it time we heard about the BA St Alphage sub committee's strategy?", 
      "date": "2008-05-20 17:11:00", 
      "id": 3601, 
      "responses": 10, 
      "subject": "2nd June Residents' Meeting - Chance to vote on St Alphage?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4360"
    }, 
    {
      "body": "Does anyone have any details please?  Is there a talk and presentation - in which case there is no point going except from the start at 6 p.m., or is it an open exhibition with people around to answer questions?", 
      "date": "2007-09-20 11:33:00", 
      "id": 3431, 
      "responses": 3, 
      "subject": "Tonight's meeting (20/09) about Milton Court", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3668"
    }, 
    {
      "body": "One page flier advertising a one evening consultation meeting posted through Speed House doors today.  Private company to build the flats and sell them but not clear if the freehold will remain with corporation.", 
      "date": "2008-01-24 00:15:00", 
      "id": 3613, 
      "responses": 3, 
      "subject": "Frobisher crescent to be turned in to flats", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3947"
    }, 
    {
      "body": "Armagnac-tasting and financial planning talk 8pm 10th April This event hgas been postponed as it clashes with the BA AGM. A fresh date will be notified in the next Barbican Life magazine. Please email me at   if you are intersted provisionaly.", 
      "date": "2008-04-08 06:31:00", 
      "id": 3853, 
      "responses": 1, 
      "subject": "Armagnac-tasting 8pm 10th April POSTPONED", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4211"
    }, 
    {
      "body": "The AGM is this Thursday in St Giles Church at 19.00.  Please  come along and tell us what you really think. Apart from a Q&A session 2 new pieces of formal business are the new constitution and a new policy on opposing late license applications. So come and have a pop at us in person (though I would far prefer it if you went softly on me!   ) Stephen Horrocks", 
      "date": "2004-05-04 10:18:00", 
      "id": 4752, 
      "responses": 1, 
      "subject": "BA AGM - Thursday 6th May - come and tell us what you think", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1098"
    }
  ]
}