{
  "summary": [
    {
      "body": "I'd like to open the campaign for the election in the Ward of Cripplegate, as I have already lodged my nomination papers. This is to fill the vacancy created by the resignation of Sir Gavyn Arthur on becoming a circuit judge.  The wardmote takes place on Tuesday, 3 June, and 4 June is voting day at St Giles's, Cripplegate.  I shall be getting my election mailing out next week. My new website   is now up and running.  I would be glad to hear from any Cripplegate elector and am happy to deal with questions about the policies I would pursue if elected as alderman. You can email me on  .", 
      "date": "2008-05-14 22:15:00", 
      "id": 3687, 
      "responses": 104, 
      "subject": "Cripplegate Aldermanic Election", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4342"
    }, 
    {
      "body": "Next week we are supposed to be voting in a by-election in the ward that covers the west and north sides of the Barbican and Golden Lane.(Sorry if you live in Seddon, Mountjoy, Defoe, etc - you're not affected) Has anyone heard from any candidates yet?", 
      "date": "2006-09-04 08:42:00", 
      "id": 4483, 
      "responses": 29, 
      "subject": "By-election in Cripplegate Ward?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2575"
    }, 
    {
      "body": "I've had a letter from Mark Field MP, seeking the opinions of his constituents about ID cards. (Interesting, as I think he voted in favour of the introduction of ID cards - perhaps he's changing his mind?) I'd be interested to know what the general feeling is in the Barbican about ID cards, and the NIR database. Have you spent any time reading up about the various issues? Do you all know what the introduction of the database will mean? And how much money it will cost you? Have you all got one of these letters from Mark Field, and how many of you are going to reply? Is the Barbican Pro, Anti, or Couldn't Care Less?", 
      "date": "2006-04-10 14:10:00", 
      "id": 3096, 
      "responses": 20, 
      "subject": "ID Cards", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2192"
    }, 
    {
      "body": "In the context of Ward Mote ( which still mystifies me incidentally ) someone has implied that some people might regard the City of London as the last rotten borough in Britain. Why is that ? It rarely if ever crops up in the Private Eye section devoted to them. No doubt some people may have a good time occasionally at someone else's expense but I am willing to believe they work hard on our behalf for the privilege and it is the same throughout the country. While it has not kept me awake all night, I am concerned that I am missing something which troubles others sufficiently to deserve the description \" rotten \".", 
      "date": "2008-03-15 10:33:00", 
      "id": 3862, 
      "responses": 18, 
      "subject": "Rotten Borough", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4127"
    }, 
    {
      "body": "Well over a third of the City's Adult Social Care budget is spent not on City residents, but on care for Rough Sleepers, e.g. funding placements for them in residential and nursing homes. In November 2007 our Adult Social Care budget was funding 63 ex Rough Sleepers in residential and nursing care homes. Costs per person can be over 800 a week [see notes, below].  However deserving the cause of Rough Sleepers, isnt it time to call on the Corporation and Committee Members to challenge central government to take back responsibility for funding their care centrally, rather than at the expense of funds intended for needy residents? Now, more than ever, residents need those funds, now we are suffering the consequences of the enormous overspend [details below] in the Department of Community and Childrens Services (DCCS) resulting from appalling mismanagement in Adult Social Care (ASC) dating back to 2006. CoL is keen to shift blame for consequent  budgetary constraints and cutbacks on to an inadequate local government grant settlement, plus imposed efficiency savings, and increased levels of user need. Of changes so far announced, one of the most alarming is CoLs hugely detrimental proposal to outsource the newly 'modernised' in-house Home Care Service (HCS) for paltry savings of a mere 8% - 9% of the total amount it spends on non-resident Rough Sleepers. Residents of Tudor Rose Court, amongst others, can testify to the unhappy consequences of outsourcing in the care sector. Meals-on-wheels have just been outsourced to Tower Hamlets. Many other services are under review.  Its definitely not the fault of Rough Sleepers, but if CoL can, as decided, continue to fund non-resident Rough Sleepers to the tune of 1.5m - 1.7m (more than a third of the ASC budget), surely it can afford to respect its own vulnerable residents by looking elsewhere for savings of less than a tenth of that amount? --------------------------------------   In November 2007 total expenditure on ex rough sleepers was projected to cost 1.77m in 2007/08 with residential care placements making up the largest amount of expenditure (1.49m) ... Currently there are 63 ex rough sleepers in residential and nursing care homes\" [Report to CCSC, 8 February 2008, paragraphs 20 - 21]    Attempts are only now being made to cap future expenditure on Rough Sleepers at 1.5m per annum beyond 2007/08   The projected overspend this financial year [2007/08] is some 1.4m, against a budget of only 4.3m [Adult Social Care], plus overspends of some 1.863m to follow in each of the following three years.  [Financial Position Report by Director DCCS: non-public report to CCS Committee, 23 Nov 2007,  later made public after Policy and Resources Committee, 13 Dec 2007     REP18593   Public was excluded from CCSCs 23 November debate because the report contained several wide-ranging issues that could impact upon service users [Minutes of the CCSC meeting ]", 
      "date": "2008-04-07 18:01:00", 
      "id": 3865, 
      "responses": 7, 
      "subject": "Overspend in Corporation", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4208"
    }, 
    {
      "body": "More on our MP (from TheyWorkForYou) Heres his record on the key votes on the Human Fertilisation and Embryology Bill on 20 May. The conclusion to be drawn is that he is a social conservative, as the newspapers have it. He voted to reduce the abortion limit to 20 and 22 weeks, and voted against lesbian couples right to families.  20 May 2008Human Fertilisation and Embryology Bill  Change abortion limit from 24 weeks to 22 weeks  rejected. Field voted with the ayes.  20 May 2008Human Fertilisation and Embryology Bill  Prospects for life of handicapped child must be given before abortion  rejected. Field voted with the ayes 20 May 2008Human Fertilisation and Embryology Bill  Change abortion limit from 24 weeks to 20 weeks  rejected. Field voted with the ayes 20 May 2008Human Fertilisation and Embryology Bill  Fertility treatment requires male role model  rejected. Field voted with the ayes  20 May 2008Human Fertilisation and Embryology Bill  Fertility treatment requires father and mother  rejected. Field voted with the ayes He was absent on both the votes for 16 weeks and 12 weeks.", 
      "date": "2008-05-23 12:49:00", 
      "id": 3603, 
      "responses": 4, 
      "subject": "More on our MP", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4368"
    }, 
    {
      "body": "On Thursday 1st May, we have the well publicised London Mayoral Elections between Ken Livingston and Boris Johnston, which I think most people will have formed an opinion as to whom to vote for. Also that day, we have elections for the London Assembly. For this, I am much less clear on who to vote for, and would appreciate any input from people more clued up on local politics and the London Assembly. The London Assembly vote is split between a constituency vote in the City and East London, where you vote for a specific person, and a London-wide proportional representation vote, where you vote for a party. Our current London Assembly constituency member is  , who has a   . Can anyone comment on John Biggs? Is he worth voting for - his election flier that was junk mailed across the estate seemed reasonably impressive - at least he is aware of some of the planning issues around here. Or is there a better candidate, or more precisely, a better candidate with a chance of unseating him - I would think a 14,000 majority makes it a safe seat for him.  The   resulted in 5 Liberals, 2 Labour, 2 Greens and 2 UKIPs. Can anyone comment on the effectiveness of any of these parties in the London Assembly, for example have the 2 Green Party members been able to make a difference, have the Liberals been able to make their voices heard? Many thanks, Paul.", 
      "date": "2008-04-26 11:19:00", 
      "id": 3888, 
      "responses": 3, 
      "subject": "London Assembly Elections - Thurs 1st May at St Giles Church", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4275"
    }, 
    {
      "body": "Someone put up a petition in our block on which we could register our opposition to the annual council tax levy to fund the 2012 Olympics. The petition nows seems to have disappeared, but I found a similar one online:  If you feel that it is unfair for Londoners to pick up the Olympics tab (as opposed to spreading the burden across the entire UK population), then you may wish to sign this petition.", 
      "date": "2006-05-07 07:31:00", 
      "id": 3083, 
      "responses": 1, 
      "subject": "Olympics levy", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2267"
    }, 
    {
      "body": "sorry if this sounds like a stupid question,what are ward members? and what do they do? ", 
      "date": "2006-05-23 13:38:00", 
      "id": 4242, 
      "responses": 1, 
      "subject": "ward members", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2312"
    }, 
    {
      "body": "Mail hysterics - or plausible downside for those living here where energy efficiency doesn't come to mind as a prime virtue of the Barbican eco-system?  \"Homeowners who refuse to alter their houses and flats to conserve more heat and power face higher council tax bills, ministers revealed. They plan to encourage town halls to jack up bills for the least energy efficient homes in the name of tackling climate change. A link between council taxes and energy efficiency is on the way after the controversial system of home sellers' information packs comes into force next summer, officials confirmed. Councils will be able to check the green credentials of houses and flats from details contained in 'energy performance certificates' which will be a compulsory element of every information pack.  [etc etc ad nause, ad inf.]", 
      "date": "2006-09-23 22:15:00", 
      "id": 4503, 
      "responses": 1, 
      "subject": "Low energy efficiency = higher council tax bills?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2623"
    }
  ]
}