{
  "summary": [
    {
      "body": "In the context of Ward Mote ( which still mystifies me incidentally ) someone has implied that some people might regard the City of London as the last rotten borough in Britain. Why is that ? It rarely if ever crops up in the Private Eye section devoted to them. No doubt some people may have a good time occasionally at someone else's expense but I am willing to believe they work hard on our behalf for the privilege and it is the same throughout the country. While it has not kept me awake all night, I am concerned that I am missing something which troubles others sufficiently to deserve the description \" rotten \".", 
      "date": "2008-03-15 10:33:00", 
      "id": 3862, 
      "responses": 18, 
      "subject": "Rotten Borough", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4127"
    }, 
    {
      "body": "Well over a third of the City's Adult Social Care budget is spent not on City residents, but on care for Rough Sleepers, e.g. funding placements for them in residential and nursing homes. In November 2007 our Adult Social Care budget was funding 63 ex Rough Sleepers in residential and nursing care homes. Costs per person can be over 800 a week [see notes, below].  However deserving the cause of Rough Sleepers, isnt it time to call on the Corporation and Committee Members to challenge central government to take back responsibility for funding their care centrally, rather than at the expense of funds intended for needy residents? Now, more than ever, residents need those funds, now we are suffering the consequences of the enormous overspend [details below] in the Department of Community and Childrens Services (DCCS) resulting from appalling mismanagement in Adult Social Care (ASC) dating back to 2006. CoL is keen to shift blame for consequent  budgetary constraints and cutbacks on to an inadequate local government grant settlement, plus imposed efficiency savings, and increased levels of user need. Of changes so far announced, one of the most alarming is CoLs hugely detrimental proposal to outsource the newly 'modernised' in-house Home Care Service (HCS) for paltry savings of a mere 8% - 9% of the total amount it spends on non-resident Rough Sleepers. Residents of Tudor Rose Court, amongst others, can testify to the unhappy consequences of outsourcing in the care sector. Meals-on-wheels have just been outsourced to Tower Hamlets. Many other services are under review.  Its definitely not the fault of Rough Sleepers, but if CoL can, as decided, continue to fund non-resident Rough Sleepers to the tune of 1.5m - 1.7m (more than a third of the ASC budget), surely it can afford to respect its own vulnerable residents by looking elsewhere for savings of less than a tenth of that amount? --------------------------------------   In November 2007 total expenditure on ex rough sleepers was projected to cost 1.77m in 2007/08 with residential care placements making up the largest amount of expenditure (1.49m) ... Currently there are 63 ex rough sleepers in residential and nursing care homes\" [Report to CCSC, 8 February 2008, paragraphs 20 - 21]    Attempts are only now being made to cap future expenditure on Rough Sleepers at 1.5m per annum beyond 2007/08   The projected overspend this financial year [2007/08] is some 1.4m, against a budget of only 4.3m [Adult Social Care], plus overspends of some 1.863m to follow in each of the following three years.  [Financial Position Report by Director DCCS: non-public report to CCS Committee, 23 Nov 2007,  later made public after Policy and Resources Committee, 13 Dec 2007     REP18593   Public was excluded from CCSCs 23 November debate because the report contained several wide-ranging issues that could impact upon service users [Minutes of the CCSC meeting ]", 
      "date": "2008-04-07 18:01:00", 
      "id": 3865, 
      "responses": 7, 
      "subject": "Overspend in Corporation", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4208"
    }, 
    {
      "body": "Mail hysterics - or plausible downside for those living here where energy efficiency doesn't come to mind as a prime virtue of the Barbican eco-system?  \"Homeowners who refuse to alter their houses and flats to conserve more heat and power face higher council tax bills, ministers revealed. They plan to encourage town halls to jack up bills for the least energy efficient homes in the name of tackling climate change. A link between council taxes and energy efficiency is on the way after the controversial system of home sellers' information packs comes into force next summer, officials confirmed. Councils will be able to check the green credentials of houses and flats from details contained in 'energy performance certificates' which will be a compulsory element of every information pack.  [etc etc ad nause, ad inf.]", 
      "date": "2006-09-23 22:15:00", 
      "id": 4503, 
      "responses": 1, 
      "subject": "Low energy efficiency = higher council tax bills?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2623"
    }
  ]
}