{
  "summary": [
    {
      "body": "Hello, i write a column for a newspaper and am planning to write it this week on what i suspect Patricia hewitt might say on Question Time this evening. Only problem is that i don't have a television and as i need to write it straight after, can't really trapse around london visiting friends who have a TV. Slightly random, but i was wondering if anyone was planning on watching Question Time tonight and if they'd mind having a guest watch it with them (me). thanks so much.", 
      "date": "2007-05-03 12:20:00", 
      "id": 4327, 
      "responses": 13, 
      "subject": "Does anyone have a television?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3299"
    }, 
    {
      "body": "Help! Have just sat down to write my column where i'm referring throughout to Orwell's '1984', only to find i actually don't have a copy of the book! Does anyone happen to have it that i could borrow tonight??", 
      "date": "2006-12-07 21:22:00", 
      "id": 3236, 
      "responses": 5, 
      "subject": "HELP!!!! Urgent request", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2815"
    }, 
    {
      "body": "It's a long shot, but in the quest for caffeine, here goes... Does anyone, by any change this late at night, happen to have a spare paper coffee filter for a perculator - size 1/4 - that i could have? Just relalised to my mortification that i've run out, and am faced with a night of work without any coffee. Have just run to Tescos and they don't sell them - only some funny pod-things for a machine i don't have. Thanks!", 
      "date": "2007-06-12 22:15:00", 
      "id": 3344, 
      "responses": 2, 
      "subject": "Coffee filters", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3417"
    }, 
    {
      "body": "Hello,  I know this is very short notice, but is there any friendly soul out there who could lend me a UK road atlas for a week (until next Sunday)?  We are leaving this evening (around 6pm) to South Yorkshire, and throughout the week will have to drive to places that will be pretty difficult to find. A friend who was going to lend us his road atlas has just phoned to tell us that actually he cannot find it. Ahhhh!  I know it's very short notice - and judging from people's bad experiences (see thread on \"conman operating...\" ) I doubt that anyone would want to part with a road map....but IF you can help, PLEASE send a PM, or phone me on 07910587878 (Dani).  Thanks so much!!  Dani", 
      "date": "2007-03-04 12:01:00", 
      "id": 3266, 
      "responses": 1, 
      "subject": "HELP uk road atlas", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3101"
    }
  ]
}