{
  "summary": [
    {
      "body": "Yesterday, I have learned that the we can have the plants of the flowerbeds for free , only ask the gardeners.  I would like to exhort the BEO  a) to create a system to recycle at least the geraniums that overwinter in the Barbican without no problems and to offer the plants that otherwise will be thrown away to the residents in order to make the Barbican a greener place. b) use the a. m. geraniums to embellish Frobisher Crescent that looks complete concrete to me. Love Strawby", 
      "date": "2007-10-15 13:56:00", 
      "id": 3449, 
      "responses": 5, 
      "subject": "Plants of flower beds", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3727"
    }, 
    {
      "body": "Hi all, the Barbican Horticultural Society's summer competition is almost upon us again. As part of this event some of the balconies and window boxes are open to other members from the society. I would like to extend this for my balcony to anyone from this forum who wishes to have a nose around and get some planting ideas. I have a couple of trees and quite a lot of planting that may be of some interest, including a six foot Echium. Another Echium is on its way up and promising to be even bigger. So if you are around on the morning of 2nd July then please do pop in. David 20 Thomas More House", 
      "date": "2006-06-21 16:28:00", 
      "id": 3129, 
      "responses": 4, 
      "subject": "Barbican in Bloom", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2381"
    }, 
    {
      "body": "Whilst planting up some planters this week I discovered a white bug in the earth that I have identified as the dreaded Vine Weevil larvea. This bug to those who do not know, will eat the roots of your plants and by the time you normally discover it, your plants are dead. Planters are particularly at risk, so I have ordered some biological pest control, trouble is as always I have enough for 12 square metres arriving and only have 1 if that to do.  If anyone would like some (as it has to all be used once the packet's opened) please let me know. PS if you want to order your own then I found this company from the RHS: ", 
      "date": "2005-05-05 12:44:00", 
      "id": 2930, 
      "responses": 1, 
      "subject": "Bug Invasion", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1607"
    }
  ]
}