{
  "summary": [
    {
      "body": "Hi  Does anyone know how to whiten these original Barbican bathtubs.  I am poised to sell/rent my flat and would like a whiter bathtub to be part of the picture. I once had a cleaner from Abracadabra or somewhere come in and they told me something about soaking the tub overnight with bio or non-bio washing powder - dissolved in cold water.  Does anyone know this or any other tricks? Thanks very much, Jeannie", 
      "date": "2007-12-01 14:33:00", 
      "id": 2625, 
      "sentiment": 1, 
      "subject": "A whiter bathtub", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3831"
    }, 
    {
      "body": "Anyone know where I can get plastic sheeting large enough to wrap a king sized mattress in?", 
      "date": "2005-04-14 16:22:00", 
      "id": 2912, 
      "sentiment": 1, 
      "subject": "plastic sheeting", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1563"
    }, 
    {
      "body": "On the standard electric CredaPlan barbican oven, could some-one help me translate the numbers on the dial so I can cook my ovenready meals safely? The Oven dial runs from 0 to 5 ..... Now are those the same as 'gasmarks' referred to on ready meals?  - clearly not Centigrade or Fahrenheit. Any enlightenment would be appreciated, many thanks,", 
      "date": "2005-04-17 21:49:00", 
      "id": 2913, 
      "sentiment": 1, 
      "subject": "Settings on CredaPlan Oven", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1569"
    }, 
    {
      "body": "Has anybody used Abracadabra or Helping Hands for cleaning (or anything else)? If so, a report would be most welcome. Thanks", 
      "date": "2005-04-27 17:46:00", 
      "id": 2935, 
      "sentiment": 1, 
      "subject": "cleaner report", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1596"
    }, 
    {
      "body": "Has anybody tried to wall mount a plasma screen and channel out for the wiring, and if so how successful was it?", 
      "date": "2005-05-13 15:04:00", 
      "id": 2937, 
      "sentiment": 1, 
      "subject": "Plasma Screens", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1626"
    }
  ]
}