{
  "summary": [
    {
      "body": "I'm interested in finding out more about the Golden Lane guest flats (quality, pricing, etc.).  Any information would be much appreciated.  Regretfully my search showed only the last post of recent weeks.  Many thanks!", 
      "date": "2007-09-15 12:43:00", 
      "id": 1425, 
      "sentiment": 2, 
      "subject": "Golden Lane Guest Flats", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3658"
    }, 
    {
      "body": "We have the original bedroom wardrobe doors; on one, a hinge has pulled away from the door frame (they are soldered, not screwed). Can anyone advise on how to repair this (I am not a metal basher) or alternatively suggest who could do it for me?? many thanks - Roy S", 
      "date": "2006-02-09 15:58:00", 
      "id": 2753, 
      "sentiment": 2, 
      "subject": "Repairing wardrobe doors", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2064"
    }, 
    {
      "body": "Hi there. Have been looking to move from one Barbican flat to another. The one I have seen has an original oven. Anyone here used one? They look good but small. Maybe fab for cakes but not so good for the Christmas turkey. Any thoughts?", 
      "date": "2005-04-13 22:24:00", 
      "id": 2908, 
      "sentiment": 2, 
      "subject": "Chefs ahoy", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1562"
    }, 
    {
      "body": "Hello I've got a 9 month old baby here in the Barbican, and I've been trying to get information from the Corporation about Childcare places (and, later on, school places) in the City. The Corporation themselves don't seem very sure what they offer. I know that there are several private nurseries (that I can't afford). Does anyone know what's the deal with 'local authority' provision of nursery care? And, if Sir John Cass is the only primary school in the City, is that where my son has to go? Does he automatically get in? (even though we're not C of E). Thanks for any help! A Confused Parent...", 
      "date": "2005-04-19 15:47:00", 
      "id": 2916, 
      "sentiment": 2, 
      "subject": "City childcare & schooling", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1577"
    }, 
    {
      "body": "Hi, can anyone give me advice about replacing an original Creda hotplate?  One of my hotplates stopped working, and a resident who was replacing his kitchen kindly gave me one of his. I went to fit it today, but can't seem to take the old hotplate out just by prising it. It seems to be fixed underneath. I would have a go at unscrewing the hotplate from below, but there's what looks worryingly like a sheet of asbestos there, and I'm not sure it's safe to slide it out. Is there anyone out there who's done this before? Any advice would be much appreciated.", 
      "date": "2005-04-24 14:37:00", 
      "id": 2924, 
      "sentiment": 2, 
      "subject": "Creda hotplates and asbestos", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1585"
    }
  ]
}