{
  "summary": [
    {
      "body": "Has any body else stop receiving TV Saturday morning from 0130hr following a power failure. I have called the Bunyan court CPA who was going to look into it, so I then called the resident Engineer, only to have the phone answered by Defoe house CPA who said his TV works alright and he would connect me to the Bunyan CPA who would deal with my problem. The Bunyan CPA did call back with a telephone no. of the TV / satellite people under contract to the Barbican Estate, I call the number and listened to an answer machine message requesting our contract number with them (to which I don't know, only the Barbican office knowns, and they are not back for 3 days, so I could not leave any information). I have decided that Life dose not revolve around TV, so thanks to the BEO and there contract with an answer service I am now cancelling my subscription to rip off sky and going to buy a free view box which will work when the BEO get the TV people to switch back on the trip switch (shame the resident engineers dont know where this switch is!). Sorry about the rant, but missing all my favourite TV programmes this weekend. AHHHHHHHHHHHHHHHHHHHHH -0", 
      "date": "2008-05-05 19:40:00", 
      "id": 3566, 
      "sentiment": 4, 
      "subject": "TV Bunyan Court - May Day Bank Holiday weekend without TV", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4304"
    }, 
    {
      "body": "Has anybody tried to buy anything from Ikea and have it delivered by them to the Barbican? I have been informed by Customer SErvices that I cannot go to Edmonton to buy my stuff and then have it delivered to EC2, but have to go to CROYDON in order to do this! What tosh! And I cannot order over the phone either! Any suggestions? Like go to John Lewis?", 
      "date": "2007-03-10 18:39:00", 
      "id": 4322, 
      "sentiment": 4, 
      "subject": "Ikea deliveries", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3130"
    }, 
    {
      "body": "It's been 10 days, 4 long phone calls, and BT still haven't allocated the right telephone number for our new home at Mount Joy. They have no record of the two order numbers being placed. Our calls are being routed through to call centres in India where they have been giving us wrong numbers and not placing the orders. Does anyone know of a currently good substitute for BT in the Barbican or is it a question of from the frying pan to the fire? Thanks everyone", 
      "date": "2007-04-14 12:20:00", 
      "id": 4382, 
      "sentiment": 4, 
      "subject": "B.T. Substitute?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3231"
    }, 
    {
      "body": "A planning application for change of colour for external redecorations has arrived today in Ben Jonson.  I opened it thinking....please god...anything but red. And of course it's red.  Does anyone know why it has to change, and if so who chooses the colour and why? I have a huge personal dislike of red ... some primeval fear of the colour possibly ... this is actually a huge deal to me although I appreciate it probably doesn't bother most people.   Why mess with something that looks so good as it is? And surely it's harder to change the colour than simply to redecorate with the same shade.  Or maybe the intention is to make sure that the job is done well, so the colour change is a good way of checking it's all been done? I may have to move    ", 
      "date": "2006-04-21 18:59:00", 
      "id": 4393, 
      "sentiment": 4, 
      "subject": "Paintwork - change of colour for BJH", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2213"
    }, 
    {
      "body": "Ive been wondering where on earth my service charge bill had got to, and now its here the *** thing has given me a conniption.  On top of the substantially increased quarterly service charge for 06-07, Im being charged 191.07 for Services 2005/06 Year End Balance From 01/04/2005 to 31/03/2006. But I only purchased my flat on 3 February 06, so surely I should be liable for less than a sixth of that 191. Of course I will be going to the estate office about this first thing Monday morning, but the bills have gone out so late this time  arrived Saturday 16/9, due date is 29/9  that Ill be in arrears and presumably getting penalised for it if I dont cough up almost immediately. While 191 might be peanuts to some people on the estate, its a serious problem for me. So in case I get the runaround, is anyone able to tell me ahead of time how theyve dealt with this situation? I assume it must happen to everyone who buys a flat here. Are the Corporation just trying it on, or have I agreed to be liable for this by buying my flat? Am I going to have to go back to my solicitor and ask her to extract the money from the dodgy letting company who owned this flat previously? And is that even possible six months after the sale is supposed to have been wrapped up? I appreciate any light anyone can shed on the matter. Its the fact that the bill is both late and timed to arrive on a weekend that makes me particularly angry. Thats two totally unnecessary days of worry.", 
      "date": "2006-09-16 23:21:00", 
      "id": 4491, 
      "sentiment": 4, 
      "subject": "Incorrect service charge", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2607"
    }
  ]
}