{
  "summary": [
    {
      "body": "Wouldn't it be nice if we could have a civilised wine bar there again with tables outside ... My partner and I used to find it quite pleasant in summers a few years ago sitting outside and chatting. And I at weekends there's nowhere I find it wothrwhile to gofor a quiet drink. Harry", 
      "date": "2006-05-27 16:30:00", 
      "id": 4401, 
      "responses": 19, 
      "subject": "The ex-Wine Bar at the Bottom of Shakespeare", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2323"
    }, 
    {
      "body": "Anyone know what happene to the City Boot over Tuesday night?  Smashed out window, the smell of smoke and police on Wednesday morning leas to one conclusion. Any details anyone?", 
      "date": "2006-07-20 06:51:00", 
      "id": 3137, 
      "responses": 2, 
      "subject": "City Boot", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2464"
    }, 
    {
      "body": "Went into the new Parker McMillan place that's opened in place of Boudoir on Chiswell St   Seemed a very low key place, very pleasant female Jazz vocalist was on, seems unlikely to be the short of place that will be turfing out loads of rowdy late night revellers Surprised that its appearance hasn't raised the usual paranoid threads", 
      "date": "2006-07-13 12:26:00", 
      "id": 3241, 
      "responses": 1, 
      "subject": "Boudoir Returns???", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2451"
    }, 
    {
      "body": "Does everyone already know this?  Planning consent has gone in for a change of use for the Butler's Wine Bar site in Defoe Place at the bottom of Shakespeare Tower, to be turned in to Livery Company accommodation. The Worshipful Company of Paviors: currently without a livery hall (motto: God Can Raise to Abraham Children of Stone; mission: to further the craft of paving). At least its not those Haberdashers, they can be pretty rowdy.  The reference is 07/00709/FULL  on the City's planning portal: there doesn't seem to be any associated documents at present to shine more light on the case. This is the same site that the City wanted temporary permission for offices for three years, but what became of that?", 
      "date": "2007-07-31 10:21:00", 
      "id": 4112, 
      "responses": 1, 
      "subject": "Shakespeare Tower Wine Bar Plans", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3546"
    }, 
    {
      "body": "Shakespeare Tower residents seem to have been leafleted about the planning application for change of use of the old Pintxos wine bar to office space. It took me a while to find the planning application, so here's a public spirited link to it:", 
      "date": "2007-01-12 18:14:00", 
      "id": 4134, 
      "responses": 1, 
      "subject": "Planning application - base Shakespeare Tower", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2903"
    }
  ]
}