{
  "summary": [
    {
      "body": "Have just been told an extraordinary story about someone moving into the Barbie and then moving out again a few months later recently, because they found it 'too snobby'! Having moved in just over a year ago, I've found it very friendly and welcoming, so I'm puzzled by this reaction. They only moved across from near St Paul's, too, so not strangers to this part of London.", 
      "date": "2007-04-19 08:48:00", 
      "id": 4254, 
      "responses": 14, 
      "subject": "Snobby - us????", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3244"
    }, 
    {
      "body": "I'm not one for thinking that the Christians got hold of the Gay marketing material promoting a night of trouble at Wood St and burning it before anyone got sight of it.  I think it is more to do with rationing of pins and it was most likely taken by an overzealous house officer. I wanted to write and suggest that rather than this just being a good knees up which will eventually die out that it has a purpose...such as counselling teenagers on the estate or being more active in the wider London gay scene for equality. I suggest with a brand as strong as the barbican in London, it should be able to grab some air time. More gays mean nicer neighbours means more fashion means greater house prices. D07", 
      "date": "2007-03-18 23:52:00", 
      "id": 4361, 
      "responses": 14, 
      "subject": "gay gathering...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3160"
    }, 
    {
      "body": "Newer members of this forum may wish to read earlier installments of the Parable before reading this posting:   ------------------------------------------------------------------------------------------------------------------ It had been ages since I had seen my neighbour 1179. He had finally been released from Pols Bonne Chambers, and had been signed off as fully re-educated. Never again would he even dream of replacing his original skirting boards, nor would anyone ever hear him muttering about smells emanating out of his Garchey. He was now a Barbicanite through and through, and he would adhere to the listings guidelines like a limpet to a two-ton anchor.  The Committee had even found him employment; he had been appointed into the new role of Lake Guardian, which had been created after the lakes and fountains were renovated last year. One fine morning I decided to track him down by the lakeside. Greetings, adherer, he said. And be you ever grateful for your Listing, I replied, using the Committees recommended salutation. Nice to see that youve come back from Pols Bonne Chambers. Oh yes, the Chambers were fabulous but nothing can compare with living here, right in the beating heart of Brutalism, he said. Youve found yourself a great position here as Lake Guardian. A stroke of luck, wasnt it? The Lakes are such an integral part of the original Barbican vision. If they werent here, the whole place wouldnt be so reminiscent of Venice, would it. Absolutely! And it was so clever of the conservationists to ensure that mosquitoes would now be able to breed here, just as in La Serenissima itself. Mosquitoes? But there are no mosquitoes here; havent you read the notices which have gone up in each block? Samples have been taken from the lake and there are absolutely no mosquitoe larvae. Its those insurgents again, always stirring up trouble. They are determined to undermine the Brutalist vision, and are surreptiously dropping nits onto peoples heads from one of the balconies of Shakespeare Tower. But were on to them now and will soon put a stop to this. It was so reassuring to hear 1179 speak this way. The trainers at Pols Bonne Chambers had done wonders. Here was surely a man who put the rut into Brutalism. I asked him about the rumours concerning the lake plantings. Oh yes, those silly people who say that the lake in front of the Arts Centre was never meant to be planted with two rows of greenery. Have they never seen a Brutalist waterhedge? The ignorance of these people is just staggering. I had to agree that one heard a lot of nonsense spouted by the uninformed. And the way people moan about the green slime in the lakes now. Did anyone ever say Brutalism was meant to be clean? I think there are some idiots out there who cant tell the difference between Minimalism and Brutalism. That slime has been carefully cultured to counter the antiseptic characteristics of water features in suburban developments. Whats right for Kingston is certainly NOT right for EC2. Hear, hear I said. Where have these moaners been living all their lives  on the moon? Come to think of it, the surface of the moon is actually rather Brutalist. Maybe the Almighty spent some time in Pols Bonne Chambers and got some inspiration there, halfway through the Creation. Interesting theory; worth further study. Must get going now; Im doing my weekly patrol for terracotta containers on the balconies  theyre like weeds: just when you think you are rid of them, a couple more crop up somewhere else and have to be eradicated before they spread further. Who in their right mind would think that you can put terracotta next to hammered concrete? Nice chatting to you, I said. A very good day to you, sir - and may you always be Adhering,  he said as he strolled off.", 
      "date": "2005-09-09 20:54:00", 
      "id": 2997, 
      "responses": 5, 
      "subject": "the parable of the lake", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1836"
    }, 
    {
      "body": "Calling on Barbican-based folk working in the creative industries.  How about meeting up in a local pub for a neighbourly drink or two? There's a few of us (Photographer, Publisher, New media guys) wondering if there may be more of us working at home on artistic, visual, literary, publishing, musical, new media, architectural etc  type things. We're meeting up on Wednesday 7th May at 7.30pm at the Wood Street Bar for a drink. You're very welcome to join us. [/b]", 
      "date": "2008-04-20 16:21:00", 
      "id": 3877, 
      "responses": 3, 
      "subject": "Barbican Creatives Social", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4254"
    }, 
    {
      "body": "Hey all,  I know some of the people on the board here eat at Spice Corner Indian Restaurant so thought I'd inform you that I've just read in the Classifieds that the Aldersgate restaurant are offering 30% discount to residents throughout summer - please read the classified message board for more details. It's nice that there are special offers for us residents, makes it more 'neighbourly' if you know what I mean. I would highly recommend people who like Indian food to check the place out - food as well as service is very good.", 
      "date": "2005-06-23 01:30:00", 
      "id": 4673, 
      "responses": 2, 
      "subject": "Spice Corner Offers", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1708"
    }
  ]
}