{
  "summary": [
    {
      "body": "I have heard on the grapevine that one of the residents of Andrewes House has an interest in a company that provides moth control at an exhorbitant price. Has anyone approached you about moth control of offered bizarre and incorrect information about these creatures?  If so, be aware that their intersts are not your interests! Moreta", 
      "date": "2006-10-05 22:52:00", 
      "id": 4279, 
      "responses": 5, 
      "subject": "Moths", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2660"
    }, 
    {
      "body": "People should be aware of the unscrupulous  activity of nPower door-to-door salesman in the area. My wife was recently visited by someone who said that he was just checking that we were on the right electricity tariff. He filled out a form and got her to sign it; she asked specifically if there would be any change to our supplier and he said no. Lo and behold two weeks later (conveniently after the end of the 14-day cancellation period - which he did not mention) a letter comes from nPower saying we have changed our supply to them.  Misselling of this nature is not just scandalous, it is fraudulent. I have reported it to our MP and would urge City of London police also to look into the behaviour of nPower doorstep sellers in the Barbican.", 
      "date": "2008-04-04 09:22:00", 
      "id": 5522, 
      "responses": 5, 
      "subject": "nPower scam", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=4186"
    }, 
    {
      "body": "My annual statement arrived today, and London Energy said that my monthly direct debit should go up from 34 to 45. As the difference in my statement from Oct 2004 to 0ct 2005 was only 13, it didn't seem right to charge me 132 extra during the course of the year. Once I managed to get them on the phone, they immediately blamed their over-eager computer and proposed that my monthly payment go up to 38, as my electricity usage is very constant.  What made me really laugh is that they said they were trying to \"protect\" me by overcharging me for a full year.  I seem to remember exactly the same scenario a year or two ago. Clearly their \"computer\" is very greedy indeed and one needs to keep a close eye on it. Goodness knows where this computer acquired such bad manners.", 
      "date": "2005-10-26 19:44:00", 
      "id": 4551, 
      "responses": 1, 
      "subject": "London Energy - watch your direct debit bills", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1908"
    }
  ]
}