{
  "summary": [
    {
      "body": "Hello Neighbours, I live on Golden Lane Estate, and I'm tring to rally up support for objecting to the late license that the Shakepeare pub (on Aldersgate Street) have applied for. Does the noise  reach as far as the Barbican, John Trundle Court perhaps?", 
      "date": "2005-07-29 11:40:00", 
      "id": 2966, 
      "sentiment": 2, 
      "subject": "Shakespeare pub late license", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1768"
    }, 
    {
      "body": "the other day my partner was on the balcony (we're in bunyan) and saw two large chavettes walking their dog near the lake under bunyan court. they were repeatedly throwing a ball into the water and trying to get their dog to attack the big golden carp in the lake. the dog didn't seem very interested, but they kept trying. my partner yelled out, \"hey! you! leave that fish alone!\" so they sauntered off.  about 20 minutes later, they were back doing the same thing. he shoo'ed them away again. so if anyone's on their balcony in the area, keep an eye out for them. they seemed like they were regular visitors to the lake.  has anyone noticed, btw, that they've added five new goldfish to the bunyan lake? they like to hide under the duck slide. i think the carp is excited to have the company.", 
      "date": "2005-08-27 12:46:00", 
      "id": 2983, 
      "sentiment": 2, 
      "subject": "estate fish in vicious chav dog attack danger!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1820"
    }, 
    {
      "body": "Newer members of this forum may wish to read earlier installments of the Parable before reading this posting:   ------------------------------------------------------------------------------------------------------------------ It had been ages since I had seen my neighbour 1179. He had finally been released from Pols Bonne Chambers, and had been signed off as fully re-educated. Never again would he even dream of replacing his original skirting boards, nor would anyone ever hear him muttering about smells emanating out of his Garchey. He was now a Barbicanite through and through, and he would adhere to the listings guidelines like a limpet to a two-ton anchor.  The Committee had even found him employment; he had been appointed into the new role of Lake Guardian, which had been created after the lakes and fountains were renovated last year. One fine morning I decided to track him down by the lakeside. Greetings, adherer, he said. And be you ever grateful for your Listing, I replied, using the Committees recommended salutation. Nice to see that youve come back from Pols Bonne Chambers. Oh yes, the Chambers were fabulous but nothing can compare with living here, right in the beating heart of Brutalism, he said. Youve found yourself a great position here as Lake Guardian. A stroke of luck, wasnt it? The Lakes are such an integral part of the original Barbican vision. If they werent here, the whole place wouldnt be so reminiscent of Venice, would it. Absolutely! And it was so clever of the conservationists to ensure that mosquitoes would now be able to breed here, just as in La Serenissima itself. Mosquitoes? But there are no mosquitoes here; havent you read the notices which have gone up in each block? Samples have been taken from the lake and there are absolutely no mosquitoe larvae. Its those insurgents again, always stirring up trouble. They are determined to undermine the Brutalist vision, and are surreptiously dropping nits onto peoples heads from one of the balconies of Shakespeare Tower. But were on to them now and will soon put a stop to this. It was so reassuring to hear 1179 speak this way. The trainers at Pols Bonne Chambers had done wonders. Here was surely a man who put the rut into Brutalism. I asked him about the rumours concerning the lake plantings. Oh yes, those silly people who say that the lake in front of the Arts Centre was never meant to be planted with two rows of greenery. Have they never seen a Brutalist waterhedge? The ignorance of these people is just staggering. I had to agree that one heard a lot of nonsense spouted by the uninformed. And the way people moan about the green slime in the lakes now. Did anyone ever say Brutalism was meant to be clean? I think there are some idiots out there who cant tell the difference between Minimalism and Brutalism. That slime has been carefully cultured to counter the antiseptic characteristics of water features in suburban developments. Whats right for Kingston is certainly NOT right for EC2. Hear, hear I said. Where have these moaners been living all their lives  on the moon? Come to think of it, the surface of the moon is actually rather Brutalist. Maybe the Almighty spent some time in Pols Bonne Chambers and got some inspiration there, halfway through the Creation. Interesting theory; worth further study. Must get going now; Im doing my weekly patrol for terracotta containers on the balconies  theyre like weeds: just when you think you are rid of them, a couple more crop up somewhere else and have to be eradicated before they spread further. Who in their right mind would think that you can put terracotta next to hammered concrete? Nice chatting to you, I said. A very good day to you, sir - and may you always be Adhering,  he said as he strolled off.", 
      "date": "2005-09-09 20:54:00", 
      "id": 2997, 
      "sentiment": 2, 
      "subject": "the parable of the lake", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1836"
    }, 
    {
      "body": "I know there was a thread with some related info on this but does anyone know where I can get something to treat the pests (not sure whether caterpillars or slugs - can't believe caterpillars survive in this weather!) that are destroying my lovely pansies? They are literally eating the whole things. Now I know why people have geraniums - our neighbours' plants seem to be perfectly healthy!", 
      "date": "2005-11-22 09:49:00", 
      "id": 3045, 
      "sentiment": 2, 
      "subject": "Plants", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1950"
    }, 
    {
      "body": "Has anyone else had recent trouble with bites from mosquito like insects? I've had over 12 bites in the past week and caught six of the beggars!", 
      "date": "2005-08-03 10:59:00", 
      "id": 3048, 
      "sentiment": 2, 
      "subject": "Mosquito's or some such lfying pest", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1782"
    }
  ]
}