{
  "summary": [
    {
      "body": "Jay Bird. Now I've got your attention... Has anyone else noticed the really beautiful Jay Bird(s) that is frequenting the Barbican lately. I never saw anything as nice when I lived outside of London, so I feel its even more amazing to see it here. It is obviously a bit more canny than the other birds as it has mastered my pigeon proof peanut feeder.", 
      "date": "2005-08-31 07:57:00", 
      "id": 2991, 
      "sentiment": 4, 
      "subject": "Naked as a...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1824"
    }, 
    {
      "body": "Life just gets better and better here . . . the new zebra crossing opposite the Barbican Tandoori has now opened and is getting lots of use. Much needed! And I've seen two cyclists being cautioned by police at the corner of Aldersgate and Beech Street in the last week. Hopefully the message will get round that cyclists should ride responsibly . . .  [cue the flame war]", 
      "date": "2007-01-29 22:34:00", 
      "id": 3281, 
      "sentiment": 4, 
      "subject": "Aldersgate zebra crossing", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2974"
    }, 
    {
      "body": "I woke up this morning to the most lovely chirpy but tuneful birdsong outside amongst the plants in the windowboxes. It was about 5am but the sound cheered me up no end. Anyone know which birds are singing in the Barbican at this time of year? This followed ducklings running along the fire escape on Saturday so it's been quite an ornithological weekend. It's a great bonus to live in the middle of a major city with all this wildlife outside - and some wild life inside by all accounts!  ", 
      "date": "2008-03-24 05:28:00", 
      "id": 3827, 
      "sentiment": 4, 
      "subject": "Birdsong", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4149"
    }, 
    {
      "body": "For me, there are three main reasons for wishing to live in the Barbican 1/ Walk to work (and to South Bank, West End etc) 2/ Pedestrian only 3/ The Barbican Centre on your doorstep We go to The Barbican Centre a lot: pretty much it's the main arts venue in London we go to regularly. I was wondering how often Barbican residents make use of this wonderful venue. Look forward to your responses! What sort of events do you go to, and what have you been to recently?", 
      "date": "2006-10-02 09:23:00", 
      "id": 4276, 
      "sentiment": 4, 
      "subject": "How often do you attend cultural events at The Barbican?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2649"
    }, 
    {
      "body": "I'm not one for thinking that the Christians got hold of the Gay marketing material promoting a night of trouble at Wood St and burning it before anyone got sight of it.  I think it is more to do with rationing of pins and it was most likely taken by an overzealous house officer. I wanted to write and suggest that rather than this just being a good knees up which will eventually die out that it has a purpose...such as counselling teenagers on the estate or being more active in the wider London gay scene for equality. I suggest with a brand as strong as the barbican in London, it should be able to grab some air time. More gays mean nicer neighbours means more fashion means greater house prices. D07", 
      "date": "2007-03-18 23:52:00", 
      "id": 4361, 
      "sentiment": 4, 
      "subject": "gay gathering...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3160"
    }
  ]
}