{
  "summary": [
    {
      "body": "Does anyone know when they are going to start demolition of Milton Court and whats going in its place. Barbican maintenance etc have already moved out and corporation have approved demolition. Nothing from Speed or Wiioughby groups, let alone B.Ass(ociation)", 
      "date": "2006-01-04 12:35:00", 
      "id": 3231, 
      "responses": 85, 
      "subject": "milton court", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2010"
    }, 
    {
      "body": "I would like to make a formal complaint about the building site of the school.Plus I would like to address the issue of the safety of the project with interested authorities. Who Do I contact? I am not against a school I am against that project!", 
      "date": "2006-09-27 14:47:00", 
      "id": 4271, 
      "responses": 24, 
      "subject": "prior weston school", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2636"
    }, 
    {
      "body": "Who would be interested in starting a petition to have the glass and tin extension to the exhibition hall which cuts across the podium demolished.  It is never used, is an eyesoar and it would be an attempt to try and resotre the podium to its original design.", 
      "date": "2006-02-16 22:54:00", 
      "id": 4599, 
      "responses": 22, 
      "subject": "Start petition to demolish an old podium building", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2082"
    }, 
    {
      "body": "In case anyone's interested but hasn't heard the news, it looks like part of Smithfield market is to be replaced with an office block:  I assume this is the bit at the west end of Smithfield, with Simply Sausages in it? It'd be so much nicer to see it all fixed up and used as is, but I guess \"nicer\" is nowhere near as important as \"more lucrative\" for the people involved.", 
      "date": "2006-05-18 14:23:00", 
      "id": 3731, 
      "responses": 14, 
      "subject": "Part of Smithfield to be demolished", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2303"
    }, 
    {
      "body": "The language in what follows is not mine.  I have taken it straight from the back right hand side of the newly-distributed PODIUM which claims - in its stap line - to be \"From the Barbican Centre for Residents\".  It is death by a thousand cuts (taken in conjunction with all the other development works around and invading the quality of life of the Estate) and written in the kind of jargon that makes NEWSPEAK warm, cuddly and comprehensible. \"As part of the Frobisher Redevelopment works, staff on Level 6 of the Barbican Centre are required to decant to other office spaces. The majority of Level 6 staff will be moving to a temporary site in Bonhill Street and the remainder, who cannot leave the site due to the nature of their work, will be located in two modular buildings located on the Sculpture Court.\" \"The delivery of the modular buildings is currently scheduled for Sunday 18 November. The delivery is certified as an abnormal load, due to its size, therefore the Metropolitan Police will only allow this to take place overnight or on a Sunday. With the residents in mind, the Barbican Centre did want want the delivery to be overnight and therefore Sunday was chosen as the only other option.\" For those of you old enough to remember BEYOND THE FRINGE in 1961 you may already hear the cackle of Dudley Moore in the background as I continue in my best Alan Bennett (or Peter Cook or Jonathan Miller voice) because this piece of idiocy would have been fought over by all the cast as it is such a gem. \"It is necessary to close Silk Street to allow the delivery to take place; road closure will be between the hours of 9am and 6pm. The modular buildings will then be craned into the Sculpture Court.\" \"The mobile crane will arrive on Silk Street at 8am and will be set up in preparation for the first lift at 9am. Units will then be unpacked and attached to the crane which will lift the unit from Silk Street on to Level 3. Power pallet trucks will then be used to skate the units into position on the Sculpture Court.\" \"There will be a total of 14 lifts taking place throughout the day and they will take approximately five minutes each....To address the environmental issue of noise, delivery vehicles will switch off engines between arrival and departure and the crane's engine will be switched off when not in operation.\" I've checked my blood pressure. Yes....it is up.  I do not want to use bad language on this site so I will let others scream the words for me as they read this (or as they react to the PODIUM delivery through their letterboxes). The convenient fiction - and it is one the City of London and our representatives on it to go along with -  seems to be that people do not live in the Barbican Estate, not really. And - if they do - then they bugger off at the weekend. And for those who stay then \"Hey, you'll wish you hadn't.\" The interest I declare - in this posting - is that, living in a flat in Shakespeare looking out over the Sculpture Court, means that Calypso and I will have to live through the stated (and probably under-estimated)14 lifts on that Sunday and we are being treated as if we were not here and shouldn't be here.  The trouble is it makes me want to hire a mobile crane and some modular buildings and to go and spend a weekend - maybe over the Christmas/New Year period of goodwill - doing exactly this close to the people who think this is OK....but that way lies madness, war and the destruction of civilisation.  I'd better get back in my box and keep taking the tablets.", 
      "date": "2007-11-04 23:53:00", 
      "id": 4149, 
      "responses": 12, 
      "subject": "Just when you thought it was safe to sleep in", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3772"
    }, 
    {
      "body": "Does anyone know what is happening to this building by the Musem of London roundabout?", 
      "date": "2007-06-20 08:58:00", 
      "id": 3361, 
      "responses": 10, 
      "subject": "Clifford Chance Building", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3428"
    }, 
    {
      "body": "Another Saturday, another 8 a.m. start for jackhammering. Skanska/EDF is digging up Whitecross St. outside the school for \"emergency\" cable work so the curb can be installed. Obviously the companies have figured out there is no enforcement, so they can call everything an \"emergency\" and do what they like. I have contacted the city environmental services but the work may be in Islington and the duty officer wasn't well versed in the work rules.", 
      "date": "2008-02-23 10:43:00", 
      "id": 3523, 
      "responses": 9, 
      "subject": "Saturday noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4049"
    }, 
    {
      "body": "Does anyone know if there are exciting archaeological discoveries being made on the site of the new school in Whitecross St.? I can see it from my windows and was surprised to see that a large white protective roof has gone up over part of the site. There's a notice saying 'Danger Deep Excavation' on the surrounding fencing. The people who've been visible on site today are certainly not the usual workforce, either. As an historian specialising in this area I'm fascinated!", 
      "date": "2006-05-05 14:56:00", 
      "id": 3108, 
      "responses": 6, 
      "subject": "Archaeology on the new school site?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2256"
    }, 
    {
      "body": "Are they obliged to down tools at any point tonight, or could they be working throughout....? It's rather noisy over here in Defoe", 
      "date": "2007-06-27 21:18:00", 
      "id": 3478, 
      "responses": 5, 
      "subject": "Roadworks in the tunnel", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3450"
    }, 
    {
      "body": "It's gone. Around 12.45pm today a massive crane and hordes of men in fluorescent jackets finalized the deed. It's a sad day for the Barbican Estate and its residents. Also an unhappy portent of the shape of things to come PS Is it really \"JP Morgan Chase Bear\" now? Perhaps they have a sense of humour after all. Even better if it could emulate that immortal Shakespearean stage direction in the \"The Winter's Tale\":- [Exit pursued by a Bear] If only......................... ", 
      "date": "2008-04-11 14:07:00", 
      "id": 3867, 
      "responses": 5, 
      "subject": "Silk Street Bridge - R.I.P.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4224"
    }, 
    {
      "body": "A number of people have been disturbed by construction noise from the Islington side of the border. The Environmental Health Department in the borough of Islington is not as effective as our own.  They do not work at weekends which is when it appears that most of the problems have occurred.  In fact, they actually asked the City to monitor the behaviour of British Land at the Ropemaker", 
      "date": "2008-03-18 15:22:00", 
      "id": 3834, 
      "responses": 4, 
      "subject": "Islington construction noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4136"
    }, 
    {
      "body": "Sunday - from at least 9am until 12:45 last - hammering from the old green glass fronted building on Moor Lane/Chiswell St - fed up by 11am - went down to the site - Polish builder very reluctantly directed me to the site office, - he said  \"I am  just wasting my time now\" - I signed the site visitors book, since no-one there to complain to - and called the CoL environmental health line 7606-3030. Apparently I was not the first person to complain about this specific noise today - and the environmental health officer had already visited the site - but unable to find any perpetrators - and yet STILL (12:55) the noise goes on - not really very reassuring when Willoughby/Speed residents  are asked to accept promises from a new developer (Heron) about noise associated with the redevelopment of Milton Court, which will be monitoted by the CoL........(CoL terms -no work allowed after 13:00 Saturday, no work allowed Sunday) - message to CoL - your/our terms are being breached deliberately - what means do you propose to enforce the mutually agreed terms ??", 
      "date": "2007-03-04 13:07:00", 
      "id": 4250, 
      "responses": 4, 
      "subject": "NOISE from One Moor Lane construction site on Sunday", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3102"
    }, 
    {
      "body": "I am in the process of buying a flat in John Trundle, and my solicitor made some enquiries with crossrail. What came back was a non specific letter, which told me nothing I am going to attach the letter at the end of the mail. My question is, has anyone in the same block had any more useful information than this, and is the possibility of structural damage a real possibility. Thanks Max Thank you for your enquiry of 9 December 2005 regarding the effect of Crossrail on the above property.  Cross London Rail Links Limited administers a Direction issued by the Department of Transport on 22 February 2005 for the Safeguarding of the preferred alignment of Crossrail. The Secretary of State for Transport has introduced a Bill into Parliament that if enacted would authorise acquisition of the land and construction of the project. The Bill is expected to take about 2 years to be approved, which will include an examination of the proposals and objections to them in public before two Parliamentary Committees. Construction could start in 2008 and take about 6 years.  You may inspect and/or purchase copies of Plans, Sections, Environmental Statement, Explanatory Notes and Non-Technical Summary regarding the Crossrail Proposals at specified Libraries and Local Authority Offices.  The proposed route of Crossrail runs from Shenfield to Stratford, descending into a tunnel at Bow. The line will continue through Whitechapel, Liverpool Street, Farringdon, Tottenham Court Road, Bond Street and Paddington, and continue on the surface to Heathrow and Maidenhead.  The property falls within the consultation limits shown on the plans attached to the Safeguarding Direction. The terms of the Direction require the local authority to consult Cross London Rail Links Limited regarding planning applications that are within the limits of consultation. The local planning authority is required to report to the Secretary of State for Transport if it resolves to determine the application in a manner which is inconsistent with the advice given by Crossrail.  It is Crossrail policy to limit damage to buildings as a result of settlement to slight (as defined by the work of Burland et al 1977 and Boscardin and Cording 1989), if necessary by carrying out engineering protective works.  We currently anticipate that properties located within the zone of settlement will be surveyed by independent building surveyors and a schedule of existing defects prepared.  Should any claim subsequently be made in respect of damage to the building caused by the construction of the works it will be considered against this initial survey and schedule.  Compensation will be payable in respect of any justifiable claims for damage so caused, in accordance with compensation law and practice.  With regard to operational noise, the underground sections of Crossrail are being designed with the aim that re-radiated noise levels inside buildings will not exceed a maximum sound level of 40dB(A).  In most underground areas the trains will run on continuous welded track supported on resilient base plates, which will help to reduce any adverse noise and vibration levels considerably.  If redevelopment is being considered, Crossrail would advise that a meeting be arranged with its engineers as soon as possible to discuss the impact of foundations, basements and other structures (including piles) on Crossrails proposed structures and tunnels, including ground movement arising from the construction thereof and the effects of noise and vibration.  I hope this information is helpful, but if you require any further assistance then please feel free to contact me.", 
      "date": "2005-12-12 16:49:00", 
      "id": 3005, 
      "responses": 3, 
      "subject": "crossrail letter", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1984"
    }, 
    {
      "body": "Does anyone have any idea when the demolition work on St Alphage House and surroundings is going to start? I understand that the plan is to start sometime in 2008", 
      "date": "2008-02-02 22:38:00", 
      "id": 3624, 
      "responses": 3, 
      "subject": "JPMorgan Chase building", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3975"
    }, 
    {
      "body": "If anyone else was awakened by the 4 a.m. construction choir on Whitecross St. today, or any of the other rulebreaking activities by our neighbours to the north, may be worth filling out an online noise diary at   Noise Record Diary is the last option in the blue box Do it online on the right I have tried leaving voice messages before with no response so I don't expect any from this either, but somehow it makes me feel better.", 
      "date": "2008-04-14 11:43:00", 
      "id": 3864, 
      "responses": 3, 
      "subject": "Islington noise complaint", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4236"
    }, 
    {
      "body": "For those of you who are interested in what was on the school site in previous centuries, I've been doing some more research and found out the following. In the late 18th century a brewery called the Goat Brewhouse was operating. A 20 year old called Sam Whitbread starting working there, then moved to Whitbread's present site within a few years. By 1813 the Whitecross St site was a debtors' prison! It was built to separate debtors from the other prisoners who were held in Newgate, so that they (the debtors) wouldn't be led astray by hardened criminals. The medieval Jewish cemetery was further south than I thought and probably stretched from Thomas More Gardens up to Beech Street.   The dig under the marquee seems to have been completed now, although the soil being replaced is being sifted through, but there's a smaller dig opened up nearer Whitecross. No idea what's there.", 
      "date": "2006-06-22 08:26:00", 
      "id": 4434, 
      "responses": 3, 
      "subject": "A little more local history", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2382"
    }, 
    {
      "body": "Am I going mad, but didn't they dig up Beech Street only a couple of months ago, and today they have dug it up again? In fact I think it's been dug up 3 times in the last 12 months, but I may be wrong. Fortunately we don't have a car; if we did, we would be really furious.", 
      "date": "2006-08-31 20:27:00", 
      "id": 4466, 
      "responses": 3, 
      "subject": "digging in Beech St. tunnel", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2567"
    }, 
    {
      "body": "I note that Keltbray having finished demolition on Ropemaker Street seem to be moving on to 1 Moor Lane, the rather striking green blue glass building just north of Milton Court.  Does anyone know what is proposed for that site?", 
      "date": "2005-09-06 21:21:00", 
      "id": 2993, 
      "responses": 2, 
      "subject": "New Demolition", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1832"
    }, 
    {
      "body": "Well, this was the promise from Cantillon  I was woken at 9:23 this morning by pneumatic drilling. More than a little irritated (having worked a 20 hour day on Friday), I eventually went down to complain to the site manager, and find out who had authorised this. His response was that a Richard Lambert from the Corporation had permitted it. According to him, the project manager had asked the Corp how much noise they can make on a Saturday, and this Mr Lambert said \"you can make as much noise as you like between 9:00 and 14:00\". Who are these faceless %!*!wits who are so generous with our ability to have a nice lie-in ? What is the point of us trying to get commitments from Cantillon regading noise when they are discarded like so much jetsam just weeks into the project ?  ", 
      "date": "2008-02-16 10:42:00", 
      "id": 3510, 
      "responses": 2, 
      "subject": "Weekend noise from Milton Court", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4027"
    }, 
    {
      "body": "IF you are disturbed by the current illegal cable laying in Aldersgate street, please call the guidhall to complain 606 3030.  They then tell environmental health. They've just run away, leaving all their kit but they are the kelley group, and the more complaints the better my big question is why is there no enforcement of the rules on raod works?", 
      "date": "2008-02-25 22:29:00", 
      "id": 3527, 
      "responses": 2, 
      "subject": "Aldersgate St roadworks 10 pm", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4060"
    }, 
    {
      "body": "Once again British Land was working illegally on Saturday afternoon.  If the exceed the normal working hours the City of London Environmental Health Department can intervene, as they did. Technically only Islington Council can take action but as they do not work at weekends the City can step in.  Islington has long suspected that British Land were working beyond agreed hours and on Monday the City will contact them so action can be taken. If the same problem occurs again in Whitecross Street please ring the City on 7606 3030 and get the switchboard to contact the duty environmental health officer.  They can take action.", 
      "date": "2008-03-09 03:07:00", 
      "id": 3813, 
      "responses": 2, 
      "subject": "Ropermaker St. construction and spin off for Whitecross", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4100"
    }, 
    {
      "body": "Why is it being knocked down before consent has been given for a new building?  Or has the consent for the latest application been given?", 
      "date": "2007-11-29 20:05:00", 
      "id": 4152, 
      "responses": 2, 
      "subject": "Milton Court Demolition", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3824"
    }, 
    {
      "body": "Was anyone else aware that work was going to start at 6am this morning?  I'm wondering if I missed a mailshot.  Apparently the police gave permission for vehicles to be moved in early, and Islington Council were aware it was going to happen, but the news didn't reach me.  If I'd known it was a planned one-off event, I might have gone to bed earlier to compensate. I might not have got so annoyed about it, taken photos from my balcony, phoned Islington Council several times, or marched onto the site to talk to the manager. Both Wilmott  Dixon and Islington Council seemed surprised we hadn't been informed. Presumably one of them is responsible for doing it.", 
      "date": "2006-05-31 11:20:00", 
      "id": 4405, 
      "responses": 2, 
      "subject": "Early morning construction work on Fortune Park campus", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2328"
    }, 
    {
      "body": "Has anyone else received a letter from Crossrail?  It provides no comfort (in fact the opposite) to my mind... It is unclear whether the work site on Aldersgate Street will be required if the crossover cavern is to be built in a different way from that currently proposed.  The letter implies that it is. The working hours stated in the letter are not quite the whole story - it does not mention that working could also happen at weekends and at night (set out below) effectively at the discretion of the contractor.  The removal of spoil from the tunnel will take place on a   basis. Also the noise mitigation, which basically involves fitting double glazing   (!) inside our windows (and fitting a fan) is entirely unacceptable.  Apart from turning our flats into squalid non-ventilated greenhouses, I very much doubt that this is appropriate treatment for a Grade 2 listed building.   I for one am not prepared to live for 3 years without fresh air, and I also think what is proposed would be entirely impossible to install in our flat. BA Chair, we need you to organise us to oppose this. If we do not act together, I shall be certainly taking legal advice, but a joint approach would seem to me to make much more sense.  Normal working hours are planned to be from 0700 to 1900 on weekdays and 0700 to 1400 on Saturday. Only non-disruptive preparatory work, repairs or maintenance will be carried out on Saturday afternoons or Sundays between 0800 and 1700. The nominated undertaker will adhere to these normal working hours for each site as far as reasonably practicable and where feasible, operations anticipated to cause disturbance would be limited to these hours. There are certain exceptions to the normal working hours, which are described below. Certain operations are season and weather dependent and in these instances the nominated undertaker will seek, as is customary in the construction industry, to extend the working hours for such operations to take advantage of daylight hours, with the agreement of the relevant authorities.  Track laying and internal fit out works within the stations and tunnels may also be carried out on a 24 hour per day, 7 days per week basis. In order to safeguard the works it may be necessary for certain items of plant and equipment to be kept running 24 hours per day, which would include pumps and generators. Any such equipment will be shielded in order to provide appropriate noise attenuation. Staff may be required to collect data and samples outside normal working hours at times. Certain works requiring temporary possession of roads and railways for safety or operational requirements, to limit disruption to the travelling public, and works in connection with utilities when demand is low will need to be undertaken outside normal working hours. This will include Saturday afternoon, night-time, Sunday and/or bank holiday working from time to time. On occasion longer term possessions (in excess of one week) will be required for more major works.", 
      "date": "2005-07-23 11:15:00", 
      "id": 4700, 
      "responses": 2, 
      "subject": "Crossrail", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1757"
    }, 
    {
      "body": "Heard that Whitecross Street is going to be overhauled - to what extent I don't know. There was a man with a clipboard questioning passers-by yesterday lunchtime. Anyone know anything?", 
      "date": "2006-01-12 11:44:00", 
      "id": 3035, 
      "responses": 1, 
      "subject": "Whitecross Street", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2029"
    }, 
    {
      "body": "did anyone find out what the digging on old school site on whitecross/golden lane site is about.Is it the old Jewish cemetry?All info greatfully reeived", 
      "date": "2006-05-16 17:15:00", 
      "id": 3106, 
      "responses": 1, 
      "subject": "archiology", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2297"
    }, 
    {
      "body": "I am on the Crossrail email list and received this missive today: The proposed Crossrail Bill is currently being considered by a Select Committee in the House of Commons and a number of changes to the scheme are proposed to address petitioners' concerns, or otherwise improve the project design. These are called 'Additional Provisions'. We are now holding an information round to explain these changes and keep you up to date on the project. Public information centres are being held along the proposed route between 11 September 2006 and 10 October 2006. Additional information centres are now being held at Liverpool Street on 5 and 6 October, and Bond Street on 9 and 10 October 2006.  All information materials relating to the current information round can be found on the information round microsite by clicking the button at the Crossrail website  . The Liverpool Street information centre is, apparently, at the Broadgate end of the main concourse, for anyone who might like to check out what the latest proposals are for themselves", 
      "date": "2006-09-27 17:29:00", 
      "id": 4267, 
      "responses": 1, 
      "subject": "Crossrail", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2637"
    }, 
    {
      "body": "Does anyone know when the above building is coming down ? THANK YOU", 
      "date": "2006-03-18 16:33:00", 
      "id": 4615, 
      "responses": 1, 
      "subject": "MOORFIELDS BUILDING", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2143"
    }
  ]
}