{
  "summary": [
    {
      "body": "For a long time building works meant that it was not possible to reach the Guildhall Library from the corner of Willoubghy and Andrewes, over the footbridges and down the back of Guildhall. Can anyone tell me when this route re-opened?   Personally I got out of the habit of using it and now fear that low usage may be used to justify the closure St Alphage Highwalk.", 
      "date": "2008-03-02 13:37:00", 
      "id": 3900, 
      "responses": 33, 
      "subject": "St Aphage Highwalk question...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4078"
    }, 
    {
      "body": "Having entered one of those 5k charity runs (seemed like a good idea at the time....) I am now faced with the unpleasant task of training. finding treadmills terminally dull even with the benefit of pumping tunes in my ears, i have just realised the benefits of the perimeter highwalk (including round by museum of london) as a running route. does anyone know how far this is so i can work out how many laps is the equivalent to 5k?  need to learn to pace to myself before i collapse in a beetroot-faced heap......", 
      "date": "2006-05-14 19:11:00", 
      "id": 3107, 
      "responses": 9, 
      "subject": "How long is the highwalk?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2290"
    }, 
    {
      "body": "Please can someone explain to me how the flats in Willoughby work - the flat door next to ours doesn't seem to be the living room next door to ours if that makes sense? Our steps go down from the front door, so does that mean if I want to knock on our next door neighbour's door, I need to go down a floor?", 
      "date": "2006-06-27 12:58:00", 
      "id": 3124, 
      "responses": 6, 
      "subject": "Willoughby House Residents only please!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2399"
    }, 
    {
      "body": "I am moving one of the cupboards in my flat. I've read that I can add the doors to the architectural salvage collection but don't know where that is.  Can anyone help?", 
      "date": "2007-04-18 12:14:00", 
      "id": 4384, 
      "responses": 5, 
      "subject": "architectural salvage?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3240"
    }, 
    {
      "body": "I wondered if anyone could point me to the nearest (to the Barbican) wifi spot - doesn't need to be free. Many thanks, Simon", 
      "date": "2007-11-18 06:39:00", 
      "id": 4156, 
      "responses": 3, 
      "subject": "Nearest wifi?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3799"
    }
  ]
}