{
  "summary": [
    {
      "body": "how many gays live on the estate?", 
      "date": "2006-12-10 23:30:00", 
      "id": 1675, 
      "responses": 93, 
      "subject": "only straight on the estate", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2821"
    }, 
    {
      "body": "In case anyone didn't get today's junk mailing inside the \"City Resident\" magazine, the St Alphage House redevelopment is to be exhibited at the City of London Girls School, Weds 26th March 6pm - 8pm and Thurs 27th March 4pm - 7pm.  There is very little extra \"real\" information in the mailing, other than confirming the footprint of the building, which will include the Fore Street Telephone Exchange. Strangely enough they chose not to include any renderings of the proposed building - guess we'll all have to go along to see the alleged elephantine building.", 
      "date": "2008-03-18 23:08:00", 
      "id": 3587, 
      "responses": 77, 
      "subject": "St Alphage House Exhibition at Girls School, 26/27 March", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4138"
    }, 
    {
      "body": "Hi everyone I need a bit of advice, please. I didn't mind the duck nesting last month and am a proud auntie to 11 ducklings in Mountjoy House lake, but two days ago, a wood pigeon started to nest in another window-box.  We shooed her away yesterday morning and discarded of the twig nest, but she and her mate came back that evening and she's refusing to be moved on, even when I use the mop or broom. In fact, she started snapping out, as to bite both objects. She backs into my favourite echyium (Canarian palm) to the extent that her wing hits it at a funny angle and it looks like she'll break her wing, which stops me from being more agressive towards her. I left her for the night but her mate came back and cooed again at 6am and I'm really shattered today, so have cancelled plans to go out to the flower market  I think I recall that you can prick the eggs. I don't know if she's laid yet, but the way she's biting out at the broom and not moving this time, implies she has one underneath her. Maybe if I put her rent up? Does anyone have any experience of what happens when the eggs hatch? Do your plants really die?  Any advice would be greatly appreciated. She is very sweet looking, the nest building exercise showed the devotion of her love-interest, but I'm really tired and grumpy today, and don't want to be like this for the next few weeks, otherwise it will be ME snapping everytime I see a mop or broom.    ", 
      "date": "2008-04-20 09:10:00", 
      "id": 3897, 
      "responses": 39, 
      "subject": "Wood pigeon dilemma", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4251"
    }, 
    {
      "body": "What do people make of the daubing of small penguins on the pillars of Andrewes House? What is 'London Zoo'? Is it a guerrilla marketing exercise or just old fashioned graffit. bit odd. I think the paint looks water based so it must be quite easy to get off.", 
      "date": "2006-02-19 15:27:00", 
      "id": 4594, 
      "responses": 39, 
      "subject": "Penguins on Andrewes House", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2090"
    }, 
    {
      "body": "Maybe it's because I saw it at night, but what on earth is the Whitcross Street frontage of the new school supposed to look like. If it's supposed to look like a due to be demolished laundry building or to blend in with the dated look of the block Waitrose resides in then it's a perfect fit, but in my humble opinion it looks as though they have given the Golden lane area and Whitecross street something that some looks an absolute eye sore. I hope the graffity artists can do something to improve it, coz that looks like what it was designed for!!!   Rant over...  NB Happy new year all.", 
      "date": "2008-01-08 12:05:00", 
      "id": 3617, 
      "responses": 31, 
      "subject": "OMG - Rant", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3916"
    }, 
    {
      "body": "After the Mozart Requiem, there will be fireworks outside the Barbican Centre tonight - around 9.30-10pm I would guess. I would advise sedating toddlers and (illegal) pets, and those residents who complained that they have \"seen it, done it\" might want to look for alternative entertainment elsewhere. For example, they might want to book a hot air balloon over the lovely Kent countryside on this fine evening. For the rest of us, enjoy! I know I will.", 
      "date": "2007-08-04 08:05:00", 
      "id": 3389, 
      "responses": 28, 
      "subject": "fireworks tonight", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3560"
    }, 
    {
      "body": "It's getting chilly... but no electric warmth from the floor yet. If only I had some Totes Toasties (remember those?) Though really it's not quite that cold yet, I expect that's why it's still off. It's always a treat when it does come on, though. I'm looking forward to it already. Is anyone else turned on and warmed up yet?", 
      "date": "2006-10-03 18:18:00", 
      "id": 3204, 
      "responses": 26, 
      "subject": "Heating - that time of year again!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2651"
    }, 
    {
      "body": "It's been good and cold so hopefully all the little devils have been killed.  But it can't last long. So place your bets. When will the 1st bite start and the plug-in deterents be in place.  I'm reckoning 2nd week March personally....", 
      "date": "2007-01-24 21:09:00", 
      "id": 4391, 
      "responses": 26, 
      "subject": "Mosquito predictions...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2954"
    }, 
    {
      "body": "Past experience suggests that the Frank Harris estate agency acts as a good indicator of Barbican property.  Property hard to sell and prices on the low side = politeness and smiles to all potential buyers.  Property scare and prices on the way up = snotty attitude.  Snottiness at Frank Harris is now reaching such extreme levels it could indicate a turn in the market.  Or maybe I'm just generally less tolerant of rudeness and snotty behaviour than I used to be - obviously getting spoiled by Waitrose.", 
      "date": "2006-07-07 14:51:00", 
      "id": 3247, 
      "responses": 25, 
      "subject": "Frank Harris snottiness barometer", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2436"
    }, 
    {
      "body": "Does anyone have any information as to how high, how wide, the number of students, the age of said inhabitants, when will the structure be finished, when will the first kids be under roof etc. etc.! I've heard all kinds of stories, some plausable, some pretty far fetched, a few wanting me to sell up and flee. Having risen from the ashes of the old seat of learning the structure at present looks pretty formidable to say the least! Many months ago I was under the impression it would be a one story group of buildings. If one looks at what has risen so far that couldn't be gospel. I've even heard that there will be situated a football pitch on the roof!!! Enough rumours and neighborhood horror stories...any REAL information to give we who are interested to the point of distraction!", 
      "date": "2007-03-02 17:59:00", 
      "id": 3568, 
      "responses": 25, 
      "subject": "That shiney new school on Whitecros Street.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3095"
    }, 
    {
      "body": "I hate to be a moaning minnie, but the sound of the lady above me marching up and down and up and down her flat is driving me mad! Whats the etiquette here? She must have a wooded/hard floor. I guess I might just need to knock on her door and have a quiet word, but by the sound of her footsteps, she sounds bigger than me!", 
      "date": "2008-03-13 17:47:00", 
      "id": 1597, 
      "responses": 20, 
      "subject": "Footsteps driving me crazy!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4119"
    }, 
    {
      "body": "Early Saturday morning around 5am, I looked out my bedroom window and was shocked to see 2 middle aged men running around the gardens naked except for running shoes. I must admit that I was a little unsettled by the experience especially when the first man (obviously the pace setter) disappeared into Defoe house followed shortly by the other gentleman who was clutching his chest and appeared to be in great difficulty. Is there a new resident's running club that I should be aware of?", 
      "date": "2006-11-20 21:26:00", 
      "id": 3220, 
      "responses": 20, 
      "subject": "Nude Jogging", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2764"
    }, 
    {
      "body": "I wish a very happy, prosperous  and full of joy 2008 to all my neighbours,  met and not met Love,  Ilaria   :  ", 
      "date": "2007-12-27 18:11:00", 
      "id": 3555, 
      "responses": 20, 
      "subject": "Happy 2008!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3888"
    }, 
    {
      "body": "I read with interest in the Mail on Sunday that Mr Harris of Frank Harris has been quoted as follows\" b] Maybe making money is all that is of interest to Mr Harris and his Company!!! Why cant people embrace the fact we have achieved a great thing in securing the 2012 Olympics instead of being negative and disinterested!", 
      "date": "2005-07-11 07:30:00", 
      "id": 4505, 
      "responses": 20, 
      "subject": "\"We dont want the Olympics\" - Frank Harris", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1735"
    }, 
    {
      "body": "As I was walking past the new Tesco on my way home, I stopped in and had a quick look round. Teeny-weeny sections of everything except revolting-looking 'do-nuts' and sandwiches. I suppose if my false leg fell off as I came out of the Tube I might be persuaded to stop in for a pint of milk, but can't think of any other reason for using it. I don't think any of the existing shops need worry, quite frankly. ", 
      "date": "2006-11-17 22:08:00", 
      "id": 3219, 
      "responses": 18, 
      "subject": "That new T***co", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2758"
    }, 
    {
      "body": "In the context of Ward Mote ( which still mystifies me incidentally ) someone has implied that some people might regard the City of London as the last rotten borough in Britain. Why is that ? It rarely if ever crops up in the Private Eye section devoted to them. No doubt some people may have a good time occasionally at someone else's expense but I am willing to believe they work hard on our behalf for the privilege and it is the same throughout the country. While it has not kept me awake all night, I am concerned that I am missing something which troubles others sufficiently to deserve the description \" rotten \".", 
      "date": "2008-03-15 10:33:00", 
      "id": 3862, 
      "responses": 18, 
      "subject": "Rotten Borough", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4127"
    }, 
    {
      "body": "Amid all the moans and groans we have living here, which this forum helps to bring to light, I feel we need a thread about all the wonderful things about the Barbican, which I hope you'll all add to so this might become the most prominent thread.  So I'll start the list, and please add to it or extrapulate on the points already made. 1. I love my home, with its corbusian dimensions and its south facing sitting room overlooking a garden. 2. I love being able to walk to work and to the West End, and home again.  3. I love my Sunday Walks though a quiet City of London down to St Paul's (sometimes stopping for evensong and other times walking on) across the bridge and along the river, back up again through the City to home again.  4. I love the wildlife on my door: wrens nesting in my window boxes; ducks, geese; falcons; gulls; ducks; blackbirds; wagtails; coots; moorhens ... to name but a few. 5. I love the gardens. Private, public spaces (especially the wildlife garden.  6. I love feeling safe, and having a police force for the city that respond to complaints about skateboarders with half the police station! 7. I love the Barbican Association; the way it fights on our behalf, produces great publications and most of all makes me feel I'll never have to worry about things going wrong here.  8. I love the Barbican arts center (or the theatre/cinema downstairs as we call it). 9. I love Barbicantalk. We exchange information, help out new residents, winge, moan, complain, have the occasional row, but ultimately, rare among internet forums it remains a place of polite communication.  10. I love the incredible rise of the Smithfields' Clerkenwell area -- we we first moved here there were no restaurants or bars open at the weekend, a total desert, and now we have on our doorstep one of the most vibrant parts of London and some of its great eateries.  11. I love the way people really care about the Barbican, and can become a bit obsessive about it (this threat: QED). 12. I love being equidistant to every London airport.  13. I love the CPA's, porters and cleaners, who always know what's going on; caring above and beyond the call of duty for our senior residents, knocking on doors (and breaking in if necessary if someone's not seen for a while). 14. I love having the corporation as a landlord. Never any problems.  !5. I love being a citizen of London (a freeman). Well, I could go on much longer, but I'll leave it now to others to add to the list.  x", 
      "date": "2006-08-20 01:44:00", 
      "id": 4470, 
      "responses": 18, 
      "subject": "Things I love about Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2541"
    }, 
    {
      "body": "I know this has been discussed before but the posts I saw dated back to 05/06 and wondered how up to date it all was. We're looking for a hygienist and, possibly in time, a dentist too, preferably in the area but would be prepared to travel for someone really fantastic. My current dentist was great but now seems to be more interested in filling his surgery with staff under the age of 25, charging me 80 for a scrape and polish from a 22 year old who was more concerned with chatting and showing me how white her teeth were, and generally doing 'cosmetic surgery' (Botox, teeth whitening etc) than actual dentistry. There are also only so many DVDs of Friends - which you watch whilst he does your teeth - I can watch whilst I listen to water dripping (the new water feature in the surgery).  I had an horrendous experience as a child with the dentist so any recommendations would be most gratefully received.", 
      "date": "2007-03-14 21:18:00", 
      "id": 3291, 
      "responses": 15, 
      "subject": "Dentists", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3144"
    }, 
    {
      "body": "I've walked by the new restyled Barbican Centre entrance a good number of times over the past few weeks waiting for it to be finished showing how that multi million pound bundle put aside for this venture was spent. To my chagrin I've now been told that indeed the finishing touches have been put to this attempt that now seems to either have been left unfinished or the powers that be ran out of finance.        I reaize the doors open automatically, a step into modernizing, and the walkway outside has been fashioned with seemingly very expensive paving stone but to my eyes the empty, neuter and down right dull cave like walkway into the interior simply doesn't make it. I can't see how this attempt can generate a welcome to visitors or the inquisitive, sorely lacking in the past.The interior walls move to the tune of Barbican buildings in gentle silhouette recognized by residents but lost on those who are not familiar with our surroundings. I may be very wrong here but I can't believe this redesign does anything to make the Centre the magic place the powers that be want it to be.        This has been but a personal observation and hopefuly not of a contentious nature ( something I have been labeled with in the past ) but it would be interesting to know what others might think on the subject.", 
      "date": "2006-10-22 09:07:00", 
      "id": 4305, 
      "responses": 15, 
      "subject": "The new Barbican Centre entrance.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2696"
    }, 
    {
      "body": "Have just been told an extraordinary story about someone moving into the Barbie and then moving out again a few months later recently, because they found it 'too snobby'! Having moved in just over a year ago, I've found it very friendly and welcoming, so I'm puzzled by this reaction. They only moved across from near St Paul's, too, so not strangers to this part of London.", 
      "date": "2007-04-19 08:48:00", 
      "id": 4254, 
      "responses": 14, 
      "subject": "Snobby - us????", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3244"
    }, 
    {
      "body": " Hank and Dannii got off the train at Windsor and Eton Riverside station and made their way to the venerable boys school. Soon they were in the chapel, with its graceful arches and medieval wall paintings. Doesnt look too Brutalist to me, said Dannii. Surely you didnt acquire your taste for concrete while you were at Eton. Appearances, my dear, may be deceiving. You have no doubt noticed the exquisite fan vaulting above you, and probably assumed, like most casual observers, that it dates back to the time of Henry VI. Yes, you took the words right from my lips. I took the module on Perpendicular Gothic at police college. Ahh, but there is a twist in the tale, purred Hank. The fan vaulting was actually added in 1959. And what do you think is behind its stone facing? Asbestos? No  pure concrete. I was a boy here when the rotting wooden ceiling was pulled out, and this marvel of 1950s ingenuity was constructed. You see, Dannii, I became a man here  a concrete man through and through. Gradually the fog was lifting, the pieces were falling into place, and there was light at the end of the tunnel. (Unfortunately Dannii had skipped the module on Avoiding Mixed Metaphors at police college.) Hank, I have only known you for a short time, but destiny has brought us together and there must be a reason. He had been admiring the misericords in the choir but rose and turned to face her. Yes, Dannii, it doesn't take much to see that the problems of two little people don't amount to a hill of beans in this crazy world. As time goes by   No, no, no, Hank. Get a grip. There is a Brutalist secret and it is here somewhere but we just cant see it. I had a dream! The quote of the day! Martin Luther King? No, Larry Crogan on Barbicantalk FM. I dreamt about his morning show. And he said something about the playing fields of Eton.  An allegorical dream! So thats why you kept muttering theres no place like home on the train this morning. Thass wicked! Wed better get over to those playing fields straightaway. Soon enough they were watching the boys training for the Berkshire Cup. You know, Dannii, I probably learned more here than in any lessons. Wickets, beamers, rippers, dibbly-dobbly bowlers . . .  What ARE you on about? Whats any of this got to do with Brutalism? Well, a cricket match is a lot like life. Nothing happens for ages, and then it all happens at once. It doesnt do much for me, Hank. Now, darts is something I can really get my teeth into. Did I ever tell you about the Advanced Darts module at police college? Sadly not, Dannii. Look, I know a little wine bar in Windsor, where you can tell me all about it. It was getting dark when their train eventually pulled into Waterloo. As they got off the train, Dannii said to Hank, You know, Ive never been to a cricket match before. The funny thing is, cricket whites arent really white. I mean, I suppose they are white when theyre new, but they sure do attract grass stains. Its a bit of a misnomer isnt it? Theres more colour to cricket than I would have guessed. Hank sighed and changed the subject. So near and yet so far. I really thought we were going to get deeper into the heart of Brutalism today. But we travelled all that way and then just sort of hit a brick wall. Well, it has been very pleasant in any case. Lets round off the day with a walk down by the river. And so off they went towards the South Bank. TO BE CONTINUED", 
      "date": "2006-06-11 12:09:00", 
      "id": 4423, 
      "responses": 14, 
      "subject": "The Defoe 'C' Code - pars IV", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2358"
    }, 
    {
      "body": "I do hope that the fuzzy rather strange strip in our wonderful new entrance is not the work of art promised.  If so, gosh how much did it cost?  What is it?  Hopefully I'm wrong and an all singing all dancing thing will appear soon.", 
      "date": "2006-09-02 11:06:00", 
      "id": 4472, 
      "responses": 14, 
      "subject": "Work of art?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2572"
    }, 
    {
      "body": "Barely 2 hours after having placed in Andrewes 42 -59 a notice of the next EC2Gayz gathering  (on the 27th) we were shocked to discover it had been torn down. Is this a really enthusiastic member who doesn't want to miss the date, or could it be that we have a 'disgusted' in our midst? :roll: :", 
      "date": "2007-03-11 18:10:00", 
      "id": 3287, 
      "responses": 13, 
      "subject": "Homophobia in the Barbican?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3135"
    }, 
    {
      "body": "Found a couple of quotes from Peter Rees on the metropoliswest website from the 2007 Cities Conference on Urban Design, thought they might be of interest. \"The worst thing you can have in downtown is families. Families kill cities. Families are boring. What you must not do is create a downtown that is mixed-use residential. The City of London about is only one square mile, and we dont have room for everything. I would direct your attention to the fact that important things like world financial centers and world centers of nightlife are easily killed by residents. Residents move into SoHo, and the first thing they do is complain about the noise and late night activity, and you wonder why they moved in there in the first place. Now of course other cities have residents downtown, but in the heart of a world financial center, where weve renewed 50 percent of the floor space in the last 15 years, we cant afford to have NIMBYs stopping that process.", 
      "date": "2008-05-01 17:33:00", 
      "id": 3563, 
      "responses": 13, 
      "subject": "Peter Rees Quotes", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4295"
    }, 
    {
      "body": "Hi A comment on the last restaurants thread prompted this query... Can anyone recommend good take-aways that deliver here? We've been here 5 years and only got take away delivery once from 'deliverance' which was good but pricey. I really miss take-outs! No shortage of great eating spots out and about of course...but some nights you just want to stay in!! Many thanks", 
      "date": "2005-10-27 22:40:00", 
      "id": 4515, 
      "responses": 13, 
      "subject": "local take-away food?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1910"
    }, 
    {
      "body": "Has anybody had any success in trying to stop the relentless influx of unsolicited mail that we seem to get shoved through our letterboxes? I'm fully aware that the Post Office have a statutory duty to deliver anything which has the address on it (hence their legal inability to avoid delivering stuff to \"the occupier\"). But I have registered with the mail preference service and I still get unsolicited, environment-unfriendly **** put through my door. I even have a sign above my letterbox, clearly asking people to avoid giving me flyers, menus and junk mail and yet it is constantly ignored: *     The Guildhall School of Music still chuck unwanted flyers at me, begging me to attend plays I don't want to see, and concerts I don't want to listen to. *     Ken Livingstone's propaganda newspaper, sorry \"mayoral communique\" is also forced upon me, and that rag isn't even absorbent. I can just about cope with taking these unread items and putting them straight in the recycling bin but I would rather be left in peace. Its not a lot to ask. Do any fellow residents have any decent strategies to avoid these annoying environmentally-harmful intrusions? And if not, could our friendly police advise me on the legality of lying in wait for these doorsteppers and dispatching them with harsh language and a water pistol?", 
      "date": "2007-09-01 21:29:00", 
      "id": 3434, 
      "responses": 12, 
      "subject": "Junk Mail- How can I stop it?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3621"
    }, 
    {
      "body": "The language in what follows is not mine.  I have taken it straight from the back right hand side of the newly-distributed PODIUM which claims - in its stap line - to be \"From the Barbican Centre for Residents\".  It is death by a thousand cuts (taken in conjunction with all the other development works around and invading the quality of life of the Estate) and written in the kind of jargon that makes NEWSPEAK warm, cuddly and comprehensible. \"As part of the Frobisher Redevelopment works, staff on Level 6 of the Barbican Centre are required to decant to other office spaces. The majority of Level 6 staff will be moving to a temporary site in Bonhill Street and the remainder, who cannot leave the site due to the nature of their work, will be located in two modular buildings located on the Sculpture Court.\" \"The delivery of the modular buildings is currently scheduled for Sunday 18 November. The delivery is certified as an abnormal load, due to its size, therefore the Metropolitan Police will only allow this to take place overnight or on a Sunday. With the residents in mind, the Barbican Centre did want want the delivery to be overnight and therefore Sunday was chosen as the only other option.\" For those of you old enough to remember BEYOND THE FRINGE in 1961 you may already hear the cackle of Dudley Moore in the background as I continue in my best Alan Bennett (or Peter Cook or Jonathan Miller voice) because this piece of idiocy would have been fought over by all the cast as it is such a gem. \"It is necessary to close Silk Street to allow the delivery to take place; road closure will be between the hours of 9am and 6pm. The modular buildings will then be craned into the Sculpture Court.\" \"The mobile crane will arrive on Silk Street at 8am and will be set up in preparation for the first lift at 9am. Units will then be unpacked and attached to the crane which will lift the unit from Silk Street on to Level 3. Power pallet trucks will then be used to skate the units into position on the Sculpture Court.\" \"There will be a total of 14 lifts taking place throughout the day and they will take approximately five minutes each....To address the environmental issue of noise, delivery vehicles will switch off engines between arrival and departure and the crane's engine will be switched off when not in operation.\" I've checked my blood pressure. Yes....it is up.  I do not want to use bad language on this site so I will let others scream the words for me as they read this (or as they react to the PODIUM delivery through their letterboxes). The convenient fiction - and it is one the City of London and our representatives on it to go along with -  seems to be that people do not live in the Barbican Estate, not really. And - if they do - then they bugger off at the weekend. And for those who stay then \"Hey, you'll wish you hadn't.\" The interest I declare - in this posting - is that, living in a flat in Shakespeare looking out over the Sculpture Court, means that Calypso and I will have to live through the stated (and probably under-estimated)14 lifts on that Sunday and we are being treated as if we were not here and shouldn't be here.  The trouble is it makes me want to hire a mobile crane and some modular buildings and to go and spend a weekend - maybe over the Christmas/New Year period of goodwill - doing exactly this close to the people who think this is OK....but that way lies madness, war and the destruction of civilisation.  I'd better get back in my box and keep taking the tablets.", 
      "date": "2007-11-04 23:53:00", 
      "id": 4149, 
      "responses": 12, 
      "subject": "Just when you thought it was safe to sleep in", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3772"
    }, 
    {
      "body": "Ma, who's that at the door... it's Bruce, he says he's calling on you again... Why ma, that's 23 years, is he gett'n serious... I hope so, yaw'll gett'n too old to wear that white crinolyn with bows 'n all.... so we are currently looking for somewhere to have our Civil Partnership ceremony... We don't want to book a hotel etc as we shall be holding our own get together at home, but we would like a Register Office that is actually nice to go to. The Registry in Cambridge is just plain awful, where it is cramped and even the photo opportunity area is directly in-front of the loo sign. Can anyone recommend a Registry not too far away that I would be entitled to use as a resident here (if that makes any difference)?", 
      "date": "2006-06-26 10:46:00", 
      "id": 3139, 
      "responses": 11, 
      "subject": "Getting hitched", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2391"
    }, 
    {
      "body": "I've just been summoned to jury service at the City of London Coroner's Court. Does anyone know what this will involve? As far as I can tell, the Coroner's court looks at dead bodies and treasure trove.", 
      "date": "2006-04-27 14:15:00", 
      "id": 3893, 
      "responses": 11, 
      "subject": "Jury service", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2232"
    }, 
    {
      "body": "Can we discuss the option of lighting the 3 towers at night for dramtic effect?  Not sure if you have noticed but EVERY sky shot of london that has Natwest, Swiss Re, etc... has the Barbican Towers removed.  Anytime there is a news shot or a programme with an interview with a london backdrop...our council towers are not to be seen. I would like to propose that we campaign the city of london to make a feature of these. Who is in? D07", 
      "date": "2007-01-02 23:37:00", 
      "id": 4126, 
      "responses": 11, 
      "subject": "landmark!!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2875"
    }, 
    {
      "body": "For those who delight in the majestic silhouette of the Canada Goose rejoice they have arrived yet again. This time being the friendly rascals they have proven to be they picked up three more hitch hikers along the way and now number FIVE! For those who live beneath their flight path, they arrive from somewhere each morning usually from 4 A.M. onward, the day is lengthened whether we want the change or not. Five geese looking for nesting sites, places to graze, loo facilities and practicing their scales from long before daylight once again have a cross to bear.          The Corporation for years has turned it's collective back on complaints from residents but I suppose it's explained away by those who make up the committees who govern us by living far away and out of range of the problem!           Gads am I being overly critical here?    ", 
      "date": "2007-02-01 10:43:00", 
      "id": 4226, 
      "responses": 11, 
      "subject": "The blinkin geese are back!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2999"
    }, 
    {
      "body": "Horseradish, I know you and Mrs. Horseradish are manically busy refurbishing Tetiaroa  - purchased I understand from the massive proceeds of running this board - but if you have a sec. please - oh, alright, I'll beg and grovel - give Dave Whitebread and Paul Gilmour their own category in the Forum Index. Athough I don't always agree with their point of view, I think the effort they make to respond to questions and discussions posted makes them very worthy candidates for their own space. Rich.", 
      "date": "2006-09-13 20:05:00", 
      "id": 4273, 
      "responses": 11, 
      "subject": "OK ... Horseradish ... I'll beg ... !", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2598"
    }, 
    {
      "body": "Is it just that I have turned into a grumpy old man or do fellow Barbican citizens find the muzak in M&S Finsbury Pavement extremely annoying? I now refuse to shop there. Perhaps the M&S management should consider not chasing business away, particularly with the advent of Waitrose in June.  Anyone feeling similarly annoyed mught like to send an email to M&S at the following address:", 
      "date": "2006-03-10 08:33:00", 
      "id": 4630, 
      "responses": 11, 
      "subject": "M&S moan", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2124"
    }, 
    {
      "body": "There is a new charity shop in whitecross! For those of you who want to get rid of anything they get almost anything functioning and proper it is for widows I am kind of at the moment plus I was annoyed by the fact that bins of the salvation army were always full to the brim and I do not like armies in general... Open also Sats what a pleasure to clean up your wardrobe and be goood Love peace freedom Hva a look on the BANKSY on the way tehre a real pleasure the art gallery director is taking care of him...", 
      "date": "2008-01-29 15:32:00", 
      "id": 3620, 
      "responses": 10, 
      "subject": "New charity shop in whitecross", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3958"
    }, 
    {
      "body": "I was just thinking....  My friend has to do a lot of reading for work. He spends something approaching 1k a year on books. Most he reads once and then never looks at again.  Is there a sort of video rental store but for books?? It would make things a lot cheaper, plus once one person has read one, the next person can get enjoyment from it.", 
      "date": "2008-01-30 13:52:00", 
      "id": 3621, 
      "responses": 10, 
      "subject": "Massive Hook", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3963"
    }, 
    {
      "body": "I have my sister, with her husband and 2 very active boys aged 5 and 9, visiting this weekend. The boys' favourite food are lasagna and spaghetti (preferably with half left on the carpet   ).  Given my pathetic cooking skills, are there any local restaurants you can recommend? Or would you recommend a take away instead?", 
      "date": "2007-01-04 13:56:00", 
      "id": 4133, 
      "responses": 10, 
      "subject": "Restaurants suitable for young kids", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2878"
    }, 
    {
      "body": "There is   in the Ben Jonson House car park. A whole pile of several full wheely suitcases by the lift. They could be full of gold, or diamonds, or goodness knows what. Or someone has gone on holiday with their large family and forgotten all their luggage. So many possibilities.", 
      "date": "2005-10-21 15:26:00", 
      "id": 4509, 
      "responses": 10, 
      "subject": "Ben Jonson car-park treasure!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1901"
    }, 
    {
      "body": "I thought it might be amusing to complile a list of where people have spotted the Barbican sink.  I'm afraid McDonalds and Carluccios and anywhere in the Barbican don't count. I do have a trump card but like all good gamblers I will hold that up my sleeve.  My starter for 10: Love India:  Indian Restaurant on Fulham Road", 
      "date": "2005-11-25 15:03:00", 
      "id": 4547, 
      "responses": 10, 
      "subject": "Spot the Barbican Sink Competition", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1957"
    }, 
    {
      "body": "Hello there Can anyone recommend where I could take my parents for a lovely Sunday Roast when they come to visit me in a week's time?  Apart from visiting a neighbour (who's roast always smells scrumptous when it wafts down the vents!). Thanks", 
      "date": "2006-03-26 18:26:00", 
      "id": 4645, 
      "responses": 10, 
      "subject": "Where to go for a Sunday Roast?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2159"
    }, 
    {
      "body": "Having entered one of those 5k charity runs (seemed like a good idea at the time....) I am now faced with the unpleasant task of training. finding treadmills terminally dull even with the benefit of pumping tunes in my ears, i have just realised the benefits of the perimeter highwalk (including round by museum of london) as a running route. does anyone know how far this is so i can work out how many laps is the equivalent to 5k?  need to learn to pace to myself before i collapse in a beetroot-faced heap......", 
      "date": "2006-05-14 19:11:00", 
      "id": 3107, 
      "responses": 9, 
      "subject": "How long is the highwalk?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2290"
    }, 
    {
      "body": "Is anyone else having problems with Radio 4 recetion lately? I can't get a clear signal anymore thanks to the two \"urban sounds\" (pirate?) stations that are currently sandwiching it .... boo to hip hop (when I can't get Nicolas Parsons!).  In search of solution to this devastating loss (although not being able to listen to the Today program seems to be doing wonders for my blood pressure) I was thinking about going digital (DAB) and was wondering what others' experience of this is in the Barbican? Will I need to plug it in the the communal ariel, do little portable (carry round the flat) units work here?", 
      "date": "2006-08-13 13:16:00", 
      "id": 3153, 
      "responses": 9, 
      "subject": "Radio 4 reception", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2524"
    }, 
    {
      "body": "Hello. Can anyone recommend a good Christmas tree delivery service? After an unfortunate incident on a London bus last yuletide, i think Christmas tree delivery may be a safer option this year... Thanks.", 
      "date": "2006-11-25 11:29:00", 
      "id": 3227, 
      "responses": 9, 
      "subject": "Christmas Tree!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2778"
    }, 
    {
      "body": "Hey everyone I'm on big business in Vienna, the european community sure is complicated , and lets just say this place ain't no Boston! Any one got any ideas what I should see here. I'm here for a week and I've already done the Third man tour three times. Well hell the guide is cute!", 
      "date": "2007-06-20 21:11:00", 
      "id": 3477, 
      "responses": 9, 
      "subject": "Help, things to do in Vienna.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3432"
    }, 
    {
      "body": "Hello, I wanted to see if any other parents are missing not being able to take their kids to the pool at the weekend.  I have complained to the management a couple of times about reinstating a lifeguard, but they say the problem is they're not able to find a lifeguard that will only work for a couple of hours a day. I think if there's enough of us that rally around and push for it, Virgin will make more of an effort to find somebody/have to increase the wage to make it more of an attractive offer.   I know we're able to use the faciltiies at the Islington site but with all the baggage, inflatables etc. it's just another hike I want to avoid at the weekend - in the time we save we might even be able to squeeze in the luxury of a few Sunday papers. Oh the crazy, glamorous life we parents lead! Here's hoping! Best, Sam", 
      "date": "2008-03-23 14:10:00", 
      "id": 3836, 
      "responses": 9, 
      "subject": "No Lifeguard for Children at Virgin Barbican Pool", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4148"
    }, 
    {
      "body": "There's a planning application in for a new EAT sandwich bar on the corner of Aldersgate St and Long Lane (opposite the Pret a Manger and Frank Harris, if that makes sense, just down from Barbican tube). EAT is an independent sandwich chain, a pret-a-manger-a-like, but not as good, in my opinion. Chains are dull satisfaction, but I suppose we get what we go to.", 
      "date": "2008-04-16 15:36:00", 
      "id": 3996, 
      "responses": 9, 
      "subject": "new EAT on Aldersgate St", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4239"
    }, 
    {
      "body": "pinchito has opened in Featherstone St, just behind Old street  ... tapas galore and all delicious, with a wine list that does lots by the glass too ... lots of old favourites ... potatas bravas, chorizo etc etc but all very well done ... fave dish (sadly, given its also the unhealthiest) was anchovies on crisps ... now i know its ounds odd, but splendid it was ...  best sight was a table of six, four of whom were smokers... they of course had to go outside at which point their \"friends\" truly guzzled what was left of the food ...   give it a whirl", 
      "date": "2007-07-03 22:22:00", 
      "id": 4050, 
      "responses": 9, 
      "subject": "lovely new restaurant", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3469"
    }, 
    {
      "body": "How did we get rid of the geese (thank you for whoever managed that) and - in their absence - how did the clever white-breasted Mummy duck land up upside-down and dead in the water last week? Gulls? Predatory pigeons? Other ducks? Other predators? I doubt whether it was Mr and Mrs Coot or the Moorhen family. There is a lot of life and sudden death going on, Lakeside, but it is quite difficult to keep up with it....it is a bit like missing the key episode in a Soap.", 
      "date": "2007-04-15 20:57:00", 
      "id": 4390, 
      "responses": 9, 
      "subject": "LakesideLife", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3235"
    }, 
    {
      "body": "Perhaps it might be a good idea for Cityview magazine to read their article on page 8 and 9 of its August 2006 edition of Cityview, entitled \"What a Load of Rubbish\". Then perhaps refrain from sending FOUR copies of its magazine to the same household, thus generating unwanted and unnecessary printing postage and waste paper. That in turn requires a collection and re-cycle programme. Maybe they could write a follow up article entitled \"What a Waste of Time and Resorces\"? Anyone else feel the same way?  The consumer does not produce all this rubbish, they are only the last link in the chain of unwanted junk mail and un-necessary packaging. Kevin Usher", 
      "date": "2006-08-16 08:28:00", 
      "id": 4456, 
      "responses": 9, 
      "subject": "The Irony of Cityview!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2529"
    }, 
    {
      "body": "Just wondered what everyone thought of the two new London free papers that are out this week?", 
      "date": "2006-09-06 14:16:00", 
      "id": 4496, 
      "responses": 9, 
      "subject": "Battle of the London papers", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2582"
    }, 
    {
      "body": "Has anyone else noticed the Squirrel on the 2nd floor of Willoughby / Andrewes / Speed?  We often spot him (or perhaps her?) in the mornings on our 2nd floor Willoughby balcony. He has had a great time digging up and eating old bulbs and even though I don't like him trampling on my new bulb shoots he is fun to watch. Unlike the wood pigeons he is not at least eating the new shoots. When he's finished digging up our troughs he continues round into Speed. Today he put his front paws on our sliding window - he seemed to know what the door was for and wanted to come in. He seems very tame and does not mind people standing over him, inches away, when he is eating old bulbs. He is also getting very fat. Has someone been letting him in and feeding him I wonder? How did he get up to the 2nd floor balcony? I wonder if he can get down or get between the floors? Also, have you noticed the Herons? I saw one on the top of Gilbert this morning and later on my boyfriend saw two circling around. Perhaps they are spotting nesting sites in the Barbican?", 
      "date": "2006-02-14 09:41:00", 
      "id": 4590, 
      "responses": 9, 
      "subject": "Second floor Squirrel / Herons", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2074"
    }, 
    {
      "body": "I fear our list of tropical pests may be extending beyond mosquitos. Walking on the podium this morning, just where the Postern meets the ramp to JP Morgan/Pizza Express, I noticed a rather large (2 inches), brown, fat, hairy and frankly horrendous spider. If someone braver than me spots it again, perhaps they could entice it into a jar and take it off for identificaton? Or failing that, stamp on it?", 
      "date": "2007-05-01 17:14:00", 
      "id": 1391, 
      "responses": 8, 
      "subject": "Spider alert", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3291"
    }, 
    {
      "body": "Hi there, It's about time I changed my GP to a local Barbican one as I'm flying to New Zealand via Dubai and I may be arrested if the address on my prescription doesn't match my home address (that's what the Embassy just told me!). I don't fancy two months in prison like Tracy Wilkinson had to endure just for having codeine in her bloodstream or the threat of a 4 year jail term either over there.   Can anyone recommend a good, sympathetic GP around here?  Thanks!!", 
      "date": "2006-07-05 09:33:00", 
      "id": 3186, 
      "responses": 8, 
      "subject": "Can Anyone Recommend a Good GP?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2431"
    }, 
    {
      "body": "Life just gets better and better here . . . the new zebra crossing opposite the Barbican Tandoori has now opened and is getting lots of use. Much needed! And I've seen two cyclists being cautioned by police at the corner of Aldersgate and Beech Street in the last week. Hopefully the message will get round that cyclists should ride responsibly . . .  [cue the flame war]", 
      "date": "2007-01-29 22:34:00", 
      "id": 3281, 
      "responses": 8, 
      "subject": "Aldersgate zebra crossing", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2974"
    }, 
    {
      "body": "Given the current vogue to 'save the planet' (quite how it managed without our help I'll never know) I've been thinking about Double Glazing the flat. Has any one done this and are there businesses that make listed friendly units - not secondary glazing - proper double glazing units?", 
      "date": "2007-07-09 20:14:00", 
      "id": 3787, 
      "responses": 8, 
      "subject": "Double Glaze Barbican Flats", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3484"
    }, 
    {
      "body": "Hi there,  Does anyone else in Lauderdale Tower in particular use Tiscali ? We are with them and although we pay for a 2Mb service, when I recently tested the line speed (see link below) I am getting speeds of 31.70 kpbs for example which means I might as well be dialling up and not paying for broadband !    I've spent many an afternoon on the phone to New Dehli to try and solve the problem and as such have : run anti spyware, switched off the firewall (temporarily of course), moved the wireless phone AND run a defrag ; and guess what - it's no faster. Is anyone else in a similar position or know what the issue might be ? ( I did read with interest the e-mails re broadband stats but am not sure if this is directly related ?). Any thoughts greatly appreciated ! Thanks, Liz", 
      "date": "2008-04-02 13:51:00", 
      "id": 3847, 
      "responses": 8, 
      "subject": "Broadband speed - Tiscali", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4174"
    }, 
    {
      "body": "Sometimes I sit in the dead of night thinkng how terribly unfair life is when one thinks of what the government squeezes from our earnings each and every year, four months for the dastardly chancellor and what's left on the table as a tip for those who continue to labour in the fields. It all seems such a rip off when one consideres what we get in return. I try my very best to save a bit here and and a wee bit there but at the end of the day to no avail.  And then I harken back to a subject that has rumbled through my mind since first I moved to the Barbican a long time ago, the water meter or lack of same! I was told by the Corporation that for some reason that at this writing escapes me  meters can't be installed here but to compound the felony another fact arises out of the mire that I've just been made privy too...Britain has allowed itself to become the only country in Europe that does not meter it's domestic water supply!  Take a family of two here on the estate who knows full well that when their water bill arrives they will be forced to pay EXACTLY the same total as a family of five! I don't know whether the readeris at all interested in my thoughts but somehow if by a miracle each and every flat is issued a meter I would think the resident would be gob smacked when the next bill arrived. Comments?   ", 
      "date": "2006-09-23 14:52:00", 
      "id": 4265, 
      "responses": 8, 
      "subject": "Is it past time for a water meter?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2621"
    }, 
    {
      "body": "Thanks so much to whoever put the   flyers in my letterbox.  Best laugh I've had all week.  The first quote refers to it as though it is still up and running and also uses the word monolithic, second quote says it will stand the test of time etc. tee hee. But the coconut goes to Kevin McCloud who has made such a pretentious quote it deserves to be in Pseud's Corner.   Now where's that site - Knock this 20th century monstrosity down it's a dump?", 
      "date": "2006-10-25 10:11:00", 
      "id": 4308, 
      "responses": 8, 
      "subject": "Miltonic", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2700"
    }, 
    {
      "body": "What's happened to the thread posted yesterday by that TV producer who wanted to come & sort out our problems for us (poor thing)? (Or have the couple of adverse comments seen her off already?)", 
      "date": "2006-06-16 14:54:00", 
      "id": 4430, 
      "responses": 8, 
      "subject": "the missing TV programme", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2369"
    }, 
    {
      "body": "I replanted this year and have actually kept my plants alive on the balcony all summer.  But yesterday I noticed I have a problem, which wiped the smug grin off my face, my four hebes seem to have been colonized by some evil pest. Lots of the leaves are curled round into a tube arrangement and stuck together with some cobwebby silvery thread. I peeled a few open, most were empty and then horrors, a tiny green caterpillar nosed out to meet me! Do I need to spray the plants? Or do I just remove all the offending tubular caterpillar homes. Any help would be appreciated.", 
      "date": "2005-11-01 09:53:00", 
      "id": 4512, 
      "responses": 8, 
      "subject": "A gardeners question", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1917"
    }, 
    {
      "body": "How many Roads are there in the CITY? ", 
      "date": "2005-08-04 15:03:00", 
      "id": 2956, 
      "responses": 7, 
      "subject": "QUIZ", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1784"
    }, 
    {
      "body": "Anyone else saw a very brief shot just before the credits on the Locaton Location Location rental special showing a shot from Ben Jonson House over to the pub?", 
      "date": "2006-04-25 19:49:00", 
      "id": 3095, 
      "responses": 7, 
      "subject": "Phil & Kirsty", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2224"
    }, 
    {
      "body": "I am at the south end of Willoughby House...  I am vaguely aware of how plumbing systems work, but this one has me utterly baffled.  Yesterday afternoon, I noticed that my loo was flushing using hot water (hot enough to be steaming).  And no I havent been making more frequent trips to Chawol. At first I thought I was going mad but it really seems to be true.  I don't know how this could be.  I did, however, hear some plumbing work going on at some point towards the end of last week as it reverberated through the communal service ducts.  Is it possible someone somewhere has done something strange with some pipes?! Any help or suggestions greatfly appreciated!", 
      "date": "2007-09-03 11:02:00", 
      "id": 3423, 
      "responses": 7, 
      "subject": "Toilet flushing with hot water", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3627"
    }, 
    {
      "body": "When first I picked the BARBICAN LIFE magazine from my mail box some months aago I mistakenly thought it was the Association magazine that reported items and issues important to the residents on the estate, namely the BARBICAN RESIDENT. Many topics in that publication were of value since they had to do with the operating of the estate and even more importantly, at least to me, what our Association was accomplishing on our behalf.         Needless to say that isn't so. This wonderfully glossy magazine seems to be a vehicle extolling the virtues of the many eateries round about, the  dishes put before one in the neighborhood resturants, the riches of their cellar etal. The rising number of real estate groups swooping in on us picturing great values of property on the Albert Embankment and even distant Bridgewater Square. Of the number of pages in the current autumn issue, namely fifty two, there appear exactly forty seven advertisements! There are sixten full page adds and three spreads totaling six full pages! This leaves a grand total of thirty pages for editorial material much having absolutely nothing to do with resident interests.           I realize revenue from advertising keeps pubications from going bust, so be it, but does it keep the reader rivited who might be looking for what's happening about his or her ears here on the estate? Don't misunderstand I love eateries, good wine, real estate values, good old Dan Defoe's many faces but how about giving room to this Grade 2 listed spot and it's future. Let me know the Barbican Association is questioning the Corporation and their many fait accompli's slotted in our lives when we weren't looking. Comments?  ", 
      "date": "2006-10-01 14:47:00", 
      "id": 4277, 
      "responses": 7, 
      "subject": "The new Barbican Life Magazine!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2648"
    }, 
    {
      "body": "Remember the old M&S foodstore a the very top of Moorgate (the same block as the tube station entrance and next to horrible old Clintons Cards)? There's a sign on it saying that Halifax Bank of Scotland is applying for planning permission to chang the usage from retail and to develop it as a bank.  What a shame. I was hoping we'd get something more useful and necessary in the City.  I know it sounds far fetched for that particular site, but  a Muji branch wouldn't go a miss. There are so many in the West End but none at all east of Tottenham Court Road. Such a useful and interesting shop! I was hoping they would have put one in the new Paternoster Square development, but no luck there.", 
      "date": "2006-05-19 09:09:00", 
      "id": 4398, 
      "responses": 7, 
      "subject": "Empty M & S on Moorgate.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2304"
    }, 
    {
      "body": "Cycling round the City and Islington,  I have noticed vertical banners strung on lamp standards, sayin \"We are Londoners\"  These carry the info that they are sponsored by The Mayor of London and what I would call the Gas Board  but is probably called something else now-London Gas?-- What do viewers think is the thinking behind these displays?   I quite like them--I'm not complaing, but I am a little puzzled.   They're all down London Wall.     They invite satire and sarcasm, which I love, but these seem not to deserve that response.   Unless I'm missing something.", 
      "date": "2006-09-10 17:17:00", 
      "id": 4484, 
      "responses": 7, 
      "subject": "\"We are Londoners\"", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2589"
    }, 
    {
      "body": "Hi this is not some tired and trivial request for help on behalf of whichever politically-fashionable cause currently requires funding. Nor is it designed to touch the consciences of the developed world and change our bahaviour.  It is, quite simply, far more important than that. In comparison to this issue, the environment can go hang, milton court can be converted into a disco, and Crossrail can burrow through the Concert Hall. I am obviously talking about the disappearance of the Chocolate Donuts (Berliners) from Waitrose. For 2 consecutive days, there have been no donuts on the shelves. This is of vital significance and essential to my wellbeing - after a week of hard work and a weekend morning of hard rowing, I am entitled, under the Barbican Residents' Tastebud Appeasement Act, to scoff 2 chocolate donuts. Please, write to Mark Field, the Chief Exec of the John Lewis Partnership, Tony Blair, the Queen and anyone else you can think of. In fact, forget Blair and write to Prescott instead: he has the look of a man who would appreciate this catastrophe... thanks M PS Is it me, or were the chocolate fillings getting concerningly less gloopy ?", 
      "date": "2006-09-17 14:46:00", 
      "id": 4500, 
      "responses": 7, 
      "subject": "Help! Undercover are you there ?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2608"
    }, 
    {
      "body": "yay, we won the olympics! so, what does that mean for the crossrail link? is it now going to be pushed forward? are we all going to sink into the lake?", 
      "date": "2005-07-06 15:24:00", 
      "id": 4688, 
      "responses": 7, 
      "subject": "olympics and the cross-rail", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1728"
    }, 
    {
      "body": "Could anyone recommend a good, local cleaner for a neurotic? My last one shipped herself back to Poland, first class. D07", 
      "date": "2008-02-24 09:18:00", 
      "id": 1324, 
      "responses": 6, 
      "subject": "Cleaner Recommendation", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4054"
    }, 
    {
      "body": "Yesterday whilst waiting in the box office queue to book a ticket for the new Norman Wisdom film, oops I mean Daniel Craig in James Bond (he does look like Wisdom).  A woman behind me totally over reacted to being filmed by a man filming his family who were attending a graduation ceremony. He was just filming the Barbican and setting the scene but possibly because he was Asian she went bananas calling a steward over who attempted to pacify her by agreeing with her and then moaning to the box office staff.  Her point was that no one had the right to film her without asking her permission and who knew what \"they\" could do with said film splicing etc. and could \"they\" be filming the inside of the Barbican for possible future use.....?   The poor lad apologised profusely and I don't know what happened next.  I had noticed him with his video camera and merely turned my head away but she seemed to be totally paranoid, is this what the world has come to?", 
      "date": "2006-11-21 11:37:00", 
      "id": 3213, 
      "responses": 6, 
      "subject": "\"Illicit\" filming", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2766"
    }, 
    {
      "body": "well, a beautiful day outside and a new Barbican experience - the heating isn't working so I was cast back to childhood as i tiptoed on very chilly floors ... in a sweater ... usually pants only its so hot anyway, it should be fixed later today ...", 
      "date": "2006-12-09 09:33:00", 
      "id": 3309, 
      "responses": 6, 
      "subject": "brrrr - no heating", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2817"
    }, 
    {
      "body": "Hello Does anyone know of a company/someone who offers a service of putting plants/mini trees into the planters on balconies?  I tried searching this site (thought had seen some suggestions in the past) but couldn't find anything.  Some relations of mine have always done it in the past but can't this year (in case you were wondering...!) Thanks v much (ps. yes, I know, I'm lazy)", 
      "date": "2007-05-19 19:51:00", 
      "id": 3320, 
      "responses": 6, 
      "subject": "Balcony plants", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3344"
    }, 
    {
      "body": "Will our Waitrose be one of the shops piloting this packaging?  I do feel that the current packaging for milk is wasteful for its purpose - a container that would probably last a lifetime for a product consumed within a few days.", 
      "date": "2007-06-25 05:59:00", 
      "id": 3482, 
      "responses": 6, 
      "subject": "milk in a bag at Waitrose?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3442"
    }, 
    {
      "body": "Ben Jonson fire doors have been smartened up with a white plastic strip, very dinky, but THE FIRE DOORS NO LONGER CLOSE !!! Is this work in progress, powers that be, or do we start to get worried? Answers on a piece of toast, please ... ", 
      "date": "2008-05-06 09:36:00", 
      "id": 3591, 
      "responses": 6, 
      "subject": "Fire doors - slightly missing the point", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4308"
    }, 
    {
      "body": "Not the furry kind but the shop variety. I finally had the excuse to go into the lovely shop Fox by Moorgate and London Wall and it was worth the wait. Although I couldn't find everything I needed the service was brilliant and I've now got matching belt and shoes... gorgeous! If ever you find yourself with an excuse (& cash) or just curious I can certainly recommend it. Stark contrast to my encounter in Ede and Ravenscroft (Cambridge branch) last week when buying clothes for my Civil Ceremony. Having gone through the whole measuring and trying bit for 1/2 hour, the shop assistant (boring dry personality) asked what the suit was for. When I told him, it was just like the scene of the conservative lady in Little Britian, I thought he was going to ask to wash his hands! Needlessly to say I just left.", 
      "date": "2008-04-25 11:00:00", 
      "id": 3891, 
      "responses": 6, 
      "subject": "Fox", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4274"
    }, 
    {
      "body": "There's a very weird sort of skinny fox-type creature with black and brown splotches , foxshaped head and long tail, looks hairless from here, which ahs just appeared on the school site below my window. Tell me how to import a photo and I'll put one on the chat-room. Wotizzit???   [/img]", 
      "date": "2007-04-22 18:33:00", 
      "id": 4246, 
      "responses": 6, 
      "subject": "What on earth is this creature?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3259"
    }, 
    {
      "body": "We have just received from EDF Energy the annual review of our monthly direct debit payment. At the end of the year we owed 25 and it was proposed to increase our monthly direct debit by 8 - 96 in the year to come. After a lengthy freephone call, this was reduced after much haggling to an additional 5 a month - 60 a year. EDF have been overestimating our direct debits in this manner for some years and I once raised the matter with Ofgen. We now contemplate looking for another supplier and will be interested in others' experience of EDF and any other suppliers and any suggestions for an alternative supplier and problems in switching suppliers. Help!  PS. We wish the French SNCF had taken over running our railways rather than dabbling in electricity supply.", 
      "date": "2007-05-01 11:41:00", 
      "id": 4321, 
      "responses": 6, 
      "subject": "Electricity charges", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3289"
    }, 
    {
      "body": "Like the model on which it is based, this literary exercise could run on and on interminably. You are forewarned!  Professor Tom Hank Hangman was just dropping off to sleep when the phone rang. He picked it up and a voice said Come now to Bunyan Court . . . you have been chosen. Suddenly he sat up, wide awake. Could this be the signal he had been waiting for all these years? Had it finally happened? Would he soon gain admittance to that dark and hallowed place which so few had seen but of which so much had been spoken? Would someone please answer one of these questions so we can move on to the next paragraph?  There could be no doubt. The message could only mean one thing. What had been prophecied so many years ago was now within his grasp: the Hangman name had arrived at the top of the list, and tonight he would get his own baggage store on the Barbican estate.  He quickly left his flat in Defoe House and made his way to Bunyan Court. Along the way a small figure in a hoodie passed him, and whispered something. It sounded like Latin. Hangman may well have been the only Latin scholar at Oxford who had written an award-winning study of 20th-Century Brutalism, but he ignored the stranger; surely it was just one of those Spanish students from the YMCA going out to recycle his empties, and he was probably just saying hello or asking whether he had a spare euro. But there was no one else in Bunyan Court garden. He walked round and round but not a soul. Finally the hooded figure returned. Ola! Buenas noches Hangman called out. I beg your pardon? It was a womans voice, not a mans, and it was not Spanish. It sounded more North European than Mediterranean. German? Danish? Estonian? He finally placed the accent: Crouch End.  Sorry, I thought you were going to the YMCA. I am. We got a call about a disturbance there. Im WPC Brown  Dannii Brown. Im Professor  I mean, Im Hank. I was hoping to meet someone here. Wouldnt you have a bit more success over in the Shakespeare? The light is better there, too. No, no, thats not what I meant. Im not looking for a one-night stand, I am in search of something far more enduring and fulfilling  something with depth and breadth. Dannii lowered her gaze, and thought: It must be him. The Initiate. Why else would he be wandering around Bunyan Court garden at this hour, dressed in his jimjams and floppy bunny slippers? She spoke just three words: Chamberlin Powell Bon Hanks head spun round. What an extraordinary thing to say! It all started to add up: the hooded figure, the mock-Latin words, Bunyan Court at precisely 11.11 on a Tuesday evening, and Dannii spelled with two Is. She must be the Grandmaster. Now he just needed to find the right response; he concentrated his Eton-educated, Chateau-Margaux-addled brain and spoke: Alpenhorn  climb  elbow. TO BE CONTINUED", 
      "date": "2006-05-21 13:47:00", 
      "id": 4399, 
      "responses": 6, 
      "subject": "The Defoe 'C' Code", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2308"
    }, 
    {
      "body": "Newer members of this forum may wish to read earlier installments of the Parable before reading this posting:   ------------------------------------------------------------------------------------------------------------------ It had been ages since I had seen my neighbour 1179. He had finally been released from Pols Bonne Chambers, and had been signed off as fully re-educated. Never again would he even dream of replacing his original skirting boards, nor would anyone ever hear him muttering about smells emanating out of his Garchey. He was now a Barbicanite through and through, and he would adhere to the listings guidelines like a limpet to a two-ton anchor.  The Committee had even found him employment; he had been appointed into the new role of Lake Guardian, which had been created after the lakes and fountains were renovated last year. One fine morning I decided to track him down by the lakeside. Greetings, adherer, he said. And be you ever grateful for your Listing, I replied, using the Committees recommended salutation. Nice to see that youve come back from Pols Bonne Chambers. Oh yes, the Chambers were fabulous but nothing can compare with living here, right in the beating heart of Brutalism, he said. Youve found yourself a great position here as Lake Guardian. A stroke of luck, wasnt it? The Lakes are such an integral part of the original Barbican vision. If they werent here, the whole place wouldnt be so reminiscent of Venice, would it. Absolutely! And it was so clever of the conservationists to ensure that mosquitoes would now be able to breed here, just as in La Serenissima itself. Mosquitoes? But there are no mosquitoes here; havent you read the notices which have gone up in each block? Samples have been taken from the lake and there are absolutely no mosquitoe larvae. Its those insurgents again, always stirring up trouble. They are determined to undermine the Brutalist vision, and are surreptiously dropping nits onto peoples heads from one of the balconies of Shakespeare Tower. But were on to them now and will soon put a stop to this. It was so reassuring to hear 1179 speak this way. The trainers at Pols Bonne Chambers had done wonders. Here was surely a man who put the rut into Brutalism. I asked him about the rumours concerning the lake plantings. Oh yes, those silly people who say that the lake in front of the Arts Centre was never meant to be planted with two rows of greenery. Have they never seen a Brutalist waterhedge? The ignorance of these people is just staggering. I had to agree that one heard a lot of nonsense spouted by the uninformed. And the way people moan about the green slime in the lakes now. Did anyone ever say Brutalism was meant to be clean? I think there are some idiots out there who cant tell the difference between Minimalism and Brutalism. That slime has been carefully cultured to counter the antiseptic characteristics of water features in suburban developments. Whats right for Kingston is certainly NOT right for EC2. Hear, hear I said. Where have these moaners been living all their lives  on the moon? Come to think of it, the surface of the moon is actually rather Brutalist. Maybe the Almighty spent some time in Pols Bonne Chambers and got some inspiration there, halfway through the Creation. Interesting theory; worth further study. Must get going now; Im doing my weekly patrol for terracotta containers on the balconies  theyre like weeds: just when you think you are rid of them, a couple more crop up somewhere else and have to be eradicated before they spread further. Who in their right mind would think that you can put terracotta next to hammered concrete? Nice chatting to you, I said. A very good day to you, sir - and may you always be Adhering,  he said as he strolled off.", 
      "date": "2005-09-09 20:54:00", 
      "id": 2997, 
      "responses": 5, 
      "subject": "the parable of the lake", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1836"
    }, 
    {
      "body": "In perusing the many comments on BarbicanTalk I thought I'd introduce to those who on occasion pop a lowly egg into a frying pan ( naughty ) or possibly poach the rascal or whatever a most delightful addition to my cupboard and hopefully yours. Waitrose stocks a large variety of the orb, and not overpriced for those who think our new shop is only for the rich, and in choosing my dozen one day recently I hit upon a sure winner!         In opening the box to check whether any might be broken I came upon a charming description of the product written over the lady's name whose layers laid the goodies,Mrs.Mabel Pearman's Burford Browns!!           I'll impart that message if I may but not before telling the reader that never in my long life have I tasted a more delicious egg, the flavour unsurpassed I do believe. But the colour truly beautiful, not a sallow and pale little yellow thing but almost orange and reminding me of many a sundown just before the heavenly star sank into the sea out there beyond that Greek Island. Oh dear I waffel so onward if you have a moment!            \" Clarence Court Free Range Eggs are special, not only for their superior flavour and quality, but because the poulturer's attention to the health and welfare of her hens , which are free to range and forage on green pasture from dawn till dusk, leading a natural and hapy life.            Our birds enjoy a gererous helping of sun drenched maize corn in their non-GM vegitarian diet, the privacy of warm secluded nest boxes, trees and scrubs for cover, dust baths - in fact, everything that a healthy hen requires for it's freedom of expression and fullness of life, to bring you a truly Free Range Farm Egg! \"               Somehow I feel that I've done the reader a service and I shall forever be in Mrs. Peaman's debt knowing full well that a succession of Burford Browns will be popping pullets for years to come!  ", 
      "date": "2006-08-13 10:21:00", 
      "id": 3151, 
      "responses": 5, 
      "subject": "A wonderful discovery via Waitrose!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2523"
    }, 
    {
      "body": "Help! Have just sat down to write my column where i'm referring throughout to Orwell's '1984', only to find i actually don't have a copy of the book! Does anyone happen to have it that i could borrow tonight??", 
      "date": "2006-12-07 21:22:00", 
      "id": 3236, 
      "responses": 5, 
      "subject": "HELP!!!! Urgent request", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2815"
    }, 
    {
      "body": "on the way back from the Tate the other evening, with a freezing wind blowing and feeling decidely chilled, we stopped off at Terra Nostra , which is at  27 Old Bailey EC4M 7HS  City 020 3201 0077  it was really good - the sardinian bent really lifting it above the usual fairly flaccid italian restaurant moment ... lovely kind of fish platter thing to start, then sardinian pasta with sausage-y sauce, which was perfect for a cold night, even though i could feel my waist expanding markedly...  we were the only ones in there for a fair while, which was a bit weird, but the staff are great and friendly without making you feel you've got to ask them about the health of their great aunt ... anyway, worth a look", 
      "date": "2008-02-16 19:26:00", 
      "id": 3505, 
      "responses": 5, 
      "subject": "really good sardinian restaurant", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4030"
    }, 
    {
      "body": "I woke up this morning to the most lovely chirpy but tuneful birdsong outside amongst the plants in the windowboxes. It was about 5am but the sound cheered me up no end. Anyone know which birds are singing in the Barbican at this time of year? This followed ducklings running along the fire escape on Saturday so it's been quite an ornithological weekend. It's a great bonus to live in the middle of a major city with all this wildlife outside - and some wild life inside by all accounts!  ", 
      "date": "2008-03-24 05:28:00", 
      "id": 3827, 
      "responses": 5, 
      "subject": "Birdsong", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4149"
    }, 
    {
      "body": "So I know someone has answered this in the past, but I can't seem to find the answer anywhere.... We have a PC monitor, printer and keyboard which are all in perfectly good working order that we need to dispose of.  Being the tidy kiwi that I am, I am loathe to just chuck it.   Does anyone know of an organisation that will collect (preferably free) to recycle such items?  I seemed to remember reading somewhere that there is that operates within the Barbican - maybe I'm just being hopeful then... Any suggestions welcome as I am sick of seeing them on our floor!", 
      "date": "2007-03-29 17:11:00", 
      "id": 3828, 
      "responses": 5, 
      "subject": "Computer disposal", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3188"
    }, 
    {
      "body": "It's gone. Around 12.45pm today a massive crane and hordes of men in fluorescent jackets finalized the deed. It's a sad day for the Barbican Estate and its residents. Also an unhappy portent of the shape of things to come PS Is it really \"JP Morgan Chase Bear\" now? Perhaps they have a sense of humour after all. Even better if it could emulate that immortal Shakespearean stage direction in the \"The Winter's Tale\":- [Exit pursued by a Bear] If only......................... ", 
      "date": "2008-04-11 14:07:00", 
      "id": 3867, 
      "responses": 5, 
      "subject": "Silk Street Bridge - R.I.P.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4224"
    }, 
    {
      "body": "Nothing new about getting rid of it? Where is he committee? Thanks for any info if there is any... Any idea to attract the attention of the media? Maybe attraction of the media bathing naked in the lakes... ...physique du role gone and...  ....scared of bacteria, green stuff...bleah!", 
      "date": "2007-11-29 16:34:00", 
      "id": 4169, 
      "responses": 5, 
      "subject": "garchey the revenge...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3822"
    }, 
    {
      "body": "Sorry I feel as if I am taking over Barbicantalk recently! I was just wondering, does anybody know whether you can lay lino over underfloor heating, or does it crack? Can anybody reccommend some nice (easy to lay!)  flooring that could go over underfloor heating?", 
      "date": "2007-04-12 20:47:00", 
      "id": 4377, 
      "responses": 5, 
      "subject": "Lino on underfloor heating?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3225"
    }, 
    {
      "body": " Professor Hank Hangman repeated himself: Alpenhorn  climb  elbow. \"Sorry love, wrong anagram. Have another go, said WPC Dannii Brown. Hank tried again: lets see, an anagram for Chamberlin, Powell, Bon. Bunyan Court. Garden. Lake. What swims in a lake. Who re-did the Barbican lakes. Who paid for it. Got it! How noblemen bill carp Well done, my little Hanky. You are worthy. Untold secrets of the Barbican past, present and future will be revealed to you (albeit in the most obtuse and improbable ways). Hank fell to the ground, and kissed the brick paving of the Upper Podium: what more could I ask for? Brutalism de-mystified, a dishy WPC who is actually a grandmaster, and Waitrose opening  truly, we are bless-ed! He asked, What message do you bare?, or rather What message do you bear? What a loser, Dannii thought, and said Come with me.  They headed east. But soon their path was blocked. A hideous apparition stood before them. Ugly beyond words, silent as the grave. They halted.  Good lord, that Barbican Exhibition Hall walkway is an eyesore Hank said. They made their way round it, entered the Arts Centre, and left it on level 2 by Searcys. Soon they were crossing the bridge under Gilbert House. Danni pulled Hanks sleeve. Look there, in front of St Giles Cripplegate. Is it truly amazing? Err . . . yes, well Ive always thought St Giles was lovely, said Hank. But its not a-Mazing, is it? Where is the labyrinth? Hank thought back to a discussion on barbicantalk a couple of years ago. Yes, there were plans to create a labyrinth on the forecourt of the church. But they never came to anything. Dannii was getting impatient. There is no labyrinth, because they didnt want us to know the truth. They thought we would solve the puzzle and the secret would be out. What secret? The secret that, should it ever be told, would change the lives of every single Barbican resident, and indeed cause the history books of our time to be re-written. Brutalism is not what it appears to be. Just stop right there, Dannii, I wrote the book on Brutalism. Hank, Hank, Hank  you went to Eton, right (I got full marks in the Accent Placement module at police college)? Perhaps thats a good place to start looking for the secret. TO BE CONTINUED", 
      "date": "2006-05-29 07:26:00", 
      "id": 4406, 
      "responses": 5, 
      "subject": "Defoe 'C' Code - Pars II", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2325"
    }, 
    {
      "body": " Click.  oooooooooooooooooooooooooooooooooooooooooooooooooooooooooo oooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo oooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo ood . . .  . . .  nnnnnnnnnnnnnnnnnn!!!!!!!!!  Its Larry Crogan here on Barbicantalk FM, and its a fine morning. Early morning drizzle will clear up and leave us with lovely grey skies for the rest of the day. Its a busy day here on the Barbican Estate, and here are some activities to look out for. Professor Hank Hangman looked around his bedroom in Defoe House. Was it already time to get up? What strange dreams he had had. A WPC named Dannii, a foreign accent, whispers in the darkness, a gentle tug on his sleeve and then  . . .  he could still feel a tingle of excitement as he remembered how his fingertips had caressed those sinuous curves, so inviting and yet curiously unyielding. Yes, nothing could beat Frobisher Crescent for sheer sensuousness. After hed said goodbye to Dannii, he had partaken of a few delicious moments there, conducting his own fingertip search of its hammered concrete.  Crogan droned on: At 11am the ducks, pigeons and geese around the lake will be fed pieces of bread. At 11.15 the Dont Feed the Birds group will meet to count the signatures on their petition. Garchey Lovers meet at noon in Willoughby, and Garchey Haters meet at noon as well - but at a safe distance, in Lauderdale Tower. Then at 4pm theres a workshop on how to set up your Freeview box and video recorder with the cable TV system. Get there early folks, as this one is bound to fill up. And bring a sandwich as this workshop lasts three hours. The lines are ringing already, so lets take our first call. Puzzled in the Postern, you are now talking live on Barbicantalk FM. Could someone please tell me why there is a stop in the Beech Street Tunnel for bus 153 when it is going eastwards, but theres no longer a stop in the tunnel for the bus on its westward journey? Well, people! Now thats a topic that will run and run. Dont be shy; pick up the phone and call us now on Barbicantalk FM. In the meantime, heres the quote of the day. Its from the Duke of Wellington: The battle of Waterloo was won on the playing fields of Eton. Hank sat up with a jolt. He was meant to be going to Eton today with Dannii. Click. Its 7am on Tuesday the 30th of May, and you are listening to Today on BBC Radio Two . . .  Professor Hank Hangman looked around his bedroom in Defoe House. What a bizarre dream he had had, all about a radio station called Barbicantalk FM. And people with the strangest things on their minds.  Whatever it had all meant, he did know one thing: he would never buy another Robin Williams video, even if they were going very cheap at the St Giles book fair. TO BE CONTINUED", 
      "date": "2006-06-04 07:24:00", 
      "id": 4411, 
      "responses": 5, 
      "subject": "The Defoe 'C' Code - pars III", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2334"
    }, 
    {
      "body": "A ghostly female form was spotted in St Giles Churchyard at 9.30 this evening, feeding the geese. Who are you, ghostly lady - and please, no more encouragement to the geese.", 
      "date": "2006-04-05 21:16:00", 
      "id": 4647, 
      "responses": 5, 
      "subject": "Feeding the geese", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2176"
    }, 
    {
      "body": "I was very disappointed to see that the Barbican no longer figures in the top 10 of Britain's ugliest buildings (according to a popular vote tken as part of Channel 4's Demolition programme). Is the British public taking a shine to Brutalism or were we just edged out by the new Scottish parliament? Either way, I'm very concerned at our new found popularity, it's  making me feel like a conformist. Time to move to Park Hill, Sheffield?", 
      "date": "2005-12-12 22:32:00", 
      "id": 3017, 
      "responses": 4, 
      "subject": "ugly buildings", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1986"
    }, 
    {
      "body": "What a day it had been for WPC Dannii Brown and Professor Tom Hank Hangman. His alarm clock had gone off in the middle of a dream which seemed to have a hidden meaning, and the two of them had taken the train to Eton in search of Brutalisms deepest secret, only to find mock-Gothic fan vaulting and a group of boys playing cricket. It was all so . . . undramatic.  Now they were having a stroll along Londons South Bank. Evening had come, and people were rushing about purposefully.  Its rather like the Barbican here, isnt it? said Hank. A cluster of world-class arts venues in the heart of the city, so convenient for people to drop into after a long days work. Dannii nodded. Yes, but there seems to be something missing. Whats that? Well, everyone is just headed towards their destination. No one is hesitating or asking for directions. Everything is arranged in a line along the river, theres decent signage, and NO ONE IS GETTING LOST. The Thames pathway curved towards the National Theatre, and Hank stopped in his tracks. Thats absolutely disgusting. Sir Denys Lasdun must be rolling in his grave. How can this desecration be allowed? Dannii followed his gaze towards the theatre, which was a lovely purplish colour tinged with green on one edge. What do you mean? Its those obscene lights which are bathing the concrete in colour. Everyone knows that Brutalist buildings were meant to be the colour of raw concrete. Dont they have any respect for Lasduns vision? Get a grip, Hank. Look, lets call it a day, shall we?  The next day Hank decided to descend to the bowels of Defoe House and see the baggage store he had recently been allocated. It was fairly gloomy down there, but he spotted what looked like an abandoned kitchen cabinet in the corner. He recognized it as a bit of one of the original Barbican kitchens  which are said to be the very first fitted kitchens in the UK. Shame that someone has painted it red  almost the colour of Waitrose morello cherry preserve, in fact  otherwise Id bring it over to the salvage store and it could be put to good use. Perhaps the paint will come off easily.  He scratched away with his fingernail but the paint didnt flake at all. He looked closer; it was almost as if the cabinet had been finished in red rather than the obligatory white. He opened the door, and on the inside of the frame there was a number: 0 0 1 2 3 5. There was a further number but it wasnt legible.  Hank went back upstairs and called Dannii. Theres something odd over here, Dannii, and I need you to exercise your investigative powers. He told her about the cabinet. Thats so frustrating, Hank. Im sure that number means something. You are the worlds foremost expert on Brutalism, so perhaps the meaning is buried in your subconscious. Was there something in that dream yesterday which you havent mentioned? Well, it all seemed rather nonsensical. Barbicantalk, Eton, Garchey, feeding the birds. Hold on, there was something about the Beech Street Tunnel, too. Lets meet up there and see if it will jog your memory, Dannii said. A few minutes later they were at the entrance to the tunnel, near Holmes Place. 0 0 1 2 3 5 . . . and then one more number. Ive got it! said Dannii. Me too! Its the Fibonacci Sequence. If you study the beige panels along this side of the tunnel, youll see that they occur in a mathematical pattern. Its deliberate! No, silly. Thats too obscure. Its the Pirelli Sequence  the tire marks going down the tunnel, and how many metres apart they are. At police college we learned how to track down stolen cars that way. Lets see where they lead! Off they went through the tunnel, down Silk Street, right round the Barbican and across London Wall until they came to the Guildhall Library. Yes, yes of course. The numbers must refer to a document in the reserve collection, said Hank. They went inside and approached the librarians desk. We are looking for a document from the 1950s, relating to the Barbican. The reference number is 001235 but we arent sure about the last number. The librarian slowly looked up. I have been waiting for you, grandmaster and acolyte. I will bring you the file. Please sit at that table behind the bookcase and let no one see you. After what seemed like an eternity, the librarian brought them an old-fashioned box file. Hank wiped off the dust and read the label: Deliberations of the Surface Rendering Committee, Barbican Estate.  He opened it quickly and the sheets inside fell across the table, light as air. Hank, what material did they use for these documents? Its so light, and almost transparent, and has this amazing texture? Is it papyrus, or vellum, or parchment? No, Dannii, its far more exotic than any of those. These are carbon copies. Its what people used before they had photocopiers or PDFs. Hank scanned through the documents. Its all about a struggle . . . between the Brutalists and . . . a kind of breakaway sect . . . the Reform Brutalists . . . theres testimony here from Chamberlin, Powell and Bon which Ive never seen before: And so, Mr Chamberlin, could you please tell this committee what colour you have chosen for Willoughby House? The hammered concrete shall be rendered entirely in chartreuse, my lords. And Andrewes House? Mr Powell spoke up. Ooooh, we rather fancied a kind of mauve, something a little heavier than a Mountbatten pink. And Lambert Jones Mews? Now it was Mr Bons turn. Viridian green. Definitely viridian. This is a fine Brutalist colour. I dont hold with that Reform Brutalist concept of unpainted concrete.  Hank slumped back into his chair. Ive always wondered why the railings in the Barbican are different colours; why not just an innocuous brown which would blend in so much better? The railings were the last survivors of the Brutalist creed. Yes, Hank, the Reform Brutalists triumph back in 1957 was all but complete. For us true Brutalists, the railings were all we could hold on to. Ive been wanting to tell you since I met you, but first I had to know whether your heart was true. Its all falling into place now, said Hank. The cricket whites at Eton  stained that vivid green. The National Theatre lit up all those colours at night. The kitchen cabinet the colour of morello cherry preserve   Yes, Waitrose will only sell that item to initiates who know to ask. For all these years, Ive followed false gods. Brutalism isnt about unadorned concrete. Its about COLOUR, great swathes of rich pigment which should be bathing every nook and cranny of our beloved estate. Im ruined; every lecture Ive given, every paper Ive published, Ill have to retract them all, every last one. Cheer up, Hank. Now that you know the truth, Im sure youll be able to re-invent yourself. Yes, Ill find a niche somewhere. Ive got it  Ill offer myself to Farrow & Ball as a consultant, and well launch the Brutalist Colour Collection. Well make a fortune!", 
      "date": "2006-06-25 17:23:00", 
      "id": 3123, 
      "responses": 4, 
      "subject": "The Defoe 'C' Code - pars ultima", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2389"
    }, 
    {
      "body": "i've just picked up a a Walking guide\" to the Barbican ... its ok - some nice pictures - there's a crap map in the middle of it all and if you live in BJ or Bunyan or Bryer or John Trundle you won't find yourself ... but anyway, my favourite line is :  so although i've bagged myself a triplex worth ? (make that ? +++ because Frank Harris says there's a surge a-commin) I will zip off to work this morning nspired by the knowledge that I still have many years of corporate struggle ahead of me before i can finally say \"Reader, I'm done...\"   ", 
      "date": "2006-08-18 07:48:00", 
      "id": 3158, 
      "responses": 4, 
      "subject": "Discover the Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2534"
    }, 
    {
      "body": "Six more ducklings sitting on the lake... And if one more seagull should fancy a bite size snack There'll be five more ducklings sitting on the lake etc until they are all gone! Maybe the ducks could offer to clean up the goose poo in return for protection of the ducklings?", 
      "date": "2006-06-28 19:55:00", 
      "id": 3174, 
      "responses": 4, 
      "subject": "Ducklingicide", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2410"
    }, 
    {
      "body": "Not sure if this is a \"secret\" or not, but it seems the Falcons (jnr) have returned to the Bbcan. We seem to see them quite regularly and it appears to be part of their hunting ground. Anyone with a chihuahua be warned!!!!!", 
      "date": "2006-11-01 13:59:00", 
      "id": 3205, 
      "responses": 4, 
      "subject": "Birds...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2713"
    }, 
    {
      "body": "I seem to have thrown away everything except my card for the Association membership, but I thought that it entitled you to a 10% discount at the Waterside Cafe.  I very rarely go there but did today and the girl at the counter was dismissive of the card (\"what ess zeeiss?\"  in a non-specific European accent) then saying \"only orange ones\" presumably meaning the Barbican card for the theatre etc.  I was ready just to pay up but suddenly she gave a shrug of the shoulders and applied a discount.   Anyway, what's the story on discounts - the website does not see to mention it.", 
      "date": "2007-10-19 12:57:00", 
      "id": 3456, 
      "responses": 4, 
      "subject": "Barbican Association Discounts?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3734"
    }, 
    {
      "body": "just a warning - we got home last night to bunyan at about midnight ... I always look at my bike in the bike cage as i walk to the lift (not sure why... ) and last night it wasn't there ... but no sign of forced entry into the cage, the bike was securely locked etc etc ... so someone with a key is obviously taking time to smash the bike locks and nicking bikes ...  I know in the great scheme of world poverty, war and the demolition of milton court this isn't that important, but I am really ******* angry about it  so check your bikes basically and avoid the kind of blood pressure bursts I'm getting whenever i think about it", 
      "date": "2008-01-20 11:55:00", 
      "id": 3560, 
      "responses": 4, 
      "subject": "bike theft", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3938"
    }, 
    {
      "body": "Did anybody manage to see the three amazing rainbows towards the east? Absolutely gorgeous.", 
      "date": "2008-04-12 15:49:00", 
      "id": 3879, 
      "responses": 4, 
      "subject": "Rainbows", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4230"
    }, 
    {
      "body": "With the hope that summer might be on the way (and in fact first sunshine of the weekend seems to have just arrived) I am trying to find a very simple sail awning for my balcony.  however all the ones i have researched online are way too big, and even Habitat's version is too wide to fit. has anyone come across anything that works for Barbie balcony (I am top floor lowrise with L-shaped balcony) thanks", 
      "date": "2008-04-20 13:54:00", 
      "id": 3881, 
      "responses": 4, 
      "subject": "Balcony shade", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4253"
    }, 
    {
      "body": "I'm not if this is too specific a topic for this forum, but I was wondering what other Shakespeare Tower residents were thinking about the lobby refurbishment.  I haven't a clue what it's supposed to look like when it's done. I'm liking what I am seeing so far, but I worry it's not going to have as much class as the Lauderdale lobby.", 
      "date": "2007-01-31 22:31:00", 
      "id": 4213, 
      "responses": 4, 
      "subject": "Shakespeare Tower Lobby Refurb", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2998"
    }, 
    {
      "body": "Am I the only person to be surprised about the results of the Garchey Survey? I was expecting the Garchey to be firmly voted down across the Estate, but have just seen the results posted on our notice board in TMH. There was a narrow win (52%) for retaining the Garchey system.  Full figures - for retention 52%, for removal 46%, 2% don't know. Number of responses - 841 [about 40 per cent of all properties]. Given all the strong and vigorous criticism of the Garchey by some people, I was expecting the vote to go the other way.  It will be interesting to hear about the implications for the next few years........", 
      "date": "2006-10-05 23:04:00", 
      "id": 4282, 
      "responses": 4, 
      "subject": "Garchey Survey", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2661"
    }, 
    {
      "body": "Anyone interested in the campaign to save Milton Court should check out   , about which I received a flyer last week (surprised no-one has posted to complain about such unsolicited missives disturbing the order of their letterboxes)", 
      "date": "2006-10-14 21:03:00", 
      "id": 4292, 
      "responses": 4, 
      "subject": "Milton Court website", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2679"
    }, 
    {
      "body": "I have just returned from PC World on Chiswell Street. The level of service compared to previous visits in the last 10 years was concerning: *   I was helped quickly and efficiently by a polite member of staff who knew what he was on about and didn't patronise me. *   He even came charging up while I was queuing to pay to show me a cheaper substitute than the item I had (I had specified cheap was important). *   They had a wide selection of items on sale, many reduced to silly cheap prices. *   The checkouts were over-manned and I was able to pay with the minimum of fuss. *   Not once was I ignored, patronised or allowed to hear a conversation about who boned who at the office party. *   All the staff looked and sounded cheerful and happy. I have to say I find this all quite disturbing. 10 years I've been going there and I've always managed to have a whinge afterwards.", 
      "date": "2007-05-04 14:25:00", 
      "id": 4329, 
      "responses": 4, 
      "subject": "PC World Service...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3303"
    }, 
    {
      "body": "Am I imagining things or are the police doing motorbike patrols on the Podium? I thought I caught sight of one the other night but I couldn't quite make it out. I keep imagining I can hear motorbikes on the Podium but I don't know if it is just sound reflected from Beech Street tunnel - is there a problem of lost pizza delivery bikes or something of the sort?? Confused & puzzled ", 
      "date": "2006-09-13 15:24:00", 
      "id": 4488, 
      "responses": 4, 
      "subject": "Police motorbike patrols??", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2597"
    }, 
    {
      "body": "after a long wait I am the proud renter of a baggage store in defoe ... [but john trundle would be easier if anyone wants to swap] being new to them, I wondered if stuff like paper / cardboard files etc is ok down there or do they get damp?  and could i safely store summer / winter clothes there out of season? i'm mentally scarred by the cellar of my former victorian house where cardboard mulched within three minutes, so any advice gratefully received ...  thanks", 
      "date": "2006-03-21 19:49:00", 
      "id": 4628, 
      "responses": 4, 
      "subject": "baggage stores", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2149"
    }, 
    {
      "body": "The other night at about 11 pm a tuneful bird was singing its heart out in Speed House Garden.  Any experts on birdsong hear this.  Was it a nightingale - or perhaps an insomniac blackbird?", 
      "date": "2006-03-10 13:32:00", 
      "id": 4629, 
      "responses": 4, 
      "subject": "Night birdsong", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2126"
    }, 
    {
      "body": "Not particularly Barbican related, but an amusing story about NTL customer service:", 
      "date": "2005-06-08 15:50:00", 
      "id": 4737, 
      "responses": 4, 
      "subject": "NTL Customer Service", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1673"
    }, 
    {
      "body": "That's television, rather than transvestite by the way.  Anyone know a decent technician who would install and set up a new dvd to my telly. I know this must sound feeble to all of you who know what you are talking about on the massive posting about our new television system, but my expertise lies in other directions.", 
      "date": "2005-07-28 12:55:00", 
      "id": 2947, 
      "responses": 3, 
      "subject": "TV technician", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1766"
    }, 
    {
      "body": "i'm not sure if its my imagination but i think the water is slowly but surely draining out of the pond under bryer ... is there some work going on or are we seeing the first radical signs of water conservation?   i know there are so many other things to think about but i'm worried about the frog spawn ...", 
      "date": "2006-04-12 07:20:00", 
      "id": 3070, 
      "responses": 3, 
      "subject": "bryer pond", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2196"
    }, 
    {
      "body": "Now look folks I hate to disturb your revelry but I simply must introduce a terribly serious note to this post. After some 15,000 episodes of that earth shaking and sometimes stomach churning radio drama the Archers the writers, dastardly folk that they have become, are considering introducing adultry into our living rooms, for shame and a sharp intake of breath! It seems Ruth is considering leaving her ever loving husband to have an affair with Sam the blinking herdsman! Don't know whether it's going to take place up in the chill hills or will they trapes into town to a four star hotel? Only time will tell. Will Radio 4 ever be the same again I ask! Seven P.M. to the unitiated!  ", 
      "date": "2006-11-07 18:17:00", 
      "id": 3202, 
      "responses": 3, 
      "subject": "Whither the Archers!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2737"
    }, 
    {
      "body": "I was talking to a friend of mine who lives in a large block of flats in Hammersmith and the subject of service charges arose.  When I told him what my service charges were, and that Barbican residents tended to complain about service charge levels he fell about laughing - his were around 4 x higher than mine - admittedly for a larger flat.  And his was an all freehold block run by a management company controlled by the residents themselves.  Anyway his charges were around 6,000 a year, which perhaps puts into perspective some of the bleats about high service charges in the Barbican.  They did get heating and hot water within their charges, but no gardens, no daily rubbish collection and no general back-up which we seem to be able to get from the Estate office.  Just thought I would make that point to this forum.  Personally I feel we do pretty well - and no I don't work for the City of London!", 
      "date": "2006-11-30 23:34:00", 
      "id": 3228, 
      "responses": 3, 
      "subject": "Service charges", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2793"
    }, 
    {
      "body": "OK, I suppose it should probably go in the other thread but being that more people read this one, I'm posting here.  Currently the Switched On London festival is on [url]www.switchedonlondon.com/index.htm[/url] Despite my constant moaning about light pollution in The City this looks rather cool, and definitely worth a stroll one evening. Anyone been yet? [/url]", 
      "date": "2007-02-15 14:47:00", 
      "id": 3261, 
      "responses": 3, 
      "subject": "Switched on?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3060"
    }, 
    {
      "body": "The strangest thing happened on the podium on Saturday evening. My husband and were standing chatting on the podium when a woman jogger dressed in leopard skin barged between us, knocked me and carried straight on with out so much as a word. Is was so strange and rude that I'm now wondering if it was so bizarre part of the installation- she seemed to be running along the yellow line.  EIther that or there is a rude jogger on the podium.", 
      "date": "2007-06-05 10:14:00", 
      "id": 3338, 
      "responses": 3, 
      "subject": "Err... is it art?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3394"
    }, 
    {
      "body": "merry christmas to you all! hope you have had a good day with which receieved nice new goods!  i also wish you all a great new year! hope you don't get too much of a hangover on new years day,lol!  so what did you all get from santa then?...", 
      "date": "2006-12-25 22:44:00", 
      "id": 3375, 
      "responses": 3, 
      "subject": "merri xmas", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2859"
    }, 
    {
      "body": "Is it me or is it since the roof works that we have had more flooding in our palaces? I believe that since the roof works and the water drainage system being \"redirected\" on the 6th floor balconies, we are getting flooded every time. Who would like to support my campaign for a real architect and building firm (not a bunch of lads off a boat from Gdansk) to look at the works, along with English Heritage to see if it can be rectified? ..and if I hear from our Estate office that it is to do with Global Warming or Al Gore from I might slap someone. D07", 
      "date": "2007-07-22 23:21:00", 
      "id": 3385, 
      "responses": 3, 
      "subject": "Ben Jonson Campaign", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3530"
    }, 
    {
      "body": "Would a kind neighbour please be willing to help me retune my tv which seems, inexplicably, to have detuned itself today?  I'm not getting any channels either on digital or analogue.  I've been staring at the setup guide for the last hour and I may as well be reading Martian.  I know I'm being a big girlie about it and should be able to manage without the telly but I'm stuck at home not too well AND my computer has a trojan (someone coming to sort that one out later), so I'm now feeling a bit sorry for myself as well as very inept. If there's anyone in or near Andrewes House that would be happy to accept money or a nice bottle of wine or two to tune in my tv, I would be so grateful.  Please call me on 07775 570208 as I won't have access to my computer later once the trojan expert arrives.  Thank you very much.", 
      "date": "2007-10-31 16:03:00", 
      "id": 3461, 
      "responses": 3, 
      "subject": "help please!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3756"
    }, 
    {
      "body": "Can anyone explain please the mushrooming of deodorant blocks along the corridors in BJH and by the lifts? Ive never noticed a problem, so why are we getting these little white pong-pods? How does it help to have us breathing in cheap scented chemicals? As an asthmatic, Id like to know. Answers on a kipper, please . . .", 
      "date": "2007-11-23 10:28:00", 
      "id": 3491, 
      "responses": 3, 
      "subject": "Ben Jonson stinks - it's official!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3812"
    }, 
    {
      "body": "Hi - washer in one of my taps finally went on Saturday am (couldn't turn the said tap off. All a bit worrying!). Wanted to share 2 positive experiences with you all: 1. Car Park attendant - was able to lend me a hammer & a very big adjustable spanner (I only possess a small electrical screw-driver. Not much use in the circumstances!) 2. The hardware shop just past the YMCA is great! Having removed the tap (with the big spanner) I took it along to buy a new washer. One of the guys there removed the old washer (easy) and fitted the new one for me (v hard - had to use a vice + big spanner as the small nut holding the washer on was siezed), whilst the other discussed Mexico with me (his wife is apparently Mexican). It could be that they knew I was a complete novice (reminding me that I should use PTFE tape in refitting the tap & seeing the look on my face probably gave the game away!) Very strong recommendation for both of above! Taps now a speciality. Oh - and the cost? 50 pence!!!", 
      "date": "2008-04-06 16:22:00", 
      "id": 3849, 
      "responses": 3, 
      "subject": "Bryer Car Park Attendant & our local hardware shop", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4194"
    }, 
    {
      "body": "Hi - just back from long trip abroad, at sea. Does anyone know what has happened to the tenants in Andrewes House - you know the ones, very friendly, all young ladies, but very experienced and professional. Been banging away all day but no real joy. Think they had some colleagues in Seddon - but no answer there either.  They may have moved to another block, unfortunately I only have their first names (I really miss Kandi and Cindi - they are twins) so any help would be much appreciated.", 
      "date": "2008-04-16 20:05:00", 
      "id": 3873, 
      "responses": 3, 
      "subject": "FEELING ANXIOUS", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4241"
    }, 
    {
      "body": "I was surprised on Sunday afternoon to look out of the window and see a fox on the path outside, looking at me - TM garden.  It looked quite young and loped leisurely across the garden to the jungle that is Lambert Jones and was last seen heading for the swings.  Have we had a fox for some time and I've only just noticed?  I'm not known for my powers of observation.  As long as a hunt doesn't come crashing in, in pursuit!", 
      "date": "2006-12-27 11:28:00", 
      "id": 4119, 
      "responses": 3, 
      "subject": "Urban fox", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2860"
    }, 
    {
      "body": "I would like to switch from EDF to a 'greener' electricity supplier - could anyone recommend such an energy supplier who has experience of the Barbican (and the whereabouts of its meters) . Not quite ready to live off grid in a yurt yet but every little helps....", 
      "date": "2007-11-10 23:52:00", 
      "id": 4151, 
      "responses": 3, 
      "subject": "green electricity supplier ??", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3783"
    }, 
    {
      "body": "For me, there are three main reasons for wishing to live in the Barbican 1/ Walk to work (and to South Bank, West End etc) 2/ Pedestrian only 3/ The Barbican Centre on your doorstep We go to The Barbican Centre a lot: pretty much it's the main arts venue in London we go to regularly. I was wondering how often Barbican residents make use of this wonderful venue. Look forward to your responses! What sort of events do you go to, and what have you been to recently?", 
      "date": "2006-10-02 09:23:00", 
      "id": 4276, 
      "responses": 3, 
      "subject": "How often do you attend cultural events at The Barbican?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2649"
    }, 
    {
      "body": "did anyone see the london paper (the purple one) earlier this week advocating the barbican as a good place to go and skate?!", 
      "date": "2007-05-10 20:48:00", 
      "id": 4339, 
      "responses": 3, 
      "subject": "LondonPaper - sk8ers", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3318"
    }, 
    {
      "body": "Hi everyone, firstly thank you  for all your kind words and advice on redecorating my appartment  I'm having to put those plans on hold for the time being though. On another note, can anyone recommend the best place to advertise for  a live-in house keeper?", 
      "date": "2007-04-01 16:31:00", 
      "id": 4359, 
      "responses": 3, 
      "subject": "Housekeeper", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3195"
    }, 
    {
      "body": "I am astonished to read on p26 of Barbican News that Frobisher Crescent is to be considered for conversion to residential accommodation but that \"No element of affordable ......housing will be included within the Barbican Estate\". I know what they mean, but a better way of expressing it may have been appropriate!", 
      "date": "2006-06-03 11:48:00", 
      "id": 4412, 
      "responses": 3, 
      "subject": "Frobisher Crescent", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2332"
    }, 
    {
      "body": "Having watched Gangster Number 1 on Film 4 last night, I am interested to know which of the towers did they use to film in and did they use a studio or was that a genuine tower flat interior that was used?", 
      "date": "2006-08-31 08:09:00", 
      "id": 4462, 
      "responses": 3, 
      "subject": "Barbican on film", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2565"
    }, 
    {
      "body": "I was just sitting down listening to a play on radio 4 when i noticed a young boy, perhaps mid teens, wearing a baseball cap and big puffer jacket race down the stairs from Defoe house to Lauderdale place. I'm on the ground floor and clearly he didn't expect anyone to be watching. He run down the flight of stairs by Lambert Jones mews - which is the fire exit for the store rooms i think. I was a bit suspicious and i peered out of my window, and after a few minutes he emerged back up from the stair case by Lambert Jones mews - this made me think that he'd been hiding down there. he raced off and i opened my window and jumped out (like i said, i'm on the ground floor!) and gave chase across Lauderdale Place. I half expected him to have a totally legitimate reason for his behaviour, but instead he pelted it up Goswell Road and i gave up and returned to my flat, as my window was still wide open.  Did anyone else see anything suspicious? Perhaps the radio 4 play has made me unnecessarily paranoid - it was about cops and robbers!", 
      "date": "2006-03-03 21:40:00", 
      "id": 4557, 
      "responses": 3, 
      "subject": "suspicious boy", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2110"
    }, 
    {
      "body": "Whilst flicking through Barbican Life magazine I noticed that Spice Corner in the Barbican Association page was misspelt as Spice World and some poor person had crossed it out and handwritten 'Corner'. Was there one person who went through every magazine and did this? The mind boggles.", 
      "date": "2005-06-17 16:20:00", 
      "id": 4666, 
      "responses": 3, 
      "subject": "Spice Corner in Barbican Life magazine", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1693"
    }, 
    {
      "body": "Anyone going to the \"No Wax\" event at the Barbican? I know we're quite a tech savvy bunch so expect lots of i-Whores shaking their funky thangs and jiggling their funky wheels. So go on, do it. And if you're going to, what's your bag baby.  Parrrrrrrrrrrrrp", 
      "date": "2005-04-21 00:22:00", 
      "id": 2917, 
      "responses": 2, 
      "subject": "Mo' no wax", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1580"
    }, 
    {
      "body": "in the spirit of summer joy, and now that it feels like autumn and i for one am much happier, i thought I would mention that the abseiling window cleaners came recently ... and my windows were spotless... i know this is a tale of no consequence but as we rage about the garchey, and the Ymca, and pink striped geraniums, and children's parties with enough equipment to launch a space ship, I thought some unalloyed good news might be welcome ...  I now have a perfect view of the YMCA in complete darkness - like someone has come along and removed a bit of the planet and forgot to replace it ...   gosh ... now i'm fantasising ...", 
      "date": "2006-08-03 22:51:00", 
      "id": 3136, 
      "responses": 2, 
      "subject": "window cleaning", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2505"
    }, 
    {
      "body": "On Friday the cashier at M&S told me I was entiltled to a free bottle of Cava as i'd spent over 35 on food shopping. I was astonished when checking my receipt yesterday to find she'd charged me 4-99 for the said bottle!  I must start checking my receipts more carefully at the time. It's difficult with 4 bags of shopping and a queue behind you.", 
      "date": "2006-07-02 09:17:00", 
      "id": 3176, 
      "responses": 2, 
      "subject": "M&S \"Free\" Cava!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2422"
    }, 
    {
      "body": "I've been reading Barbican Talk for the last couple of years since somebody at work put me on to it.  It was during a period  where there was a lot of contact between the residents and Perry Ridley one of the P.O. managers. I work for the Post Office that delivers to the Barbican ( although thankfully I'm not one of your \"delivery officers.\") That's too much hard work. I've found the site both entertaining and informative. Carry on the good work.", 
      "date": "2006-11-04 19:47:00", 
      "id": 3193, 
      "responses": 2, 
      "subject": "New Member", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2727"
    }, 
    {
      "body": "Sorry to bother again. I want to set up my own company ( Tuscan real estate) so I need a website I need to learn how to make one.I know nothing about web design so I need a course for beginners but I quite like design and computers so I learn fast... Where can I learn? Any suggested course? I prefer to attend lessons than an internet course, possibly the best and cheapest.. I ask too much these days..I know...Thank you in advance! Ta ta PS In Tuscany is freezing..bbrrrr", 
      "date": "2006-12-12 18:11:00", 
      "id": 3313, 
      "responses": 2, 
      "subject": "web design?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2827"
    }, 
    {
      "body": "It's a long shot, but in the quest for caffeine, here goes... Does anyone, by any change this late at night, happen to have a spare paper coffee filter for a perculator - size 1/4 - that i could have? Just relalised to my mortification that i've run out, and am faced with a night of work without any coffee. Have just run to Tescos and they don't sell them - only some funny pod-things for a machine i don't have. Thanks!", 
      "date": "2007-06-12 22:15:00", 
      "id": 3344, 
      "responses": 2, 
      "subject": "Coffee filters", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3417"
    }, 
    {
      "body": "So there I was after watching Madonna's performance at the Live Earth concert from the comfort of my Mountjoy apartment last Saturday, vowing to never leave any electrical item on stand-by ever again, when I close my curtains to try and shut out every bit of light coming from all the office buildings that we're surrounded by.  What's the point in trying to make a difference in order to prevent global warming when all the office buildings around us can happily leave all their lights on 24/7? I don't know if anyone feels the same way, but I'd love to have more darkness outside at night time, so we can occasionally forget we're in the heart of a big city.", 
      "date": "2007-07-09 13:12:00", 
      "id": 3484, 
      "responses": 2, 
      "subject": "Light Pollution after Live Earth Campaign", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3483"
    }, 
    {
      "body": "Hello!  I understand wanting to repair an electrical device in today's climate is rather unusual, but I've got a rather internet radio bedside clock that I'd like to have fixed. I'm pretty sure it's just a loose connection so it should be a relatively simple job. Anyone know of a local repairs shop? Thanks.", 
      "date": "2008-02-19 14:12:00", 
      "id": 3508, 
      "responses": 2, 
      "subject": "Electrical repairs nearby?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4039"
    }, 
    {
      "body": "Did anyone see tonight's episode of Dr Who? Looked like a scene was shot in the Barbican Conservatory...", 
      "date": "2008-05-10 20:12:00", 
      "id": 3584, 
      "responses": 2, 
      "subject": "Dr Who in the Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4326"
    }, 
    {
      "body": "I have an old small B&O TV Beovision MX1500 from the 80s that anyone may have but... recently it developed a fault: the colours are gone and I could get only BBC1. It may be somethgn small or something major. I offered it to the V&A for their 20th century furniture display and they almost took it but then decided that the model was not 'distinctive' enough. Hate to throw it away and would like to find an appreciative home for it. Can email a picture (it is not in the Barbican at the moment). PLease note I am off for a long weekend, back Sunday night 18/5. Liz", 
      "date": "2008-05-15 10:54:00", 
      "id": 3585, 
      "responses": 2, 
      "subject": "DIY on B&O TV?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4343"
    }, 
    {
      "body": "as our environment around us changes rapidly, somewhat closer to home, does anyone else think the portacabins on the sculpture court are an absolute disgrace?   I know I'm a delicate bloom, but I was genuinely shocked", 
      "date": "2008-01-29 20:17:00", 
      "id": 3618, 
      "responses": 2, 
      "subject": "sculpture jim, but not as we know it", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3961"
    }, 
    {
      "body": "There seems to be someone on the podium serenading the east end of Ben Jonson on a trumpet. For the last half hour. Mainly doing scales. Has anyone else been disturbed by this? It started around midnight and was amusing at first, but now its stopping me sleeping and I have work to do tomorrow, so I have been a real killjoy and alerted our local bobbies who are apparently sending someone to ask them to put a sock in it...", 
      "date": "2008-04-04 23:34:00", 
      "id": 3846, 
      "responses": 2, 
      "subject": "trumpet involuntary", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4191"
    }, 
    {
      "body": "Whilst you are all banging on about the signage on the doorways to our homes someone has merrily placed three giant ashtray bins just beyond the Pizza restaurant - presumably to serve J P Morgan employees et al? This is a 'substantially enclosed area' so are the city turning a blind eye due to London's importance as a financial centre / fear of another exit to Canary Wharf or are JPM just paying the fines as fringe benefit?  Clearly snitching on the freephone number is an option but the politicians tell me that's not the British way.  So stiff upper lips all round!", 
      "date": "2007-07-19 19:35:00", 
      "id": 4049, 
      "responses": 2, 
      "subject": "Smoking whilst Rome burns", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3513"
    }, 
    {
      "body": "I wonder if the complete absence of litter bins on the podium, except for those in the Speed House andd Defore gardens, bothers anyone? There are times that litter accumulates to such a degree that I yearn for that long gone receptical that at one time was seen round about and many time full to overflowing.        I realize our litter bins were removed about the time the IRA were using both litter bins and post boxes to house their explosives in their dastardly campaign in England. But since the troubles, and the long awaited answer to the final solution, things have taken a turn for the better I would assume the recepticals might effect a long awaited return.         I've inquired, of the Corporation on a number of occasions, when   might the bins again appear and on each instance came the reply ' we are in the process of perfecting a bomb proof litter bin '!!! Remembering the year of my first inquiry, 1998 I believe, finding the material and answer to this problem seems so far to escaped their search.          Very possibly I won't have the pleasure of seeing the bins in my lifetime but I hope for those who follow me here on the Estate litter hopefully will if not be a thing of the past at least will be lessened. Am I asking too much and are there any comments out there?", 
      "date": "2007-01-14 13:12:00", 
      "id": 4139, 
      "responses": 2, 
      "subject": "The long absent litter bin!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2905"
    }, 
    {
      "body": "I live in Lauderdale Tower and I seem to remember that the Barbican (or the Towers at least) have been plumbed in for Sky TV. Is this right, or have I gone completely mad?  Can anyone advise me as to how I go about subscribing to the service if it is available. Five terresrial channels just isn't entertaining me anymore...", 
      "date": "2007-01-16 09:45:00", 
      "id": 4140, 
      "responses": 2, 
      "subject": "Sky/cable TV", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2919"
    }, 
    {
      "body": "Hi I've finally got around to convincing myself that I need a new laptop (mine is 7 years old) and would appreciate any advice on where to go to arrange for it to be installed.  I'm planning to buy a wireless router and printer too.  I suppose I will also need to transfer what's on my existing laptop to my new one (just a few photos and some music). I imagine that it would be pretty easy for someone who knows what they are doing, but I don't so I know it would be a disaster if I tried myself! In an ideal world, it would be a company that could come this Saturday as have bought myself a fancy new iphone but my old laptop is too rubbish to support it (needs USB 2 apparently) so it is just sitting there feeling sorry for itself at the moment... I have tried doing a google search and searched this forum but not had any success.  PC World can't do it this Saturday unfortunately (they are also quite pricey). Thanks very much in advance for any assistance.  And merry christmas! Matt", 
      "date": "2007-12-17 13:27:00", 
      "id": 4179, 
      "responses": 2, 
      "subject": "Setting up laptop/wireless", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3877"
    }, 
    {
      "body": "Hello everyone, We're just moving from Thomas More to Mountjoy House, and wanted to paint the apartment with Farrow and Ball colours. I popped into Leylands on Farringdon Road on the way back from F&B, and the guy there said F&B's paint is really hard to keep clean, it shows up dirt and fingerprints sooner than any other paint. While this may be good from Crime Scene Investigation point of view ,it may not work in the Barbican. He kindly gave me a free litre of Leyland paint to match the F&B colour, so that I could see for myself that their Leyland paint would be much better (even though it's half the price), but as F&B charge a 15% handling free for any unopened returns, I thought it best to ask the forum, in case anyone's used it in the Barbican. Is F&B really a no-no for a modern building like ours with large windows letting lots of light (and dirt) in, does it really only suit dark Dickensian settings?  Please someone say they've used it and loved it, as I've just bought gone and 20 litres of the stuff   PS apologies for the overuse of question marks in the title, just an effort to make the subject matter more interesting  ", 
      "date": "2007-03-23 18:35:00", 
      "id": 4244, 
      "responses": 2, 
      "subject": "Farrow and Ball in the Barbican?????", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3177"
    }, 
    {
      "body": "Way back in 1990s I move into ECx as it was close to my work - how much joy I had then when I was seven (yes 7) minutes door to door. There wasn't much around here then - fluid was the only bar and the italian on the corner was the only restaurant but even then the bug had started to bite... after that relationship fell though I rented in whitecross street then (briefly and badly) went to pimlico. After that in '03 into BJ house. Gloomy (east side) but spacious and close to the supermarket. And 65m2 is not to be sniffed at - and I did make it very nice. But now it's in my blood. There is nowhere else in London I want to live; *hams don't do it for me, mayfair is too dull & expensive, whitechappel is too edgy.  I think I've found home. I've moved now from my slightly dark flat in BJ to a little studio in JT and it's wonderful! The light, the big windows. The Barbican was an exceptional piece of '60s / '70s architecture.  When I come in from the east on the train after visting a friend I see so many bleak blocks of badness; some old and plenty new. Small mean windows and cheap construction. Now, just now 30/40 years later the Barbican kitchens are fading... that's a long time compared to the new brick boxes! I feel so at home here - curiously my current JT rented studio is directly opposite the flat I had when I first moved into ECx.  In spite of the influx of clicky heels on a Friday, it still feels good. And the best thing is... there are more blocks to discover! I've only done two so far  :-) B", 
      "date": "2007-04-26 22:05:00", 
      "id": 4256, 
      "responses": 2, 
      "subject": "I genuinely can't think of anywhere else I'd rather live", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3274"
    }, 
    {
      "body": "First of all, please forgive me - I am not actually a resident of the area, but I'm sure all you Barbican inhabitants may be able to answer my question, which is.. Why has the Barbican become so madly popular recently? I have always considered it on and off, and just a month or two ago nearly every estate agent in town had a vast choice of different Barbican properties, but now there is literally not a single property available, and in a tower block with a view... forget it.  It was always the case for years that there were consistently many Barbican properties available, but now they've all gone.  I saw in another thread that someone recommended calling the estate agent on the day they release details of a new sale, and they're quite right!  This has become like trying to buy a property in Primrose Hill! Prices have skyrocketed too, there is currently a tower block apartment for 700,000 (under offer), whilst this time last year tower apartments were about 550,000 with the desirable views, and much less (400k region) with the north (and west?) aspect.  There was a penthouse in one of the tower blocks that sat on the market for about 3 years, but recently it appears that two newly for sale penthouses in tower blocks have been snapped up in about a month. Are you (Barbican residents) noticing more people in the area? Has anything specific brought about these changes, or are people finally opening their eyes to how magnificant the Barbican estate actually is?  Are the original generation of Barbican dwellers (who perhaps have a second home too, out of London) starting to sell up and move out?   Whatever it is, i'm rather annoyed now!", 
      "date": "2006-06-10 12:40:00", 
      "id": 4416, 
      "responses": 2, 
      "subject": "Current mad popularity of Barbican...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2354"
    }, 
    {
      "body": "Anyone know what the event is happening in Fore Street this lunchtime? It's all quite exciting -  Darth Vader, Stormtroopers, the Lord Mayor (of London, not a galaxy far far away) and scores of schoolkids.  Lots of fun but what's it about? It's all a lot nicer than writing a report which is what I'm supposed to be doing ", 
      "date": "2006-06-23 12:17:00", 
      "id": 4433, 
      "responses": 2, 
      "subject": "The force is with us", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2387"
    }, 
    {
      "body": "Anyone in a duplex have a novel and non life threatning way to change the lightbulb in the ceiling above the stairs? ", 
      "date": "2006-04-05 08:07:00", 
      "id": 4650, 
      "responses": 2, 
      "subject": "How many residents does it take to change a lightbulb?...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2173"
    }, 
    {
      "body": "Anyone become a Freeman of the City of London? I'm thinking of applying and was wondering how difficult it was.", 
      "date": "2005-04-13 13:43:00", 
      "id": 2907, 
      "responses": 1, 
      "subject": "Free at last....", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1559"
    }, 
    {
      "body": "Jay Bird. Now I've got your attention... Has anyone else noticed the really beautiful Jay Bird(s) that is frequenting the Barbican lately. I never saw anything as nice when I lived outside of London, so I feel its even more amazing to see it here. It is obviously a bit more canny than the other birds as it has mastered my pigeon proof peanut feeder.", 
      "date": "2005-08-31 07:57:00", 
      "id": 2991, 
      "responses": 1, 
      "subject": "Naked as a...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1824"
    }, 
    {
      "body": "Andrewes House pond-side, the nasty Canadian geese have produced 6 of the fluffiest goslings ever. Worth a look.  I'll be watching the ducks to see if they exact revenge on the little ones.", 
      "date": "2006-05-11 08:46:00", 
      "id": 3101, 
      "responses": 1, 
      "subject": "Canadian goslings", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2282"
    }, 
    {
      "body": "I am deeply disppointed to see the waitrose thread disappearing down the screen - after such a record breaking run could it be that everyone is now bored with the topic.  Never in such a short time has a supermarket caused such a rumpous.  So to all Waitrose fans /detractors - here's the chance for a whole new thread (or a great big raspberry for flogging a dead horse !!!!)", 
      "date": "2006-07-06 22:03:00", 
      "id": 3181, 
      "responses": 1, 
      "subject": "Waitrose ..... again", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2435"
    }, 
    {
      "body": "I'm a bit thick when it come to things like this, so perhaps this is a really obvious GCSE-level plumbing question but... i've noticed that over the past few weeks, the hot water tap in my bathroom has been making a funny whistling sound when it's turned on - like a pressure sort of noise. When it's turned on full blast, the noice disappears. What does this mean? and how can i fix it, as it's quite annoying at times, especially as it's begun to drown out the wonderful sounds of me singing in the shower...", 
      "date": "2006-11-07 21:58:00", 
      "id": 3200, 
      "responses": 1, 
      "subject": "Hot water noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2739"
    }, 
    {
      "body": "I see we have another three day foodie market starting in Whitecross Street tomorrow. I hope there's more than just a lot of posh bread and jam this time (O.K. and one organic butcher and one fish stall).", 
      "date": "2006-12-06 09:41:00", 
      "id": 3233, 
      "responses": 1, 
      "subject": "Whitecross Street Xmas Market", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2808"
    }, 
    {
      "body": "Went into the new Parker McMillan place that's opened in place of Boudoir on Chiswell St   Seemed a very low key place, very pleasant female Jazz vocalist was on, seems unlikely to be the short of place that will be turfing out loads of rowdy late night revellers Surprised that its appearance hasn't raised the usual paranoid threads", 
      "date": "2006-07-13 12:26:00", 
      "id": 3241, 
      "responses": 1, 
      "subject": "Boudoir Returns???", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2451"
    }, 
    {
      "body": "Hello,  I know this is very short notice, but is there any friendly soul out there who could lend me a UK road atlas for a week (until next Sunday)?  We are leaving this evening (around 6pm) to South Yorkshire, and throughout the week will have to drive to places that will be pretty difficult to find. A friend who was going to lend us his road atlas has just phoned to tell us that actually he cannot find it. Ahhhh!  I know it's very short notice - and judging from people's bad experiences (see thread on \"conman operating...\" ) I doubt that anyone would want to part with a road map....but IF you can help, PLEASE send a PM, or phone me on 07910587878 (Dani).  Thanks so much!!  Dani", 
      "date": "2007-03-04 12:01:00", 
      "id": 3266, 
      "responses": 1, 
      "subject": "HELP uk road atlas", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3101"
    }, 
    {
      "body": " rather than .co.uk ", 
      "date": "2007-03-06 13:30:00", 
      "id": 3276, 
      "responses": 1, 
      "subject": "Not a million miles apart?     try this..........", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3110"
    }, 
    {
      "body": "As I remember, when the Girls School was getting permission to replace the grass on their playing surface with a synthetic all-weather surface, one of the blandishments tossed up to nearby residents was that the planting around the field would be renovated. There's a strip of planters along the southern edge, and a larger, wilder section above the playing surface on the northern side (with numerous lost tennis balls amongst the wild flowers and shrubbery).  I can't see that any new landscaping has happened, especially on the planters on the southern side. I realize that I should be asking the CoL School about this, but before I do, I wonder if anyone has any inside news, or better ideas? (ps: Tuesday nights seems to be football night for a bunch of large hairy men, who play seven a side football on the all weather surface. I've no problem with that, but I'm surprised that a girl's school can furnish a team for a competition like that).", 
      "date": "2008-05-06 21:15:00", 
      "id": 3570, 
      "responses": 1, 
      "subject": "Gardening around CoL Girls School all weather play surface", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4312"
    }, 
    {
      "body": "Music, Bob Dylan, wafting on the breeze. Does anyone know where it's coming from? Shakespeare Tower? The times they are a changing indeed.", 
      "date": "2007-07-19 20:10:00", 
      "id": 4047, 
      "responses": 1, 
      "subject": "Noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3519"
    }, 
    {
      "body": "Gosh aren't I lucky just heard that Thomas More House and me in particular have been chosen as one of the \"few\" places/people in the whole of London to be chosen to take part in their draw and apparently I am already at stage three without knowing anything about it.  How do these people get addresses and do they think we are all daft?  Any other specal people out there in Barbican land?", 
      "date": "2006-12-29 12:24:00", 
      "id": 4120, 
      "responses": 1, 
      "subject": "Readers' Digest Draw", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2864"
    }, 
    {
      "body": "This morning I found the remains of a blackbird on our Speed House balcony - mostly feathers, with just enough legs, beak and guts to make it sticky. Is this likely to be the work of a seagull, or perhaps we have another bird of prey on the estate, or do we have a phantom cat stalking the balconies after dark?", 
      "date": "2007-12-20 09:11:00", 
      "id": 4182, 
      "responses": 1, 
      "subject": "Look what I found on the balcony....", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3880"
    }, 
    {
      "body": "sorry if this sounds like a stupid question,what are ward members? and what do they do? ", 
      "date": "2006-05-23 13:38:00", 
      "id": 4242, 
      "responses": 1, 
      "subject": "ward members", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2312"
    }, 
    {
      "body": "I'm moving flats again within the barbican at the end of the month & wonder if anyone can recommend a cleaner for a one off clean (unfurnished at one flat) at both ends. I did this myself last time & was worn out! Thanks", 
      "date": "2007-04-25 14:03:00", 
      "id": 4255, 
      "responses": 1, 
      "subject": "One off clean", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3271"
    }, 
    {
      "body": "Anyone else in on this Friday evening may be interested to see one of Harry Enfield/Paul Whitehouse's latest creations is '70s throwback the Barbican man'...... 9.30 BBC1 (and then watch the phenomenal Peep Show later on.....)", 
      "date": "2007-04-27 19:54:00", 
      "id": 4258, 
      "responses": 1, 
      "subject": "Barbican Man alive and well.....", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3276"
    }, 
    {
      "body": "Anyone for a pelican in the barbican? ", 
      "date": "2006-10-25 13:22:00", 
      "id": 4300, 
      "responses": 1, 
      "subject": "Pigeons again...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2701"
    }, 
    {
      "body": "I've just come back from a weekend away only to find that the pigeons have eaten all the radishes and beetroots on my balcony. What I would like to know is how do city pigeons know anything about vegetable plots or do they have country retreats too!", 
      "date": "2007-05-08 10:14:00", 
      "id": 4331, 
      "responses": 1, 
      "subject": "City Slicker Pigeons", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3311"
    }, 
    {
      "body": "I just posted the 15,000 topic", 
      "date": "2007-04-10 11:52:00", 
      "id": 4368, 
      "responses": 1, 
      "subject": "15000th", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3215"
    }, 
    {
      "body": "The following April 1 notice was put up in a Speed House lift but I am not sure it circulated much wider and I think it deserves to be preserved for posterity.   Pigeon control on the Barbican estate  Measures to reduce the numbers of wild pigeons on the Barbican Estate are proving successful with the introduction of pigeon pie in the Waterside caf. The weekly visits from the Harris hawk are ensuring that the pigeons are fully race-fit and the pies have now been authorised as low-fat by the Cripplegate healthy eating society.  To ensure a plentiful supply of pigeons we ask that if residents find a nest on their balcony, you keep your personal noise to a minimum.  We have been assured by Barbican engineers that the recent noises from running barbican fire alarm tests at the weekend, drilling for oil in Milton Court on unloading trucks at all hours are collectively and statistically less intrusive than the noise residents make playing Radio 3 at low volume with the windows closed.  Please respect your wildlife neighbours and please wear soft slippers indoors at all times. Feeding the pigeons is OK - but Waitrose only please. We have had some younger birds gagging on Somerfield tit-bits and remember  no fast food. If you want pigeon Foie Gras  Harrods can deliver a rather nice hamper of foods to stuff your pigeons with.  We do not recommend stuffing by force (gavage)  sp please just ask your birds politely to eat as much as they can.", 
      "date": "2007-04-12 00:06:00", 
      "id": 4372, 
      "responses": 1, 
      "subject": "Pigeon control on the Barbican estate", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3222"
    }, 
    {
      "body": "don't know if anyone experienced similar strange happenings with the water system last night....  at around 11pm the cold water in my bathrooms was extremely hot, to the point of boiling! also the water flushing the loo was piping hot (judged by steam, rather than hand down loo before you ask....) couldn't work out what was going on but then as mysteriously as it had come on, the water grew colder til back to normal", 
      "date": "2006-05-25 13:03:00", 
      "id": 4396, 
      "responses": 1, 
      "subject": "Weird goings on with water", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2316"
    }, 
    {
      "body": "Mail hysterics - or plausible downside for those living here where energy efficiency doesn't come to mind as a prime virtue of the Barbican eco-system?  \"Homeowners who refuse to alter their houses and flats to conserve more heat and power face higher council tax bills, ministers revealed. They plan to encourage town halls to jack up bills for the least energy efficient homes in the name of tackling climate change. A link between council taxes and energy efficiency is on the way after the controversial system of home sellers' information packs comes into force next summer, officials confirmed. Councils will be able to check the green credentials of houses and flats from details contained in 'energy performance certificates' which will be a compulsory element of every information pack.  [etc etc ad nause, ad inf.]", 
      "date": "2006-09-23 22:15:00", 
      "id": 4503, 
      "responses": 1, 
      "subject": "Low energy efficiency = higher council tax bills?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2623"
    }, 
    {
      "body": "Our local authority has been rebranded. The Court of Common Council has voted to rename the Corporation of London - from Jan 3 2006 it will be known as the 'City of London'. Apparently this makes the Corporation more recognizable and more relevant on the global stage - I'm sure we're all glad to hear that the costs of this rebranding will be minimized by a gradual phase in!", 
      "date": "2005-11-11 23:41:00", 
      "id": 4523, 
      "responses": 1, 
      "subject": "Sayonara Corporation of London", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1931"
    }, 
    {
      "body": "Whilst waiting for a bus outside the Barbican Music shop yesterday I couldn't help noticing how dangerous the corner immediately outside our lovely new Barbican Centre entrance is.  Vans were parked on both sides of the corner in spite of double yellow lines.  Taxis etc. were hurling themselves round the vans and the corner even though they couldn't see where they were going or more to the point what was coming the other way.  It seems like a nasty accident waiting to happen, would red lines help?  Other than that a large first aid box for the Barbican reception staff?", 
      "date": "2006-10-04 09:37:00", 
      "id": 5040, 
      "responses": 1, 
      "subject": "Dangerous corner", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=2652"
    }, 
    {
      "body": "I'd love to say it's a heatwave, but it's not...... Friday 20/07/2007 \"The risk of disruption across the London area is assessed as 60%.  20-30mm of rain looks likely, generally over much of the area in the 36 hours up to midday Saturday.   60-90mm is possible in some areas although, as the warning indicates, there is some doubt about where the highest amounts of rainfall will occur.  At this stage, parts of London must be considered to be in the firing line for some of these higher totals.  With regard to timings, the rain currently looks likely to reach London in the early hours of Friday but it could be Friday evening before the heaviest rain clears northwards.  Thereafter, there is a risk of further outbreaks of rain as another band moves back across the region during the day on Saturday.     There are considerable doubts about the detail of this though.   \" Should anyone notice signs of Summer, please contact Barbicantalk immediately.", 
      "date": "2007-07-18 11:26:00", 
      "id": 5350, 
      "responses": 1, 
      "subject": "Severe Weather Friday 20/07", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=3506"
    }
  ]
}