{
  "summary": [
    {
      "body": "Anyone else saw a very brief shot just before the credits on the Locaton Location Location rental special showing a shot from Ben Jonson House over to the pub?", 
      "date": "2006-04-25 19:49:00", 
      "id": 3095, 
      "sentiment": 1, 
      "subject": "Phil & Kirsty", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2224"
    }, 
    {
      "body": "Nick Cohen in the Standrd has had a cliched jibe at the Barbican tonight.  I think we should mail in to protest. To quote: \"I went to the Museum of London .....  but spent as much time gawping at the Barbican complex ....   Nothing, not the doomed attempts of the residents to prettify the blocks with window boxes nore the late june sun, could make the brutalist towers look like anything other than an East German Housing project. Because it is in the centre of London and has a nice arts centre  attached, its flats still sell for 350k.  But it will take only one propoerty crash for the Barbican to meet its destiny and become what it was designed to be: a sink estate for the upper-middle class.\" Grrrrrrrrrrrrr............... Letters to   including daytime number, name and address !!!!!", 
      "date": "2006-06-28 21:16:00", 
      "id": 3173, 
      "sentiment": 1, 
      "subject": "Bad press for the Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2411"
    }, 
    {
      "body": "Just to let you know that the colour centrefold in the Guardian today is a view of the Barbican in honour of the 25th anniversary.", 
      "date": "2007-03-06 15:24:00", 
      "id": 3301, 
      "sentiment": 1, 
      "subject": "Barbican picture in the Guardian", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3112"
    }, 
    {
      "body": "The BBC are running an online vote on the future of Milton Court.", 
      "date": "2007-06-25 14:43:00", 
      "id": 3360, 
      "sentiment": 1, 
      "subject": "Eyesore or gem: Milton Court?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3445"
    }, 
    {
      "body": "This evening's 'The Nature of Britain' programme includes filming which took place last year of the raising of ducklings on the Barbican Estate.  It's on at 9.00 on BBC1 (recording number 4453 if you want to record it).", 
      "date": "2007-10-24 14:16:00", 
      "id": 3470, 
      "sentiment": 1, 
      "subject": "This evening's 'The Nature of Britain' - Barbican ducklings", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3745"
    }
  ]
}