{
  "summary": [
    {
      "body": "I was very disappointed to see that the Barbican no longer figures in the top 10 of Britain's ugliest buildings (according to a popular vote tken as part of Channel 4's Demolition programme). Is the British public taking a shine to Brutalism or were we just edged out by the new Scottish parliament? Either way, I'm very concerned at our new found popularity, it's  making me feel like a conformist. Time to move to Park Hill, Sheffield?", 
      "date": "2005-12-12 22:32:00", 
      "id": 3017, 
      "sentiment": 2, 
      "subject": "ugly buildings", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1986"
    }, 
    {
      "body": "Hi The Observer are interested in doing a feature on designery flats in the barbican (and their owners), to flag up the Barbican tours taking place during the London Architecture Biennale in June. If your flat is ready for its close up then do send some snaps of  it to    the PR company for the biennale by next Tuesday 2nd May. For more info on the events during the festival check out   tickets go on sale in a week.", 
      "date": "2006-04-28 12:20:00", 
      "id": 3071, 
      "sentiment": 2, 
      "subject": "observer article on barbie flats", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2235"
    }, 
    {
      "body": "i may have missed this elsewhere, so it might be old news, but I was intrigued in yesterday's observer to see that the Terry Farrell re-development of the far side of Smithfield incorporates the potential to re-locate both the Museum of London and the Barbican Arts Centre ...  doesn't strike me as realistic but stranger things have happened ...", 
      "date": "2007-11-05 09:03:00", 
      "id": 3465, 
      "sentiment": 2, 
      "subject": "arts centre move?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3773"
    }, 
    {
      "body": "I was hearing this morning on the radio about various difficulties people have had getting Energy Performance Certificates done for the Home Information Packs that are now required when buying/selling a house. That made me wonder how the Barbican rated in energy efficiency terms. Would anyone who has seen a Barbican EPC be prepared to divulge what it said? I'm not a buyer/seller, but curious to see how it works nonetheless  and to see if the Barbie is energy efficient of course.  The government's website describes the EPC like this: 'Each rating is based on the performance of the building itself and its services (such as heating and lighting), rather than the domestic appliances within it. This is known as an asset rating. The certificate also lists the potential rating of the building if all the cost-effective measures were installed. The ratings will vary according to the age, location, size and condition of the building. The potential rating on the certificate will take these factors into account, and the suggested measures will be tailored so that they are realistic for the particular building.'", 
      "date": "2008-01-03 13:18:00", 
      "id": 3546, 
      "sentiment": 2, 
      "subject": "HIPS and Energy Performance Certificate", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3903"
    }, 
    {
      "body": "I saw an Islington Gazette A board yesterday with the announcement that Barbican Residents have scored a big victory. What's that about then?", 
      "date": "2008-05-20 09:57:00", 
      "id": 3600, 
      "sentiment": 2, 
      "subject": "Islington Gazette", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4359"
    }
  ]
}