{
  "summary": [
    {
      "body": "My brother in law called me up tonight to tell me a team from the Barbican was on University Challenge competing against one from the Society for the Preservation of Ancient Buildings.  However, i missed the start and would like to write a news item on this for Barbican Life.  Can anyone who may have watched, or happens to know, whether the Barbican team was drawn from the staff of the Barbican Centre, or from residents?  I also only managed to pick up the team's surnames - can anyone supply me with their forenames too? Thanks", 
      "date": "2005-08-15 20:14:00", 
      "id": 2971, 
      "sentiment": 3, 
      "subject": "University Challenge", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1809"
    }, 
    {
      "body": "has anyone spotted the ad for the new observer format?  it includes lovely shots of the barbican... so not only is it the best sunday paper by miles but is also the most tasteful  ", 
      "date": "2006-01-06 23:28:00", 
      "id": 3024, 
      "sentiment": 3, 
      "subject": "lovely ad", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2020"
    }, 
    {
      "body": "Hi there, I write a regular feature for Time Out Magazine called Homes with History which focuses on architecturally striking homes in London with a fascinating heritage. I am very keen to  feature a flat in the Barbican, ideally one with panoramic views though I am interested in hearing from anyone who might like to be interviewed. The piece would require a short interview and a couple of pictures with a resident within their property and we could arrange it to all take place on the same day. The interview usually takes about 45 minutes and the photographs an hour or so. It would be great to arrange something for this week so that the feature could run around Aug 16. Is this something that would interest you? If so please do get in contact:   07956 872 694.", 
      "date": "2006-08-01 10:32:00", 
      "id": 3131, 
      "sentiment": 3, 
      "subject": "Barbican flat for Time Out", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2497"
    }, 
    {
      "body": "Hello everyone I just wanted to inform you that there's a page on living in the Barbican in Time Out this week. It's a good read!", 
      "date": "2006-08-18 10:42:00", 
      "id": 3159, 
      "sentiment": 3, 
      "subject": "Barbican featured in Time Out", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2536"
    }, 
    {
      "body": "For those of you that like to spot local landmarks on Television, Ashes to Ashes, the sequel to Life on Mars, looks like it will be a gem of a series. The first episode tonight featured a drive down London Wall - under Alban Gate towards Moorgate, and a nice sequence of the Audi Quattro driving through the Barbican Tunnel. I thought Life on Mars was the highlight of previous years on TV and it looks like Ashes to Ashes should repeat the formula, but with local landmarks as an added plus.", 
      "date": "2008-02-07 23:05:00", 
      "id": 3504, 
      "sentiment": 3, 
      "subject": "Ashes to Ashes in the Barbican Tunnel", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3993"
    }
  ]
}