{
  "summary": [
    {
      "body": "if interested please email   This will be 8090 west/north facing with views of St pauls and London eye. three bedrooms. on 31st floor", 
      "date": "2007-03-07 16:31:00", 
      "id": 3302, 
      "responses": 14, 
      "subject": "towerblock flat for sale", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3116"
    }, 
    {
      "body": "Hamilton Brooks have just re-instated their third row of flats for sale on their front window - either an ominous sign for the health of the housing market here, or just an indication of things returning back to normal after a crazy few years. I remember Hamilton Brooks always used to have 3 rows of flats for sale, but a couple of years ago, literally every single flat had an 'Under Offer' sign on it. They then reduced it to only showing two rows of flats for sale. Until quite late last year, every flat was still 'Under Offer'. Then the tide changed. Now they've re-instated the third row of flats, and few, if any, are 'Under Offer'.", 
      "date": "2008-04-29 20:27:00", 
      "id": 3574, 
      "responses": 12, 
      "subject": "Hamilton Brooks Estate Agency - 3rd row of flats!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4287"
    }, 
    {
      "body": "Hi  Does anyone know how to whiten these original Barbican bathtubs.  I am poised to sell/rent my flat and would like a whiter bathtub to be part of the picture. I once had a cleaner from Abracadabra or somewhere come in and they told me something about soaking the tub overnight with bio or non-bio washing powder - dissolved in cold water.  Does anyone know this or any other tricks? Thanks very much, Jeannie", 
      "date": "2007-12-01 14:33:00", 
      "id": 2625, 
      "responses": 11, 
      "subject": "A whiter bathtub", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3831"
    }, 
    {
      "body": "We're considering selling our Barbican flat and wonder if anyone can reccommend a solicitor? Many thanks.", 
      "date": "2008-05-07 19:20:00", 
      "id": 3586, 
      "responses": 9, 
      "subject": "Solicitors - reccommendation?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4315"
    }, 
    {
      "body": "Hello everyone,  We love the Barbican and have been renting here for a while but now want to buy. However the price of the apartments here are astronomical (and we are looking for a 2 bed flat). We have noticed though that the Golden Lane flats seem to be a lot cheaper. But what is it actually like to live there? Ok I am not expecting it to be as fabulous as the Barbican (chiefly because I suspect nowhere can be!) but what is it like in terms of safety, in terms of neighbours, in terms of flat construction (ie noise problems?), in terms of Estate Office responsibility (ie they are very responsive to Barbican dwellers - is it the same with Golden Lane?). Are there any communal areas like the Barbican Gardens? What is the mix of residents like? Any views or information, positive or negative is welcomed!", 
      "date": "2006-06-19 20:10:00", 
      "id": 4431, 
      "responses": 7, 
      "subject": "What's it like living in Golden Lane Estate?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2378"
    }, 
    {
      "body": "... are both for sale; I never knew that they had a glass roof: ", 
      "date": "2005-11-06 11:13:00", 
      "id": 4513, 
      "responses": 3, 
      "subject": "The Cromwell Penthouses", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1922"
    }, 
    {
      "body": "Does any one have any idea how much the lower garden flats (the studios) go for in Thomas More? i've never seen inside one, but i like the idea of living in one - does anyone know what they're like inside? Do they actually ever come on the market - i have never seen one for sale - or do the people that live there love them so much they never move?", 
      "date": "2005-08-28 20:19:00", 
      "id": 2985, 
      "responses": 1, 
      "subject": "Thomas More Garden Studio Flats", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1823"
    }
  ]
}