{
  "summary": [
    {
      "body": "Although this will define me as one of the estate wingers.... Lordy, has anyone seen the upper floors of the revamped Marks & Spencer on Moorgate?  It's miserable and gloomy in some parts and unnaturally bright and stark in others. This is due to having been 'updated' and now the windows are covered over so there's no natural light at all on the women's clothing floor (not sure about the men's dept).  Customers and staff have lost soft carpeting and natural daylight to hard floors and strip lights.  Ewww.  I was more than disappointed. Anyway, I have started a thread to get anyone who wants a good old kvetch about things going.  Well, I feel better.....", 
      "date": "2005-09-09 15:53:00", 
      "id": 2994, 
      "sentiment": 4, 
      "subject": "marks & sparks", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1834"
    }, 
    {
      "body": "Have spent an hour this evening looking at the proposals for the redevelopment of Milton Court and am extremely worried.  There was no mention, that I could see, of the impact a 42 storey building would have on the surrounding residential buildings.  In the expensive looking mock ups of every possible aspect of the new building + model, there was no reference to Cromwell Tower for example.  Residents there, and their current views had been conveniently forgotten. There was also minimal reference to Speed House & Willoughby House, unless I am mistaken. Am I the only one concerned about the imposing nature of the building, the impending building noise, light disturbance and additional hassle such a large building will cause? When I asked the City of London representative about the impending planning application & the date it would be submitted, he was reluctant to be specific.  He tried to placate me with \"sometime in June\".  My advice to all residents in the Barbican is to be vigilant about the planning applications and register your objections as soon as possible.  I would be interested in other peoples opinions on the redevelopment plans.....", 
      "date": "2006-04-27 21:38:00", 
      "id": 3075, 
      "sentiment": 4, 
      "subject": "Milton Court - proposed redevelopment", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2233"
    }, 
    {
      "body": "Riots in and outside the YMCA, paint colour wars, satanic children and smashed glass in BJH and drunken hoodies under Bunyan. What's going on on our northern fringes? Is there something in the water? ", 
      "date": "2006-05-06 22:29:00", 
      "id": 3097, 
      "sentiment": 4, 
      "subject": "what's up??", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2266"
    }, 
    {
      "body": "Is anyone else getting a liitle hacked off with the seemingly endless deliveries at the newly opened Tesco? There have been half a dozen juggernauts so far today (Sunday), and each time they arrive the tailgate is allowed to hit the road making an incredibly loud noise. Then theres the clanking of the storage cages as theyre dragged along the pavement. Its bad enough during the day but they also do it before dawn! Does anyone know if there are any restrictions on this kind of noise? I must be really noisy for people living in John Trundle Court.", 
      "date": "2006-11-19 18:28:00", 
      "id": 3212, 
      "sentiment": 4, 
      "subject": "Noisy Tesco", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2760"
    }, 
    {
      "body": "There was mention in the Milton Court thread about the St Alphage redevelopment plans.  I know these were put on ice some time ago - are they back on? If it involves losing the access via the Highwalk this is serious especially as this is currently the best route through to the Guildhall - try doing it at street level - not funny.  The Moorefields development alao involves a downgrading of the highwalk access to a slim walkway down the side of the building.  Obvioulsy Milton Court if redevloped will also mean losing a walkway but to be honest the difference between stairs by Citypoint and stairs at podium is not huge.   It's the cumulative effect that is worrying. On top of that how much more skyline is going to be filled in - the ghastly pink building on London Wall and it's new neighbour have filled in that section completely - what's St Alphage going to do ?  As it is to the South of the estate it will have far mor impact on light.", 
      "date": "2007-03-11 16:19:00", 
      "id": 3284, 
      "sentiment": 4, 
      "subject": "St Alphage House - any ideas what is happening", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3133"
    }
  ]
}