{
  "summary": [
    {
      "body": "I have now recommended my cleaner to 5 different people requiring cleaning/ironing not one of which has contacted her or me. Am I iwasting my time and hers?", 
      "date": "2007-07-04 16:44:00", 
      "id": 3438, 
      "responses": 14, 
      "subject": "cleaners", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3472"
    }, 
    {
      "body": "Has any body else stop receiving TV Saturday morning from 0130hr following a power failure. I have called the Bunyan court CPA who was going to look into it, so I then called the resident Engineer, only to have the phone answered by Defoe house CPA who said his TV works alright and he would connect me to the Bunyan CPA who would deal with my problem. The Bunyan CPA did call back with a telephone no. of the TV / satellite people under contract to the Barbican Estate, I call the number and listened to an answer machine message requesting our contract number with them (to which I don't know, only the Barbican office knowns, and they are not back for 3 days, so I could not leave any information). I have decided that Life dose not revolve around TV, so thanks to the BEO and there contract with an answer service I am now cancelling my subscription to rip off sky and going to buy a free view box which will work when the BEO get the TV people to switch back on the trip switch (shame the resident engineers dont know where this switch is!). Sorry about the rant, but missing all my favourite TV programmes this weekend. AHHHHHHHHHHHHHHHHHHHHH -0", 
      "date": "2008-05-05 19:40:00", 
      "id": 3566, 
      "responses": 1, 
      "subject": "TV Bunyan Court - May Day Bank Holiday weekend without TV", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4304"
    }, 
    {
      "body": "Dear All, Some time ago I posted a message in the Classified section, seeking to rent a flat or room in the Barbican or nearby for six weeks  (from mid-September to the end of October).  I haven't got  any replies so far and I'm still desperately looking for one.  (By the way, when posting that Classified ad, I inadvertently stole \"andrewes_person's\" nickname - apologies!) Of course, I may not have got any replies, because no one in the Barbican or nearby has a flat or room to rent at that time. It is more likely, though, that  there are relatively few Barbicantalkers (and probably only some of them look at the Classified section) so it's not the best way of advertising such needs. Hence my question - does anybody know of any better way to put up such ads? Is there perhaps an ad board in the Estate Office we can use? As far as I know, we can't put up any private notices on the boards inside the houses, and putting slips of paper through people's mailboxes might not be very well received, either.  I'll be very grateful for any suggestions. Of course, if you do have a room or flat to rent for six weeks from mid-September - or know of someone who does - I'll be more than happy to hear from you at   or (020) 7920 0275. Thanks a lot, Dorota", 
      "date": "2004-07-27 15:20:00", 
      "id": 4770, 
      "responses": 1, 
      "subject": "Flat ads", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1205"
    }
  ]
}