{
  "summary": [
    {
      "body": "Hi  Does anyone know how to whiten these original Barbican bathtubs.  I am poised to sell/rent my flat and would like a whiter bathtub to be part of the picture. I once had a cleaner from Abracadabra or somewhere come in and they told me something about soaking the tub overnight with bio or non-bio washing powder - dissolved in cold water.  Does anyone know this or any other tricks? Thanks very much, Jeannie", 
      "date": "2007-12-01 14:33:00", 
      "id": 2625, 
      "responses": 11, 
      "subject": "A whiter bathtub", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3831"
    }, 
    {
      "body": "Hi, I live in Andrewes and want to fit a timer to my water boiler. Has anyone had any experience doing this?  I was thinking about putting it on the face plate near the switch to turn it on but believe it may be possible to use one of those timer plugs. Slight problem with the second option - i have no idea where the tank is! Any ideas?", 
      "date": "2005-11-30 17:06:00", 
      "id": 4626, 
      "responses": 10, 
      "subject": "Fitting a timer to the water heater", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1967"
    }, 
    {
      "body": "we are in andrewes house in a type 21 flat. in the main door there is a gap in the bottom and we see lot of air escaping inside the flat from outside. we cant find any door mat or any sealant methods to stop this. can any body suggest anything useful here..?", 
      "date": "2007-06-14 16:31:00", 
      "id": 3356, 
      "responses": 8, 
      "subject": "Door Vent", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3422"
    }, 
    {
      "body": "We have the original bedroom wardrobe doors; on one, a hinge has pulled away from the door frame (they are soldered, not screwed). Can anyone advise on how to repair this (I am not a metal basher) or alternatively suggest who could do it for me?? many thanks - Roy S", 
      "date": "2006-02-09 15:58:00", 
      "id": 2753, 
      "responses": 7, 
      "subject": "Repairing wardrobe doors", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2064"
    }, 
    {
      "body": "i don't know whether all Barbican shower \"cables and heads\" are the same ... but mine has just started leaking badly... i've attempted all the basics - re-screwing, checking for limescale blocks etc but to no avail... any advice gratefully received (pls - don't tell me to get a plumber... its too early in 2007 to have quite recovered my bonhomie...) thanks all", 
      "date": "2007-01-02 20:27:00", 
      "id": 4131, 
      "responses": 7, 
      "subject": "shower fixture", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2874"
    }, 
    {
      "body": "Has anyone recently sucessfully replaced the hob unit with halogen whilst maintaining a nearly completely original kitchen?", 
      "date": "2006-11-07 17:37:00", 
      "id": 3210, 
      "responses": 6, 
      "subject": "Halogen Hobs", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2736"
    }, 
    {
      "body": "I am very much looking forward to moving into a large-style studio later next month.  It currently has a badly-laid, cheap, laminate floor throughout.  I realise this is in breach of the lease, and shall be removing it. I'm considering stripping the floor back to its original concrete, and painting it white.  Has anyone already done this in their flat?  Any tips or warnings?  Is special paint required because of the under-floor heating?  Being a DIY-loser, could you recommend someone who knows how to make good, paint and seal a concrete floor? Any sage words would be much appreciated! Nigel", 
      "date": "2006-08-24 10:31:00", 
      "id": 4461, 
      "responses": 6, 
      "subject": "Concrete floor", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2554"
    }, 
    {
      "body": "I need to put a stairgate across the top of a spiral staircase, which is slightly more complicated than it needs to be due to the metal posts (difficult to drill, especially when cylindrical) and a curious difference in angle between the posts at either side of the top step and the step itself. I don't like those stairgates that (allegedly) support themselves by means of a floor bar to trip you head-first down the stairs. And I don't want to damage the tender fabric of the building at all if I can avoid it (and I am aware that certain alterations will require consent). Any thoughts ? I can see that I could use hose clips or something similarly robust to attach wooden posts to the metal posts, and then drill the wood, but that would probably look like a nasty bodge.", 
      "date": "2006-11-01 14:45:00", 
      "id": 3197, 
      "responses": 5, 
      "subject": "Stairgate", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2715"
    }, 
    {
      "body": "Sorry I feel as if I am taking over Barbicantalk recently! I was just wondering, does anybody know whether you can lay lino over underfloor heating, or does it crack? Can anybody reccommend some nice (easy to lay!)  flooring that could go over underfloor heating?", 
      "date": "2007-04-12 20:47:00", 
      "id": 4377, 
      "responses": 5, 
      "subject": "Lino on underfloor heating?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3225"
    }, 
    {
      "body": "I have inherited refurbished bath and shower rooms in a tower flat. The lighting in both rooms is from a single source placed near the doors above the basins. I find this single source does not light the room adequately and before I start pulling the entire lot to pieces (including wall to ceiling tiling) I'd appreciate some ideas on improving the lighting. Am I correct in assuming that ceiling lighting is not an option due to the underfloor heating in the flat above? I have a horrible feeling that I am going to have to rip all the tiles off and carry the wiring across the wall to add another wall light, but welcome ideas, especially if an old wiring point may be likely to be lurking behind the tiling. I have looked at the photos on Barbicanliving for clues but am none the wiser. Thanks", 
      "date": "2007-08-12 18:29:00", 
      "id": 3395, 
      "responses": 4, 
      "subject": "bathroom lighting", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3584"
    }, 
    {
      "body": "Has anyone tried mounting an lcd or plasma tv on the wall of their flat and also chased in the cables?  Was it easy?  Is it even allowed under the terms of the lease?!", 
      "date": "2007-08-21 15:55:00", 
      "id": 3408, 
      "responses": 4, 
      "subject": "Wall mount lcd tv with chased in cables", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3600"
    }, 
    {
      "body": "I, in my infinite wisdom have ordered a sofa too big to bring up the stairs in Andrewes House and was wondering whether anyone would have any advice or info on rigging stuff over the balcony? The engineer from ove arup seems to think the handrail on the fire escape might not be strong enough. Many thanks, BarbicanDTS", 
      "date": "2008-03-10 16:52:00", 
      "id": 3540, 
      "responses": 4, 
      "subject": "Rigging Question", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4104"
    }, 
    {
      "body": "I think our original Barbican oven just \"died\" - flash of white light, bit of a bang, pleasantly toxic odour and all that. The orange indicator lights aren't coming on now suggesting that it has powered itself down, though I wouldn't mind isolating it from the mains power somehow just to be sure that nothing nasty happens while I hunt/wait for somebody to fix it. Does anybody have a clue what the fuses in the kitchen correspond with? We have a bank of eight unlabelled fuses in a panel within a cupboard above the stove - is it likely that one of these will knock the power from the oven? Any other suggestions? (And, does anybody know who to get to repair an original barbican oven? Or is it a lost cause?)", 
      "date": "2006-06-20 19:32:00", 
      "id": 4432, 
      "responses": 4, 
      "subject": "Dead Oven", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2379"
    }, 
    {
      "body": "I'm helping a relative move into a top-floor flat that has a curved ceiling. The small curved window above the main window is not easy to deal with in a way that leaves the option for light. We've regretfully decided to tack cloth over it so that sleep is possible, but it seems a real shame to not be able to use the window during the day. It's a rental, so a proper fix is probably impossible, but does anyone solved this ?", 
      "date": "2007-02-05 16:46:00", 
      "id": 4225, 
      "responses": 3, 
      "subject": "curtaining arched top windows", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3038"
    }, 
    {
      "body": "The water from my hot water cylinder is heated to a very high temperature. Yesterday a toddler got a nasty burn from the hot water tap, so I must now turn the thermostat to a lower setting. From a book I have this looks like quite a simple operation, but I would like to know if anyone has done it themselves and can confirm my impression.", 
      "date": "2007-04-09 12:10:00", 
      "id": 4371, 
      "responses": 3, 
      "subject": "Thermostat adjustment", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3213"
    }, 
    {
      "body": "We have been trying to put a picture up in our flat, and seemed to hit a solid brick wall. Has anyone else had problems putting pictures up, maybe our hooks / pins are too flimsy?", 
      "date": "2006-01-26 09:34:00", 
      "id": 4558, 
      "responses": 3, 
      "subject": "Pictures", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2047"
    }, 
    {
      "body": "does anyone have advice on how to remove, then put back the large sliding door into the kitchen? we need to relay the lino in the kitchen and have to remove the door for this task.", 
      "date": "2006-08-21 09:48:00", 
      "id": 3164, 
      "responses": 2, 
      "subject": "kitchen sliding door", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2545"
    }, 
    {
      "body": "Anyone used a good carpet cleaning service (steam or pref dry cleaning)  lately please? Or had a good experience with DIY hire cleaner?", 
      "date": "2007-03-19 18:56:00", 
      "id": 3298, 
      "responses": 2, 
      "subject": "carpet cleaning wanted", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3163"
    }, 
    {
      "body": "Hello everyone, We're just moving from Thomas More to Mountjoy House, and wanted to paint the apartment with Farrow and Ball colours. I popped into Leylands on Farringdon Road on the way back from F&B, and the guy there said F&B's paint is really hard to keep clean, it shows up dirt and fingerprints sooner than any other paint. While this may be good from Crime Scene Investigation point of view ,it may not work in the Barbican. He kindly gave me a free litre of Leyland paint to match the F&B colour, so that I could see for myself that their Leyland paint would be much better (even though it's half the price), but as F&B charge a 15% handling free for any unopened returns, I thought it best to ask the forum, in case anyone's used it in the Barbican. Is F&B really a no-no for a modern building like ours with large windows letting lots of light (and dirt) in, does it really only suit dark Dickensian settings?  Please someone say they've used it and loved it, as I've just bought gone and 20 litres of the stuff   PS apologies for the overuse of question marks in the title, just an effort to make the subject matter more interesting  ", 
      "date": "2007-03-23 18:35:00", 
      "id": 4244, 
      "responses": 2, 
      "subject": "Farrow and Ball in the Barbican?????", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3177"
    }, 
    {
      "body": "I'm redoing our kitchen and have removed the (enormous, over-engineered) oven hood and ducting. The Barbican Estate Office give instructions for how to replace it, that involves 'a mechanical volume control damper and suitably sized inlet grill... commissioned to achieve an extract rate of 30 litres per second.' I've tried calling them for advice and left messages, but as a shortcut has anyone here dealt with this issue? I have a suspicion a mechanical volume control damper might just be a slider on the grille... but how do you measure the extract rate?", 
      "date": "2005-11-05 19:34:00", 
      "id": 4521, 
      "responses": 2, 
      "subject": "kitchen ventilation adjustment", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1921"
    }, 
    {
      "body": "Does anyone have problems with the brush seals between sliding windows of the type found in below podium/brandon mews/wallside? The majority of mine were missing when I moved in and now the cold wind howls in. Does anyone know (a) if it's possible to get new brush seals which fit into the existing metal slots and (b) if fitting the seals is a simple DIY job or something needing a glazier with Barbican experience?", 
      "date": "2005-11-19 09:26:00", 
      "id": 4531, 
      "responses": 2, 
      "subject": "Window seals", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1940"
    }, 
    {
      "body": "Hi My washing machine seems to have decided to stop using hot water (becuase the clothes do not seem to be warm when I open the door at the end of the wash).  I'm not good at DIY and have no idea what could be causing this!  Does anyone have any bright ideas?  Or, even better, the name and number of someone reliable who could fix it...? Thanks", 
      "date": "2006-03-16 18:50:00", 
      "id": 4618, 
      "responses": 2, 
      "subject": "Cold washing machine", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2140"
    }, 
    {
      "body": "Anyone in a duplex have a novel and non life threatning way to change the lightbulb in the ceiling above the stairs? ", 
      "date": "2006-04-05 08:07:00", 
      "id": 4650, 
      "responses": 2, 
      "subject": "How many residents does it take to change a lightbulb?...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2173"
    }, 
    {
      "body": "I am looking to replace, what I believe are, the original white splash boards behind the hob and sink in a Defoe type 20 flat. Hopefully, with salvaged parts. Does anyone know how these are held in place? I can't see any scews so assume they are glued but would welcome comments.", 
      "date": "2006-01-21 19:45:00", 
      "id": 3042, 
      "responses": 1, 
      "subject": "Defoe kitchen panel replacement", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2039"
    }, 
    {
      "body": "I'm a bit thick when it come to things like this, so perhaps this is a really obvious GCSE-level plumbing question but... i've noticed that over the past few weeks, the hot water tap in my bathroom has been making a funny whistling sound when it's turned on - like a pressure sort of noise. When it's turned on full blast, the noice disappears. What does this mean? and how can i fix it, as it's quite annoying at times, especially as it's begun to drown out the wonderful sounds of me singing in the shower...", 
      "date": "2006-11-07 21:58:00", 
      "id": 3200, 
      "responses": 1, 
      "subject": "Hot water noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2739"
    }, 
    {
      "body": "Has anyone fitted a dishwasher instead of one of the kitchen cupboards.  We were recommended to move the sink water heater and put a smaller one next to the garchey.  Has anyone done that?  Who did you use?", 
      "date": "2007-05-20 11:05:00", 
      "id": 3321, 
      "responses": 1, 
      "subject": "Fitting a dishwasher", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3345"
    }, 
    {
      "body": "Has anyone come up with any genius ideas for keeping light out of the barbican bedrooms besides the obvious curtains and roller/roman blinds. I loathe the look of curtains, and whereas I like the look of blinds, find that they let the light in in the gap between each blind and annoyingly prevent opening of the door because of the lack of headroom. I know there are some panels which slide laterally on tracks set in ceiling and floor. Anyone tried those? Or any other ideas? Thanks", 
      "date": "2007-09-15 17:00:00", 
      "id": 3427, 
      "responses": 1, 
      "subject": "instead of curtains", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3660"
    }, 
    {
      "body": "Has anyone had any experience of successfully replacing a broken belt or able to offer a top tip on how to do so before I admit defeat and call the professionals?!! Many thanks", 
      "date": "2007-12-19 22:38:00", 
      "id": 4181, 
      "responses": 1, 
      "subject": "washing machine drive belt!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3879"
    }, 
    {
      "body": "Is there someone anyone can recommend who can do a few odd jobs around the flat - replace the leaky washer in the bathroom, replace a fluorescent light in the kitchen, fix a few loose doors and take a look at the oven door which refuses to shut properly? Or do I have to call separate carpenter/plumber/electrician? Thank you for any advice. PS: Or maybe someone can tell me how to change the kitchen lightbulb myself because I have no idea where to start (!)", 
      "date": "2006-10-15 12:16:00", 
      "id": 4296, 
      "responses": 1, 
      "subject": "odd jobs - recommendation?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2680"
    }, 
    {
      "body": "I have inheritaed a rather scabby, semi-original bathroom.  I would like to either renovate or replace it sympathetically.  Has anyone done similar and have recommendations for contractors, fittings, suppliers, unforeseen problems, etc?  Would be most grateful to hear of your experiences...", 
      "date": "2007-03-30 07:38:00", 
      "id": 4352, 
      "responses": 1, 
      "subject": "Bathroom renovation / replacement", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3189"
    }, 
    {
      "body": "Hi, I've recently moved into Andrewes House, and there's often a nasty smell around the kitchen - almost like someone's old Sunday Roast. I've thoroughly drenched my kitchen sink in bleach, so I don't think it can be coming from there. There is a large metal contraption above the electric hobs - like an air vent - and that is encrusted in slimey dust. It seems an original part, and is solid steel - I cannot find a way of taking it apart. Can anyone else share their experience of this kitchen air vent - how to go around cleaning it - or have you had it ripped out or boarded up? Thanks Paul.", 
      "date": "2006-09-15 11:48:00", 
      "id": 4489, 
      "responses": 1, 
      "subject": "Smells from Air Vent above Kitchen hobs", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2603"
    }
  ]
}