{
  "summary": [
    {
      "body": "I've walked by the new restyled Barbican Centre entrance a good number of times over the past few weeks waiting for it to be finished showing how that multi million pound bundle put aside for this venture was spent. To my chagrin I've now been told that indeed the finishing touches have been put to this attempt that now seems to either have been left unfinished or the powers that be ran out of finance.        I reaize the doors open automatically, a step into modernizing, and the walkway outside has been fashioned with seemingly very expensive paving stone but to my eyes the empty, neuter and down right dull cave like walkway into the interior simply doesn't make it. I can't see how this attempt can generate a welcome to visitors or the inquisitive, sorely lacking in the past.The interior walls move to the tune of Barbican buildings in gentle silhouette recognized by residents but lost on those who are not familiar with our surroundings. I may be very wrong here but I can't believe this redesign does anything to make the Centre the magic place the powers that be want it to be.        This has been but a personal observation and hopefuly not of a contentious nature ( something I have been labeled with in the past ) but it would be interesting to know what others might think on the subject.", 
      "date": "2006-10-22 09:07:00", 
      "id": 4305, 
      "responses": 15, 
      "subject": "The new Barbican Centre entrance.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2696"
    }, 
    {
      "body": "I do hope that the fuzzy rather strange strip in our wonderful new entrance is not the work of art promised.  If so, gosh how much did it cost?  What is it?  Hopefully I'm wrong and an all singing all dancing thing will appear soon.", 
      "date": "2006-09-02 11:06:00", 
      "id": 4472, 
      "responses": 14, 
      "subject": "Work of art?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2572"
    }, 
    {
      "body": "Is anyone about to die wondering what the hell is going on with the snagging lists for Ben Jonson.... I still have no new fire door, damp and painting that needs completed. The temp repair to my 7th Flr firedoor consists of a wooden strap across the handle. Well Done the Corporation.", 
      "date": "2006-02-03 13:02:00", 
      "id": 4568, 
      "responses": 7, 
      "subject": "Ben Jonson Repairs", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2059"
    }, 
    {
      "body": "Now that the gate has been installed where the bridge used to cross into Milton Court I'm wondering if they intend to paint it blue to match all the other paint work at this end of the estate, or are they going to leave it as it is - white?", 
      "date": "2008-04-30 13:37:00", 
      "id": 3906, 
      "responses": 6, 
      "subject": "New gate under Speed House/ Milton Court Bridge", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4289"
    }, 
    {
      "body": "We have just received the questionnaire about the refurbishment, and I hope that many residents will complete it and return it to the estate office. Overall the refurbishment looks great, and the automatic doors are a big improvement. However, the budget was 190,000 - quite an astonishing amount of money to spend on the podium entrance and car park entrance. The budget apparently did not stretch to the following items which I think residents should consider, as I had understood that they would be included: -- the porters' desk was not renewed and is showing lots of signs of wear and tear -- there is no parcel store - as before, parcels are left on the floor, which I find rather astonishing. Nowadays people order more and more online, and there is no provision for the storage of delivered items. -- the doors at podium level (possibly elsewhere) were poorly repainted. You can see that old layers of paint were not removed, and already the new paintwork is showing signs of damage. I'd be interested in hearing opinions from my neighbours on this. The house committee has been silent, to my knowledge. The whole job took an extraordinary amount of time, and cost an unfathomable amount of money, and I think that in less than 12 months we will all have serious misgivings - if we don't already.", 
      "date": "2007-11-24 20:32:00", 
      "id": 3614, 
      "responses": 4, 
      "subject": "Shakespeare lobby refurb questionnaire", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3815"
    }, 
    {
      "body": "In 2006 the Breton House and Ben Jonson House Groups consulted with residents and recommended colour schemes for pending external redecoration. A few residents in BJH  complained about the process and the colour recommended by the Breton House Group was rejected as being outside the accepted palatte of colours, so those proposals were scrapped. This year the Estate Office initiated a formal ballot of lease holders of the two blocks within a limited and accepted palette of colours.  Agreement was achieved. Redecoration was due to start next week.   Following complaints from three leaseholders about the agreed colour scheme, the work has been put on hold and is now due to be referred to the full City Planning Committee in September. Further appeals to English Heritage may follow. All of this costs us money. I've lived here for over 25 years and have never encountered anything like this.  ", 
      "date": "2007-08-10 17:14:00", 
      "id": 3391, 
      "responses": 2, 
      "subject": "Redecoration Breton and BJH", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3577"
    }, 
    {
      "body": "Walking home the other day I noticed some of the Breton House re-painting (Waitrose side) is pretty shoddy as it is in some parts of the Ben Jonson/Breton car park...anyone else agree??", 
      "date": "2008-01-02 12:06:00", 
      "id": 3543, 
      "responses": 2, 
      "subject": "Breton Re-paint", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3899"
    }
  ]
}