{
  "summary": [
    {
      "body": "Any suggestions for a location for a venue in the City for a dinner for 150 people.  It needs to have a bit of character and quality - we have a bunch of french people to keep happy.  Any favourite livery halls or other venues ?", 
      "date": "2005-12-19 14:24:00", 
      "id": 4580, 
      "responses": 9, 
      "subject": "Venue for big event", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1995"
    }, 
    {
      "body": "Hi There  Does anyone know if there are any rooms available to hire nearby suitable for a small kids party? (small in number and size!) thanks", 
      "date": "2008-02-09 21:55:00", 
      "id": 3498, 
      "responses": 6, 
      "subject": "room hire", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4004"
    }, 
    {
      "body": "Hi,  I want to organize a workshop in the Barbican area and need to rent a room for 2-3 hours with enough space for 10-15 people.  This could be in a community centre or maybe a school. I do not know the area very well but I am trying to get some information through the internet without much luck yet.  Do you have any suggestions?  Many thanks, Esther", 
      "date": "2008-03-03 18:48:00", 
      "id": 3534, 
      "responses": 3, 
      "subject": "Room hire for a workshop", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4080"
    }, 
    {
      "body": "Vinoteca on St Johns St has a private room downstairs a do a wonderful job catering for private functions.  We had a fabulous birthday party there and the food, wine, and service were all fantastic.  And the prices are not bad either. It is also a (rather extreme) way of getting to eat there....", 
      "date": "2007-08-22 15:04:00", 
      "id": 3407, 
      "responses": 1, 
      "subject": "Vinoteca - a great venue for parties", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3602"
    }, 
    {
      "body": "Is anyone aware of any pubs local to Barbican that regularly screen live rugby? I'm a Barbican dwelling avid Leic Tigers fan (w/out Sky) and very keen to watch this evening's Tigers v Bath clash on Sky 2. Thanks Paul", 
      "date": "2008-04-15 12:19:00", 
      "id": 3869, 
      "responses": 1, 
      "subject": "Rugby screening pubs near Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4238"
    }, 
    {
      "body": "Last Sunday i was passing through the Barbican Centre and thought I'd pop along to the conservatory. I hadn't been for years and was really shocked at how decrepit the place looked. Plants were falling over, some overgrown and others dying, there appeared to be a lack of any thoughtful planting, lots of random pots strewn about the place either empty or with straggeling plats in. Very little clear labelling of the plants that there were and the few labels regarding the areas that the plants were from were embarrassingly lame, giving little real information. The cacti room was closed. I felt depressed leaving the place. My thoughts about the place appear to be reflected by the comments on Babricanliving, and it's suggested that perhaps John Tusa wants to get rid of it, and therefore has cut funding and let it fall into disprepair on purpose. This would certainly be an explanation. Have anyother residents been recently and thought the same? i think it's such a wonderful place and that it's something worth saving. With some thoughtful planting and relevant, well planned labelling it could be a real educational attraction for schools etc. as well as a little haven for those attempting to escape from the city for an hour or so. In it's present state i'd never suggest to any guest visting me on a Sunday that we go. It's an embarrasment. What can we, as residents, do. except write a letter to John Tusa?", 
      "date": "2006-03-25 01:55:00", 
      "id": 4622, 
      "responses": 1, 
      "subject": "conservatory", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2153"
    }
  ]
}