{
  "summary": [
    {
      "body": "Residents, I am sure you will be aware of the robbery that occurred at Defoe House around 11.30pm on Friday evening (8th March). A lady left Barbican Tube Station, crossed over in to Aldersgate Street and went in to Lauderdale Place, she then took the stairs up to the Podium Level with the intention of entering a block in the Barbican. This lady was followed into Defoe House lift by two women in their late teens to early twenties, who trapped her in the lift where she was subjected to a serious assault and was robbed. I want to take this opportunity to reassure you that as a Force we are doing all we can to find her attackers.  In order to do this you may notice an increased number of City Police Officers in the area, in particular around Defoe House.  If anyone thinks they may have seen or heard anything suspicious around the time the offence took place please contact our C.I.D. office on 020 7601 2472 or the Barbican Police Office  020 7601 2456. If you see anyone acting suspiciously please contact City of London Police on 020 7601 2222.  In an emergency dial 999 Thank you for your co-operation at this time. Regards Sgt. Hector Mckoy, Barbican and Golden Lane Estates Message posted by John Levey", 
      "date": "2008-03-11 13:36:00", 
      "id": 5487, 
      "responses": 8, 
      "subject": "Robbery", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=4109"
    }, 
    {
      "body": "The Boudoir hearing is set for 10 am on August 1st.  Islington are expecting a good turnout so we shouldn't disappoint. Also people who have had personal bad experiences with the bar need to turn up and give their experiences.  Cntact   (phone number on the BA website).  This is really important as Islington sent officers down to observe what was going on and have reported that they witnessed no problems.", 
      "date": "2005-07-21 10:03:00", 
      "id": 2952, 
      "responses": 5, 
      "subject": "Boudoir Hearing - Need WITNESSES and a GOOD Turnout", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1754"
    }
  ]
}