{
  "summary": [
    {
      "body": "I've just bought a laptop, but am not sure what I now need to do to go online - sorry for the stupid question!  I have a connector for the phone line, do I need to get connected to someone like Wanadoo?  If so can anyone recommend a good internet provider?", 
      "date": "2005-10-04 13:43:00", 
      "id": 3112, 
      "responses": 17, 
      "subject": "Internet Connection", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1865"
    }, 
    {
      "body": "i've just had broadband installed into my flat in defoe house and i need someone to come in and help set it up on my laptop as i'm completely useless at this sort of thing. Does anyone know of someone/a company that will do this? everywhere i've tried through the yellow pages have said that they only deal with businesses etc. it's getting desperate. thanks.", 
      "date": "2006-01-23 11:25:00", 
      "id": 4569, 
      "responses": 9, 
      "subject": "computer help", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2040"
    }, 
    {
      "body": "I have a computer problem which is driving me INSANE but which one of you barbies out there may be able to solve. It is simply that when I am typing in Word or in Hotmail, the wretched cursor jumps suddenly somewhere else in the text and then proceeds to overwrite whatever is there. I have no idea what to do. I know it's not caused by the mouse or any of the keys. AND IT'S JUST HAPPENED AGAIN - BOTHER! Any ideas or suggestions? Thanks", 
      "date": "2006-12-15 20:53:00", 
      "id": 3371, 
      "responses": 6, 
      "subject": "COMPUTER GLITCH", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2838"
    }, 
    {
      "body": "Hey This morning I downloaded all my software updates on my macbook (itunes, safari, quickplaer and the security update). Since then, my internet connection has not worked and the mac support line seem to think that the security update may have something to do with it. However, as the machine is more than a year old, they don't provide complimentary IT support! I know my net connection works as  a) I'm happily using my desktop to dial in here, and b) my work laptop (pc) can also connect to the network wirelessly Anybody have any ideas on how to reset a macbook internet connection? I use both safari and firefox if that makes any difference! ta Matt", 
      "date": "2008-04-26 13:53:00", 
      "id": 3898, 
      "responses": 5, 
      "subject": "Mac Support - help!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4277"
    }, 
    {
      "body": "Are there any Mac users out there in Barbicanland who could make a suggestion for solving the following problem? Last night, I left my computer sending a rather large 3mb email. When I returned to it the Mail icon was bouncing away in the Dock, the mail hadn't been sent and the activity bar was showing the spinning wheel and the activity 'Copying message.....'. It carried on spinning away for ages so I tried to quit, Mail wouldn't respond to my attempts to quit, so I Force Quit. Restarted, opened mail, and now the activity bar permanently shows 'Reading mailbox file..' and the spinning wheel is whizzing away. I can't quit Mail now and have to Force Quit every time. I've tried opening the Activity Viewer and stopping the action (it says STOPPING, but doesn't stop) and I've run First Aid in Disk Utility, no help) What's going on? Any ideas? I'm so distressed, my Mac is so well behaved usually!  ", 
      "date": "2005-08-05 12:37:00", 
      "id": 2958, 
      "responses": 4, 
      "subject": "Mac Mail problem - any ideas?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1788"
    }, 
    {
      "body": "I am sure there are intelligent/competent  people here who make websites and I am sure that they know the cheapest way to host one? Could you please advice on what's the best to do?Procedures consider that I am a dummy... Many Thanks!", 
      "date": "2007-02-16 10:32:00", 
      "id": 3263, 
      "responses": 3, 
      "subject": "Where? how to host a website", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3063"
    }, 
    {
      "body": "Hello All,  I'm about to pull my hair out with my printer.  I've successfully set up my wireless broadband and decided to introduce my printer to my router.  My Mac can now see my printer and trys sending stuff to it, but to no avail.  I suspect it's something to do with the way my security is set up on my router but I've exhausted my limited knowledge of wireless networks.  To add to the confusion, we're using both Mac & PC in our flat hence not just having an airport to run everything from.   Any suggestions anyone? Or better still, does anyone know of anyone who charges to come around and sort such IT matters out?  I seem so near, yet so far! Thanks all!", 
      "date": "2006-09-04 10:10:00", 
      "id": 4471, 
      "responses": 2, 
      "subject": "wireless printing hell...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2578"
    }, 
    {
      "body": "allypally, you out there?? can you please email me to give me details of the nice computer man in Brandon Mews that you mentioned on the last thread about computers.  I need some urgent help.  Thanks v much", 
      "date": "2006-02-27 15:57:00", 
      "id": 4595, 
      "responses": 2, 
      "subject": "allypally", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2104"
    }
  ]
}