{
  "summary": [
    {
      "body": "Barbicannews has an article on this.  Has anyone done this and do they have a guide tothe fees and values paid.  We ought to use joint market power on this one ......", 
      "date": "2006-04-02 13:12:00", 
      "id": 4353, 
      "responses": 8, 
      "subject": "Lease Extensions", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2168"
    }, 
    {
      "body": "Am i the only lucky Barbican resident with vistors for summer?  Ants.  Lots of them.  Entire familys. The corporation is in the process of dealing with it.  If anyone else has them maybe we could get a mass extermination. D07", 
      "date": "2007-05-15 22:53:00", 
      "id": 4340, 
      "responses": 4, 
      "subject": "Ants", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3338"
    }, 
    {
      "body": "I have been on the waiting list for a storeroom for a few months and am told it can take a year or more to get one. I wondered in the meantime if there is anyone with an underused storeroom who might like to have someone share the rent with them in return for using it until I get allocated one myself? I am in Andrewes House so something nearby would be best but anything considered.", 
      "date": "2006-04-05 07:12:00", 
      "id": 4648, 
      "responses": 2, 
      "subject": "Renting a store room", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2172"
    }, 
    {
      "body": "Has anyone else received a letter from Crossrail?  It provides no comfort (in fact the opposite) to my mind... It is unclear whether the work site on Aldersgate Street will be required if the crossover cavern is to be built in a different way from that currently proposed.  The letter implies that it is. The working hours stated in the letter are not quite the whole story - it does not mention that working could also happen at weekends and at night (set out below) effectively at the discretion of the contractor.  The removal of spoil from the tunnel will take place on a   basis. Also the noise mitigation, which basically involves fitting double glazing   (!) inside our windows (and fitting a fan) is entirely unacceptable.  Apart from turning our flats into squalid non-ventilated greenhouses, I very much doubt that this is appropriate treatment for a Grade 2 listed building.   I for one am not prepared to live for 3 years without fresh air, and I also think what is proposed would be entirely impossible to install in our flat. BA Chair, we need you to organise us to oppose this. If we do not act together, I shall be certainly taking legal advice, but a joint approach would seem to me to make much more sense.  Normal working hours are planned to be from 0700 to 1900 on weekdays and 0700 to 1400 on Saturday. Only non-disruptive preparatory work, repairs or maintenance will be carried out on Saturday afternoons or Sundays between 0800 and 1700. The nominated undertaker will adhere to these normal working hours for each site as far as reasonably practicable and where feasible, operations anticipated to cause disturbance would be limited to these hours. There are certain exceptions to the normal working hours, which are described below. Certain operations are season and weather dependent and in these instances the nominated undertaker will seek, as is customary in the construction industry, to extend the working hours for such operations to take advantage of daylight hours, with the agreement of the relevant authorities.  Track laying and internal fit out works within the stations and tunnels may also be carried out on a 24 hour per day, 7 days per week basis. In order to safeguard the works it may be necessary for certain items of plant and equipment to be kept running 24 hours per day, which would include pumps and generators. Any such equipment will be shielded in order to provide appropriate noise attenuation. Staff may be required to collect data and samples outside normal working hours at times. Certain works requiring temporary possession of roads and railways for safety or operational requirements, to limit disruption to the travelling public, and works in connection with utilities when demand is low will need to be undertaken outside normal working hours. This will include Saturday afternoon, night-time, Sunday and/or bank holiday working from time to time. On occasion longer term possessions (in excess of one week) will be required for more major works.", 
      "date": "2005-07-23 11:15:00", 
      "id": 4700, 
      "responses": 2, 
      "subject": "Crossrail", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1757"
    }
  ]
}