{
  "summary": [
    {
      "body": "Was anyone else aware that two people were sleeping rough on the outside curve of the Arts centre opposite Ben Jonson House last night? I phoned Snowhill Police station but they only really seemed interested in whether there was any disturbance. I have always felt safe walking home on the Podium at almost any time of night, but if this were to become a regular venue for rough sleepers that would no longer be the case. What do others think?", 
      "date": "2006-08-20 17:11:00", 
      "id": 4498, 
      "responses": 30, 
      "subject": "Rough sleepers", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2544"
    }, 
    {
      "body": "Only joking... I'm not at all. I'm very cross about it ...BUT That said, is it worth discussing what we should lobby for in the medium to long term with regards to the St Alphage site?  We might get lucky and Chase JP Bear away this time. The economy might collapse. Bear JP might be rouge traded, I don't know. But the fact remains that someone at some point will try and develop the land. It may be 5-10 years from now, but surely, it will happen.  Putting aside the ghastly injustices of the political situation which've been detailed on other posts, what is clear is that the hilariously impartial planning department regard us as nothing more than a bunch of self-serving fascists who don't understand the basics of the  London economy.  It seems to me that this their way of writing off our concerns as a form of selfish Nimbyism that damages the productivity of the City.  This is clearly ridiculous, but it seems entrenched in the mind of the planning department.  Surely then, we have to present ourselves as people who care deeply about the City ( not untrue I would imagine) and who lobby for the Barbican on belhalf of the 300 000 workers we have been sterotyped as being against? We should argue for an architecture that is bold and as landmark as the Barbican itself.  We should present ourselves as people who not only care about The Barbican- but care about other people having acess to the Barbican? Not just the arts centre, but the place as a whole? If this is a grandmother suck eggs situation, forgive me. My white rage at the proposal has made me want to do all kinds of things! But should we also be working out what would be acceptable- or is this giving up before we've even started? Perhaps it is a dangerous strategy. Perhaps me saying this is all part of their darstardly plan. I put nothing past their evil cunning. And I'm sure I'm absolutely stating the obvious here and everyone else is five steps ahead of me on this- for example- the Save the Barbican T-shirts I thought struck the right note I thought! I personally would rather another Gherkin or even a 'Shard of Glass' outside my living room than the bulky monstosity we've been offered. But more importantly, I want to be able to walk to the Guildhall / Cheapside without crossing a big road. I want to get to Moorgate without getting in a lift and I want the safety offered by having a steady stream of people coming in and out of the Barbican. These are, to me, more important that the height of the building. A landmark beauty would, in my view, benefit us all. But discuss... And apologies for the provocative subject title, I was concerned that the telephone had knocked the issue off the top spot. Don't even get me started on BT. [/i]", 
      "date": "2008-04-12 14:20:00", 
      "id": 3866, 
      "responses": 5, 
      "subject": "Pro the St Alphage Development", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4229"
    }
  ]
}