{
  "summary": [
    {
      "body": "Sorry to interrupt the Waitrose debate. Back on the subject of the YMCA, and I hope it doesn't get out of hand this time. I am in conversation with the Environmental Health and Snow Hill regarding what we can do about the noise from the YMCA  the (temporary) noisy residents that on Fridays and Saturdays congregate on Fann Street at 1am or so in large crowds before going out. In anticipation that this is going to become more and more frequent in the summer I really want to sort this out before it gets out of control. If any of you are disturbed by the noise, I have been instructed by Snow Hill to report it to them where complaint will be logged. We need to keep a diary and gather up some evidence. Please back me up so I can enjoy the summer without being woken up to the sounds of Viva Espana!", 
      "date": "2006-03-20 18:19:00", 
      "id": 4285, 
      "responses": 206, 
      "subject": "YMCA noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2148"
    }, 
    {
      "body": "Today Friday July 22 the mains water supply has been off here in Andrewes since at least 0945 and is still off as I write at 21:15.  I have phoned Thames Water twice who the first time said no report showing, on the second occasion some hours later said after a short delay that a mains supply problem had occurred. I have experienced several mains water outages here. In particular there has been a group of outages in the last week or two of which I've noted these:- - 0945 BST Friday 22 July 2005 - no mains water still as of 21:15. - 12.42 BST Monday 18 July 2005. - 14:55BST Sunday 17 July 2005. - noon BST Thursday 14 July 2005, restored at ~1345; Anybody else having similar problems (frequency, dates/times)?  I am just trying to get a handle on whether this flat is particularly accident prone when it comes to utilities supply dependability or whether instead the problem lies further afield.", 
      "date": "2005-07-22 20:20:00", 
      "id": 4703, 
      "responses": 18, 
      "subject": "mains water disruption again", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1756"
    }, 
    {
      "body": "After a long time, (almost a year?) and having complained politely (yeah, right) to our neighbors upstairs, we made a formal noise complaint at the Barbican offices. The folks upstairs  (an \"L-shaped 20\", I believe is what they're called,) have two 5 or 6 year olds, and a baby that will soon be old enough to stomp and bang itself. They have laminated floors throughout the entire apartment, and every morning, at precisely the legal time to make noise (7:30-8:00 A.M.) BANG! One jumps from it's bed. in the side front room, joined seconds later by the other child, also in the front room. They race to the parents bedroom and jump around there for a while, and run back and forth (I swear I have heard them call it \"the running and jumping game\") and this goes on until they go to school, and from when they return 3:30-ish (with school freinds, often) to run, jump, bang and wrestle until they all go to bed 11:00ish. Its only running and bouncing and kiddie stuff, you can't fault them, they are only kids having fun. But the parents only gave us blank looks when we went up to ask them to hold it down. In our book of Barbican rules it says \"Carpets must cover all floors, to avoid noise.\" (I'm paraphrasing) So we complained in the Barbican office. They took down the info, and told us not to expect anything to happen \"for a reasonable lenghth of time, which meant sometime in Dec. They then added that since it would be around Christmas time by then, the neighbors probably wouldn't want to be buying and installing carpets then...     In October, a month or so after our complaint, we got a letter from the Barbi Corp asking US to keep a log of THIER noise FOR A MONTH, and  submit it back to them. Um, why is it OUR responsibility to spy and report on our nieghbors? Very Maoist spy-on-your-neighbor policy. We did it, though, making us seem quite petty, writting down everytime they banged on the floor or jumped off the furniture The corp. sent back a notice telling us that most of the noise was \"within noisey hours\" (I said I was paraphrasing, folks!) except for once when it went past midnight, which was aparently our only valid complaint. Whaaa? The complaint is that THEY DO NOT HAVE CARPETS TO CUT DOWN ON NOISE. The reply also said we had \"Screamed at them in April\" (10 months earlier) during one of the brat's (I'm still parapharasing) birthday party. Aparently that was enough to negate our claim. Actually, the Corp had told them to get carpeting, but to give them time to do so, 3 months, and if they don't, we should feel free to complain again.      We are going to get a chimpanzee and a breeding pair of Lorries, a very beautiful and very songful bird. Let THEM complain! We'll tell 'em that carpeting their floors might cut down on some of the noise.     A rule is a rule innit? Does anybody know the \"real\" rules on carpeting floors? I'ver noticed somewhere on Barbican talk that somebody mentioned their wood floors. We've also noticed the Estate Agents sometimes advertise wood floors as a plus when offering Barbican apartments for sale. We wouldn't mind if it was a sweet, lightweight lady like Thelma walking in slippered feet on her cold, cold floor, but it ain't. This is the main reason I got on this site, to find out what the \"unwritten\" rules are. Thanks in advance for your upcoming input!", 
      "date": "2008-02-03 09:04:00", 
      "id": 3778, 
      "responses": 6, 
      "subject": "Barbican bylaws versus Ignoring Barbican bylaws.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3976"
    }, 
    {
      "body": "If anyone else was awakened by the 4 a.m. construction choir on Whitecross St. today, or any of the other rulebreaking activities by our neighbours to the north, may be worth filling out an online noise diary at   Noise Record Diary is the last option in the blue box Do it online on the right I have tried leaving voice messages before with no response so I don't expect any from this either, but somehow it makes me feel better.", 
      "date": "2008-04-14 11:43:00", 
      "id": 3864, 
      "responses": 3, 
      "subject": "Islington noise complaint", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4236"
    }
  ]
}