{
  "summary": [
    {
      "body": "It is not too late to make a difference. Today (31 October) is the last day to get in your objections for the Milton Court development: a school for the Guildhall School of Music and an enormous residential tower. Reference 06/01160/FULEIA If you haven't got your objection in yet, you can email it to   or you can hand it over in person by going to the 18th floor of St Alphage House. You must ask for a receipt with today's date. Objections received after today will still be taken receipt of, but might not be considered fully. But if you can't make today, you should definitely still send yours in. I have pasted derbyram's points to object on below. It is important that people who object to the proposal to send in a letter of objection. We helped to have the submission rejected before and we can hopefully do it again. Here are the points: The plan submitted in March has been modified in an attempt to satisfy some of the objections raised, but in essence remains the same: a new building with the lower block housing a concert hall and theatre for the GSMD, surmounted by a residential tower.  284 flats in a tower covering half of the existing site, just lower than City Point  residential density over 8x greater than within the Barbican (even Heron note this in their environmental impact study  density will be 1183 units per hectare, compared with a recommended central location maximum of 240-435 as per the Mayors London Plan, which also states that density should respect local context and communities)  the existing Milton Court perimeter wall moved 1.9m closer to the Barbican, resulting in the road carriageway narrowing from 10.4m to 7.3m  buses and other large vehicles will have great difficulty is safely negotiating the Silk Street/Moor Lane junction in the face of oncoming traffic.  Heron still plan to purchase 210 car parking spaces in level 03 and 02 car parks below Willoughby, and convert space under the Moor Lane car-park ramp into secure bicycle parking, all for the exclusive use of Milton Court.  a health spa/club with outside tables will sit on top of the GSMD building (6F), directly opposite upper floor residents bedrooms in Willoughby and Speed.  many flats in north Willoughby and Speed will still suffer from a loss of light, loss of privacy, and be subject to overlooking from the new tower.  loss of the existing public highwalk  note that recent new buildings constructed around the Barbican area have been designed to retain highwalk access  similarly redevelopment of Milton Court should follow the same UDP requirement.  this development will generate 3,705 person trips and 423 vehicle trips per day, which will be in addition to traffic generated by the new Ropemaker Place building.  a caf/restaurant will be located at the SE ground floor corner  expect early morning delivery noise, as experienced with the City Point bars/restaurants.  the contractor has promised to abide by CoL working hours (which differ from Barbican Estate noisy work hours), but note than the contractor has already broken such pledges made while constructing the new lift/staircase.", 
      "date": "2007-10-31 10:07:00", 
      "id": 4154, 
      "responses": 29, 
      "subject": "MILTON COURT FINAL OBJECTIONS", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3755"
    }, 
    {
      "body": "I know that in the lease it says pets are not allowed, but what about the pets of visitors? is it OK for guests to bring their dogs? and if so, can they be walked in the gardens, or is that absolutely banned?  ", 
      "date": "2005-10-16 14:27:00", 
      "id": 4450, 
      "responses": 26, 
      "subject": "Dogs (woof!)", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1890"
    }, 
    {
      "body": " We were made aware last weekend of complaints listed on this website about actions by us or our contractors. I immediately started an investigation as we take these complaints very seriously. We have spoken at length, prior to being allowed on site, to all workers about a number of issues including hours of working, attitude when working and respecting that this is a residential neighbourhood. I have repeated this following last weekend to ensure that all workers know that any failure to respect these rules will mean they risk disciplinary measures and dismissal from the site. Following my investigation I received an apology from the scaffolder who swore, he is the foreman and it was out of character. He denies the incident happened at the time stated and was clear that he was not present on site at that time and neither were his team. I cannot prove he was there but have given him a final warning over the swearing. He is going to write to the resident who first made us aware of the complaint (this has been made possible by your Chair asking the complainant for his address). The second issue was my email address, it is working now but was not last weekend and I apologise. Thirdly I delayed this statement to you until after we had met with your representative's on Thursday night as part of our regular consultation on the planning and construction of Milton Court. This was to ensure that we had covered all the issues and had made ourselves accountable. Fourthly I was asked if we could repeat the hours of working we are keeping to, these are: Monday to Friday hours, 08:00-10:00, 12:00-14:00 and 16:00-18:00 Saturday hours, 9:00-2:00pm with no noisy works Sunday, No work Fifthly for ease here are the ways of contacting me. I hope you will not need to but would prefer that you had it easily to hand. Please contact me on 07823 442024 or   Finally I wanted to update you on the fire that occurred on the Milton Court site on Thursday. The fire was restricted to the fire station training tower in the courtyard area of the site and was caused as a result of the burning operations that were being undertaken by Cantillon on the steel sections of the tower. Once the fire was detected, the Emergency Plan was put into effect by Cantillon - the site was evacuated and the emergency services contacted. The emergency services arrived within minutes and the fire was very quickly put under control. The sheeting around the site did its job in containing the fire for longer allowing for safe exit from the site and the arrival of the fire services. The sheeting shrank and melted on the upper floors, without giving off toxic fumes or separating from the structure.  The roads around the immediate site were sealed off by the police as a precaution. Once the dousing down was completed, the scaffold to the tower were inspected by Cantillon and the District Surveyor and it was found that there was no apparent structural damage caused to the scaffold itself. The scaffold sheeting is now being removed and a more thorough inspection of the scaffold has taken place along with the clean up operations generally. No one suffered any injuries and no evacuation of adjacent premises was necessary. No delay to the project is anticipated and the whole episode was dealt with over the space of a couple of hours. This incident has of course been reported to the statutory authorities. Thank you for your understanding over both these incidents. I hope I have given a helpful explanation and that as we go forward with this project we can be a good neighbour to you. Yours faithfully Andy Dyson", 
      "date": "2008-01-13 15:22:00", 
      "id": 3559, 
      "responses": 13, 
      "subject": "Statement from Andy Dyson, Project Director for Cantillon", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3926"
    }, 
    {
      "body": "I like reading Barbicanews and I am grateful to the people that put it together. And I liked what I read in the July issue with the exception of this short section, which did rather jump out at me (p.20):  OK, no problem with the washing, but I don't actually recall ever having seen anyone's bedding or bloomers out in the breeze in EC2. But what is this about recreational use? And people smoking on balconies? It is the very place we send smokers, and that probably happens 6 times a year at our \"demise\".  So, what is recreational? Have I been inviting the wrath of my neighbours while I have been : - Gardening (beyond that which is strictly necessary to comply with the lease) - Contemplating the view - Talking to the neighbours - Taking in the sun - Watching the rain, the fireworks, planes, helicopters... ? If they mean filling the balcony with patio furniture, then they should say so. I am with the BEO if there is a serious risk of harm by people blocking off others' means of escape. But doesn't the rest go a bit too far?", 
      "date": "2005-08-14 22:34:00", 
      "id": 2976, 
      "responses": 9, 
      "subject": "Recreational visits to balconies now banned?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1806"
    }, 
    {
      "body": "I am thinking of installing a hot tub on my (tower block) balcony. Has anyone else done this? Any issues with BEO rules or planning permission?", 
      "date": "2007-07-03 00:21:00", 
      "id": 3480, 
      "responses": 5, 
      "subject": "Hot tub", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3466"
    }, 
    {
      "body": "Just to note that the application for the installation of a new public lift and staircase is about to be considered by the Planning and Transportation Committee on the 23/04/2007 with the recommendation of approval. The report and agenda will be available from the city administrator on 020 7332 3113 five days prior. Members of the public are allowed to address the committee but they must notify 3 working days prior. I can't find anything on the BA site about this change to the structure of the Barbican, which I find amazing. (Apologies if it is there and I couldn't find it but it is easier to find information on the Garchey).  Personally I can't see why we are putting up with this bolt on to the existing structure that doesn't fit in to either the architecture nor concept of the Barbican. As has been said before it is all rather 3rd rate.", 
      "date": "2007-04-11 11:55:00", 
      "id": 4374, 
      "responses": 5, 
      "subject": "Stairway & lift", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3218"
    }, 
    {
      "body": "What's the established practice for Christmas gift giving/tipping of Barbican staff - porters, window cleaners etc? Having only lived in the Barbican since May this year, this is my first Christmas here. Is the consensus to take the attitude that we already pay enough service charge, so do nothing? Or are people more generous than this? What gifts might people give? I don't want to innocently contribute towards overloading the Shakespeare porters with mince pies and Quality Street.", 
      "date": "2005-12-07 13:06:00", 
      "id": 2999, 
      "responses": 4, 
      "subject": "Established practice for Christmas tipping of BBcan staff?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1973"
    }, 
    {
      "body": "I have a knackered old sofa that I want to dispose of. Will the estates office take it away? Anyone know the process?", 
      "date": "2005-12-16 10:29:00", 
      "id": 3010, 
      "responses": 4, 
      "subject": "Getting Rid of a sofa", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1990"
    }, 
    {
      "body": "Has anyone recently experienced the consent procedure for mezzanines? Many thanks,", 
      "date": "2006-12-18 18:35:00", 
      "id": 3372, 
      "responses": 4, 
      "subject": "Alterations/consent", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2845"
    }, 
    {
      "body": "We're looking to have some fairly minor alterations made to our flat (all very much in keeping with the original Barbican aesthetic, and in some areas restoring what was there before the previous occupiers took issue with the interiors). One of these alterations necessitates the repositioning of a partition wall in the bedroom - effectively to allow us to widen the cupboard and wardrobe space (by moving the bedroom door closer to our structural / boundary wall - at the moment it's half way along a partition wall). From what I've understood from the BEO, there is no formal application process (with triplicate forms and the like) for applying for landlord's permission... I simply need to write to them, supplying our architect's drawings of what's intended. They'll then write back either granting permission (or declining it). I would have thought the process was more bureaucratic than that. Can it really be that simple? Beyond that, I've had no end of grief trying to speak to somebody at the Corporation about planning / listed building consent. Nobody seems to be available to take my calls, and despite leaving several messages, nobody calls back. I have found dozens of forms on the COL website, though they seem to be geared to quite major projects - like demolishing and rebuilding a property (for which environmental statements need preparing, etc). There doesn't seem to be a simple / straightforward guide anywhere that discloses what to do with regard to smaller residential alterations. Does anybody know the process and the approximate timescales? Are there any other parties I need to consult with?", 
      "date": "2007-09-02 10:38:00", 
      "id": 3411, 
      "responses": 4, 
      "subject": "Listed building alterations", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3622"
    }, 
    {
      "body": "As one often finds in a large community its inhabitants often find that they encounter severe problems and have serious complaints and do not know how to resolve them. Very recently, someone complained about excess light from neighbouring blocks of offices.  There is a law and it can and has been enforced.   However, using this as an example, the person concerned does not known who to contact and perhaps how to channel the complaint. It would be very useful if the Barbican Association and/or this site on its title page would put a list of the agents and agencies who handle complaints as well as the names and contact telephone numbers and E-Mail addresses of the possible offenders.  That would be extremely useful. One of the problems is that the Barbican Association is staffed by very few volunteers who cannot necessarily have the time to deal with matters that individuals or groups can deal with themselves.  House committees can take action but at least two of them are almost moribund and this at a time of crisis. So either individuals and groups can take action provided they are given proper information and here an organisation like the Barbican Association can come into play and/or  can go back to having a number of standing and active committees such as the one that so successfully dealt with the nightclub at City Point.  More recently, one has found that the BA has taken some very important actions such as concerning Milton Court but failed to follow them up.  I note that about two months ago someone wrote in and asked about secondary glazing etc., that was being provided for the legal firm opposite.  He or she was answered by the BA Chair that the matter was being dealt with.  We have heard nothing since. Now a BA Chair cannot do everything on his or her own and needs active backup by committed people.  It is no good complaining unless you will take action yourselves or at least help provide the back up in terms of advice and other forms of support for people who will take action.  The time is now nearing for elections to the association and it is important for people to be aware of who are the candidates.  Will they be people who will take a full and continuously active role in defending the Barbican or will they be elected just for the supposed glory of occupying a position?  I understand that the current chair is retiring from the post and should be congratulated for his efforts over the years.  Another person who is also quitting his post is Don Prichard who has done so very much to deal with planning applications and the like.  He will be greatly missed and must be placed with a person as knowledgeable, committed and skilled in negotiation. Do make sure you elect people who will take the association forward, make it  still more active, have it anticipate events and never act in a supine way of seeing some move by the Corporation as inevitable and therefore not worth fighting after a certain point. When the time comes make sure that the councillors we elect actually represent our interests.  There are cases of people who have been elected, get absorbed into the system to the point of adopting a Burke-like attitude that they represent \"the greater good\" rather than the people who elected them.  If they have not come up to scratch just throw them out.", 
      "date": "2008-03-29 18:12:00", 
      "id": 3837, 
      "responses": 4, 
      "subject": "Complaints and their resolution", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4165"
    }, 
    {
      "body": "My dear BarbicanTalk Has anyone ever attempted or indeed had any double glazing panels replaced?  I have 2 which have gone distinctly cloudy.  Is this something that I should approach the Corporation for and is it expensive?! Thank you", 
      "date": "2007-04-23 15:41:00", 
      "id": 4260, 
      "responses": 4, 
      "subject": "Replacing double glazed windows", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3264"
    }, 
    {
      "body": "Has anyone had any experience or advice on getting planning permission to replace an original kitchen (including a leaking garchey) with a new style kitchen ? Does anyone know how long the process would take if permission is ever granted ?", 
      "date": "2007-03-21 22:27:00", 
      "id": 4354, 
      "responses": 4, 
      "subject": "Planning permission for a new kitchen ?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3170"
    }, 
    {
      "body": "As a relatively new resident (and also hopeful about the weather!) I wanted to know about the tennis courts within the Barbican - do you need to book and / or pay for these?", 
      "date": "2005-08-05 09:28:00", 
      "id": 2962, 
      "responses": 3, 
      "subject": "Tennis court", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1786"
    }, 
    {
      "body": "Anybody know to which body I should address a letter of complaint about the music from the keep fit classes in the early evening? It's like having a rave foised upon the area each day. Pub noise I expect and accept within reason but thudding megawatt soundsystems in order to shift a few calories is several steps too far. I'm afraid i'm not going to be satisfied with approaching 'the management' either in this case. They have paying customers to satisfy so there is a conflict of interests for a start.  I want to lodge something with a body that cannot simply turn a blind eye nor file my complaint in a folder marked 'trash'. I'm thinking upon the lines of a local noise abatement officer or similar. Please feel free to PM me with accurate details if you have them  or simply don't want to to broadcast the information. Having said that ,unless i'm the only one ready to pop a valve over this irritant, then i'm sure others may be wish to object or lobby too. Regards, L", 
      "date": "2007-05-21 18:21:00", 
      "id": 3323, 
      "responses": 3, 
      "subject": "Enough! YMCA gym music", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3352"
    }, 
    {
      "body": "This is a Shakespeare Tower problem that others - elsewhere on the Estate - may have experienced. If so, help, guidance and advice would be appreciated. It is driving us mad. At 0600 each morning the bedroom wall behind our bed broadcasts the  Radio 4 time pips and then - for an hour - we get the TODAY programme. On the other side of that wall is a stairwell and not the wall of an adjacent flat.  We have no objection the programme - one of us normally gets out of bed to listen to it on the radio in the bathroom at around 0620 before going off to work - but the other needs to go on sleeping and cannot because of the noise from the wall. The two of us have to suffer it at the weekend. It is a real and intrusive problem. We have (as informally as is possible as 0600, gumpy, wearing pyjamas and carrying tumblers to improve the accoustics by resting them against front doors) checked the neighbours flats. It does not seem to be those immediately above or below us.  God know what they would have done if they had seen us. The noise is coming from somewhere else on our side of the tower (we are an 8B: **2 flat). It seems to be travelling up (or down) the wall from a flat where someone has the radio on a timer that lasts for exactly one hour.  Then there is peace. Is anyone else suffering - we are finding this noise is seriously intrusive - and what do we need to do?", 
      "date": "2006-05-07 21:45:00", 
      "id": 3091, 
      "responses": 1, 
      "subject": "Broadcasting Wall", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2270"
    }, 
    {
      "body": "hi, can anyone tell me how to book/ gain access to the tennis courts? thanks in advance for the help.", 
      "date": "2006-07-26 10:10:00", 
      "id": 3133, 
      "responses": 1, 
      "subject": "tennis courts", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2478"
    }, 
    {
      "body": "Hullo I have an original bathroom in my flat which I like very much. My problem is that the sink has a number of cracks in and there are lots of broken tiles.  I want to repair the room but I'm not sure what I'm allowed to do under the listing rules. Is there anywhere obvious to find out? Do I need to ask the Estate Office?  If anyone has an experience of something similar, I'd be really grateful for your advice Thanks", 
      "date": "2006-11-07 17:18:00", 
      "id": 3199, 
      "responses": 1, 
      "subject": "bathroom and listing rules", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2734"
    }, 
    {
      "body": "If my apartment has already been refurbished with consent, does anybody know if  I need to apply again if I want to put extra lighting in the bathroom?", 
      "date": "2008-04-24 20:35:00", 
      "id": 3886, 
      "responses": 1, 
      "subject": "buildings consent", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4271"
    }, 
    {
      "body": "We're thinking of doing some alterations and I'm finding the listed building guidelines a bit confusing. For example, no consent is needed to change the sanitaryware or vanity surfaces in the bathroom unless the \"layout\" is affected - but does that mean that you can only replace things in the same positon (e.g. any new sink has to go in the same place as the original) or does it just refer to the architectual layout i.e. walls and doors. Also does anyone have experience of applying for LBC (some of the changes we're thinking of would definitely require it), and if so how long does it take and is it necessary to get a professional designer/architect to submit the application (the requirements for multiple scale drawings of various elevations to be submitted is rather daunting)? Finally, any recommendations of interior designers/architects and reliable builders/plumbers/decorators would be welcome.", 
      "date": "2007-01-18 22:06:00", 
      "id": 4191, 
      "responses": 1, 
      "subject": "Alterations advice/listed building consent", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2929"
    }
  ]
}