{
  "summary": [
    {
      "body": "I've just received this notification of another application to turn the turret into a flat. I thought this horrible idea had been defeated! Any insights?", 
      "date": "2008-01-23 13:23:00", 
      "id": 3593, 
      "responses": 54, 
      "subject": "Planning application for John Wesley Highwalk Turret", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3943"
    }, 
    {
      "body": "I hear rumblings that Frobisher Crescent is to be converted into residental flats and is at present in the consultation stage. Don't know how a listed building, and I assume it is along with the rest of the estate, be converted into anything other than it's original use. Lots of questions here I think, any other news and views?", 
      "date": "2006-12-01 12:48:00", 
      "id": 3589, 
      "responses": 51, 
      "subject": "Frobisher Crescent conversion!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2794"
    }, 
    {
      "body": "A planning application for change of colour for external redecorations has arrived today in Ben Jonson.  I opened it thinking....please god...anything but red. And of course it's red.  Does anyone know why it has to change, and if so who chooses the colour and why? I have a huge personal dislike of red ... some primeval fear of the colour possibly ... this is actually a huge deal to me although I appreciate it probably doesn't bother most people.   Why mess with something that looks so good as it is? And surely it's harder to change the colour than simply to redecorate with the same shade.  Or maybe the intention is to make sure that the job is done well, so the colour change is a good way of checking it's all been done? I may have to move    ", 
      "date": "2006-04-21 18:59:00", 
      "id": 4393, 
      "responses": 48, 
      "subject": "Paintwork - change of colour for BJH", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2213"
    }, 
    {
      "body": "Does anybody know the latest??", 
      "date": "2007-07-10 13:57:00", 
      "id": 3458, 
      "responses": 37, 
      "subject": "Milton Court", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3486"
    }, 
    {
      "body": "For a long time building works meant that it was not possible to reach the Guildhall Library from the corner of Willoubghy and Andrewes, over the footbridges and down the back of Guildhall. Can anyone tell me when this route re-opened?   Personally I got out of the habit of using it and now fear that low usage may be used to justify the closure St Alphage Highwalk.", 
      "date": "2008-03-02 13:37:00", 
      "id": 3900, 
      "responses": 33, 
      "subject": "St Aphage Highwalk question...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4078"
    }, 
    {
      "body": "I understand that Heron, the  company owned by Gerald Ronson, has supplied Linklaters with excellent secondary glazing as a form of minimising noise during the demolition/construction opposite. As far as I know the same offer was not made to the residents of Speed and possibly Willoughby who are even closer to the site. Why have the house committees and the BA itself not taken action on behalf of the residents?  Why has there not been any public information?  Heavy and noisy destruction is about to start and nothing has been done. Answer please!", 
      "date": "2008-02-04 08:35:00", 
      "id": 3501, 
      "responses": 21, 
      "subject": "Milton Court:  Failure to protect Speed and Willoughby", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3978"
    }, 
    {
      "body": "I understand that plans are now out to redevelop the post office and telephone exchange site on Fore Street.   Also that new plans for Mlton Court are out - seven floors lower than before. Has anyone been to the Planning Department to view them?", 
      "date": "2007-07-25 14:53:00", 
      "id": 4106, 
      "responses": 16, 
      "subject": "Redevelopment of Fore Street Post Office site", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3537"
    }, 
    {
      "body": "Residents will be aware that there is a meeting next Thursday to discuss conversion of the top three floors of Frobisher Crescent into flats. If memory serves correctly, the work schedule includes Saturday mornings - although I am not sure if this includes noisy works (?). Do other residents consider weekend work reasonable given the identity of the site owner and the restrictions accepted by Barbican residents on works in their own flats? It seems fair to me for us to ask for assurances on this issue ....", 
      "date": "2008-05-09 14:08:00", 
      "id": 3697, 
      "responses": 14, 
      "subject": "Frobisher Crescent - conversion - building work on Saturdays", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4317"
    }, 
    {
      "body": "How was the application for planning permission for the re-development of Milton Court has been percieved by the BarbicanTalk users.", 
      "date": "2007-04-11 14:03:00", 
      "id": 4333, 
      "responses": 8, 
      "subject": "Objections to the Milton Court planning application", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3219"
    }, 
    {
      "body": "Does anyone know when this is taking place? I received a letter today from our house officer indicating that it will be next month and that I'll have to move my plants, but I was under the impression that we're still in the consultation period.", 
      "date": "2007-07-11 14:19:00", 
      "id": 3486, 
      "responses": 7, 
      "subject": "Ben Jonson House redecoration", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3488"
    }, 
    {
      "body": "I'm not if this is too specific a topic for this forum, but I was wondering what other Shakespeare Tower residents were thinking about the lobby refurbishment.  I haven't a clue what it's supposed to look like when it's done. I'm liking what I am seeing so far, but I worry it's not going to have as much class as the Lauderdale lobby.", 
      "date": "2007-01-31 22:31:00", 
      "id": 4213, 
      "responses": 4, 
      "subject": "Shakespeare Tower Lobby Refurb", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2998"
    }, 
    {
      "body": "Does anyone have any details please?  Is there a talk and presentation - in which case there is no point going except from the start at 6 p.m., or is it an open exhibition with people around to answer questions?", 
      "date": "2007-09-20 11:33:00", 
      "id": 3431, 
      "responses": 3, 
      "subject": "Tonight's meeting (20/09) about Milton Court", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3668"
    }, 
    {
      "body": "Have we all received the above letter telling us that a hoarding \"will be erected\" for the above work on 23rd April, the very day that a decision was due on planning permission. Was permission granted? If so, are there any ways for the decision to be called in or appealed? Has a hoarding gone up?", 
      "date": "2007-04-24 12:19:00", 
      "id": 4253, 
      "responses": 3, 
      "subject": "Milton Court Lift / Stair Works (Four Communications)", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3266"
    }, 
    {
      "body": "Does anyone know what's happening on the Moorfields Highwalk? It's been cordoned off for almost 21/2 weeks now and no progress seems to be made. Should I speak to the BEO?", 
      "date": "2006-12-13 09:31:00", 
      "id": 3310, 
      "responses": 2, 
      "subject": "Moorfields Highwalk", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2828"
    }, 
    {
      "body": "Why is it being knocked down before consent has been given for a new building?  Or has the consent for the latest application been given?", 
      "date": "2007-11-29 20:05:00", 
      "id": 4152, 
      "responses": 2, 
      "subject": "Milton Court Demolition", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3824"
    }, 
    {
      "body": "Did anyone get to the \"informal public exhibition\" for the redevelopment of Roman House this week? The limited opening hours meant that I was unable to see their proposed plans/designs and impact on Andrewes House.", 
      "date": "2008-03-14 15:48:00", 
      "id": 3814, 
      "responses": 1, 
      "subject": "Roman House - Fore/ Wood Street", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4124"
    }
  ]
}