{
  "summary": [
    {
      "body": "Anybody know to which body I should address a letter of complaint about the music from the keep fit classes in the early evening? It's like having a rave foised upon the area each day. Pub noise I expect and accept within reason but thudding megawatt soundsystems in order to shift a few calories is several steps too far. I'm afraid i'm not going to be satisfied with approaching 'the management' either in this case. They have paying customers to satisfy so there is a conflict of interests for a start.  I want to lodge something with a body that cannot simply turn a blind eye nor file my complaint in a folder marked 'trash'. I'm thinking upon the lines of a local noise abatement officer or similar. Please feel free to PM me with accurate details if you have them  or simply don't want to to broadcast the information. Having said that ,unless i'm the only one ready to pop a valve over this irritant, then i'm sure others may be wish to object or lobby too. Regards, L", 
      "date": "2007-05-21 18:21:00", 
      "id": 3323, 
      "sentiment": 4, 
      "subject": "Enough! YMCA gym music", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3352"
    }, 
    {
      "body": "We're looking to have some fairly minor alterations made to our flat (all very much in keeping with the original Barbican aesthetic, and in some areas restoring what was there before the previous occupiers took issue with the interiors). One of these alterations necessitates the repositioning of a partition wall in the bedroom - effectively to allow us to widen the cupboard and wardrobe space (by moving the bedroom door closer to our structural / boundary wall - at the moment it's half way along a partition wall). From what I've understood from the BEO, there is no formal application process (with triplicate forms and the like) for applying for landlord's permission... I simply need to write to them, supplying our architect's drawings of what's intended. They'll then write back either granting permission (or declining it). I would have thought the process was more bureaucratic than that. Can it really be that simple? Beyond that, I've had no end of grief trying to speak to somebody at the Corporation about planning / listed building consent. Nobody seems to be available to take my calls, and despite leaving several messages, nobody calls back. I have found dozens of forms on the COL website, though they seem to be geared to quite major projects - like demolishing and rebuilding a property (for which environmental statements need preparing, etc). There doesn't seem to be a simple / straightforward guide anywhere that discloses what to do with regard to smaller residential alterations. Does anybody know the process and the approximate timescales? Are there any other parties I need to consult with?", 
      "date": "2007-09-02 10:38:00", 
      "id": 3411, 
      "sentiment": 4, 
      "subject": "Listed building alterations", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3622"
    }, 
    {
      "body": "Well, this was the promise from Cantillon  I was woken at 9:23 this morning by pneumatic drilling. More than a little irritated (having worked a 20 hour day on Friday), I eventually went down to complain to the site manager, and find out who had authorised this. His response was that a Richard Lambert from the Corporation had permitted it. According to him, the project manager had asked the Corp how much noise they can make on a Saturday, and this Mr Lambert said \"you can make as much noise as you like between 9:00 and 14:00\". Who are these faceless %!*!wits who are so generous with our ability to have a nice lie-in ? What is the point of us trying to get commitments from Cantillon regading noise when they are discarded like so much jetsam just weeks into the project ?  ", 
      "date": "2008-02-16 10:42:00", 
      "id": 3510, 
      "sentiment": 4, 
      "subject": "Weekend noise from Milton Court", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4027"
    }, 
    {
      "body": "After a long time, (almost a year?) and having complained politely (yeah, right) to our neighbors upstairs, we made a formal noise complaint at the Barbican offices. The folks upstairs  (an \"L-shaped 20\", I believe is what they're called,) have two 5 or 6 year olds, and a baby that will soon be old enough to stomp and bang itself. They have laminated floors throughout the entire apartment, and every morning, at precisely the legal time to make noise (7:30-8:00 A.M.) BANG! One jumps from it's bed. in the side front room, joined seconds later by the other child, also in the front room. They race to the parents bedroom and jump around there for a while, and run back and forth (I swear I have heard them call it \"the running and jumping game\") and this goes on until they go to school, and from when they return 3:30-ish (with school freinds, often) to run, jump, bang and wrestle until they all go to bed 11:00ish. Its only running and bouncing and kiddie stuff, you can't fault them, they are only kids having fun. But the parents only gave us blank looks when we went up to ask them to hold it down. In our book of Barbican rules it says \"Carpets must cover all floors, to avoid noise.\" (I'm paraphrasing) So we complained in the Barbican office. They took down the info, and told us not to expect anything to happen \"for a reasonable lenghth of time, which meant sometime in Dec. They then added that since it would be around Christmas time by then, the neighbors probably wouldn't want to be buying and installing carpets then...     In October, a month or so after our complaint, we got a letter from the Barbi Corp asking US to keep a log of THIER noise FOR A MONTH, and  submit it back to them. Um, why is it OUR responsibility to spy and report on our nieghbors? Very Maoist spy-on-your-neighbor policy. We did it, though, making us seem quite petty, writting down everytime they banged on the floor or jumped off the furniture The corp. sent back a notice telling us that most of the noise was \"within noisey hours\" (I said I was paraphrasing, folks!) except for once when it went past midnight, which was aparently our only valid complaint. Whaaa? The complaint is that THEY DO NOT HAVE CARPETS TO CUT DOWN ON NOISE. The reply also said we had \"Screamed at them in April\" (10 months earlier) during one of the brat's (I'm still parapharasing) birthday party. Aparently that was enough to negate our claim. Actually, the Corp had told them to get carpeting, but to give them time to do so, 3 months, and if they don't, we should feel free to complain again.      We are going to get a chimpanzee and a breeding pair of Lorries, a very beautiful and very songful bird. Let THEM complain! We'll tell 'em that carpeting their floors might cut down on some of the noise.     A rule is a rule innit? Does anybody know the \"real\" rules on carpeting floors? I'ver noticed somewhere on Barbican talk that somebody mentioned their wood floors. We've also noticed the Estate Agents sometimes advertise wood floors as a plus when offering Barbican apartments for sale. We wouldn't mind if it was a sweet, lightweight lady like Thelma walking in slippered feet on her cold, cold floor, but it ain't. This is the main reason I got on this site, to find out what the \"unwritten\" rules are. Thanks in advance for your upcoming input!", 
      "date": "2008-02-03 09:04:00", 
      "id": 3778, 
      "sentiment": 4, 
      "subject": "Barbican bylaws versus Ignoring Barbican bylaws.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3976"
    }, 
    {
      "body": "I'm concerned about the notices that have appeared on every single entrance door in the blocks. My understanding was that residential buildings should have some exemption from labeling. Can somebody please quote chapter and verse of the new legislation??? Or has BEO stuck these up just in case? I'm asthmatic and the last thing I want is smoking, but I have never been troubled by it here and dont expect to be. I certainly dont want to arrive home each evening to be forced to think about two things (1) the bossy boots anti-libertarianism of the Government and (2) yes, smoking  its not usually on my mind. I find these officious little stickers every bit as much of a nuisance as a puff of smoke in my face. Otherwise, as there are a few thousand criminal offences on the statute books might I suggest a few more bossy notices? Please tell me Im not alone someone   ", 
      "date": "2007-06-30 17:05:00", 
      "id": 4040, 
      "sentiment": 4, 
      "subject": "No-Smoking notices - can we get them removed?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3458"
    }
  ]
}