{
  "summary": [
    {
      "body": "I'm interested in finding out more about the Golden Lane guest flats (quality, pricing, etc.).  Any information would be much appreciated.  Regretfully my search showed only the last post of recent weeks.  Many thanks!", 
      "date": "2007-09-15 12:43:00", 
      "id": 1425, 
      "sentiment": 2, 
      "subject": "Golden Lane Guest Flats", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3658"
    }, 
    {
      "body": "Hi  Does anyone know how to whiten these original Barbican bathtubs.  I am poised to sell/rent my flat and would like a whiter bathtub to be part of the picture. I once had a cleaner from Abracadabra or somewhere come in and they told me something about soaking the tub overnight with bio or non-bio washing powder - dissolved in cold water.  Does anyone know this or any other tricks? Thanks very much, Jeannie", 
      "date": "2007-12-01 14:33:00", 
      "id": 2625, 
      "sentiment": 2, 
      "subject": "A whiter bathtub", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3831"
    }, 
    {
      "body": "We have the original bedroom wardrobe doors; on one, a hinge has pulled away from the door frame (they are soldered, not screwed). Can anyone advise on how to repair this (I am not a metal basher) or alternatively suggest who could do it for me?? many thanks - Roy S", 
      "date": "2006-02-09 15:58:00", 
      "id": 2753, 
      "sentiment": 2, 
      "subject": "Repairing wardrobe doors", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2064"
    }, 
    {
      "body": "Hi there. Have been looking to move from one Barbican flat to another. The one I have seen has an original oven. Anyone here used one? They look good but small. Maybe fab for cakes but not so good for the Christmas turkey. Any thoughts?", 
      "date": "2005-04-13 22:24:00", 
      "id": 2908, 
      "sentiment": 2, 
      "subject": "Chefs ahoy", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1562"
    }, 
    {
      "body": "On the standard electric CredaPlan barbican oven, could some-one help me translate the numbers on the dial so I can cook my ovenready meals safely? The Oven dial runs from 0 to 5 ..... Now are those the same as 'gasmarks' referred to on ready meals?  - clearly not Centigrade or Fahrenheit. Any enlightenment would be appreciated, many thanks,", 
      "date": "2005-04-17 21:49:00", 
      "id": 2913, 
      "sentiment": 2, 
      "subject": "Settings on CredaPlan Oven", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1569"
    }
  ]
}