{
  "summary": [
    {
      "body": "In case anyone didn't get today's junk mailing inside the \"City Resident\" magazine, the St Alphage House redevelopment is to be exhibited at the City of London Girls School, Weds 26th March 6pm - 8pm and Thurs 27th March 4pm - 7pm.  There is very little extra \"real\" information in the mailing, other than confirming the footprint of the building, which will include the Fore Street Telephone Exchange. Strangely enough they chose not to include any renderings of the proposed building - guess we'll all have to go along to see the alleged elephantine building.", 
      "date": "2008-03-18 23:08:00", 
      "id": 3587, 
      "responses": 77, 
      "subject": "St Alphage House Exhibition at Girls School, 26/27 March", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4138"
    }, 
    {
      "body": "Has anybody had any success in trying to stop the relentless influx of unsolicited mail that we seem to get shoved through our letterboxes? I'm fully aware that the Post Office have a statutory duty to deliver anything which has the address on it (hence their legal inability to avoid delivering stuff to \"the occupier\"). But I have registered with the mail preference service and I still get unsolicited, environment-unfriendly **** put through my door. I even have a sign above my letterbox, clearly asking people to avoid giving me flyers, menus and junk mail and yet it is constantly ignored: *     The Guildhall School of Music still chuck unwanted flyers at me, begging me to attend plays I don't want to see, and concerts I don't want to listen to. *     Ken Livingstone's propaganda newspaper, sorry \"mayoral communique\" is also forced upon me, and that rag isn't even absorbent. I can just about cope with taking these unread items and putting them straight in the recycling bin but I would rather be left in peace. Its not a lot to ask. Do any fellow residents have any decent strategies to avoid these annoying environmentally-harmful intrusions? And if not, could our friendly police advise me on the legality of lying in wait for these doorsteppers and dispatching them with harsh language and a water pistol?", 
      "date": "2007-09-01 21:29:00", 
      "id": 3434, 
      "responses": 12, 
      "subject": "Junk Mail- How can I stop it?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3621"
    }, 
    {
      "body": "Perhaps it might be a good idea for Cityview magazine to read their article on page 8 and 9 of its August 2006 edition of Cityview, entitled \"What a Load of Rubbish\". Then perhaps refrain from sending FOUR copies of its magazine to the same household, thus generating unwanted and unnecessary printing postage and waste paper. That in turn requires a collection and re-cycle programme. Maybe they could write a follow up article entitled \"What a Waste of Time and Resorces\"? Anyone else feel the same way?  The consumer does not produce all this rubbish, they are only the last link in the chain of unwanted junk mail and un-necessary packaging. Kevin Usher", 
      "date": "2006-08-16 08:28:00", 
      "id": 4456, 
      "responses": 9, 
      "subject": "The Irony of Cityview!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2529"
    }, 
    {
      "body": "Anyone interested in the campaign to save Milton Court should check out   , about which I received a flyer last week (surprised no-one has posted to complain about such unsolicited missives disturbing the order of their letterboxes)", 
      "date": "2006-10-14 21:03:00", 
      "id": 4292, 
      "responses": 4, 
      "subject": "Milton Court website", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2679"
    }, 
    {
      "body": "On Thursday 1st May, we have the well publicised London Mayoral Elections between Ken Livingston and Boris Johnston, which I think most people will have formed an opinion as to whom to vote for. Also that day, we have elections for the London Assembly. For this, I am much less clear on who to vote for, and would appreciate any input from people more clued up on local politics and the London Assembly. The London Assembly vote is split between a constituency vote in the City and East London, where you vote for a specific person, and a London-wide proportional representation vote, where you vote for a party. Our current London Assembly constituency member is  , who has a   . Can anyone comment on John Biggs? Is he worth voting for - his election flier that was junk mailed across the estate seemed reasonably impressive - at least he is aware of some of the planning issues around here. Or is there a better candidate, or more precisely, a better candidate with a chance of unseating him - I would think a 14,000 majority makes it a safe seat for him.  The   resulted in 5 Liberals, 2 Labour, 2 Greens and 2 UKIPs. Can anyone comment on the effectiveness of any of these parties in the London Assembly, for example have the 2 Green Party members been able to make a difference, have the Liberals been able to make their voices heard? Many thanks, Paul.", 
      "date": "2008-04-26 11:19:00", 
      "id": 3888, 
      "responses": 3, 
      "subject": "London Assembly Elections - Thurs 1st May at St Giles Church", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4275"
    }, 
    {
      "body": "Gosh aren't I lucky just heard that Thomas More House and me in particular have been chosen as one of the \"few\" places/people in the whole of London to be chosen to take part in their draw and apparently I am already at stage three without knowing anything about it.  How do these people get addresses and do they think we are all daft?  Any other specal people out there in Barbican land?", 
      "date": "2006-12-29 12:24:00", 
      "id": 4120, 
      "responses": 1, 
      "subject": "Readers' Digest Draw", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2864"
    }
  ]
}