{
  "summary": [
    {
      "body": "As it has been about a month since guest postings were stopped, I was wondering how others felt this action was affecting the forum. I certainly find I am less likely to post (I know it only takes a minute to log in but still ...!) Might this affect the classifieds, or indeed the forum as a whole, if people are less likely to post? It seems like it's the same few people posting all the time. It may of course be the case that people are sticking to just one name now rather than a number of pseudonyms! There seems to be more consensus amongst the relatively few posters and consequently less fun. A couple of abrasive comments livened things up on here!  Does the Moderator have any plans to reconsider what appeared to be a hasty decision? The thread that caused the problems was pretty dumb, and doubtless offensive, but would have burnt itself out pretty quickly with judicious use of the delete key! In any event, as the Moderator has pointed out in a recent thread, stopping guests does not stop some people taking multiple names and using fake email addresses.  How do other forum users feel?", 
      "date": "2005-05-15 00:02:00", 
      "id": 4717, 
      "responses": 19, 
      "subject": "The guestless forum", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1631"
    }, 
    {
      "body": "so its seems that access has now been restricted to registered members only. so what did i miss? (maybe i shouldnt ask this question and risk banishment to the nuclear family gulag ?!)", 
      "date": "2005-04-13 22:20:00", 
      "id": 2915, 
      "responses": 10, 
      "subject": "no more guests", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1561"
    }, 
    {
      "body": "Do talkers think officers of the City of London should use this facility to respond to comments raised? It came up in the YMCA meeting tonight so to assist officers in their deliberations, so I thought I'd ask ... good idea or bad idea? Paul from the Police does already, and I personally find his interventions v useful ...", 
      "date": "2006-05-10 22:32:00", 
      "id": 3105, 
      "responses": 7, 
      "subject": "barbican talk", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2280"
    }, 
    {
      "body": "How old are you?  Just fill in the poll above so it can be private.  I am just curious", 
      "date": "2005-06-23 16:22:00", 
      "id": 4674, 
      "responses": 6, 
      "subject": "Age", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1710"
    }, 
    {
      "body": "Where is Strawby? I miss her contributions to the discussions.", 
      "date": "2005-08-11 16:06:00", 
      "id": 2980, 
      "responses": 4, 
      "subject": "Strawberry", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1800"
    }, 
    {
      "body": "is this site aimed at people who live on the barbican estate only or the area in general? i have recently moved to the golden lane estate and was wondering if people from there use this site?", 
      "date": "2005-06-02 11:45:00", 
      "id": 4728, 
      "responses": 4, 
      "subject": "this site", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1659"
    }, 
    {
      "body": "I recently registered & have just received a private message to my Barbican Talk  (just saying 'hi') from a kamleshgjadav (based in India). It seems our message board is going global. Has anybody else had any private messages from strangers?", 
      "date": "2004-04-08 20:37:00", 
      "id": 4751, 
      "responses": 1, 
      "subject": "private messages?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1071"
    }
  ]
}