{
  "summary": [
    {
      "body": "My son just bought a flat in Willoughby House and we struggled to find a good contractor who wanted to work at the Barbican. Eventually through a recommendation from a friend we found Dan O'Connor and he has proved to be fantastic. He has completely renovated the flat including two new bathrooms and a new kitchen (Bye Bye Garchey!) We've now broken him in to the perculiarities of the Barbican so he knows how to fit in with the regulations and how to deal with rubbish disposal etc. He is a qualified electrician and can issue the appropriate certification of his work We found him honest, reliable, skilled and above all 'easy to do business with'. If you'd like to know more please let me know - I can even arrange to let you see his work.", 
      "date": "2008-03-06 15:21:00", 
      "id": 3884, 
      "responses": 4, 
      "subject": "Interested in a good reliable contractor -Was great for us", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4088"
    }, 
    {
      "body": "I was wondering if anyone has opened up the wall between their kitchen and lounge?  If so, who did the work and would you recommend them?  We're hoping to do the same in our new flat and would like to get someone who comes recommended.", 
      "date": "2007-05-15 19:56:00", 
      "id": 4347, 
      "responses": 3, 
      "subject": "Opening up a kitchen", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3335"
    }, 
    {
      "body": "I want to get my bathroom renovated - regrouted etc. Has anyone had this done and can recommend someone?", 
      "date": "2005-12-10 18:03:00", 
      "id": 3001, 
      "responses": 2, 
      "subject": "bathroom renovation", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1979"
    }, 
    {
      "body": "We're thinking of doing some alterations and I'm finding the listed building guidelines a bit confusing. For example, no consent is needed to change the sanitaryware or vanity surfaces in the bathroom unless the \"layout\" is affected - but does that mean that you can only replace things in the same positon (e.g. any new sink has to go in the same place as the original) or does it just refer to the architectual layout i.e. walls and doors. Also does anyone have experience of applying for LBC (some of the changes we're thinking of would definitely require it), and if so how long does it take and is it necessary to get a professional designer/architect to submit the application (the requirements for multiple scale drawings of various elevations to be submitted is rather daunting)? Finally, any recommendations of interior designers/architects and reliable builders/plumbers/decorators would be welcome.", 
      "date": "2007-01-18 22:06:00", 
      "id": 4191, 
      "responses": 1, 
      "subject": "Alterations advice/listed building consent", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2929"
    }
  ]
}