{
  "summary": [
    {
      "body": "I love my original Barbican bathroom, and have stuck with it as long as I possibly can, but it is now in such a bad state I am afraid I have to do a major renovation. Any spare parts will, of course, be offered for re-use. My questions are: Can anyone recommend a designer? Preferably, one who would stay as close as possible to the original design. Any ideas about how much this will cost and how long it will take? I would appeciate any advice or information.", 
      "date": "2006-01-24 00:02:00", 
      "id": 2882, 
      "responses": 10, 
      "subject": "Renovating a bathroom", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2041"
    }, 
    {
      "body": "Has anyone got any recommendations for interior designers? Three advertise in Barbican Life (David Carden, Peta Weston & Hazel Ewing) - can anyone recommend one of them or is it another case of paying extra for unnecessary \"Barbican\" expertise?", 
      "date": "2007-01-24 21:49:00", 
      "id": 4199, 
      "responses": 6, 
      "subject": "interior designers", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2955"
    }, 
    {
      "body": "I am planning to decorate part of the flat and would be pleased to receive recommendations of reliable contractors. Neighbours have recommended Emma James, who has worked on the estate, but the telephone number I have been given seems to be incorrect. Happy New Year to everyone.", 
      "date": "2007-01-04 11:22:00", 
      "id": 4125, 
      "responses": 1, 
      "subject": "INTERIOR DECORATOR/EMMA JAMES", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2877"
    }, 
    {
      "body": "We're thinking of doing some alterations and I'm finding the listed building guidelines a bit confusing. For example, no consent is needed to change the sanitaryware or vanity surfaces in the bathroom unless the \"layout\" is affected - but does that mean that you can only replace things in the same positon (e.g. any new sink has to go in the same place as the original) or does it just refer to the architectual layout i.e. walls and doors. Also does anyone have experience of applying for LBC (some of the changes we're thinking of would definitely require it), and if so how long does it take and is it necessary to get a professional designer/architect to submit the application (the requirements for multiple scale drawings of various elevations to be submitted is rather daunting)? Finally, any recommendations of interior designers/architects and reliable builders/plumbers/decorators would be welcome.", 
      "date": "2007-01-18 22:06:00", 
      "id": 4191, 
      "responses": 1, 
      "subject": "Alterations advice/listed building consent", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2929"
    }
  ]
}