{
  "summary": [
    {
      "body": "My JLP sources confirm that the Waitrose is definately coming to   Tree Walk!", 
      "date": "2006-03-09 11:10:00", 
      "id": 1176, 
      "sentiment": 2, 
      "subject": "Waitrose", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&hilit=Organic+Morello+Cherry+Preserve&t=2122"
    }, 
    {
      "body": "I note a few messages about Crossrail on another thread - and thought it might make sense to start a new one here.  I think one of the messages says that there is a plan B regarding the Crossover cavern under Defoe House.  There is indeed a Plan B, but that doesn't stop the crossover being constructed - but it might enable the engineers to do away with the proposed surface works on Aldersgate Street as the plan involves removing the muck through the tunnels back to Liverpool street, rather than through a shaft at Aldersgate Street/Beech Street.  Regarding subsidence, residents will be exceedingly unlucky if they are affected at all.  Virtually all underground works make for some subsidence (most of the Barbican falls within a prospective area where up to 10mm of subsidence might be expected) - but if this occurs evenly across the structures it is unlikely that anyone will notice apart from the engineers with their precision monitoring instrumentation.  Bear in mind that the Crossrail route under the Barbican is actually directly underneath the existing Metropolitan Line/Circle line/Thameslink tracks - and for safety reasons any subsidence will have to be very tightly controlled under the existing tracks.  I don't think Defoe residents should have anything to worry about.  Plenty of tunnelling has taken place under London recently without damage to overlying structures. Regarding the Crossover cavern - this is a structure where the twin tunnels are merged effectively into one much wider one so that trains can be switched from one track to the other.  These are necessary for both safety and operational reasons.  I am not sure why such a cavern needs to be directly under Defoe, but it is necessary for it to be somewhere, and in an urban environment it is virtually bound to be under some building and the plans place it  below Defoe and I doubt that that will be changed, but I reiterate that I still don't believe that Defoe, or any other Barbican residents will have anything to worry about from the tunnels themselves as they are 30 m down and modern engineering should be able to cope very well with this kind of problem.  The noise etc. from works in Aldersgate Street is another factor altogether and i think the current plans call for works to be carried out there for up to 43 months! - If we can do anything to get Crossrail to implement Plan B then we should.  Traffic disruption alone will be pretty horrendous, and there will also be major traffic problems in Moorgate where a major sewer has to be diverted and then replaced.  We do live in 'interesting times.'", 
      "date": "2005-04-13 20:06:00", 
      "id": 2909, 
      "sentiment": 2, 
      "subject": "Crossrail", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1560"
    }, 
    {
      "body": "I am new round here..... please can someone tell me how i might go about joining the Barbican tennis club? Or else how we are able to access/use the School courts?", 
      "date": "2005-04-15 13:37:00", 
      "id": 2911, 
      "sentiment": 2, 
      "subject": "Anyone for tennis?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1567"
    }, 
    {
      "body": "Hello I've got a 9 month old baby here in the Barbican, and I've been trying to get information from the Corporation about Childcare places (and, later on, school places) in the City. The Corporation themselves don't seem very sure what they offer. I know that there are several private nurseries (that I can't afford). Does anyone know what's the deal with 'local authority' provision of nursery care? And, if Sir John Cass is the only primary school in the City, is that where my son has to go? Does he automatically get in? (even though we're not C of E). Thanks for any help! A Confused Parent...", 
      "date": "2005-04-19 15:47:00", 
      "id": 2916, 
      "sentiment": 2, 
      "subject": "City childcare & schooling", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1577"
    }, 
    {
      "body": " hello i have been using the gym here at the ymca for a few months as a resident the cost was two pound a session witch was good the other day i went to use the gym and was told that if i want to use it the cost would be six pound ! i was shocked and asked the reason for the increase and was told it was becose they have instaled new equipment i am still not happy with this does anybody know of a reasonibly priced gym thats local? thanks", 
      "date": "2005-04-19 14:20:00", 
      "id": 2928, 
      "sentiment": 2, 
      "subject": "ymca gym", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1575"
    }
  ]
}