{
  "summary": [
    {
      "body": "As those of you who have received the latest Barbican Life will have seen, we did use barbicantalk comments on local establishments.  I am particularly keen to continue doing so, so please do comment in this thread on good, or bad, eating experiences in the general Barbican area.  I'm also keen to learn of reaction to new restaurants - for example I looked in on the new Cardamom Rooms restaurant in Charterhouse Square the other day (has replaced the old Gulshan/Bar Bombay) and it looks really nice and they seemed to be making a great effort - but I haven't eaten there yet.  Any comments would be appreciated. Also the Comptoir Gascon in Charterhouse Street has extended its eating options - anybody tried this yet? Any other new restaurants around that barbicantalkers have sampled?", 
      "date": "2005-09-25 08:56:00", 
      "id": 1375, 
      "sentiment": 3, 
      "subject": "Restaurants", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1854"
    }, 
    {
      "body": "I'm sure all residents posted all their Christmas cards weeks ago so this is a bit late, but I'd like to draw people's attention to the excellent cards they sell in the Survival International shop on Goswell Road. Slightly arty photos of life in the Arctic - 10 cards for 4.95", 
      "date": "2005-12-19 17:45:00", 
      "id": 3014, 
      "sentiment": 3, 
      "subject": "Christmas cards", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1996"
    }, 
    {
      "body": "There's a notice going around from the Soil Association. Looks like a very good line-up of exhibitors. Sounds like a one-off so we need to give as much attendance as poss. to encourage them to repeat. Should be well worth going. 10:00 till 4:00 on Sunday 8th Jan. Admittance fee not mentioned so assume free. We're defininitely going - see you there  ", 
      "date": "2006-01-04 14:34:00", 
      "id": 3026, 
      "sentiment": 3, 
      "subject": "Organic farmers' market this Sunday at the Brewery", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2011"
    }, 
    {
      "body": "just to let any pensioners who dont already know you can have lunch in the ymca resturant  on saturday and sunday at 1-2 pm it costs 4.50 which is a good deal    by the way residents do not get lunch so you will have a nice quiet meal", 
      "date": "2006-05-11 17:01:00", 
      "id": 3102, 
      "sentiment": 3, 
      "subject": "pensioners lunch ymca every saturday/sunday", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2285"
    }, 
    {
      "body": "Does anyone know if there are exciting archaeological discoveries being made on the site of the new school in Whitecross St.? I can see it from my windows and was surprised to see that a large white protective roof has gone up over part of the site. There's a notice saying 'Danger Deep Excavation' on the surrounding fencing. The people who've been visible on site today are certainly not the usual workforce, either. As an historian specialising in this area I'm fascinated!", 
      "date": "2006-05-05 14:56:00", 
      "id": 3108, 
      "sentiment": 3, 
      "subject": "Archaeology on the new school site?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2256"
    }
  ]
}