{
  "summary": [
    {
      "body": "Early Saturday morning around 5am, I looked out my bedroom window and was shocked to see 2 middle aged men running around the gardens naked except for running shoes. I must admit that I was a little unsettled by the experience especially when the first man (obviously the pace setter) disappeared into Defoe house followed shortly by the other gentleman who was clutching his chest and appeared to be in great difficulty. Is there a new resident's running club that I should be aware of?", 
      "date": "2006-11-20 21:26:00", 
      "id": 3220, 
      "responses": 20, 
      "subject": "Nude Jogging", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2764"
    }, 
    {
      "body": "Does anybody know why there are two people trying to fish out the baby ducklings from the Lake?", 
      "date": "2008-04-12 18:44:00", 
      "id": 3874, 
      "responses": 13, 
      "subject": "Baby ducklings", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4231"
    }, 
    {
      "body": "Around 7am, 3 mornings a week a man can be heard in the Ben Jonson/Breton House/Cripplegate Free Library area shouting at the top of his voice: 'Hello' and 'oh dear oh dear oh dear oh dear oh dear'. It continues for about a minute then stops. Occasionally another person joins him, but I'm not sure what they're shouting. Can anyone fill me in?!", 
      "date": "2007-08-06 09:55:00", 
      "id": 4118, 
      "responses": 9, 
      "subject": "shouting", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3564"
    }, 
    {
      "body": "I was airing my slacks on the balcony of the apartment (yes, I know we're not supposed to do that, but it was an emergency!) but the wind must have taken them... I don't suppose anybody has seen a pair of Zandra Rhodes emerald green palazzo pants in the vicinity of Shakespeare tower?", 
      "date": "2008-01-31 22:41:00", 
      "id": 3628, 
      "responses": 7, 
      "subject": "Look out below!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3969"
    }, 
    {
      "body": "A Chinook and an Apache have just flown past my window, taken off from HAC I assume. I  heard what  I am sure was machine gun fire from the grounds earlier today. Anyone know what's been happening?", 
      "date": "2008-05-20 19:54:00", 
      "id": 3598, 
      "responses": 5, 
      "subject": "helicopters", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4362"
    }, 
    {
      "body": "Anyone notice the steam coming out of the drains on the corner of Beach St and Aldersgate? Just curious as to where the heat is coming from as it looks like the streets in New York.", 
      "date": "2006-08-22 09:28:00", 
      "id": 3166, 
      "responses": 4, 
      "subject": "Steam", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2549"
    }, 
    {
      "body": "The strangest thing happened on the podium on Saturday evening. My husband and were standing chatting on the podium when a woman jogger dressed in leopard skin barged between us, knocked me and carried straight on with out so much as a word. Is was so strange and rude that I'm now wondering if it was so bizarre part of the installation- she seemed to be running along the yellow line.  EIther that or there is a rude jogger on the podium.", 
      "date": "2007-06-05 10:14:00", 
      "id": 3338, 
      "responses": 3, 
      "subject": "Err... is it art?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3394"
    }
  ]
}