{
  "summary": [
    {
      "body": "anybody know what / why the sudden psychedelic green algae bloom on the upper lake?  the water's looking flurotastic and pretty nasty from up here.  i don't remember pond scum of that voracity before the lake rennovations... can we hope that the proposed re-planting of the sunken reed beds will help clean up the problem?", 
      "date": "2005-04-22 11:20:00", 
      "id": 2923, 
      "sentiment": 2, 
      "subject": "lakes", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1583"
    }, 
    {
      "body": "Roof works on Bunyan have just concluded, but there's a ton of stuff that's not quite right ... we've been promised a snagging meeting and commitments to correcting faults etc.  Should we be optimistic that this snagging meeting will yield results, or are we simply venturing forth into a new sea of shifting Technical Services sands?  Any tips for progressing appreciated ...", 
      "date": "2005-05-04 06:17:00", 
      "id": 2940, 
      "sentiment": 2, 
      "subject": "Roof works - the final frontier?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1606"
    }, 
    {
      "body": "Does anyone know why it is necessary to water Thomas More gardens twice a day for twenty minutes at a time?  From TM house to about a third of the way up the garden the ground is waterlogged and horrible to walk on.  There are permanet puddles at the end by the school and on the path outside my flat.  Indeed when the ducks are around they walk from the lake to sit in the puddles!  We know the garden is built on builders and bomb rubble and doesn't drain easily , so why spend four hours a week watering?  Surely three times would be sufficient or even rely on the weather, in the winter in particular.  It's not as though the garden has wonderful species in it, in fact it's positively overgrown by Lambert Jones Mews.", 
      "date": "2005-09-26 13:54:00", 
      "id": 3057, 
      "sentiment": 2, 
      "subject": "Waterlogged gardens", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1855"
    }, 
    {
      "body": "I have signs of water leaking in to my ceiling, but the people upstairs say they can't find any problem? Any suggestions as to what I do now? If water is coming in through upstair flat's window frames, is it the Corporation's problem? Anyone know? Advice welcomed, thanks", 
      "date": "2006-04-29 10:52:00", 
      "id": 3076, 
      "sentiment": 2, 
      "subject": "water leak", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2237"
    }, 
    {
      "body": "Is the Barbican slowly becoming an island? Two Wood Street access point have been lost and I found hoarding blocking my way at the Andrew's end of the estate yesterday. I suppose it makes us more secure in some ways but it looks as though the estate is becoming cut off and the corporation must be making money out of giving rights of access away for office space?", 
      "date": "2005-10-11 09:58:00", 
      "id": 3117, 
      "sentiment": 2, 
      "subject": "Island Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1876"
    }
  ]
}