{
  "summary": [
    {
      "body": "No channel 5 on terrestrial channels and BBC1 in black and white with no sound - Breton House 19:45, Wednesday.", 
      "date": "2007-10-31 19:39:00", 
      "id": 3463, 
      "responses": 11, 
      "subject": "TV reception Wednesday 31 October", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3757"
    }, 
    {
      "body": "If you hate calling NTL's customer service because calls get disconnected or you can't get connected to the Westminster call centre - use the following email address:   It's better than dealing with them over the phone and everything is recorded in writing.", 
      "date": "2005-04-19 09:08:00", 
      "id": 4709, 
      "responses": 11, 
      "subject": "NTL Westminster Customer Service Email Address", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1574"
    }, 
    {
      "body": "Film 4 was advertised as being available free from last weekend on  Freeview channel 31, and indeed I found a discarded Schedule of Highlights listing programmes of films from 23 July. Yet when tuning to Freeview channel 31 (yes I re-tuned all channels on the box last Sunday) the onscreen program guide for channel 31 lists all sorts of programmes except films! Odder still, e.g. this evening I select the channel despite said erroneous program descriptions and find there is a film showing (Madness of King George).", 
      "date": "2006-07-26 23:08:00", 
      "id": 4464, 
      "responses": 6, 
      "subject": "Film 4 on channel 31 Freeview - onscreen Programme Guide", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2480"
    }, 
    {
      "body": "Just had it installed and it's very very impressive for those that are interested, now need to have another Sky Cable installed to take full atvantage of the Sky + element, does anyone know how I get this done?", 
      "date": "2006-07-03 09:39:00", 
      "id": 3128, 
      "responses": 5, 
      "subject": "SKY HD", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2424"
    }, 
    {
      "body": "i am routinely baffled by some of the technical posts on here so forgive the simple approach but ... i had long battled with a simple freeview box and trying to record things on a dvd recorder ... it just never seemed to work, the wires always seemed to be in the wrong place etc ... when the freeview box just packed up over night, i went and bought a \"digital terrestrial TV receiver / recorder\" by Sagem ... it lets me watch all the channels like BBC 24 etc but the great thing is ... it took seconds to install and recording anything and everything is miraculously simple ... it cost about 120 from the shop in moorgate (Currys or Dixons or whatever) and its worth every penny ...  no doubt you have all had one for ages but if you haven't and ur not that interested in techy things but want to tape Film 4 etc I thought the tip might be helpful", 
      "date": "2007-01-29 23:15:00", 
      "id": 4207, 
      "responses": 3, 
      "subject": "freeview", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2975"
    }, 
    {
      "body": "Seemingly un-related to all the Broad-band connection problems associated with Moorgate Exchange BT phoned yesterday to offer a Free of Charge Freeview Box. I bought one some time ago but others may benefit", 
      "date": "2008-03-20 10:24:00", 
      "id": 3819, 
      "responses": 2, 
      "subject": "BT Freeview", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4142"
    }
  ]
}