{
  "summary": [
    {
      "body": "Are there any other Holmes Place Barbican users experiencing the hell that the Aldersgate gym has become? This is not just because it is in renovation mode. A selection of my gripes (much abbreviated) include: Young children (in particular pre-teen girls) romping around in the  men's shower room at weekends while their Dads are in the shower cubicles....it is beyond daft, but most young men using the showers at the same time look too embarrassed to complain  Washing the changing room floor - sealing off access to lockers with the fresh change of clothes etc in it - while the gym is in full swing Cutting the sunbed time from 15 minutes to 10 minutes (for the same price)", 
      "date": "2004-09-06 19:28:00", 
      "id": 5533, 
      "responses": 27, 
      "subject": "The hell that is Holmes Place Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1250"
    }, 
    {
      "body": "I'm looking at covering Health Clubs and Gyms in close proximity to the Barbican in the next issue of Barbican Life.  Those I'm looking at are:  Champneys, Holmes Place Barbican, Holmes Place Moorgate, Lambs Club (Fitness Exchange), LA Fitness, Fitness First and the YMCA.  Comments appreciated as long as they don't stimulate a thread like the long running one - 'The Hell that is Holmes Place'!  Interested in facilities, service, pricing etc.  Obviously I'm asking the health clubs themselves to send in photographs and details on their services, but users comments would also be appreciated and may be used anonymously.", 
      "date": "2006-01-14 10:19:00", 
      "id": 3044, 
      "responses": 14, 
      "subject": "Health Clubs etc.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2034"
    }, 
    {
      "body": "I discovered recently that Holmes Place Barbican has significantly reduced its off-peak hours (but of course without any corresponding reduction in its membership fee). They've also introduced a new rule that off-peak members aren't admitted more than 30min before the end of the off-peak period and need to leave before it ends - before so long as you entered within the off-peak time you could stay as long as you liked. Aside from meaning they now offer considerably worse value for money for off-peak members, this is plainly in breach of their membership conditions (which do not mention them having any right to vary off peak hours). I strongly urge any off-peak members to write to the manager, Andy Francis, and ask him to reinstate the previous rules, or at least offer a significant reduction in price.", 
      "date": "2005-09-09 18:18:00", 
      "id": 3234, 
      "responses": 14, 
      "subject": "Holmes Place hours change", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1835"
    }, 
    {
      "body": "Hi, could anyone let me know membership fees for Virgin gym at Barbican or City point gym? Have looked on both websites & neither seem to advertise prices. I enjoy classes & swimming but don't particularly use the exercise machines. Any other recommendations locally? Thanks", 
      "date": "2007-10-02 06:44:00", 
      "id": 3448, 
      "responses": 13, 
      "subject": "Gym membership", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3703"
    }, 
    {
      "body": "Holmes Place Barbican has been trying to put my Gold/Link membership up to 980 per year on the basis that that is their usual membership.  I've resisted and they have now come in with a better offer but I'd be grateful to hear from others about what they pay, particularly if there is anyone with an ancient membership which was supposed to give a permanent discount. Also, since Holmes Place often raises my blood pressure as much as it's supposed to lower it, does anyone have strong recommendations for alternatives.  Is Champneys still hugely expensive?", 
      "date": "2006-02-13 16:01:00", 
      "id": 3184, 
      "responses": 11, 
      "subject": "Gym fees", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2071"
    }, 
    {
      "body": "Hello, I wanted to see if any other parents are missing not being able to take their kids to the pool at the weekend.  I have complained to the management a couple of times about reinstating a lifeguard, but they say the problem is they're not able to find a lifeguard that will only work for a couple of hours a day. I think if there's enough of us that rally around and push for it, Virgin will make more of an effort to find somebody/have to increase the wage to make it more of an attractive offer.   I know we're able to use the faciltiies at the Islington site but with all the baggage, inflatables etc. it's just another hike I want to avoid at the weekend - in the time we save we might even be able to squeeze in the luxury of a few Sunday papers. Oh the crazy, glamorous life we parents lead! Here's hoping! Best, Sam", 
      "date": "2008-03-23 14:10:00", 
      "id": 3836, 
      "responses": 9, 
      "subject": "No Lifeguard for Children at Virgin Barbican Pool", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4148"
    }, 
    {
      "body": " hello i have been using the gym here at the ymca for a few months as a resident the cost was two pound a session witch was good the other day i went to use the gym and was told that if i want to use it the cost would be six pound ! i was shocked and asked the reason for the increase and was told it was becose they have instaled new equipment i am still not happy with this does anybody know of a reasonibly priced gym thats local? thanks", 
      "date": "2005-04-19 14:20:00", 
      "id": 2928, 
      "responses": 8, 
      "subject": "ymca gym", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1575"
    }, 
    {
      "body": "Anybody know what the hell is going on with these trucks taking in new machinery to Holmes place, the noise is hellish!", 
      "date": "2007-05-24 22:22:00", 
      "id": 3326, 
      "responses": 6, 
      "subject": "virgin active refurb - noise!!!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3363"
    }, 
    {
      "body": "I've just heard that there's a public swimming pool somewhere on the Golden Lane estate.  Any views or comments from Barbican residents on this pool facility would be most welcome.  Is it a nice pool?  Or tending towards municipal dinginess?  I'm happy to go and explore, but some advance warning would be helpful. I'm just looking for a weekly swim in a quiet lane for 30-40 minutes, and am fed up with paying outrageous gym membership fees for a few odd swims per year. Many thanks.", 
      "date": "2005-06-02 15:38:00", 
      "id": 4453, 
      "responses": 5, 
      "subject": "Golden Lane swimming pool", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1661"
    }, 
    {
      "body": "Further to the article Healthy Options in Barbican Life I thought I'd let people know that Champneys CityPoint has actually closed down. An enquiry to their Head Office leads me to believe that the premises are now up for sale.", 
      "date": "2006-03-28 08:56:00", 
      "id": 4635, 
      "responses": 5, 
      "subject": "Champneys CityPoint has closed down", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2161"
    }, 
    {
      "body": "Do any Barbicanites go horse riding in the local-ish area? I would love to find a decent school. I know there is a school in Hyde Park but would appreciate any informed  recommendations or suggestions (or warnings). Thanks", 
      "date": "2006-07-11 21:37:00", 
      "id": 3242, 
      "responses": 4, 
      "subject": "Horse riding", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2448"
    }, 
    {
      "body": "hello was wondering if anyone knew of a local gym with a creche? just looked at holmes place website and they don't appear to... thanks", 
      "date": "2007-02-04 19:38:00", 
      "id": 4228, 
      "responses": 4, 
      "subject": "local gym with creche?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3033"
    }, 
    {
      "body": "As a relatively new resident (and also hopeful about the weather!) I wanted to know about the tennis courts within the Barbican - do you need to book and / or pay for these?", 
      "date": "2005-08-05 09:28:00", 
      "id": 2962, 
      "responses": 3, 
      "subject": "Tennis court", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1786"
    }, 
    {
      "body": "The weekday opening times at Barbican Holmes Place have just been reduced by an hour to closing at 10pm. I'm quite upset not only because its a lot less convenient for whenI like to go, but also because the management didn't notify members by letters or email (not me at any rate) and it seems like a cost-cutting exercise for what should be a premium service at the prices they charge. Anyone else affected by this?", 
      "date": "2006-09-13 21:29:00", 
      "id": 4493, 
      "responses": 2, 
      "subject": "Holmes Place Opening Hours Cut", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2599"
    }, 
    {
      "body": "Is anybody going along to the COLCEC Qi Gong/T'ai Chi classes? I am thinking of starting in September and am wondering if it's suitable for beginners.", 
      "date": "2005-06-22 15:54:00", 
      "id": 4669, 
      "responses": 2, 
      "subject": "Qi Gong/T'ai Chi classes", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1705"
    }, 
    {
      "body": "I am new round here..... please can someone tell me how i might go about joining the Barbican tennis club? Or else how we are able to access/use the School courts?", 
      "date": "2005-04-15 13:37:00", 
      "id": 2911, 
      "responses": 1, 
      "subject": "Anyone for tennis?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1567"
    }
  ]
}