{
  "summary": [
    {
      "body": "We've just come back from a lovely first visit to the Wood Street Restaurant and Bar. Gorgeous food, great service, wonderful setting.  When it came to paying the bill, we asked if we could pay the main part with a card but pay the service charge in cash to ensure the staff get it. We have no problem excercising this legal right in other restaurants. You may or may not be aware but whenever the service charge is paid with a card, the staff do not get it but the corporation who owns the restaurant does. Time Out Magazine wrote a piece about a year ago stating that if you want to ensure the staff who served you are rewarded with a tip, then pay the service charge in cash. Our friendly and efficient waitress asked the manager on our behalf if we could do this, but she refused. We HAD to pay it with the card.  We were shocked that the manager refused point blankly and didn't even come over to explain why but decided not to go any further, we had a lovely meal in wonderful surroundings but ended up paying the waitress some more on top of the service charge as we left, just because we felt so bad for her.  She seemed to have no idea that she was entitled to the service charge. At St Paul's Chez Gerard, our regular haunt we often pay the service charge in cash and it goes directly to the staff. NB: the manager of the Wood Street Bar is the daughter of one of the three owners, who also own other restaurants, which is probably why she didn't want the staff to get the tips but her father's company instead. When we go next week, we'll have to point blankly refuse to pay the service charge with a card or bring extra cash. I understand Wood Street Restaurant is very popular with us Barbican residents on Sundays. May I suggest, if you'd like the service charge to go to the staff (and not just the manager's family and business partners), that you consider paying it in cash and ask for this right if they refuse you. We will, as otherwise, there's no incentive for good service.  In other London restaurants (and other parts of the world, especially the States) , waiters and waitresses thrive on their good tips, it's a shame that their right to this has been eroded at our local.  Has anyone else experienced the same problem at the Wood Street or any other local restaurants?", 
      "date": "2007-04-18 14:59:00", 
      "id": 4326, 
      "responses": 25, 
      "subject": "Tips at the Wood Street Restaurant and Bar", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3242"
    }, 
    {
      "body": "Have we all received the above letter telling us that a hoarding \"will be erected\" for the above work on 23rd April, the very day that a decision was due on planning permission. Was permission granted? If so, are there any ways for the decision to be called in or appealed? Has a hoarding gone up?", 
      "date": "2007-04-24 12:19:00", 
      "id": 4253, 
      "responses": 3, 
      "subject": "Milton Court Lift / Stair Works (Four Communications)", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3266"
    }
  ]
}