{
  "summary": [
    {
      "body": "Just wanted to ensure BarbicanTalkers know about the double page spread in today's Homes and Property Section on the Mackay's 4,000 sq ft home (no need to peer in over the walkway now).  Also, the main paper carried a half-page article entitled \"Life's Easy in the Inner City\" in the Life and Culture section by Bernice Davison, a Thomas More resident (by the description of \"watching the sun glint on the gold cross atop St Paul's\"). The article's sub-title \"No commuting and so much to do: it's good to be back in London\", says it all. I can try and find online links if anyone's interested ", 
      "date": "2007-08-01 21:36:00", 
      "id": 4116, 
      "responses": 14, 
      "subject": "Barbican featured in today's Evening Standard - TWICE!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3551"
    }, 
    {
      "body": "If anyone is reading a current discussion topic headed \"Landmark!!\", I thought I would raise this addendum topic to literally see how many Barbican images are used by the media etc, as the BA Chair suggests. Whilst doing a google search to try and find the official website of the Museum of Childhood in Bethnal Green, I came across this website with a picture of our glorious Barbican Towers! This is my \"starter for 10\"...    ", 
      "date": "2007-01-05 00:37:00", 
      "id": 4197, 
      "responses": 14, 
      "subject": "Sightings of the Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2879"
    }, 
    {
      "body": "Nick Cohen in the Standrd has had a cliched jibe at the Barbican tonight.  I think we should mail in to protest. To quote: \"I went to the Museum of London .....  but spent as much time gawping at the Barbican complex ....   Nothing, not the doomed attempts of the residents to prettify the blocks with window boxes nore the late june sun, could make the brutalist towers look like anything other than an East German Housing project. Because it is in the centre of London and has a nice arts centre  attached, its flats still sell for 350k.  But it will take only one propoerty crash for the Barbican to meet its destiny and become what it was designed to be: a sink estate for the upper-middle class.\" Grrrrrrrrrrrrr............... Letters to   including daytime number, name and address !!!!!", 
      "date": "2006-06-28 21:16:00", 
      "id": 3173, 
      "responses": 12, 
      "subject": "Bad press for the Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2411"
    }, 
    {
      "body": "According to the BBC ( ), Carluccio's pays its waiters just 3.75 per hour - less than minimum wage - expecting them to make up the difference with tips. Disgraceful! Knowing that I'm amazed at how cheerful the staff at Carluccios manage to be. I suggest a boycott of Carluccios until the management change their ways.", 
      "date": "2008-04-18 08:03:00", 
      "id": 3878, 
      "responses": 12, 
      "subject": "Boycott Carluccio's!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4245"
    }, 
    {
      "body": "Hello, I have read the news reports about the prosecution of a 15-year-old by the City of London Police over a placard he held at a demonstration at the Church of Scientology. Could the police please comment on the decision to prosecute and how this action was not covered by free speech. thank you", 
      "date": "2008-05-22 15:49:00", 
      "id": 5458, 
      "responses": 12, 
      "subject": "Scientology", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=4364"
    }, 
    {
      "body": "Can we discuss the option of lighting the 3 towers at night for dramtic effect?  Not sure if you have noticed but EVERY sky shot of london that has Natwest, Swiss Re, etc... has the Barbican Towers removed.  Anytime there is a news shot or a programme with an interview with a london backdrop...our council towers are not to be seen. I would like to propose that we campaign the city of london to make a feature of these. Who is in? D07", 
      "date": "2007-01-02 23:37:00", 
      "id": 4126, 
      "responses": 11, 
      "subject": "landmark!!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2875"
    }, 
    {
      "body": "Just to let you know that the colour centrefold in the Guardian today is a view of the Barbican in honour of the 25th anniversary.", 
      "date": "2007-03-06 15:24:00", 
      "id": 3301, 
      "responses": 8, 
      "subject": "Barbican picture in the Guardian", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3112"
    }, 
    {
      "body": "Further to comments by Maximus regading the roofs visible in the recent Barbican Photo published by the Guardian, one wonders whether the Barbican Estate could - with careful planning and some investment - achieve a 'zero carbon' certification.  Not only would this be environmentally sensitive but could also result in exemption from stamp duty for homes under 500,000.  Does anyone think this might be worth exploring?", 
      "date": "2007-03-22 16:56:00", 
      "id": 4247, 
      "responses": 8, 
      "subject": "Zero Carbon Homes", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3172"
    }, 
    {
      "body": "Anyone else saw a very brief shot just before the credits on the Locaton Location Location rental special showing a shot from Ben Jonson House over to the pub?", 
      "date": "2006-04-25 19:49:00", 
      "id": 3095, 
      "responses": 7, 
      "subject": "Phil & Kirsty", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2224"
    }, 
    {
      "body": "take care crossing the streets in Feb....!  Shell backs Ferrari F1 with world's costliest ad (from Marketing mag 23 Jan) LONDON - Shell is to seal off the City of London and turn it into a mini Grand Prix-style racing circuit, as part of the filming of an ad highlighting its partnership with the Ferrari Formula One team. The TV execution, whose production cost 2m, making it the most expensive ad ever, will promote Shell's high-performance V-Power fuel. It is intended to support Shell's positioning as the most innovative fuel brand.  The ad will feature Ferrari F1 cars racing through some of the world's most famous cities, including New York and Sydney. The London leg of the ad, being created by JWT London, will be shot on 17 February, with the execution set to air globally in March.", 
      "date": "2007-01-27 22:45:00", 
      "id": 4230, 
      "responses": 7, 
      "subject": "Formula 1 in the City: 17 Feb", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2966"
    }, 
    {
      "body": "This evening's 'The Nature of Britain' programme includes filming which took place last year of the raising of ducklings on the Barbican Estate.  It's on at 9.00 on BBC1 (recording number 4453 if you want to record it).", 
      "date": "2007-10-24 14:16:00", 
      "id": 3470, 
      "responses": 6, 
      "subject": "This evening's 'The Nature of Britain' - Barbican ducklings", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3745"
    }, 
    {
      "body": "Interesting article in BD magazine, condemning redevelopment proposals for Milton Court:", 
      "date": "2007-04-06 06:35:00", 
      "id": 4367, 
      "responses": 6, 
      "subject": "Milton Court in architectural press...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3208"
    }, 
    {
      "body": "For those of you that like to spot local landmarks on Television, Ashes to Ashes, the sequel to Life on Mars, looks like it will be a gem of a series. The first episode tonight featured a drive down London Wall - under Alban Gate towards Moorgate, and a nice sequence of the Audi Quattro driving through the Barbican Tunnel. I thought Life on Mars was the highlight of previous years on TV and it looks like Ashes to Ashes should repeat the formula, but with local landmarks as an added plus.", 
      "date": "2008-02-07 23:05:00", 
      "id": 3504, 
      "responses": 5, 
      "subject": "Ashes to Ashes in the Barbican Tunnel", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3993"
    }, 
    {
      "body": "Is this interesting? Interview with Nicholas Kenyon in the Torygraph (a daily newspaper), about his plans for the Barbican Art Centre. <http>", 
      "date": "2008-02-21 18:51:00", 
      "id": 3514, 
      "responses": 5, 
      "subject": "Nicholas Kenyon interview", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4044"
    }, 
    {
      "body": "FYI: Thursday 27th March,  8-9pm, Channel 5, 'I Own Britains Best Home', is featuring a barbican flat.", 
      "date": "2008-03-25 15:23:00", 
      "id": 3838, 
      "responses": 5, 
      "subject": "Barbican on the telly", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4153"
    }, 
    {
      "body": "I just came across   with a 1956 story about the proposed building of the Barbican, including a link to a crackly black and white film of the land development and a model of an early design. Fascinating stuff!", 
      "date": "2007-04-08 16:58:00", 
      "id": 4369, 
      "responses": 5, 
      "subject": "BBC News story on the Barbican from 1956", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3212"
    }, 
    {
      "body": "I was very disappointed to see that the Barbican no longer figures in the top 10 of Britain's ugliest buildings (according to a popular vote tken as part of Channel 4's Demolition programme). Is the British public taking a shine to Brutalism or were we just edged out by the new Scottish parliament? Either way, I'm very concerned at our new found popularity, it's  making me feel like a conformist. Time to move to Park Hill, Sheffield?", 
      "date": "2005-12-12 22:32:00", 
      "id": 3017, 
      "responses": 4, 
      "subject": "ugly buildings", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1986"
    }, 
    {
      "body": "Just read this on Timesonline   and even though we wouldn't mind a few more shops open on the weekend, we wouldn't want the City to become another West End. The reason we live here is for the peace and quiet. We would hate to see this beautiful part of London spoilt by a mass of high street shops. ", 
      "date": "2008-02-04 20:28:00", 
      "id": 3779, 
      "responses": 4, 
      "subject": "Rival to Blue Water Shopping Centre", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3981"
    }, 
    {
      "body": "Not particularly Barbican related, but an amusing story about NTL customer service:", 
      "date": "2005-06-08 15:50:00", 
      "id": 4737, 
      "responses": 4, 
      "subject": "NTL Customer Service", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1673"
    }, 
    {
      "body": "i may have missed this elsewhere, so it might be old news, but I was intrigued in yesterday's observer to see that the Terry Farrell re-development of the far side of Smithfield incorporates the potential to re-locate both the Museum of London and the Barbican Arts Centre ...  doesn't strike me as realistic but stranger things have happened ...", 
      "date": "2007-11-05 09:03:00", 
      "id": 3465, 
      "responses": 3, 
      "subject": "arts centre move?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3773"
    }, 
    {
      "body": "bbc /on this day JAN 24 1956 has an interesting article on the original CoL plan for our estate.Well worth a look!", 
      "date": "2008-05-12 11:40:00", 
      "id": 3580, 
      "responses": 3, 
      "subject": "barbican past", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4331"
    }, 
    {
      "body": "I have been contacted by a Hong Kong based TV company interested in  taking in as a guest for just under a week a Chinese student, whose time with the family and as a tourist in London will be filmed for broadcast in Hong Kong. As they may need to wait some time to register here to place their message themselves, I offered to post it here for them and to put them in touch with anyone interested in participating. I have no information about this beyond the information they have given me, which I have copied below: \"RE: Invitation for home visit to Barbican Estate for filming We are a TV production team of Radio Television Hong Kong (RTHK), please visit:   for more information about us. We produce educational TV programs in Hong Kong, China. We are currently working on a program called \"Youth Travelogue\" and would like ask for our favor to facilitate our filming. Program description: \"Youth Travelogue\" is a 22-minutes TV program about a new way of traveling. In this TV series, a Hong Kong youngster who grows up in Hong Kong's public housing will be arranged to visit other country's public housing.  By showing the presenters home staying with host families in different countries public housing, we hope to broaden audiences horizons and understanding of other countries unique social and cultural contexts. Know more about our presenter: Our presenter for this England episode is a 21-year-old young man, named Raisin, studying Linguistic and Finance in the University of Hong Kong. He is also a double-decker enthusiast. Our trip to England will also consist of the discovery of buses in England. What we need: We are looking for a host family who live in Council House in London. Given the unique architecture and historical background of Barbican Estate, we hope we can have the privilege to arrange a short home stay in the estate. The ideal host family would be open-minded and willing to share their daily life under our camera while they provide our presenter a 4~5 days' home stay with them. A small amount of remuneration will be given to the host family as a token of gratitude. The filming is scheduled to take place around Easter and we do wish this will be a wonderful opportunity for cultural exchange offered to both the host family and the presenter.\" I did point out to them that the Barbican is now almost entirely a private Estate, but it represents highly a successful example of post war public housing and they still want to come to the Barbican, specifically, although Golden Lane ought also to meet their criteria. Please PM me if you are interested, and I can put you in touch with the company concerned.", 
      "date": "2007-02-08 21:46:00", 
      "id": 4223, 
      "responses": 3, 
      "subject": "Barbican Filming Opportunity", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3049"
    }, 
    {
      "body": "did anyone see the london paper (the purple one) earlier this week advocating the barbican as a good place to go and skate?!", 
      "date": "2007-05-10 20:48:00", 
      "id": 4339, 
      "responses": 3, 
      "subject": "LondonPaper - sk8ers", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3318"
    }, 
    {
      "body": "According to the FT today (\"the way we live now column\" on page 14) a nest of falcons is in the Barbican and the June 6 Mozart fireworks have been cancelled to allow oeace and quiet for hatching.", 
      "date": "2006-05-30 13:31:00", 
      "id": 4428, 
      "responses": 3, 
      "subject": "Barbican peregine falcon", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2327"
    }, 
    {
      "body": "Having watched Gangster Number 1 on Film 4 last night, I am interested to know which of the towers did they use to film in and did they use a studio or was that a genuine tower flat interior that was used?", 
      "date": "2006-08-31 08:09:00", 
      "id": 4462, 
      "responses": 3, 
      "subject": "Barbican on film", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2565"
    }, 
    {
      "body": "Did anyone see tonight's episode of Dr Who? Looked like a scene was shot in the Barbican Conservatory...", 
      "date": "2008-05-10 20:12:00", 
      "id": 3584, 
      "responses": 2, 
      "subject": "Dr Who in the Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4326"
    }, 
    {
      "body": "I saw an Islington Gazette A board yesterday with the announcement that Barbican Residents have scored a big victory. What's that about then?", 
      "date": "2008-05-20 09:57:00", 
      "id": 3600, 
      "responses": 2, 
      "subject": "Islington Gazette", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4359"
    }, 
    {
      "body": "An article today in the Sunday Times makes interesting reading.  Is it indicative of how choices concerning building in the City are made?  I wonder if Mr. Ronson, who they point out was convicted of fraud, will take legal action?  I wonder if the principal person who backed the scheme and is behind the Morgan scheme will now have to justify himself?  I wonder if the procedures by which planning applications are dealt with need review.  Is a judicial review required?", 
      "date": "2008-03-16 09:32:00", 
      "id": 3816, 
      "responses": 2, 
      "subject": "Milton Court and Sunday Times claims", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4129"
    }, 
    {
      "body": "I just caught the end of an announcement on Radio 4 advertising what I think is a programme about the politics behind the enormous building boom in the City. Worth a listen at 10pm tonight?", 
      "date": "2008-04-27 17:08:00", 
      "id": 3899, 
      "responses": 2, 
      "subject": "Radio 4 prog Politics of building in C of L", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4281"
    }, 
    {
      "body": "interesting piece - though it doesn't actually mention the Barbican", 
      "date": "2006-03-23 14:04:00", 
      "id": 4625, 
      "responses": 2, 
      "subject": "BBC online article on our Brutalist heritage", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2152"
    }, 
    {
      "body": "My brother in law called me up tonight to tell me a team from the Barbican was on University Challenge competing against one from the Society for the Preservation of Ancient Buildings.  However, i missed the start and would like to write a news item on this for Barbican Life.  Can anyone who may have watched, or happens to know, whether the Barbican team was drawn from the staff of the Barbican Centre, or from residents?  I also only managed to pick up the team's surnames - can anyone supply me with their forenames too? Thanks", 
      "date": "2005-08-15 20:14:00", 
      "id": 2971, 
      "responses": 1, 
      "subject": "University Challenge", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1809"
    }, 
    {
      "body": "I was hearing this morning on the radio about various difficulties people have had getting Energy Performance Certificates done for the Home Information Packs that are now required when buying/selling a house. That made me wonder how the Barbican rated in energy efficiency terms. Would anyone who has seen a Barbican EPC be prepared to divulge what it said? I'm not a buyer/seller, but curious to see how it works nonetheless  and to see if the Barbie is energy efficient of course.  The government's website describes the EPC like this: 'Each rating is based on the performance of the building itself and its services (such as heating and lighting), rather than the domestic appliances within it. This is known as an asset rating. The certificate also lists the potential rating of the building if all the cost-effective measures were installed. The ratings will vary according to the age, location, size and condition of the building. The potential rating on the certificate will take these factors into account, and the suggested measures will be tailored so that they are realistic for the particular building.'", 
      "date": "2008-01-03 13:18:00", 
      "id": 3546, 
      "responses": 1, 
      "subject": "HIPS and Energy Performance Certificate", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3903"
    }, 
    {
      "body": "In one of the obituaries of Benazir Bhutto it was mentioned that after escaping imprisonment in Pakistan in 1984 she lived for a while in the Barbican, I was wondering if anyone knew what building - are there any of her one-time neighbours around?", 
      "date": "2007-12-30 17:46:00", 
      "id": 3553, 
      "responses": 1, 
      "subject": "Benazir Bhutto", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3895"
    }, 
    {
      "body": "Anyone else in on this Friday evening may be interested to see one of Harry Enfield/Paul Whitehouse's latest creations is '70s throwback the Barbican man'...... 9.30 BBC1 (and then watch the phenomenal Peep Show later on.....)", 
      "date": "2007-04-27 19:54:00", 
      "id": 4258, 
      "responses": 1, 
      "subject": "Barbican Man alive and well.....", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3276"
    }, 
    {
      "body": "Mail hysterics - or plausible downside for those living here where energy efficiency doesn't come to mind as a prime virtue of the Barbican eco-system?  \"Homeowners who refuse to alter their houses and flats to conserve more heat and power face higher council tax bills, ministers revealed. They plan to encourage town halls to jack up bills for the least energy efficient homes in the name of tackling climate change. A link between council taxes and energy efficiency is on the way after the controversial system of home sellers' information packs comes into force next summer, officials confirmed. Councils will be able to check the green credentials of houses and flats from details contained in 'energy performance certificates' which will be a compulsory element of every information pack.  [etc etc ad nause, ad inf.]", 
      "date": "2006-09-23 22:15:00", 
      "id": 4503, 
      "responses": 1, 
      "subject": "Low energy efficiency = higher council tax bills?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2623"
    }
  ]
}