{
  "summary": [
    {
      "body": "I came down the East staircase to podium today - found that both doors had been smashed in. It also turns out that a door on East Central stair had been smashed. This is really deeply disturbing.  I did hear some noises last night but can't place when as I was in bed drifting off to sleep - could have been 10 or 11. Anyone any info? Very alarming", 
      "date": "2006-10-05 07:08:00", 
      "id": 4299, 
      "responses": 49, 
      "subject": "Ben Jonson House: attacked", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2654"
    }, 
    {
      "body": "Went to M&S earlier and noticed that the ridged paving stone had been pulled out at Moorfields High Walk, which prevents skateboarders jumping the stairs. On the way back, the paving stone was in pieces. Looked like someone had thrown it. Most probably a skateboarder. Simply senseless vandalism...", 
      "date": "2006-03-11 17:59:00", 
      "id": 3073, 
      "responses": 28, 
      "subject": "Skateboard Vandalism", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2128"
    }, 
    {
      "body": "Does anyone know when/how the glass panel next to one of the Podium level doors of Ben Jonson was smashed? It has been repaired, temporarily, but it's still a bit crunchy underfoot.", 
      "date": "2006-05-06 16:02:00", 
      "id": 4403, 
      "responses": 14, 
      "subject": "BJH smashing", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2260"
    }, 
    {
      "body": "It's 8pm and I've just walked along the podium and come across several beer cans and smashed spirit bottles with puddles of alcohol outside the conservatory. Nearby litres of white paint have been thrown on the paving and splashed over a considerable area.  3 nights ago there were more smashed and discarded alcohol bottles near Bryer Court at about 9pm. WHY do we never see police patrolling the podium at night when these problems occur. Don't tell me they're isolated incidents! Police please respond.", 
      "date": "2008-03-01 20:07:00", 
      "id": 3532, 
      "responses": 11, 
      "subject": "Vandalism", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4075"
    }, 
    {
      "body": "Received the latest copy of Barbican News this morning. Apart from the usual updates, I was most interested in one article. It was the one about the lift doors in John Trundle and Bunyan. How have these lift doors got into such a state? From what I could make out in the small photograph, they appear to have suffered a lot of vandalism. Do these block suffer from feral youth and other such problems? And if so why has nothing been done. Will be the lifts themselves next?", 
      "date": "2005-07-29 16:04:00", 
      "id": 2961, 
      "responses": 10, 
      "subject": "Feral Vandals?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1769"
    }, 
    {
      "body": "I rent a parking space on level 01 of Willoughby and in the past 6 months I have found a screw(same type of screw on both occassions) embedded in one of my tyres. I am sure that nobody who lives in the Barbican would be responsible for this, however for it to happen once is an incovenience but twice begins to make me feel a little suspicious. Has anyone else who rents a space in a Barbican car park faced a similar problem?", 
      "date": "2006-09-18 08:33:00", 
      "id": 4494, 
      "responses": 6, 
      "subject": "Parking problems", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2609"
    }, 
    {
      "body": "Riots in and outside the YMCA, paint colour wars, satanic children and smashed glass in BJH and drunken hoodies under Bunyan. What's going on on our northern fringes? Is there something in the water? ", 
      "date": "2006-05-06 22:29:00", 
      "id": 3097, 
      "responses": 2, 
      "subject": "what's up??", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2266"
    }, 
    {
      "body": "You may wish to respond here to the thread about Vandalism on the main residents' discussion area", 
      "date": "2008-03-03 12:50:00", 
      "id": 5516, 
      "responses": 1, 
      "subject": "Vandalism?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=4079"
    }
  ]
}