{
  "summary": [
    {
      "body": "anybody know what / why the sudden psychedelic green algae bloom on the upper lake?  the water's looking flurotastic and pretty nasty from up here.  i don't remember pond scum of that voracity before the lake rennovations... can we hope that the proposed re-planting of the sunken reed beds will help clean up the problem?", 
      "date": "2005-04-22 11:20:00", 
      "id": 2923, 
      "sentiment": 2, 
      "subject": "lakes", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1583"
    }, 
    {
      "body": "anyone else notice that 02 lift in ben jonson needs just a splash of paint to get rid of the graffiti? its all begining to look a lttle tatty and it shouldn't", 
      "date": "2005-04-20 21:31:00", 
      "id": 2939, 
      "sentiment": 2, 
      "subject": "service charges, somerfield, and a splash of paint", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1579"
    }, 
    {
      "body": "I have signs of water leaking in to my ceiling, but the people upstairs say they can't find any problem? Any suggestions as to what I do now? If water is coming in through upstair flat's window frames, is it the Corporation's problem? Anyone know? Advice welcomed, thanks", 
      "date": "2006-04-29 10:52:00", 
      "id": 3076, 
      "sentiment": 2, 
      "subject": "water leak", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2237"
    }, 
    {
      "body": "Is the Barbican slowly becoming an island? Two Wood Street access point have been lost and I found hoarding blocking my way at the Andrew's end of the estate yesterday. I suppose it makes us more secure in some ways but it looks as though the estate is becoming cut off and the corporation must be making money out of giving rights of access away for office space?", 
      "date": "2005-10-11 09:58:00", 
      "id": 3117, 
      "sentiment": 2, 
      "subject": "Island Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1876"
    }, 
    {
      "body": "I have some moths or flying insects coming in from the vent in my toilet. Has anyone else had this problem ?", 
      "date": "2007-02-26 20:34:00", 
      "id": 3264, 
      "sentiment": 2, 
      "subject": "moths or flying insects in toilet", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3084"
    }
  ]
}