{
  "summary": [
    {
      "body": "Roof works on Bunyan have just concluded, but there's a ton of stuff that's not quite right ... we've been promised a snagging meeting and commitments to correcting faults etc.  Should we be optimistic that this snagging meeting will yield results, or are we simply venturing forth into a new sea of shifting Technical Services sands?  Any tips for progressing appreciated ...", 
      "date": "2005-05-04 06:17:00", 
      "id": 2940, 
      "sentiment": 3, 
      "subject": "Roof works - the final frontier?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1606"
    }, 
    {
      "body": "Received the latest copy of Barbican News this morning. Apart from the usual updates, I was most interested in one article. It was the one about the lift doors in John Trundle and Bunyan. How have these lift doors got into such a state? From what I could make out in the small photograph, they appear to have suffered a lot of vandalism. Do these block suffer from feral youth and other such problems? And if so why has nothing been done. Will be the lifts themselves next?", 
      "date": "2005-07-29 16:04:00", 
      "id": 2961, 
      "sentiment": 3, 
      "subject": "Feral Vandals?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1769"
    }, 
    {
      "body": "Does anyone have any insider knowledge about when the lift and staircase between the street and the podium level on Moor House will finally be available for use? It seems that they've been completed weeks, if not months, ago. I have a pram, and the lift would be really helpful. Is the Corp in charge of these things, or the owners of Moor House?", 
      "date": "2005-08-13 09:30:00", 
      "id": 2969, 
      "sentiment": 3, 
      "subject": "Lift/Moor House", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1803"
    }, 
    {
      "body": "remember a while back when the water pressure thing happened and we didn't have running water? in the morning when it came back on, i noticed this really weird thing... there's five drains along the side of the pond under bunyan court. they usually leak a sludge of water that leaves puddles and icky ooze on the path. that morning there was this weird whistling sound and i went to the window to figure out what it was. the drains were either spewing steam or spraying pressurised water into the air. one at a time.  the following week workers from the estate were looking at them and then now they don't seem to be leaking.  anyone know what they are? or where they drain to/from?  and while i'm asking questions, there's three staircase entrances across from the bunyan pond that lead down to the \"barbican trade centre\"... what's that? where do the stairs go? they look like they probably end up in holmes place, but i've never seen the stairs in the gym...", 
      "date": "2005-08-27 12:54:00", 
      "id": 2984, 
      "sentiment": 3, 
      "subject": "barbican geysers", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1821"
    }, 
    {
      "body": "Does anyone else find the noise of lifts intrusive? I was wondering if we just had a poorly serviced one in our block. It's seems to emanate from the winding gear (perhaps the cables). Sound level is variable but when I first heard it thought it was distant roadworks!", 
      "date": "2005-12-30 14:03:00", 
      "id": 3027, 
      "sentiment": 3, 
      "subject": "Lift noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2001"
    }
  ]
}