{
  "summary": [
    {
      "body": "The lift on the East side of Ben Jonson is breaking down on a regular basis. It's absolutely ridiculous. My boyfriend was stuck there for 15mns this morning before the lift started working again. He was late for work. Anybody else got similar problems in other blocks? Clochette", 
      "date": "2005-05-06 12:25:00", 
      "id": 2931, 
      "sentiment": 4, 
      "subject": "Lifts - Enough is enough", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1610"
    }, 
    {
      "body": "Is it me or is it since the roof works that we have had more flooding in our palaces? I believe that since the roof works and the water drainage system being \"redirected\" on the 6th floor balconies, we are getting flooded every time. Who would like to support my campaign for a real architect and building firm (not a bunch of lads off a boat from Gdansk) to look at the works, along with English Heritage to see if it can be rectified? ..and if I hear from our Estate office that it is to do with Global Warming or Al Gore from I might slap someone. D07", 
      "date": "2007-07-22 23:21:00", 
      "id": 3385, 
      "sentiment": 4, 
      "subject": "Ben Jonson Campaign", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3530"
    }, 
    {
      "body": "We have just received the questionnaire about the refurbishment, and I hope that many residents will complete it and return it to the estate office. Overall the refurbishment looks great, and the automatic doors are a big improvement. However, the budget was 190,000 - quite an astonishing amount of money to spend on the podium entrance and car park entrance. The budget apparently did not stretch to the following items which I think residents should consider, as I had understood that they would be included: -- the porters' desk was not renewed and is showing lots of signs of wear and tear -- there is no parcel store - as before, parcels are left on the floor, which I find rather astonishing. Nowadays people order more and more online, and there is no provision for the storage of delivered items. -- the doors at podium level (possibly elsewhere) were poorly repainted. You can see that old layers of paint were not removed, and already the new paintwork is showing signs of damage. I'd be interested in hearing opinions from my neighbours on this. The house committee has been silent, to my knowledge. The whole job took an extraordinary amount of time, and cost an unfathomable amount of money, and I think that in less than 12 months we will all have serious misgivings - if we don't already.", 
      "date": "2007-11-24 20:32:00", 
      "id": 3614, 
      "sentiment": 4, 
      "subject": "Shakespeare lobby refurb questionnaire", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3815"
    }, 
    {
      "body": "Twice in recent weeks the new lift at the eastern end of the estate has broken down.  The telephone number posted for emergencies actually leads to the Guildhall switchboard.  They have no record of who is responsible.  The Corporation failed to pass relevant material sent to them from the then builder Ardmore-Mace (now fired by Gerald Ronson for not being tough enough in their dealings with residents and the Environmental Health people when damage was caused to a number of flats due to their work).  Ardmore-Mace says it is not responsible.  So the fire brigade had to be called.  Anyone using the lift should be aware that aside form shouting no help is available.  The Corporation was informed at least a fortnight ago and still no telephone numbers have been posted. They even claimed that the lift should be maintained by the Estate!  News to the Estate and our excellent engineers.  The Estate was unaware of this and, in any case, the Estate would not assume responsibility for a year after construction.  One trusts that the Estate will charge the Corporation for staff time.   So use that lift at your own risk.  If you press the bell no one who can do anything is altered.  If you use the telephone you get the staff at the Guildhall or the new call centre and the reply that the lift does not exist or they know nothing.  The name of the contractor and an emergency telephone number should be there by law.  It is not.  The Corporation has done nothing about this that has led to an improved situation.   However, the alternative of the exit from Willoughby 03 car park is also very uncertain.  The door has been out of action at least twice over the last fortnight nicely coinciding, on occasion, with the lift on the podium being out of action. People in wheelchairs and other people with walking difficulties have no way out from that corner of the estate unless someone with a pass key kindly takes them through Willoughby House and that is a long way around.", 
      "date": "2008-02-03 10:22:00", 
      "id": 3625, 
      "sentiment": 4, 
      "subject": "Corporation incompetence?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3977"
    }, 
    {
      "body": "This lift rarely seems to be working - something which I have seen cause considerable distress to a number of people (myself included). Today there was a notice stuck to the lift button at the upper level which read approximately as follows:- \"This lift button is not working. To call the lift please use lift button on the other level.\" This might be someone's sick idea of an April Fool's joke - or it might be genuine. Either way, it stinks. But who takes responsibility for this?", 
      "date": "2008-04-01 14:57:00", 
      "id": 3844, 
      "sentiment": 4, 
      "subject": "Lift at the corner of Speed/Willoughby", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4172"
    }
  ]
}