{
  "summary": [
    {
      "body": "Ok, people, here's another hardy perennial. It's now getting VERY COLD.  I feel the cold quite badly and am at home much of the time (like many others in the Barbican) and the free-standing electric heaters which we have just don't do the job properly. Not to mention the fact that we've already spent a small fortune this summer on using them because the weather was so cold some of the time. I rang the BEO to be given the usual \"oh, we never turn the heating on until October\". I pointed out that if it gets cold before the beginning of October, and enough people request it, then it can be turned on earlier (as has happened in previous years) so I was getting my request in early this year. This went down like the proverbial lead balloon. Apart from being cold, I'm also very annoyed. It seems to escape the notice of BEO staff that RESIDENTS PAY FOR THEIR HEATING through the service charge and if we need it turned on slightly earlier then we're perfectly entitled to have it. It's always a rather worrying situation when those in charge of your heating system a) don't live here and b) have a vested interest in keeping the cost down. I know that our heating system is an ongoing concern because of its incredibly complicated time/temperature triggers (nothing like a simple thermostat here) and also because it is hopelessly antiquated but it shouldn't be such a battle to get it turned on every year. I don't want to knock the BEO staff because usually they provide a very good service - but this one really gets me going   So, please - ring your House Officers and request that we have access to our own heating. It still takes about a month for the buildings to warm up properly so, even if it goes on now, it will some time before we really start to feel it. House Officers' telephone numbers are:-   Andrewes, Brandon, Cromwell, Gilbert, Speed and Willoughby - Helen Davinson on 7029 3963 Defoe, Lambert Jones, Lauderdale, Mountjoy, Postern, Seddon, Thomas More and Wallside - Sarah Styles on 7029 3962 BJH, Breton, Bryer, Bunyan, John Trundle and Shakespeare - Rebecca Marshall on 7029 3964. Yours in scarves and sweaters etc. etc.", 
      "date": "2007-09-26 15:09:00", 
      "id": 3804, 
      "responses": 101, 
      "subject": "HEATING!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3692"
    }, 
    {
      "body": "Dear All, I do not know if you have received the letter from the estate office about the Garchey. Practically we have to vote about the removal. I am in favour of the removal because the garchey is a polluting system of disposal: I invite the people who oppose this to look at the functioning:just google garchey+ Corporation - [b]the rubbish is treated twice with polluting agents such as thick bleach which is  very polluting plus the chemicals you use to keep the monster clean.[/b] What I oppose is the fact that I have to pay again for the removal when I ahve already paid for it , the average cost for the removal of the syphon is about 500 pounds which I will be happy to spend on a romantic week end but not for the Corporation. I am willing to pay for the removal of the pipes and parts in common but not for the syphon etc in my flat. [u]I propose to write yes to the removal but not willing to pay for the removal of the syphon as already removed[/u] I am already paying for a service that i do not receive I mean I pay for people to use it 110 pounds and I think this is enough in terms of contribution for the community. So I invite the people who support this to form a lobby or write directly to the Corporation. Union makes strength as we say in Italian.[b]   [/b]", 
      "date": "2006-08-02 08:31:00", 
      "id": 4480, 
      "responses": 55, 
      "subject": "Garchey! We have to vote...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2501"
    }, 
    {
      "body": "I have just received a letter from the corporation notifying me about Heron's planning application to convert much of the Speed/Willoughby car parks over to the exclusive use of the new Milton Court developers. Call me a nimby, but I would encourage as many people as possible to object.  - the application involves turning ALL the spaces on Speed 03 and Willoughby 02 over to the exclusive use of Milton Court. That is over 150 spaces to be removed from residents' use. (Together with developments in Lauderdale, there seems to be a trend developing here.) - Milton Court drivers would share the existing entry into 03 level with us, but have their own entrance to 02 level from the existing ramp on Moor Lane. Both entrances will have no CPAs, just electric gates plus CCTV. Pedestrian entry for Milton Court residents into 02 and 03 levels would be by a new door at the corner of silk street and Moor lane, again with electronic entry. In my view the combination of large numbers of people using 03 level together with no CPA leads to an unacceptable reduction in security. Brandon Mews residents have their back doors opening onto the car park plus there are a number of storage lockers there. Given that it's all too easy for someone to slip in before the electric gates close, this greatly increases the scope for intruders. (And I don't put much faith in CCTV - it's only effective if someone's watching it all the time, in which case why not put them in the car park instead of behind a screen?) This also affects flats overlooking Speed Gardens, which can be accessed from the car park directly (the door currently has no lock on the car park side). Note that there will be pedestrian access between the Milton Court and resident parts of the car parks, so security will be compromised for resident car park spaces as well - anyone slipping in behind a Milton Court user will be able to get into the resident areas of 02/03 without having to pass a CPA.  Further the spaces (& CCTV cameras) proposed for 02 level are directly opposite Brandon Mews kitchens/2nd bedrooms, resulting in increased noise and less privacy for residents. The plan is also stupid from the perspective of Milton Court residents who (following the removal of their bridge) would have to cross the road (with no pedestrian crossing) to get to their car park.   Last but not least, if you're opposed to the Milton Court tower, then opposing the parking scheme is another way to scupper it as it could not proceed without the car park.  The deadline for objections is 23 November. Details of the application can be found at ", 
      "date": "2007-11-04 00:16:00", 
      "id": 3684, 
      "responses": 49, 
      "subject": "Milton Court car park proposal", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3770"
    }, 
    {
      "body": "It is not too late to make a difference. Today (31 October) is the last day to get in your objections for the Milton Court development: a school for the Guildhall School of Music and an enormous residential tower. Reference 06/01160/FULEIA If you haven't got your objection in yet, you can email it to   or you can hand it over in person by going to the 18th floor of St Alphage House. You must ask for a receipt with today's date. Objections received after today will still be taken receipt of, but might not be considered fully. But if you can't make today, you should definitely still send yours in. I have pasted derbyram's points to object on below. It is important that people who object to the proposal to send in a letter of objection. We helped to have the submission rejected before and we can hopefully do it again. Here are the points: The plan submitted in March has been modified in an attempt to satisfy some of the objections raised, but in essence remains the same: a new building with the lower block housing a concert hall and theatre for the GSMD, surmounted by a residential tower.  284 flats in a tower covering half of the existing site, just lower than City Point  residential density over 8x greater than within the Barbican (even Heron note this in their environmental impact study  density will be 1183 units per hectare, compared with a recommended central location maximum of 240-435 as per the Mayors London Plan, which also states that density should respect local context and communities)  the existing Milton Court perimeter wall moved 1.9m closer to the Barbican, resulting in the road carriageway narrowing from 10.4m to 7.3m  buses and other large vehicles will have great difficulty is safely negotiating the Silk Street/Moor Lane junction in the face of oncoming traffic.  Heron still plan to purchase 210 car parking spaces in level 03 and 02 car parks below Willoughby, and convert space under the Moor Lane car-park ramp into secure bicycle parking, all for the exclusive use of Milton Court.  a health spa/club with outside tables will sit on top of the GSMD building (6F), directly opposite upper floor residents bedrooms in Willoughby and Speed.  many flats in north Willoughby and Speed will still suffer from a loss of light, loss of privacy, and be subject to overlooking from the new tower.  loss of the existing public highwalk  note that recent new buildings constructed around the Barbican area have been designed to retain highwalk access  similarly redevelopment of Milton Court should follow the same UDP requirement.  this development will generate 3,705 person trips and 423 vehicle trips per day, which will be in addition to traffic generated by the new Ropemaker Place building.  a caf/restaurant will be located at the SE ground floor corner  expect early morning delivery noise, as experienced with the City Point bars/restaurants.  the contractor has promised to abide by CoL working hours (which differ from Barbican Estate noisy work hours), but note than the contractor has already broken such pledges made while constructing the new lift/staircase.", 
      "date": "2007-10-31 10:07:00", 
      "id": 4154, 
      "responses": 29, 
      "subject": "MILTON COURT FINAL OBJECTIONS", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3755"
    }, 
    {
      "body": "Don't know if anyone else in Ben Jonson or Cromwell Has noticed but boudoir bar in chiswell st applied on the 29/4/05 for a licence extention until 3am mon-sat and 2am Sun. They already wake me on a regular basis as there patrons leave.....   have to get you're objections in to islington within four weeks of the 29/4/05 so this week...", 
      "date": "2005-05-21 22:09:00", 
      "id": 4686, 
      "responses": 27, 
      "subject": "Boudoir late licence application", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1642"
    }, 
    {
      "body": "We've just come back from a lovely first visit to the Wood Street Restaurant and Bar. Gorgeous food, great service, wonderful setting.  When it came to paying the bill, we asked if we could pay the main part with a card but pay the service charge in cash to ensure the staff get it. We have no problem excercising this legal right in other restaurants. You may or may not be aware but whenever the service charge is paid with a card, the staff do not get it but the corporation who owns the restaurant does. Time Out Magazine wrote a piece about a year ago stating that if you want to ensure the staff who served you are rewarded with a tip, then pay the service charge in cash. Our friendly and efficient waitress asked the manager on our behalf if we could do this, but she refused. We HAD to pay it with the card.  We were shocked that the manager refused point blankly and didn't even come over to explain why but decided not to go any further, we had a lovely meal in wonderful surroundings but ended up paying the waitress some more on top of the service charge as we left, just because we felt so bad for her.  She seemed to have no idea that she was entitled to the service charge. At St Paul's Chez Gerard, our regular haunt we often pay the service charge in cash and it goes directly to the staff. NB: the manager of the Wood Street Bar is the daughter of one of the three owners, who also own other restaurants, which is probably why she didn't want the staff to get the tips but her father's company instead. When we go next week, we'll have to point blankly refuse to pay the service charge with a card or bring extra cash. I understand Wood Street Restaurant is very popular with us Barbican residents on Sundays. May I suggest, if you'd like the service charge to go to the staff (and not just the manager's family and business partners), that you consider paying it in cash and ask for this right if they refuse you. We will, as otherwise, there's no incentive for good service.  In other London restaurants (and other parts of the world, especially the States) , waiters and waitresses thrive on their good tips, it's a shame that their right to this has been eroded at our local.  Has anyone else experienced the same problem at the Wood Street or any other local restaurants?", 
      "date": "2007-04-18 14:59:00", 
      "id": 4326, 
      "responses": 25, 
      "subject": "Tips at the Wood Street Restaurant and Bar", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3242"
    }, 
    {
      "body": "I understand that Heron, the  company owned by Gerald Ronson, has supplied Linklaters with excellent secondary glazing as a form of minimising noise during the demolition/construction opposite. As far as I know the same offer was not made to the residents of Speed and possibly Willoughby who are even closer to the site. Why have the house committees and the BA itself not taken action on behalf of the residents?  Why has there not been any public information?  Heavy and noisy destruction is about to start and nothing has been done. Answer please!", 
      "date": "2008-02-04 08:35:00", 
      "id": 3501, 
      "responses": 21, 
      "subject": "Milton Court:  Failure to protect Speed and Willoughby", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3978"
    }, 
    {
      "body": "One of the nice things about the Barbican gardens has been the fact that they are free of mess.  At the weekend I went to the Defoe garden and couldn't believe how much crap there was on the ground.  It wasn't hard to see why since there were two geese and five half-grown geese parading up and down.  Seven big and quite aggressive geese is beyond a joke and stepping around mounds of goose turds is not funny either.  I seem to remember reading that the Corporation hadn't received enough complaints to justify the hassle of getting rid of the geese.", 
      "date": "2006-06-27 14:18:00", 
      "id": 3144, 
      "responses": 19, 
      "subject": "Goose crap in the gardens", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2400"
    }, 
    {
      "body": "There's a planning application by the City to remove some of the car parking spaces beneath Lauderdale Tower on 02 level, and turn it into office space (apparently the Barbican Estate Office have outgrown their offices). This would have a detrimental effect to the look and feel of Lambert Jones Mews, as the new offices would overlook the Mews. There would also, obviously, be a loss of carparking facility for residents not only of Lauderdale Tower but of the estate as a whole. Could I just urge anyone who thinks this is another terrible idea to write a letter opposing this aplication as soon as possible. The case officer is Chhaya Patel and the Planning Portal Reference number is: P40059 and the application reference is: 07/00684/LBC. You can I do this online I think, you can certainly have a look at the proposals via this link:   I think it's a slippery slope if we turn a blind eye to allowing parts of the estate to be turned over to commercial uses in this way, especialy if we end up losing valuable facilities such as parking places, and it affects the character of the estate.", 
      "date": "2007-08-30 16:58:00", 
      "id": 3462, 
      "responses": 19, 
      "subject": "Application to turn part of Lauderdale car park into offices", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3614"
    }, 
    {
      "body": "I discovered recently that Holmes Place Barbican has significantly reduced its off-peak hours (but of course without any corresponding reduction in its membership fee). They've also introduced a new rule that off-peak members aren't admitted more than 30min before the end of the off-peak period and need to leave before it ends - before so long as you entered within the off-peak time you could stay as long as you liked. Aside from meaning they now offer considerably worse value for money for off-peak members, this is plainly in breach of their membership conditions (which do not mention them having any right to vary off peak hours). I strongly urge any off-peak members to write to the manager, Andy Francis, and ask him to reinstate the previous rules, or at least offer a significant reduction in price.", 
      "date": "2005-09-09 18:18:00", 
      "id": 3234, 
      "responses": 14, 
      "subject": "Holmes Place hours change", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1835"
    }, 
    {
      "body": "TfL has started piping music into the booking hall at Barbican Station (and elsewhere). You can register your views (objections, I hope) at  . On their Home page click Contact (top right corner), select Tube from the blue list, fill in their Incident form, selecting Ambience/Environment. There is space for comments.  The station staff don't like it either.", 
      "date": "2008-03-08 10:11:00", 
      "id": 3810, 
      "responses": 14, 
      "subject": "Piped Music", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4098"
    }, 
    {
      "body": "Nick Cohen in the Standrd has had a cliched jibe at the Barbican tonight.  I think we should mail in to protest. To quote: \"I went to the Museum of London .....  but spent as much time gawping at the Barbican complex ....   Nothing, not the doomed attempts of the residents to prettify the blocks with window boxes nore the late june sun, could make the brutalist towers look like anything other than an East German Housing project. Because it is in the centre of London and has a nice arts centre  attached, its flats still sell for 350k.  But it will take only one propoerty crash for the Barbican to meet its destiny and become what it was designed to be: a sink estate for the upper-middle class.\" Grrrrrrrrrrrrr............... Letters to   including daytime number, name and address !!!!!", 
      "date": "2006-06-28 21:16:00", 
      "id": 3173, 
      "responses": 12, 
      "subject": "Bad press for the Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2411"
    }, 
    {
      "body": "We residents of Brandon Mew plus, I believe, some in Willoughby House and Defoe House, do suffer from tube rumble exacerbated by what I always thought was trains going over a set of points by Moorgate Station.  However, talking to one of the Estate Agents recently, I was told that he'd been talking to a railway engineer who said the clackety clack noise, that is more disturbing than the general rumble, was due to faulty track and that Metronet Rail, or whoever is reponsible for track maintenance, knows all about this.  They won't do anything about it because nobody complains, but if a body like the BA complained strongly enough, they might be forced to do so.  I know this is all hearsay, but does anyone know if there are any grounds to this and, if so, is it something we could reasonably expect the BA to take up on our behalf.", 
      "date": "2006-02-25 13:08:00", 
      "id": 3232, 
      "responses": 12, 
      "subject": "Tube rumble and noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2099"
    }, 
    {
      "body": "According to the BBC ( ), Carluccio's pays its waiters just 3.75 per hour - less than minimum wage - expecting them to make up the difference with tips. Disgraceful! Knowing that I'm amazed at how cheerful the staff at Carluccios manage to be. I suggest a boycott of Carluccios until the management change their ways.", 
      "date": "2008-04-18 08:03:00", 
      "id": 3878, 
      "responses": 12, 
      "subject": "Boycott Carluccio's!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4245"
    }, 
    {
      "body": "Is it just that I have turned into a grumpy old man or do fellow Barbican citizens find the muzak in M&S Finsbury Pavement extremely annoying? I now refuse to shop there. Perhaps the M&S management should consider not chasing business away, particularly with the advent of Waitrose in June.  Anyone feeling similarly annoyed mught like to send an email to M&S at the following address:", 
      "date": "2006-03-10 08:33:00", 
      "id": 4630, 
      "responses": 11, 
      "subject": "M&S moan", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2124"
    }, 
    {
      "body": "Could the Residents' Meeting be our chance to put our views on St Alphage to the vote? On our RSVP card we have requested that there should be a vote on the current proposals. Should we contact the Chair prior to the meeting to get this officially on the agenda?  Perhaps it would be a good idea that residents attending the meeting refrain from participating in the electronic voting on the issues of the City's choice unless we can vote on a motion, along the lines of \"We reject the current proposals for St Alphage House\".  Of course if we propose such a vote we must win it convincingly. Perhaps we should put up information on block notice boards to make sure there is a good attendance - and give out information to residents as they arrive for the meeting. Is this something that the BA sub committee on St Alphage could co-ordinate? We would hope that asking for a vote is something that our elected representatives - the CCs of the relevant wards and the House Group chairs and committee members would support. Incidentally - isn't it time we heard about the BA St Alphage sub committee's strategy?", 
      "date": "2008-05-20 17:11:00", 
      "id": 3601, 
      "responses": 10, 
      "subject": "2nd June Residents' Meeting - Chance to vote on St Alphage?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4360"
    }, 
    {
      "body": "I complained to Transport for London that only one of the two platforms at Barbican Station was cleared of graffiti after Christmas. I have just received a phone call from Metronet, who say that their contractor has instructions to clean the other platform but cannot do so without access permission from Network Rail - which is not forthcoming. Network Rail's website states that Barbican Station is managed by TfL.   Who knows.  Who cares.  Just join me in bombarding them all with complaints until something happens!", 
      "date": "2008-02-01 14:27:00", 
      "id": 3809, 
      "responses": 10, 
      "subject": "Barbican Station update", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3973"
    }, 
    {
      "body": "Hello, I wanted to see if any other parents are missing not being able to take their kids to the pool at the weekend.  I have complained to the management a couple of times about reinstating a lifeguard, but they say the problem is they're not able to find a lifeguard that will only work for a couple of hours a day. I think if there's enough of us that rally around and push for it, Virgin will make more of an effort to find somebody/have to increase the wage to make it more of an attractive offer.   I know we're able to use the faciltiies at the Islington site but with all the baggage, inflatables etc. it's just another hike I want to avoid at the weekend - in the time we save we might even be able to squeeze in the luxury of a few Sunday papers. Oh the crazy, glamorous life we parents lead! Here's hoping! Best, Sam", 
      "date": "2008-03-23 14:10:00", 
      "id": 3836, 
      "responses": 9, 
      "subject": "No Lifeguard for Children at Virgin Barbican Pool", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4148"
    }, 
    {
      "body": "While we're on the subject of planning applications, there has been one made for the \"Void Space\" at the base of Cromwell Tower to be turned into a flat. I mention this as a recent flyer in Cromwell informed that the applicant is already a Cromwell Tower resident...and is also a member of the Cromwell Tower House Group. I would not want to comment on the rights and wrongs of the above, suffice to say that given the huge demand for tower flats, perhaps interested parties would like to contact the Chair of Cromwell Tower sub group, John Tomlinson, to evaluate the proposal. Apparently he is also liasing with David Graves of the BA. My personal view is that either the space should be converted into an apartment for a local key worker (teacher, nurse etc) plus family*, or auctioned by the corporation to the highest bidder with the resultant sum being spent on residential amenities. Either way, there should be more visibility as I suspect non-Cromwellians have not been informed of this. M * I should point out that I have no idea if the applicant - who is named on the flyer - is actually a key worker. For all I know, he might be. For that matter, he might also have already won an auction.", 
      "date": "2008-01-23 20:51:00", 
      "id": 3588, 
      "responses": 7, 
      "subject": "Cromwell Tower new flat being created - planning application", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3945"
    }, 
    {
      "body": "The Boudoir hearing is set for 10 am on August 1st.  Islington are expecting a good turnout so we shouldn't disappoint. Also people who have had personal bad experiences with the bar need to turn up and give their experiences.  Cntact   (phone number on the BA website).  This is really important as Islington sent officers down to observe what was going on and have reported that they witnessed no problems.", 
      "date": "2005-07-21 10:03:00", 
      "id": 2952, 
      "responses": 5, 
      "subject": "Boudoir Hearing - Need WITNESSES and a GOOD Turnout", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1754"
    }, 
    {
      "body": "Any thoughts on the trial of extra corridor lighting in Ben Jonson? I know the corridors are gloomy, but was there an urgent need to expend more electricity (albeit low carb) and why oh why is it ORANGE in a colour scheme of blue & white???? Rebecca is circulating a letter in the near future, so please, any one with colour sense, back me up!  ", 
      "date": "2008-05-06 09:34:00", 
      "id": 3704, 
      "responses": 5, 
      "subject": "Ben Jonson orange schmorange ...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4307"
    }, 
    {
      "body": "Only joking... I'm not at all. I'm very cross about it ...BUT That said, is it worth discussing what we should lobby for in the medium to long term with regards to the St Alphage site?  We might get lucky and Chase JP Bear away this time. The economy might collapse. Bear JP might be rouge traded, I don't know. But the fact remains that someone at some point will try and develop the land. It may be 5-10 years from now, but surely, it will happen.  Putting aside the ghastly injustices of the political situation which've been detailed on other posts, what is clear is that the hilariously impartial planning department regard us as nothing more than a bunch of self-serving fascists who don't understand the basics of the  London economy.  It seems to me that this their way of writing off our concerns as a form of selfish Nimbyism that damages the productivity of the City.  This is clearly ridiculous, but it seems entrenched in the mind of the planning department.  Surely then, we have to present ourselves as people who care deeply about the City ( not untrue I would imagine) and who lobby for the Barbican on belhalf of the 300 000 workers we have been sterotyped as being against? We should argue for an architecture that is bold and as landmark as the Barbican itself.  We should present ourselves as people who not only care about The Barbican- but care about other people having acess to the Barbican? Not just the arts centre, but the place as a whole? If this is a grandmother suck eggs situation, forgive me. My white rage at the proposal has made me want to do all kinds of things! But should we also be working out what would be acceptable- or is this giving up before we've even started? Perhaps it is a dangerous strategy. Perhaps me saying this is all part of their darstardly plan. I put nothing past their evil cunning. And I'm sure I'm absolutely stating the obvious here and everyone else is five steps ahead of me on this- for example- the Save the Barbican T-shirts I thought struck the right note I thought! I personally would rather another Gherkin or even a 'Shard of Glass' outside my living room than the bulky monstosity we've been offered. But more importantly, I want to be able to walk to the Guildhall / Cheapside without crossing a big road. I want to get to Moorgate without getting in a lift and I want the safety offered by having a steady stream of people coming in and out of the Barbican. These are, to me, more important that the height of the building. A landmark beauty would, in my view, benefit us all. But discuss... And apologies for the provocative subject title, I was concerned that the telephone had knocked the issue off the top spot. Don't even get me started on BT. [/i]", 
      "date": "2008-04-12 14:20:00", 
      "id": 3866, 
      "responses": 5, 
      "subject": "Pro the St Alphage Development", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4229"
    }, 
    {
      "body": "Anyone else suddenly being bathed in light from the new building on Chiswell Street called, I think, Milton Place. Seven dirty great floodlights have been switched on - and stay on 24 hours a day! They serve no useful purpose whatever. I no longer enjoy twilight falling softly - in fact, I can't look to the east any more as the lights dazzle so much.  Anyone else willing to join me in a protest to try and get them turned off? Quite apart from the intrustion, they are a supreme example of wasting energy!", 
      "date": "2007-04-16 07:51:00", 
      "id": 4383, 
      "responses": 5, 
      "subject": "Floodlights in Chiswell Street!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3236"
    }, 
    {
      "body": "T-Mobile are about to put in a planning application to site a phone mast on the roof of 45 Beech Street. A very quick internet scan suggests from various sources that there are potential health risks, particularly to those living within 300 metres of mobile phone masts. If we want to object to the siting of this mast - individual letters/objections count. Does anybody else know about this?", 
      "date": "2006-06-13 17:17:00", 
      "id": 4429, 
      "responses": 5, 
      "subject": "T-Mobile proposed phone base station - i.e.mast", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2364"
    }, 
    {
      "body": "I note a few messages about Crossrail on another thread - and thought it might make sense to start a new one here.  I think one of the messages says that there is a plan B regarding the Crossover cavern under Defoe House.  There is indeed a Plan B, but that doesn't stop the crossover being constructed - but it might enable the engineers to do away with the proposed surface works on Aldersgate Street as the plan involves removing the muck through the tunnels back to Liverpool street, rather than through a shaft at Aldersgate Street/Beech Street.  Regarding subsidence, residents will be exceedingly unlucky if they are affected at all.  Virtually all underground works make for some subsidence (most of the Barbican falls within a prospective area where up to 10mm of subsidence might be expected) - but if this occurs evenly across the structures it is unlikely that anyone will notice apart from the engineers with their precision monitoring instrumentation.  Bear in mind that the Crossrail route under the Barbican is actually directly underneath the existing Metropolitan Line/Circle line/Thameslink tracks - and for safety reasons any subsidence will have to be very tightly controlled under the existing tracks.  I don't think Defoe residents should have anything to worry about.  Plenty of tunnelling has taken place under London recently without damage to overlying structures. Regarding the Crossover cavern - this is a structure where the twin tunnels are merged effectively into one much wider one so that trains can be switched from one track to the other.  These are necessary for both safety and operational reasons.  I am not sure why such a cavern needs to be directly under Defoe, but it is necessary for it to be somewhere, and in an urban environment it is virtually bound to be under some building and the plans place it  below Defoe and I doubt that that will be changed, but I reiterate that I still don't believe that Defoe, or any other Barbican residents will have anything to worry about from the tunnels themselves as they are 30 m down and modern engineering should be able to cope very well with this kind of problem.  The noise etc. from works in Aldersgate Street is another factor altogether and i think the current plans call for works to be carried out there for up to 43 months! - If we can do anything to get Crossrail to implement Plan B then we should.  Traffic disruption alone will be pretty horrendous, and there will also be major traffic problems in Moorgate where a major sewer has to be diverted and then replaced.  We do live in 'interesting times.'", 
      "date": "2005-04-13 20:06:00", 
      "id": 2909, 
      "responses": 3, 
      "subject": "Crossrail", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1560"
    }, 
    {
      "body": "At risk of sounding like Disgusted of Willoughby, not only did we have the police drama in the night on Sunday, but we also had noisy building work going on all through Sunday morning and afternoon from the Austral House site at London Wall/Coleman Street. It finally finished at 3.30pm That has been 7 days of construction noise from three sites within view of our balcony ALL week.  I did log my complaint with Guildhall on Sunday, and the Environmental Health duty office did call me back. He told me that the Austral House site work had been authorised becuase they had applied for a permit and been granted one. On a Sunday! It is likely they have applied for and been granted others too. Can anyone else bothered by this please also log their complaint with the City. During the week, speak to the Pollution Team on 020 7332 3630. At the weekends, when the noise nusiance is happening, call Guildhall switchboard on 020 7606 3030 and say you have a noise nusiance complaint. We really must bring pressure to bear on the City to not issue noisy works permits for Sundays so close to the Barbican Estate.", 
      "date": "2006-04-24 22:26:00", 
      "id": 3068, 
      "responses": 3, 
      "subject": "Weekend Constuction", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2221"
    }, 
    {
      "body": "Could we please organize a big gathering with a fake big hammer to get rid of the horrible corridor under Ben Jonson House? What do you think? Or is it more sensible to lobby with the association to protect the barbican...this is the question...", 
      "date": "2007-11-29 16:38:00", 
      "id": 4170, 
      "responses": 3, 
      "subject": "Big  Fake Hammer?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3823"
    }, 
    {
      "body": "Heron and the GSMD have distribited a sales memo stating that the application to redevelop Milton Court was deferred because of \"design related reasons\". This is simply not true. I was at that planning application meeting - there were a myriad of reasons given by those who spoke in objection to this plan, and the Planning Committee effectively said \" go back and come up with an entirely new plan\". However - it seems that Heron and the GSMD care not a jot for the concerns of local residents, and believe that those concerns can be \"steamrollered\" away. So much for so-called \"consultation\". As invited by this memo, please do contact  \"leanne.parkinson@fourcommunications.com\"  and let Heron know how Barbican residents feel about such an approach........", 
      "date": "2007-06-06 22:16:00", 
      "id": 3337, 
      "responses": 2, 
      "subject": "Milton Court - Communication from Heron & GSMD", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3401"
    }, 
    {
      "body": "IF you are disturbed by the current illegal cable laying in Aldersgate street, please call the guidhall to complain 606 3030.  They then tell environmental health. They've just run away, leaving all their kit but they are the kelley group, and the more complaints the better my big question is why is there no enforcement of the rules on raod works?", 
      "date": "2008-02-25 22:29:00", 
      "id": 3527, 
      "responses": 2, 
      "subject": "Aldersgate St roadworks 10 pm", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4060"
    }, 
    {
      "body": "Once again British Land was working illegally on Saturday afternoon.  If the exceed the normal working hours the City of London Environmental Health Department can intervene, as they did. Technically only Islington Council can take action but as they do not work at weekends the City can step in.  Islington has long suspected that British Land were working beyond agreed hours and on Monday the City will contact them so action can be taken. If the same problem occurs again in Whitecross Street please ring the City on 7606 3030 and get the switchboard to contact the duty environmental health officer.  They can take action.", 
      "date": "2008-03-09 03:07:00", 
      "id": 3813, 
      "responses": 2, 
      "subject": "Ropermaker St. construction and spin off for Whitecross", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4100"
    }
  ]
}