{
  "summary": [
    {
      "body": "The following letter is being distributed to residents of the Barbican Estate on Friday 5 January to highlight the submission of the application for the redevlopment of Milton Court. 03/01/2007 Dear Resident Re: Milton Court Redevelopment I hope you enjoyed a peaceful Christmas. I wanted to advise you direct that following the public exhibition, we have submitted the planning application for Milton Court. The application was registered on 20th December 2006 by the City of London and I expect that those of you nearest to the site may receive a letter from them asking for your views. The City could take this application to their planning committee at the end of March at the earliest. We therefore wish to use the next 12 weeks making sure that the scheme is fully understood and that we listen to any issues you might have. We will hold a public exhibition in early February at the Guildhall School of Music & Drama (we will contact you again with the time and date) and will continue via newsletters to keep you informed. If you have any issues at this stage please contact Leanne Parkinson or Jeremy Fraser on 0870 420 3246,jeremy.fraser@fourcomunications.com I wish you a Happy New Year and I look forward to meeting many of you in the coming weeks. Yours sincerely  Ian Blake Heron International", 
      "date": "2007-01-05 10:11:00", 
      "id": 4209, 
      "responses": 14, 
      "subject": "Submission of application for redevelopment of Milton Court", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2880"
    }, 
    {
      "body": "The Barbican is listed in the Register of Parks and Gardens of Special Interest, where it is registered as II*. (Site reference number 5185), which means that any planning application which affects its setting has to be commented on by English Heritage The defined area clearly includes the bridges. The site rises above street level, with car parking below it, and comprises terraces and buildings built on various levels linked by a network of steps, raised walks, and pedestrian bridges I can provide copies of both the listing statement for the Barbican and the separate statement for the gardens and podium area if you send me a personal message.", 
      "date": "2007-08-31 11:01:00", 
      "id": 3414, 
      "responses": 3, 
      "subject": "The Barbican Podium and Gardens are listed Grade II*", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3615"
    }, 
    {
      "body": "Have spent an hour this evening looking at the proposals for the redevelopment of Milton Court and am extremely worried.  There was no mention, that I could see, of the impact a 42 storey building would have on the surrounding residential buildings.  In the expensive looking mock ups of every possible aspect of the new building + model, there was no reference to Cromwell Tower for example.  Residents there, and their current views had been conveniently forgotten. There was also minimal reference to Speed House & Willoughby House, unless I am mistaken. Am I the only one concerned about the imposing nature of the building, the impending building noise, light disturbance and additional hassle such a large building will cause? When I asked the City of London representative about the impending planning application & the date it would be submitted, he was reluctant to be specific.  He tried to placate me with \"sometime in June\".  My advice to all residents in the Barbican is to be vigilant about the planning applications and register your objections as soon as possible.  I would be interested in other peoples opinions on the redevelopment plans.....", 
      "date": "2006-04-27 21:38:00", 
      "id": 3075, 
      "responses": 2, 
      "subject": "Milton Court - proposed redevelopment", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2233"
    }, 
    {
      "body": "johnbh is right you dont need to be nominated if you are a resident on the local electoral list one year minimum ", 
      "date": "2006-11-29 15:19:00", 
      "id": 3222, 
      "responses": 2, 
      "subject": "bringing in the sheep", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2789"
    }
  ]
}