{
  "summary": [
    {
      "body": "Why do we bother lobbying to have pubs and clubs around the Barbican controlled for opening hours and noise disruption, when our own neighbours cause such a ruckus? Last night someone in Speed House held a really obnoxiously noisy party. Every few minutes there was some mad screaming until about 2.30 am. The noise enemy is within.", 
      "date": "2005-08-06 10:41:00", 
      "id": 2960, 
      "sentiment": 4, 
      "subject": "Noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1791"
    }, 
    {
      "body": "At risk of sounding like Disgusted of Willoughby, not only did we have the police drama in the night on Sunday, but we also had noisy building work going on all through Sunday morning and afternoon from the Austral House site at London Wall/Coleman Street. It finally finished at 3.30pm That has been 7 days of construction noise from three sites within view of our balcony ALL week.  I did log my complaint with Guildhall on Sunday, and the Environmental Health duty office did call me back. He told me that the Austral House site work had been authorised becuase they had applied for a permit and been granted one. On a Sunday! It is likely they have applied for and been granted others too. Can anyone else bothered by this please also log their complaint with the City. During the week, speak to the Pollution Team on 020 7332 3630. At the weekends, when the noise nusiance is happening, call Guildhall switchboard on 020 7606 3030 and say you have a noise nusiance complaint. We really must bring pressure to bear on the City to not issue noisy works permits for Sundays so close to the Barbican Estate.", 
      "date": "2006-04-24 22:26:00", 
      "id": 3068, 
      "sentiment": 4, 
      "subject": "Weekend Constuction", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2221"
    }, 
    {
      "body": "Riots in and outside the YMCA, paint colour wars, satanic children and smashed glass in BJH and drunken hoodies under Bunyan. What's going on on our northern fringes? Is there something in the water? ", 
      "date": "2006-05-06 22:29:00", 
      "id": 3097, 
      "sentiment": 4, 
      "subject": "what's up??", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2266"
    }, 
    {
      "body": "Is anyone else getting a liitle hacked off with the seemingly endless deliveries at the newly opened Tesco? There have been half a dozen juggernauts so far today (Sunday), and each time they arrive the tailgate is allowed to hit the road making an incredibly loud noise. Then theres the clanking of the storage cages as theyre dragged along the pavement. Its bad enough during the day but they also do it before dawn! Does anyone know if there are any restrictions on this kind of noise? I must be really noisy for people living in John Trundle Court.", 
      "date": "2006-11-19 18:28:00", 
      "id": 3212, 
      "sentiment": 4, 
      "subject": "Noisy Tesco", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2760"
    }, 
    {
      "body": "Anybody know to which body I should address a letter of complaint about the music from the keep fit classes in the early evening? It's like having a rave foised upon the area each day. Pub noise I expect and accept within reason but thudding megawatt soundsystems in order to shift a few calories is several steps too far. I'm afraid i'm not going to be satisfied with approaching 'the management' either in this case. They have paying customers to satisfy so there is a conflict of interests for a start.  I want to lodge something with a body that cannot simply turn a blind eye nor file my complaint in a folder marked 'trash'. I'm thinking upon the lines of a local noise abatement officer or similar. Please feel free to PM me with accurate details if you have them  or simply don't want to to broadcast the information. Having said that ,unless i'm the only one ready to pop a valve over this irritant, then i'm sure others may be wish to object or lobby too. Regards, L", 
      "date": "2007-05-21 18:21:00", 
      "id": 3323, 
      "sentiment": 4, 
      "subject": "Enough! YMCA gym music", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3352"
    }
  ]
}