{
  "summary": [
    {
      "body": "There was a parade of men, many wearing orange sashes and accompanied by bands & banners in the city this afternoon. I spotted them in the Smithfield area & later on London Wall & Aldersgate, but couldn't see what their banners said. I suspect that they were orange men - does anybody know what was going on?", 
      "date": "2005-04-23 17:41:00", 
      "id": 2920, 
      "sentiment": 2, 
      "subject": "orange parade in city???", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1584"
    }, 
    {
      "body": "just out of curiosity did you hear the gas fire explosion sunday morning? my windows shook and it woke me up, I had no idea what it was till I saw the news. Apparently they heard the explosion as far as Holland!", 
      "date": "2005-12-12 09:42:00", 
      "id": 3007, 
      "sentiment": 2, 
      "subject": "gas fire explosion", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1981"
    }, 
    {
      "body": "At risk of sounding like Disgusted of Willoughby, not only did we have the police drama in the night on Sunday, but we also had noisy building work going on all through Sunday morning and afternoon from the Austral House site at London Wall/Coleman Street. It finally finished at 3.30pm That has been 7 days of construction noise from three sites within view of our balcony ALL week.  I did log my complaint with Guildhall on Sunday, and the Environmental Health duty office did call me back. He told me that the Austral House site work had been authorised becuase they had applied for a permit and been granted one. On a Sunday! It is likely they have applied for and been granted others too. Can anyone else bothered by this please also log their complaint with the City. During the week, speak to the Pollution Team on 020 7332 3630. At the weekends, when the noise nusiance is happening, call Guildhall switchboard on 020 7606 3030 and say you have a noise nusiance complaint. We really must bring pressure to bear on the City to not issue noisy works permits for Sundays so close to the Barbican Estate.", 
      "date": "2006-04-24 22:26:00", 
      "id": 3068, 
      "sentiment": 2, 
      "subject": "Weekend Constuction", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2221"
    }, 
    {
      "body": "Did anyone see the two people who were walking along the brick wall in the middle of the lake about 11pm last night?! Don't know how they got there or what they were doing btu they stood there for about 5 mins then turned around and walked back again!", 
      "date": "2006-04-07 09:47:00", 
      "id": 3134, 
      "sentiment": 2, 
      "subject": "Random walkers!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2184"
    }, 
    {
      "body": "Early Saturday morning around 5am, I looked out my bedroom window and was shocked to see 2 middle aged men running around the gardens naked except for running shoes. I must admit that I was a little unsettled by the experience especially when the first man (obviously the pace setter) disappeared into Defoe house followed shortly by the other gentleman who was clutching his chest and appeared to be in great difficulty. Is there a new resident's running club that I should be aware of?", 
      "date": "2006-11-20 21:26:00", 
      "id": 3220, 
      "sentiment": 2, 
      "subject": "Nude Jogging", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2764"
    }
  ]
}