{
  "summary": [
    {
      "body": "Has anyone else noticed how nice the high walk is looking at the moment.  The planting is especially good this year with swathes of same colour planting trather than the normal polkadot effect that most local authorities.  The new gardeners are to be congratulated I think .......", 
      "date": "2005-04-18 08:26:00", 
      "id": 2914, 
      "sentiment": 3, 
      "subject": "Spring Flowers on the High Walk", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1570"
    }, 
    {
      "body": "One of the nice things about the Barbican gardens has been the fact that they are free of mess.  At the weekend I went to the Defoe garden and couldn't believe how much crap there was on the ground.  It wasn't hard to see why since there were two geese and five half-grown geese parading up and down.  Seven big and quite aggressive geese is beyond a joke and stepping around mounds of goose turds is not funny either.  I seem to remember reading that the Corporation hadn't received enough complaints to justify the hassle of getting rid of the geese.", 
      "date": "2006-06-27 14:18:00", 
      "id": 3144, 
      "sentiment": 3, 
      "subject": "Goose crap in the gardens", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2400"
    }, 
    {
      "body": "I am at the south end of Willoughby House...  I am vaguely aware of how plumbing systems work, but this one has me utterly baffled.  Yesterday afternoon, I noticed that my loo was flushing using hot water (hot enough to be steaming).  And no I havent been making more frequent trips to Chawol. At first I thought I was going mad but it really seems to be true.  I don't know how this could be.  I did, however, hear some plumbing work going on at some point towards the end of last week as it reverberated through the communal service ducts.  Is it possible someone somewhere has done something strange with some pipes?! Any help or suggestions greatfly appreciated!", 
      "date": "2007-09-03 11:02:00", 
      "id": 3423, 
      "sentiment": 3, 
      "subject": "Toilet flushing with hot water", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3627"
    }, 
    {
      "body": "We have just received the questionnaire about the refurbishment, and I hope that many residents will complete it and return it to the estate office. Overall the refurbishment looks great, and the automatic doors are a big improvement. However, the budget was 190,000 - quite an astonishing amount of money to spend on the podium entrance and car park entrance. The budget apparently did not stretch to the following items which I think residents should consider, as I had understood that they would be included: -- the porters' desk was not renewed and is showing lots of signs of wear and tear -- there is no parcel store - as before, parcels are left on the floor, which I find rather astonishing. Nowadays people order more and more online, and there is no provision for the storage of delivered items. -- the doors at podium level (possibly elsewhere) were poorly repainted. You can see that old layers of paint were not removed, and already the new paintwork is showing signs of damage. I'd be interested in hearing opinions from my neighbours on this. The house committee has been silent, to my knowledge. The whole job took an extraordinary amount of time, and cost an unfathomable amount of money, and I think that in less than 12 months we will all have serious misgivings - if we don't already.", 
      "date": "2007-11-24 20:32:00", 
      "id": 3614, 
      "sentiment": 3, 
      "subject": "Shakespeare lobby refurb questionnaire", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3815"
    }, 
    {
      "body": "I wonder if the complete absence of litter bins on the podium, except for those in the Speed House andd Defore gardens, bothers anyone? There are times that litter accumulates to such a degree that I yearn for that long gone receptical that at one time was seen round about and many time full to overflowing.        I realize our litter bins were removed about the time the IRA were using both litter bins and post boxes to house their explosives in their dastardly campaign in England. But since the troubles, and the long awaited answer to the final solution, things have taken a turn for the better I would assume the recepticals might effect a long awaited return.         I've inquired, of the Corporation on a number of occasions, when   might the bins again appear and on each instance came the reply ' we are in the process of perfecting a bomb proof litter bin '!!! Remembering the year of my first inquiry, 1998 I believe, finding the material and answer to this problem seems so far to escaped their search.          Very possibly I won't have the pleasure of seeing the bins in my lifetime but I hope for those who follow me here on the Estate litter hopefully will if not be a thing of the past at least will be lessened. Am I asking too much and are there any comments out there?", 
      "date": "2007-01-14 13:12:00", 
      "id": 4139, 
      "sentiment": 3, 
      "subject": "The long absent litter bin!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2905"
    }
  ]
}