{
  "summary": [
    {
      "body": "Ok, people, here's another hardy perennial. It's now getting VERY COLD.  I feel the cold quite badly and am at home much of the time (like many others in the Barbican) and the free-standing electric heaters which we have just don't do the job properly. Not to mention the fact that we've already spent a small fortune this summer on using them because the weather was so cold some of the time. I rang the BEO to be given the usual \"oh, we never turn the heating on until October\". I pointed out that if it gets cold before the beginning of October, and enough people request it, then it can be turned on earlier (as has happened in previous years) so I was getting my request in early this year. This went down like the proverbial lead balloon. Apart from being cold, I'm also very annoyed. It seems to escape the notice of BEO staff that RESIDENTS PAY FOR THEIR HEATING through the service charge and if we need it turned on slightly earlier then we're perfectly entitled to have it. It's always a rather worrying situation when those in charge of your heating system a) don't live here and b) have a vested interest in keeping the cost down. I know that our heating system is an ongoing concern because of its incredibly complicated time/temperature triggers (nothing like a simple thermostat here) and also because it is hopelessly antiquated but it shouldn't be such a battle to get it turned on every year. I don't want to knock the BEO staff because usually they provide a very good service - but this one really gets me going   So, please - ring your House Officers and request that we have access to our own heating. It still takes about a month for the buildings to warm up properly so, even if it goes on now, it will some time before we really start to feel it. House Officers' telephone numbers are:-   Andrewes, Brandon, Cromwell, Gilbert, Speed and Willoughby - Helen Davinson on 7029 3963 Defoe, Lambert Jones, Lauderdale, Mountjoy, Postern, Seddon, Thomas More and Wallside - Sarah Styles on 7029 3962 BJH, Breton, Bryer, Bunyan, John Trundle and Shakespeare - Rebecca Marshall on 7029 3964. Yours in scarves and sweaters etc. etc.", 
      "date": "2007-09-26 15:09:00", 
      "id": 3804, 
      "responses": 101, 
      "subject": "HEATING!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3692"
    }, 
    {
      "body": "Can I ask how people are finding the heating at the moment? My flat is quite cool and I can't detect any warmth coming up through the carpets.", 
      "date": "2005-11-08 13:52:00", 
      "id": 5531, 
      "responses": 31, 
      "subject": "Heating (again)", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1925"
    }, 
    {
      "body": "Is anyone else really cold at the moment?! I know the heating is due to come on in October (can anyone confirm this for certain?) but it would be good if the Estate Office, or whoever controls the heating, could react to the weather. Our bedroom is like an ice box in particular, and I really need to have the window open when I sleep and I can't as it's too cold!", 
      "date": "2005-09-27 08:29:00", 
      "id": 4506, 
      "responses": 29, 
      "subject": "Heating", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1856"
    }, 
    {
      "body": "It's getting chilly... but no electric warmth from the floor yet. If only I had some Totes Toasties (remember those?) Though really it's not quite that cold yet, I expect that's why it's still off. It's always a treat when it does come on, though. I'm looking forward to it already. Is anyone else turned on and warmed up yet?", 
      "date": "2006-10-03 18:18:00", 
      "id": 3204, 
      "responses": 26, 
      "subject": "Heating - that time of year again!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2651"
    }, 
    {
      "body": "I'm still feeling colder than usual in my BJH flat and I've noticed that the heating seems to be on a timer. It warms up for a couple of hours in the morning, but by 11.00 a.m. it's cold underfoot again, then it warms up again in the evening. This is all fine and dandy if you work 9-5, but lots of us don't and are here  all day. Today, despite being a weekend, the same timings seem to be operating. I'm fed up with being cold - this is my third winter here and the previous two had much higher heating levels. Anyone else getting the same heating levels? It's about to turn really cold, especially at night, and it's a bit worrying. We need heat to stay well, especially the older residents among us.", 
      "date": "2007-12-09 11:56:00", 
      "id": 4174, 
      "responses": 14, 
      "subject": "Is the heating on a timer?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3858"
    }, 
    {
      "body": "I don't seem to have any heating on at all. Anyone else with the same problem? Thanks, Clochette", 
      "date": "2006-01-05 09:48:00", 
      "id": 3034, 
      "responses": 11, 
      "subject": "Anyone else freezing in Bunyan Court?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2016"
    }, 
    {
      "body": "Due to necessity (and I'm sure I'm not alone) I have been sleeping with my window/balcony door open, because the combination of the heating and the hot weather renders my sleeping erratic to say the least! I don't want to be a sanctimonious ex-smoker, but the smell of smoke wafting in from someone chuffing on another balcony at 730am is pretty disgusting. I appreciate there's little one can do, but just wanted to have a moan and wondered whether anyone else experiences this and has any thoughts.", 
      "date": "2007-05-05 06:53:00", 
      "id": 4328, 
      "responses": 7, 
      "subject": "Alarm Call", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3306"
    }, 
    {
      "body": "well, a beautiful day outside and a new Barbican experience - the heating isn't working so I was cast back to childhood as i tiptoed on very chilly floors ... in a sweater ... usually pants only its so hot anyway, it should be fixed later today ...", 
      "date": "2006-12-09 09:33:00", 
      "id": 3309, 
      "responses": 6, 
      "subject": "brrrr - no heating", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2817"
    }, 
    {
      "body": "Has anyone else noticed substantially lower heating temperatures this year? Mine hovers around 58F and only just makes it to 60F in my tiny bathroom. The tiles only feel as though the chill has been taken off, not nice and warm as previously. It used to be too warm for anyone to consider sleeping on the floor and anything left on the floor felt very warm underneath. I have called the engineers twice, but have noticed no change from the chilly conditions prevailing. Obviously, I can top up with additional heaters but I am still also paying for for a severely depleted level of background heating. I understand the system is supposed to maintain at least 60F except in very severe conditions and today it is relatively mild. Brrrr!", 
      "date": "2007-12-04 15:15:00", 
      "id": 3492, 
      "responses": 5, 
      "subject": "Heating temperatures", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3843"
    }, 
    {
      "body": "Is the heating still on for everyone? We complained to the Estate Office last week who said that it had been turned off but would \"take a few days to work through the system\" - something I find rather hard to believe.", 
      "date": "2008-05-18 08:42:00", 
      "id": 3597, 
      "responses": 5, 
      "subject": "Heating...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4350"
    }, 
    {
      "body": "Does anyone know if there are plans anywhere showing where the cables for the underfoor heating are?  I only ask because I am being woken uo at some god forsaken hour with boiling hot feet and then I can't get back to sleep.  No I don't sleep on the floor but hot air rises.  My bread is also hot as the heat must go up the table the bread box is on.  I could move bed setee and table if I could find a cool spot.", 
      "date": "2006-11-03 10:33:00", 
      "id": 3191, 
      "responses": 2, 
      "subject": "Baked feet", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2721"
    }, 
    {
      "body": "Is it just us or does anyone else have a very hot flat? We were told that the heating is not on at the moment but we still requested that our heating be turned off. This has not made any difference to the warm temperature in our flat and we wondered if the flats facing St Pauls all suffer from the same complaint.", 
      "date": "2008-05-08 09:56:00", 
      "id": 3575, 
      "responses": 1, 
      "subject": "Heating", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4316"
    }, 
    {
      "body": "Hello Has the heating been turned off? Ben Jonson House is freezing.", 
      "date": "2008-04-07 20:11:00", 
      "id": 3851, 
      "responses": 1, 
      "subject": "heating", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4209"
    }, 
    {
      "body": "Has anyone else noticed that there are now a couple of loose manhole covers on Aldersgate Street (on on the northbound side and the other on the southbound by the pedestrian crossing) that now make a considerable racket when cars/buses run over them? I reported the first of these to the Corporation a few weeks ago but nothing was done and now the problem has doubled. It's just about tolerable when we have our windows shut but is going to be hell once the warmer weather comes.....", 
      "date": "2008-04-14 11:53:00", 
      "id": 3868, 
      "responses": 1, 
      "subject": "Noisy manhole covers on Aldersgate Street", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4237"
    }
  ]
}