{
  "summary": [
    {
      "body": "Headline on page three of Islington Tribune. Apparently the land lord of Cherry Tree walk - UBS, is not going to re-new the leases on the shops there, next June.  As you can imagine the small shop keepers are up in arms and organising a petition, no more chemist, cleaners, stationers, cafes.  What a shame and all because of Waitrose. UBS wishes to develop the shopping centre!  Hmm.", 
      "date": "2006-10-14 09:28:00", 
      "id": 4176, 
      "responses": 94, 
      "subject": "Global giant plans to evict traders from shopping Mall", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2678"
    }, 
    {
      "body": "Dear All, I do not know if you have received the letter from the estate office about the Garchey. Practically we have to vote about the removal. I am in favour of the removal because the garchey is a polluting system of disposal: I invite the people who oppose this to look at the functioning:just google garchey+ Corporation - [b]the rubbish is treated twice with polluting agents such as thick bleach which is  very polluting plus the chemicals you use to keep the monster clean.[/b] What I oppose is the fact that I have to pay again for the removal when I ahve already paid for it , the average cost for the removal of the syphon is about 500 pounds which I will be happy to spend on a romantic week end but not for the Corporation. I am willing to pay for the removal of the pipes and parts in common but not for the syphon etc in my flat. [u]I propose to write yes to the removal but not willing to pay for the removal of the syphon as already removed[/u] I am already paying for a service that i do not receive I mean I pay for people to use it 110 pounds and I think this is enough in terms of contribution for the community. So I invite the people who support this to form a lobby or write directly to the Corporation. Union makes strength as we say in Italian.[b]   [/b]", 
      "date": "2006-08-02 08:31:00", 
      "id": 4480, 
      "responses": 55, 
      "subject": "Garchey! We have to vote...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2501"
    }, 
    {
      "body": "Hello Neighbours, I live on Golden Lane Estate, and I'm tring to rally up support for objecting to the late license that the Shakepeare pub (on Aldersgate Street) have applied for. Does the noise  reach as far as the Barbican, John Trundle Court perhaps?", 
      "date": "2005-07-29 11:40:00", 
      "id": 2966, 
      "responses": 25, 
      "subject": "Shakespeare pub late license", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1768"
    }, 
    {
      "body": "Who would be interested in starting a petition to have the glass and tin extension to the exhibition hall which cuts across the podium demolished.  It is never used, is an eyesoar and it would be an attempt to try and resotre the podium to its original design.", 
      "date": "2006-02-16 22:54:00", 
      "id": 4599, 
      "responses": 22, 
      "subject": "Start petition to demolish an old podium building", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2082"
    }, 
    {
      "body": "I noticed that there is a letter from Waitrose on the communal noticeboard acknowledging the petition many of us signed in favour of a Barbican branch. Looks like positive stuff. PS Crispins is selling Andrex 4-packs for 1.55 so hurry!", 
      "date": "2005-10-06 17:49:00", 
      "id": 4530, 
      "responses": 21, 
      "subject": "Waitrose in Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1871"
    }, 
    {
      "body": "With the new rules in it seems that the local pubs are all applying for late licenses.  I gather this doesn't mean they will necessarily open late but it does mean if they get them they will have the freedom to do so. Under the new rules once they have this licence they have it forever - there is no annual renewal process. The Pubs involved are: The Podium - 12.30 am The Hoggs Head (Aldersgate Street) - 2.00 am The Rack and Tenter (Love Lane/Citypoint) - 2.30 The Globe (Moorgate) - 2 am The Cuban Bar (City Point) - 1  am Objections are due either this weekend or next - send them to the David Milnes at the the town clerk's department -   Include your name and address in the email.", 
      "date": "2005-07-15 10:48:00", 
      "id": 4695, 
      "responses": 18, 
      "subject": "5 New late night license applications", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1744"
    }, 
    {
      "body": "Has anyone heard that Tescoo is not now coming to the corner of Aldersgate Street and Carthusian Street?  The paper shop people have collected a petition and written to three councillors and two MP's about not wanting them there due to noise, congestion and the fact that they will have to close.", 
      "date": "2006-07-18 15:07:00", 
      "id": 4236, 
      "responses": 14, 
      "subject": "Tesco cancels", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2461"
    }, 
    {
      "body": "I had the following message forwarded to me and thought that this should be brought to wider attention: > > FW: Closing Borough Market > To those of you who know London... Please have a look at the   > following... And maybe sign petition.... > > Borough market is London's oldest market. It was established on  > the  south bank of the Thames when the Romans build the first  > London  Bridge and people have been trading on this site for over  > 2000  years. it's a beautiful undercover food market and a truly   > wonderful part of London's history. > > Some bright spark has decided to expand the railway line running   > through the roof of the market, which will also involve knocking   > down 23 of the beautiful listed and unlisted buildings in the   > closely surrounding area. > > They already have planning permission, but are waiting funding  > and  there is a strong local campaign to put a stop to it. > > If you know and love the market in its present state, please sign  >  the petition to prevent this from happening. The plans,  > photographs  and the petition are on the following site:  >   > > Unfortunately not a lot of people are aware of it so please sign  > it  and pass it on to anyone else you know who loves this great  > bit of  London heritage.. > >    > > >", 
      "date": "2007-02-06 12:44:00", 
      "id": 4224, 
      "responses": 11, 
      "subject": "Closing of Borough Market", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3040"
    }, 
    {
      "body": "The City has objected to the Post Office's running down of postal services and is even arguing for increased provision. To register your own concern and sign the petition, go to  .", 
      "date": "2008-03-06 09:30:00", 
      "id": 3537, 
      "responses": 9, 
      "subject": "Post Office Closures", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4087"
    }, 
    {
      "body": "All given that we would presumably all like to remove the blight that is British telecom from our lives, could I ask: a) would people be onboard with a direct appeal to Virgin to install their fibreoptic wizardry throughout the estate b) if the technical gurus amongst us are 100% convinced that this would be better than what we now have I believe that a substantial number of local residents made a real difference in replacing the awful safeways/morrisons/somerfields with waitrose. Maybe enough of us could do similar with Virgin? PM me if you think the idea has legs and I'll happily knock up some form of petition or ecircle-up. cheers Matt", 
      "date": "2008-03-14 17:59:00", 
      "id": 3825, 
      "responses": 9, 
      "subject": "Virgin Media", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4125"
    }, 
    {
      "body": "There is a sign from the COL Planning department on the building on the corner of Aldersgate Street/ Carthusian Street stating that Tesco has applied to change the doors and if anyone thinks that this will \"affect the character and appearance of Charethouse Square\" they should write in before Auggust 17th.  Apparently plans may be viewed at their office on the 18th Floor of St Alphage House, Fore Street and protests may be sent to - Department of Planning and Transportation, COL, Po Box 270, Guildhall.", 
      "date": "2006-07-28 10:26:00", 
      "id": 3142, 
      "responses": 8, 
      "subject": "Tesco Doors", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2485"
    }, 
    {
      "body": "When Somerfield acquired 115 stores from Morrisons, the Office of Fair Trading referred the matter to the Competition Commission.  The Competition Commission has this morning issued its provisional findings. It believes that there are competition concerns in 14 of the areas. These are listed, but do not include Whitecross Street. This surprised me as Somerfield seems to have our local market thoroughly stitched up (particularly on Sundays). If only Somerfield were required to sell on the Whitecross Street store to another operator...  Anyone wishing to comment on the findings is invited to e-mail  . A summary of the provisional findings report is available on ", 
      "date": "2005-07-26 06:32:00", 
      "id": 2950, 
      "responses": 6, 
      "subject": "Calling all anti-Somerfield campaigners", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1762"
    }, 
    {
      "body": "Please register your dissatisfaction with the St Alphage House redevelopment proposals by signing the   today. We have already collected several hundred signatures in the paper version and are now supplementing this with an online version. We welcome signatures from anyone who cares about the Barbican, whether you live here, work in the area, have some other connection with the Barbican or even none at all.  If you have already signed the paper version, we ask you not to sign again online, as we can only count you once - no matter how strongly you feel. Please ask you neighbours, your friends, or anyone else you know who cares about the Barbican to consider signing too.  Our group is a sub-group of the Barbican Association, and we have been given the task to make explicit residents' strong objections to what has been proposed. We are currently engaged in extensive research so that when the scheme comes to planning, we will be able to make the strongest case for why the scheme should be refused. We will soon have more information and will do our best to keep you informed through this site, through the  , and for Barbican residents, through the BA Newsletter delivered to your letterbox. Tim Macer Chair, Barbican Association St Alphage House Group Tel. (020) 3291 2938", 
      "date": "2008-05-22 20:44:00", 
      "id": 3608, 
      "responses": 5, 
      "subject": "St Alphage House petition - now open online", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4365"
    }, 
    {
      "body": "our lovely Barbican cleaner (Harry) told me today that there is a petition  to support a Waitrose store opening in the new building on Aldersgate Street (on same side as tube diagonally opposite Holmes Place) ...  true - or just a wild and hopes-raising rumour?  Just think - no more somerfield...", 
      "date": "2005-07-12 15:59:00", 
      "id": 4701, 
      "responses": 5, 
      "subject": "wild (nice) rumour", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1741"
    }, 
    {
      "body": "Is anybody intending to write any objections?  Just to remind you the LATEST they need to be in is next Wednesday  24 August 2005.", 
      "date": "2005-08-15 12:27:00", 
      "id": 2995, 
      "responses": 3, 
      "subject": "Shakespeare Pub Objection letters reminder", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1808"
    }, 
    {
      "body": "Have spent an hour this evening looking at the proposals for the redevelopment of Milton Court and am extremely worried.  There was no mention, that I could see, of the impact a 42 storey building would have on the surrounding residential buildings.  In the expensive looking mock ups of every possible aspect of the new building + model, there was no reference to Cromwell Tower for example.  Residents there, and their current views had been conveniently forgotten. There was also minimal reference to Speed House & Willoughby House, unless I am mistaken. Am I the only one concerned about the imposing nature of the building, the impending building noise, light disturbance and additional hassle such a large building will cause? When I asked the City of London representative about the impending planning application & the date it would be submitted, he was reluctant to be specific.  He tried to placate me with \"sometime in June\".  My advice to all residents in the Barbican is to be vigilant about the planning applications and register your objections as soon as possible.  I would be interested in other peoples opinions on the redevelopment plans.....", 
      "date": "2006-04-27 21:38:00", 
      "id": 3075, 
      "responses": 2, 
      "subject": "Milton Court - proposed redevelopment", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2233"
    }, 
    {
      "body": "I love the villagy atmosphere of our local shops in Aldersgate Street/Goswell Road and it would be such a shame for the opening of Tesco to force these shops out of business.   All of these shops have petitions against the opening of a Tesco store and it would be wonderful if as many people as possible signed them.", 
      "date": "2006-07-19 22:42:00", 
      "id": 4234, 
      "responses": 1, 
      "subject": "Petition against Tesco", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2463"
    }
  ]
}