{
  "summary": [
    {
      "body": "Hello, i write a column for a newspaper and am planning to write it this week on what i suspect Patricia hewitt might say on Question Time this evening. Only problem is that i don't have a television and as i need to write it straight after, can't really trapse around london visiting friends who have a TV. Slightly random, but i was wondering if anyone was planning on watching Question Time tonight and if they'd mind having a guest watch it with them (me). thanks so much.", 
      "date": "2007-05-03 12:20:00", 
      "id": 4327, 
      "responses": 13, 
      "subject": "Does anyone have a television?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3299"
    }, 
    {
      "body": "Hello  Reading the below threads it is clear that a number of residents are suffering intermittent broadband faults. Either disconnection or slow speeds. Once again, I am not able to get online via my own connection, and I'm not able to make phone calls.  We understand from the fine work of the Barbican Association that BT has been moving some components related to the exchange, and also that there has been some sort of line fault. I sense from reading our experiences that there may be more going on that we have not been privy to. Firstly, is there anything more the BA can do on our behalf at this time? I am sick of spending hours on hold to BT's various departments, especially when I'm handed off to people in India who are not empowered to change the situation. Secondly, thank you to anyone who is leaving their wireless connections open at this time. I am able to get online, just about, thanks to someone whose connection is not password-protected. Be careful to ensure your connection is firewalled/virus protected and that you are not sharing your computer network along with your wireless internet. But thank you, because otherwise I would be spending most of the day going back and forth to various internet cafes / the library and spending a fortune.", 
      "date": "2008-03-17 12:24:00", 
      "id": 3822, 
      "responses": 7, 
      "subject": "Broadband faults: help from Association? + Wireless sharing", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4132"
    }, 
    {
      "body": "Help! Have just sat down to write my column where i'm referring throughout to Orwell's '1984', only to find i actually don't have a copy of the book! Does anyone happen to have it that i could borrow tonight??", 
      "date": "2006-12-07 21:22:00", 
      "id": 3236, 
      "responses": 5, 
      "subject": "HELP!!!! Urgent request", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2815"
    }, 
    {
      "body": "Anyone on here late tonight who happens to have a few flakes of fish food that i could have (well, that my goldfish Sinclair could have, actually). Long story but just returned from 10 days away to discover that my cleaning lady's been in hospital and not fed my fish, who now looks on death's door (my fish, not the cleaning lady, who's doing very well apparently). thanks - i'll be up till at least 2am. 02076383266", 
      "date": "2006-02-18 23:14:00", 
      "id": 4597, 
      "responses": 4, 
      "subject": "Save a goldfish!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2087"
    }, 
    {
      "body": "I desperately need to print something off now for a job interview in the morning and my printer doesn't work. It's a 5 page CV. Please please if anyone has a printer i could use to print it off, i'd be forever grateful. I'm abot to cry, everything is going wrong. Please don't fail me barbicantalk!!", 
      "date": "2007-03-06 22:48:00", 
      "id": 3278, 
      "responses": 3, 
      "subject": "Urgent plea for help!!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3114"
    }, 
    {
      "body": "It's a long shot, but in the quest for caffeine, here goes... Does anyone, by any change this late at night, happen to have a spare paper coffee filter for a perculator - size 1/4 - that i could have? Just relalised to my mortification that i've run out, and am faced with a night of work without any coffee. Have just run to Tescos and they don't sell them - only some funny pod-things for a machine i don't have. Thanks!", 
      "date": "2007-06-12 22:15:00", 
      "id": 3344, 
      "responses": 2, 
      "subject": "Coffee filters", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3417"
    }, 
    {
      "body": "Hello,  I know this is very short notice, but is there any friendly soul out there who could lend me a UK road atlas for a week (until next Sunday)?  We are leaving this evening (around 6pm) to South Yorkshire, and throughout the week will have to drive to places that will be pretty difficult to find. A friend who was going to lend us his road atlas has just phoned to tell us that actually he cannot find it. Ahhhh!  I know it's very short notice - and judging from people's bad experiences (see thread on \"conman operating...\" ) I doubt that anyone would want to part with a road map....but IF you can help, PLEASE send a PM, or phone me on 07910587878 (Dani).  Thanks so much!!  Dani", 
      "date": "2007-03-04 12:01:00", 
      "id": 3266, 
      "responses": 1, 
      "subject": "HELP uk road atlas", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3101"
    }, 
    {
      "body": "We're moving from renting to buying in the Barbican and the new flat will be smaller.  We'll be putting a request in for a store room as - but as far as we can gather, this could take up to a year! Does anyone have any spare space in their store room we could borrow/rent?", 
      "date": "2007-04-29 16:05:00", 
      "id": 4316, 
      "responses": 1, 
      "subject": "Sorage space", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3284"
    }, 
    {
      "body": "I have visitors for a few days after easter and need 2 car park spaces, preferably in the Andrews/Gilbert House car park from 11 - 15 April. Can anyone help please?", 
      "date": "2007-04-03 06:32:00", 
      "id": 4358, 
      "responses": 1, 
      "subject": "Car park spaces for 4 days", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3203"
    }, 
    {
      "body": "I was wondering if anyone had a spare chair (fold-out type) that I could borrow a week on Friday (16th) for a dinner party? Realised I've invited 4 people round and only have 4 chairs! I'd return it clean the next day! Thank you in advance.", 
      "date": "2005-12-07 11:45:00", 
      "id": 4553, 
      "responses": 1, 
      "subject": "Help needed", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1972"
    }
  ]
}