{
  "summary": [
    {
      "body": "Ok, people, here's another hardy perennial. It's now getting VERY COLD.  I feel the cold quite badly and am at home much of the time (like many others in the Barbican) and the free-standing electric heaters which we have just don't do the job properly. Not to mention the fact that we've already spent a small fortune this summer on using them because the weather was so cold some of the time. I rang the BEO to be given the usual \"oh, we never turn the heating on until October\". I pointed out that if it gets cold before the beginning of October, and enough people request it, then it can be turned on earlier (as has happened in previous years) so I was getting my request in early this year. This went down like the proverbial lead balloon. Apart from being cold, I'm also very annoyed. It seems to escape the notice of BEO staff that RESIDENTS PAY FOR THEIR HEATING through the service charge and if we need it turned on slightly earlier then we're perfectly entitled to have it. It's always a rather worrying situation when those in charge of your heating system a) don't live here and b) have a vested interest in keeping the cost down. I know that our heating system is an ongoing concern because of its incredibly complicated time/temperature triggers (nothing like a simple thermostat here) and also because it is hopelessly antiquated but it shouldn't be such a battle to get it turned on every year. I don't want to knock the BEO staff because usually they provide a very good service - but this one really gets me going   So, please - ring your House Officers and request that we have access to our own heating. It still takes about a month for the buildings to warm up properly so, even if it goes on now, it will some time before we really start to feel it. House Officers' telephone numbers are:-   Andrewes, Brandon, Cromwell, Gilbert, Speed and Willoughby - Helen Davinson on 7029 3963 Defoe, Lambert Jones, Lauderdale, Mountjoy, Postern, Seddon, Thomas More and Wallside - Sarah Styles on 7029 3962 BJH, Breton, Bryer, Bunyan, John Trundle and Shakespeare - Rebecca Marshall on 7029 3964. Yours in scarves and sweaters etc. etc.", 
      "date": "2007-09-26 15:09:00", 
      "id": 3804, 
      "responses": 101, 
      "subject": "HEATING!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3692"
    }, 
    {
      "body": "Am I the only one to be annoyed at the proposals for Silk Street? One of the key things promised as part of the Milton Court development was to enhance the Silk Street to turn it into an \"Arts Centre Promenade\", but more importantly calm the traffic and rat running that happens at the moemnt. Instead we end up with a wider pavement ( maybe) and a few trees.  The Corp rips us off again I think! (I do however like what they are porposingnfor Moor Lane though the new JP Morgan Building will probably wreck it)", 
      "date": "2008-02-14 13:43:00", 
      "id": 3516, 
      "responses": 12, 
      "subject": "Street Upgrade Consultation", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4019"
    }
  ]
}