{
  "summary": [
    {
      "body": "We have the original bedroom wardrobe doors; on one, a hinge has pulled away from the door frame (they are soldered, not screwed). Can anyone advise on how to repair this (I am not a metal basher) or alternatively suggest who could do it for me?? many thanks - Roy S", 
      "date": "2006-02-09 15:58:00", 
      "id": 2753, 
      "sentiment": 2, 
      "subject": "Repairing wardrobe doors", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2064"
    }, 
    {
      "body": "I have just bought a flat in Crescent House, Golden Lane Estate, I want to renovate the bathroom and kitchen and the original kitchen/dining room partition does antbody have any good contacts?", 
      "date": "2004-11-26 17:27:00", 
      "id": 2903, 
      "sentiment": 2, 
      "subject": "Renovators, carpenteters, plumbers, electricians, anyone!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1357"
    }, 
    {
      "body": "From time to time, I need secretarial help. Any bright  ideas? Thank you.", 
      "date": "2005-07-27 10:48:00", 
      "id": 2944, 
      "sentiment": 2, 
      "subject": "secretarial help", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1763"
    }, 
    {
      "body": "That's television, rather than transvestite by the way.  Anyone know a decent technician who would install and set up a new dvd to my telly. I know this must sound feeble to all of you who know what you are talking about on the massive posting about our new television system, but my expertise lies in other directions.", 
      "date": "2005-07-28 12:55:00", 
      "id": 2947, 
      "sentiment": 2, 
      "subject": "TV technician", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1766"
    }, 
    {
      "body": "2 pleas for help: 1) Does anyone know of someone who can access some old files on our former computer and make a CD of them to download to our new computer? 2) Re the old computer, does anyone know if there are any charities who might want it (it is pretty old...) Thanks", 
      "date": "2005-07-30 17:06:00", 
      "id": 2948, 
      "sentiment": 2, 
      "subject": "New computer/old computer - help please!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1772"
    }
  ]
}