{
  "summary": [
    {
      "body": "As those of you who have received the latest Barbican Life will have seen, we did use barbicantalk comments on local establishments.  I am particularly keen to continue doing so, so please do comment in this thread on good, or bad, eating experiences in the general Barbican area.  I'm also keen to learn of reaction to new restaurants - for example I looked in on the new Cardamom Rooms restaurant in Charterhouse Square the other day (has replaced the old Gulshan/Bar Bombay) and it looks really nice and they seemed to be making a great effort - but I haven't eaten there yet.  Any comments would be appreciated. Also the Comptoir Gascon in Charterhouse Street has extended its eating options - anybody tried this yet? Any other new restaurants around that barbicantalkers have sampled?", 
      "date": "2005-09-25 08:56:00", 
      "id": 1375, 
      "responses": 136, 
      "subject": "Restaurants", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1854"
    }, 
    {
      "body": "Has anyone tried this when it opened last night?", 
      "date": "2006-11-07 17:36:00", 
      "id": 3312, 
      "responses": 41, 
      "subject": "Wood Street Restaurant?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2735"
    }, 
    {
      "body": "We've just come back from a lovely first visit to the Wood Street Restaurant and Bar. Gorgeous food, great service, wonderful setting.  When it came to paying the bill, we asked if we could pay the main part with a card but pay the service charge in cash to ensure the staff get it. We have no problem excercising this legal right in other restaurants. You may or may not be aware but whenever the service charge is paid with a card, the staff do not get it but the corporation who owns the restaurant does. Time Out Magazine wrote a piece about a year ago stating that if you want to ensure the staff who served you are rewarded with a tip, then pay the service charge in cash. Our friendly and efficient waitress asked the manager on our behalf if we could do this, but she refused. We HAD to pay it with the card.  We were shocked that the manager refused point blankly and didn't even come over to explain why but decided not to go any further, we had a lovely meal in wonderful surroundings but ended up paying the waitress some more on top of the service charge as we left, just because we felt so bad for her.  She seemed to have no idea that she was entitled to the service charge. At St Paul's Chez Gerard, our regular haunt we often pay the service charge in cash and it goes directly to the staff. NB: the manager of the Wood Street Bar is the daughter of one of the three owners, who also own other restaurants, which is probably why she didn't want the staff to get the tips but her father's company instead. When we go next week, we'll have to point blankly refuse to pay the service charge with a card or bring extra cash. I understand Wood Street Restaurant is very popular with us Barbican residents on Sundays. May I suggest, if you'd like the service charge to go to the staff (and not just the manager's family and business partners), that you consider paying it in cash and ask for this right if they refuse you. We will, as otherwise, there's no incentive for good service.  In other London restaurants (and other parts of the world, especially the States) , waiters and waitresses thrive on their good tips, it's a shame that their right to this has been eroded at our local.  Has anyone else experienced the same problem at the Wood Street or any other local restaurants?", 
      "date": "2007-04-18 14:59:00", 
      "id": 4326, 
      "responses": 25, 
      "subject": "Tips at the Wood Street Restaurant and Bar", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3242"
    }, 
    {
      "body": "I'm looking at covering new (relatively) restaurants in the next issue of Barbican Life magazine, plus those newly into the BA discount scheme.  If any Barbicantalkers care to comment on any of these it would be great in giving me an idea of how residents feel about these establishments. The 'new' restaurants I plan to cover include:  St Julien (Long Lane), Spice Corner (Aldersgate Street), Issus (Charterhouse Street), Warin (Whitecross Street), Portal and Pho (st John street).  Anyone know of any new restaurants I've missed locally?  lso any comments on the refurbished Barbican Bistro in the Barbican Centre. The new BA discounters are:  Coconut Lagoon (Aldersgate Street), Brasserie Malmaison (Charterhouse Square) as well as several of the 'new' restaurants above. Any comments much appreciated - thanks.", 
      "date": "2005-08-02 16:12:00", 
      "id": 2986, 
      "responses": 22, 
      "subject": "Restaurants again", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1779"
    }, 
    {
      "body": "Some of our Barbican area pubs and restaurants appear to have serious problems with mice. The other night, I watched a feral mouse make a bold dash across a local pub floor for dropped crisps. I'd already decided not to visit this particular pub again, because even with only 6 customers in a large space, it was too full of smoke to stay in there longer than one drink anyway (roll on 1st July). Friends have reported dining out in a local restaurant and watching a mouse scurry around the restaurant floor. Later that night, one of them got food poisoning, but having consumed alcohol, it was difficult to safely conclude any link with the resturant's mouse or their food. (Personally, I wouldn't have paid for my meal. I'd have quietly pointed out the issue to staff and promptly left the premises.) Obviously mice are not uncommon in London, but being present in such a bold way in public places suggests a serious infestation. Has anyone else seen mice in our local pubs and restaurants?", 
      "date": "2007-01-17 13:48:00", 
      "id": 4193, 
      "responses": 19, 
      "subject": "Mice", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2923"
    }, 
    {
      "body": "I know there has been a lot of good info re: restaurants in the area. I'm wondering what restaurants are actually open on Sundays.  I know Carluccios and Smiths by Smithfields are open - any other tips? Cheers", 
      "date": "2005-11-13 12:04:00", 
      "id": 4538, 
      "responses": 19, 
      "subject": "Restaurants on Sunday afternoon/evening?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1933"
    }, 
    {
      "body": "According to the BBC ( ), Carluccio's pays its waiters just 3.75 per hour - less than minimum wage - expecting them to make up the difference with tips. Disgraceful! Knowing that I'm amazed at how cheerful the staff at Carluccios manage to be. I suggest a boycott of Carluccios until the management change their ways.", 
      "date": "2008-04-18 08:03:00", 
      "id": 3878, 
      "responses": 12, 
      "subject": "Boycott Carluccio's!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4245"
    }, 
    {
      "body": "Tried the Barbican Tandoori on Saturday night for the first time (takeaway) and was very pleasantly surprised. Flavoursome, freshly prepared, generous portions and good value. Recommended. ", 
      "date": "2008-04-07 12:51:00", 
      "id": 3984, 
      "responses": 12, 
      "subject": "Restaurant Recommendation", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4200"
    }, 
    {
      "body": "For those who enjoy eating out a spate of new restaurants seem to have opened or about to open close by.  This evening I had a long chat to the owner of a new Turkish restaurant and cafe in Charterhouse Street (right next to the Rendezvous) called Issus and he's a real restaurant enthusiast who sold up a place in Tottenham to open one here.  The food I sampled was extremely tasty and was washed down with a Turkish dry white wine which was surprisingly good.  Another ethnic restaurant to add to the diversity of food in the area.  It seems reasonable value and is worth a try and the owner, David, is signing up to the BA Members' Discount scheme and will offer 10% off to BA members.  David may even read your fortune in Turkish Coffee grounds if you ask him nicely!  Service is very friendly.  It's open Monday to Saturday from 12 noon to 11pm.  It also has a Cafe section downstairs open from 2 a.m. to 4 pm.  A lunch special at 8.00 for two starters and one main course is also on offer which seems like good value. On my way back I tried a slight detour and had a talk to the Proprietor/Chef of Le Saint Julien which has replaced one of the two Mustards restaurants in Long Lane.  His name is Francois Jobard and he hails from Avignon in Provence and is bringing an authentic French atmosphere and menu to the restaurant.  Haven't yet persuaded him to join the BA discount scheme, but am working on it.  However my understanding is that they will offer you a free kir on sitting down to a meal.  the atmosphere looks attractive and there is even a set (but rather limited) two course menu at 10.95 I also noticed that the old Bar Bombay - previously the Gulshan - is now rbeing replaced by a new establishnment under new management which reckons to be opening soon. For those of us who enjoy eating out from time to time there is lots of choice of all kinds of food.  Its a good idea to try out new places and if your experiences are good, do recommend them to others here.", 
      "date": "2005-06-23 21:14:00", 
      "id": 4696, 
      "responses": 11, 
      "subject": "New Restaurants", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1711"
    }, 
    {
      "body": "Is no-one going to comment then?", 
      "date": "2007-03-01 17:26:00", 
      "id": 3269, 
      "responses": 10, 
      "subject": "Wood Street Bar and Restaurant", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3092"
    }, 
    {
      "body": "I have my sister, with her husband and 2 very active boys aged 5 and 9, visiting this weekend. The boys' favourite food are lasagna and spaghetti (preferably with half left on the carpet   ).  Given my pathetic cooking skills, are there any local restaurants you can recommend? Or would you recommend a take away instead?", 
      "date": "2007-01-04 13:56:00", 
      "id": 4133, 
      "responses": 10, 
      "subject": "Restaurants suitable for young kids", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2878"
    }, 
    {
      "body": "Hello there Can anyone recommend where I could take my parents for a lovely Sunday Roast when they come to visit me in a week's time?  Apart from visiting a neighbour (who's roast always smells scrumptous when it wafts down the vents!). Thanks", 
      "date": "2006-03-26 18:26:00", 
      "id": 4645, 
      "responses": 10, 
      "subject": "Where to go for a Sunday Roast?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2159"
    }, 
    {
      "body": "I have done a search, but apologies if this came up recently and I have missed it. Is there a good-ish (doesn't need to be Grade A, just good!) Chinese restaurant near here? Must serve crispy duck. I've thought and thought but can't think of anywhere and have a friend visiting who won't have time to go to China town but wants to have crispy duck. Any recommendations most welcome. Thank you.", 
      "date": "2008-05-17 18:30:00", 
      "id": 3594, 
      "responses": 9, 
      "subject": "Good Chinese restaurant near Barbican?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4349"
    }, 
    {
      "body": "pinchito has opened in Featherstone St, just behind Old street  ... tapas galore and all delicious, with a wine list that does lots by the glass too ... lots of old favourites ... potatas bravas, chorizo etc etc but all very well done ... fave dish (sadly, given its also the unhealthiest) was anchovies on crisps ... now i know its ounds odd, but splendid it was ...  best sight was a table of six, four of whom were smokers... they of course had to go outside at which point their \"friends\" truly guzzled what was left of the food ...   give it a whirl", 
      "date": "2007-07-03 22:22:00", 
      "id": 4050, 
      "responses": 9, 
      "subject": "lovely new restaurant", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3469"
    }, 
    {
      "body": "How cheap is Spice Corner Indian now?!  Last time I went prices were borderline ok to modestly priced, now they've lowered again!   It's good to have competition amongst restaurants as it's good for the consumers.  I know a few of you eat at Spice Corner now and again so just thought I'd let you know about their price-slash. All the same, had a real good curry at a price I'm happy to pay!", 
      "date": "2005-07-31 23:32:00", 
      "id": 2957, 
      "responses": 6, 
      "subject": "Cheap or what?!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1776"
    }, 
    {
      "body": "on the way back from the Tate the other evening, with a freezing wind blowing and feeling decidely chilled, we stopped off at Terra Nostra , which is at  27 Old Bailey EC4M 7HS  City 020 3201 0077  it was really good - the sardinian bent really lifting it above the usual fairly flaccid italian restaurant moment ... lovely kind of fish platter thing to start, then sardinian pasta with sausage-y sauce, which was perfect for a cold night, even though i could feel my waist expanding markedly...  we were the only ones in there for a fair while, which was a bit weird, but the staff are great and friendly without making you feel you've got to ask them about the health of their great aunt ... anyway, worth a look", 
      "date": "2008-02-16 19:26:00", 
      "id": 3505, 
      "responses": 5, 
      "subject": "really good sardinian restaurant", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4030"
    }, 
    {
      "body": "Any suggestions?  dedided to eat out on Christams day itself,  not too worried about the price and will travel if nesc. but would rather not eat Cuban-Romanian fusion or the like", 
      "date": "2007-11-07 10:58:00", 
      "id": 4165, 
      "responses": 4, 
      "subject": "Best place for a Traditional Christmas Dinner", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3777"
    }, 
    {
      "body": "Hey all,  Does anyone know of any Indian Restaurants around here?  How many are there?  I know that Haweli has been boarded up at present.", 
      "date": "2005-06-09 18:07:00", 
      "id": 4668, 
      "responses": 3, 
      "subject": "Indian Restaurants", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1677"
    }, 
    {
      "body": "just to let people know ... searcy's has stopped doing its \"prix fixe\" thing except for pre-performances which is stupidly early ... so the food still looks good but its whoppingly expensive - used to be about 26 for 3 courses before but now the mains alone are about 18-  20 ...  shame because the food is great and its so nice and easy to wander over there ...  funnily enough, it was deserted last night ...  on a brighter note, there's a gourmet burger company opening by St Paul's - the only one of the burger outfits that ever gets me eat that quantity of meat, but they really are the best, healthiest, loveliest burgers in town ... they also do a delicious mushroom burger to salve the conscience ...", 
      "date": "2006-11-16 20:46:00", 
      "id": 3216, 
      "responses": 2, 
      "subject": "searcys", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2755"
    }, 
    {
      "body": "In case you haven't discovered it yet, there is a fantastic new tapas bar on Featherstone Street (just off City Road up by Old Street tube) Its only been open a week or so and has just started opening in the evenings. its called  , and is a sister offshoot of the bigger Pintxos People in Brighton which has won huge plaudits and bar/restaurant,of the year award in various circles. thoroughy recommend the delicious rose and lychee sangria - knocks the socks off pimms any day. so good i am going back again tonight for more.....", 
      "date": "2007-06-22 09:59:00", 
      "id": 3358, 
      "responses": 2, 
      "subject": "Fabulous new eatery in our Manor....", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3436"
    }, 
    {
      "body": "Whilst you are all banging on about the signage on the doorways to our homes someone has merrily placed three giant ashtray bins just beyond the Pizza restaurant - presumably to serve J P Morgan employees et al? This is a 'substantially enclosed area' so are the city turning a blind eye due to London's importance as a financial centre / fear of another exit to Canary Wharf or are JPM just paying the fines as fringe benefit?  Clearly snitching on the freephone number is an option but the politicians tell me that's not the British way.  So stiff upper lips all round!", 
      "date": "2007-07-19 19:35:00", 
      "id": 4049, 
      "responses": 2, 
      "subject": "Smoking whilst Rome burns", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3513"
    }, 
    {
      "body": "Hey all,  I know some of the people on the board here eat at Spice Corner Indian Restaurant so thought I'd inform you that I've just read in the Classifieds that the Aldersgate restaurant are offering 30% discount to residents throughout summer - please read the classified message board for more details. It's nice that there are special offers for us residents, makes it more 'neighbourly' if you know what I mean. I would highly recommend people who like Indian food to check the place out - food as well as service is very good.", 
      "date": "2005-06-23 01:30:00", 
      "id": 4673, 
      "responses": 2, 
      "subject": "Spice Corner Offers", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1708"
    }, 
    {
      "body": "just to let any pensioners who dont already know you can have lunch in the ymca resturant  on saturday and sunday at 1-2 pm it costs 4.50 which is a good deal    by the way residents do not get lunch so you will have a nice quiet meal", 
      "date": "2006-05-11 17:01:00", 
      "id": 3102, 
      "responses": 1, 
      "subject": "pensioners lunch ymca every saturday/sunday", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2285"
    }, 
    {
      "body": "Has anyone else been to the Hat & Feathers? A most bizarre place .... I expected it to be a gastro pub when it is in fact a a very upscale French Restaurant.  It's almost as if it doesn't fit its skin properly.  However the food and service were very good.", 
      "date": "2007-03-05 17:28:00", 
      "id": 3270, 
      "responses": 1, 
      "subject": "Hat and Feathers", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3108"
    }, 
    {
      "body": "Vinoteca on St Johns St has a private room downstairs a do a wonderful job catering for private functions.  We had a fabulous birthday party there and the food, wine, and service were all fantastic.  And the prices are not bad either. It is also a (rather extreme) way of getting to eat there....", 
      "date": "2007-08-22 15:04:00", 
      "id": 3407, 
      "responses": 1, 
      "subject": "Vinoteca - a great venue for parties", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3602"
    }, 
    {
      "body": "19.50 two course plus vino", 
      "date": "2007-07-12 14:06:00", 
      "id": 4038, 
      "responses": 1, 
      "subject": "Good offer at Zetter", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3490"
    }, 
    {
      "body": "Anyone who enjoys authentic Japanese food might be interested to know that Matsuri Restaurant, High Holborn has a special deal on Saturday lunch during August - you pay only 50% of normal prices. Normally keenly priced, this is excellent value and highly recommended based on a recent visit. The restaurant is being fairly coy about this promotion but it seems already to be well known to the local Japanese community so make sure they can accommodate you. If you are still hungry, cross the road on the way back and take home one of the excellent cakes from Paul, the highly recommended French baker. For the avoidance of doubt, I have no financial interest whatsoever in either of these establishments.", 
      "date": "2007-08-06 23:35:00", 
      "id": 4115, 
      "responses": 1, 
      "subject": "Half Price Japanese Lunch", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3566"
    }, 
    {
      "body": "The Haweli restaurant is boarded up - to me it looks like it's closed down rather than being refitted. Does anyone know what's happened?", 
      "date": "2005-06-04 18:11:00", 
      "id": 4735, 
      "responses": 1, 
      "subject": "Haweli", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1666"
    }
  ]
}