{
  "summary": [
    {
      "body": "I know this has been discussed before but the posts I saw dated back to 05/06 and wondered how up to date it all was. We're looking for a hygienist and, possibly in time, a dentist too, preferably in the area but would be prepared to travel for someone really fantastic. My current dentist was great but now seems to be more interested in filling his surgery with staff under the age of 25, charging me 80 for a scrape and polish from a 22 year old who was more concerned with chatting and showing me how white her teeth were, and generally doing 'cosmetic surgery' (Botox, teeth whitening etc) than actual dentistry. There are also only so many DVDs of Friends - which you watch whilst he does your teeth - I can watch whilst I listen to water dripping (the new water feature in the surgery).  I had an horrendous experience as a child with the dentist so any recommendations would be most gratefully received.", 
      "date": "2007-03-14 21:18:00", 
      "id": 3291, 
      "responses": 15, 
      "subject": "Dentists", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3144"
    }, 
    {
      "body": "i know there's been a few threads on dentists already, but i have dental insurance for the first time in my life and i have to pick a dentist. there are three in the area that seem decent. does anyone have any experiences (good or bad) to share about the following: dentistry 100 (barbican) dentissentials (curtain road) zero seven (st. johns street) thanks in advance!", 
      "date": "2006-08-04 10:29:00", 
      "id": 3145, 
      "responses": 11, 
      "subject": "dentists", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2506"
    }, 
    {
      "body": "As a new resident to the Barbican, can anyone help me with a doctor and dentist in the area?", 
      "date": "2005-07-25 08:16:00", 
      "id": 3021, 
      "responses": 10, 
      "subject": "Doctor / Dentist", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1759"
    }, 
    {
      "body": "I've searched back threads on this topic and found recommendations for a place in Old Street and one in Wallside. Are these still in existence? Sadly, my old and very good dentist in Marylebone has gone. I was with him for 15 years and now I'm very nervous about moving to someone else. He was very reasonable in charges, too. Help!", 
      "date": "2007-09-29 08:10:00", 
      "id": 3447, 
      "responses": 8, 
      "subject": "Good dentist for devout coward?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3698"
    }, 
    {
      "body": "I did take everyone's good advice and went to Zero Seven dentist - and found him really good. However I've since got a letter from him saying that he is no longer doing NHS and I'm going to have to pay either yearly or monthly. Does anyone know a good dentist in the area that does NHS?", 
      "date": "2006-04-06 13:38:00", 
      "id": 4643, 
      "responses": 2, 
      "subject": "Dentists again!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2180"
    }, 
    {
      "body": "Hi We've just moved into the Barbican and need to register with an NHS dentist and doctor.  Does anyone have any recommendations for someone close? Thanks", 
      "date": "2005-06-09 16:46:00", 
      "id": 4676, 
      "responses": 2, 
      "subject": "Doctor and Dentist", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1676"
    }
  ]
}