{
  "summary": [
    {
      "body": "We are about to complete on a purchase in the Barbican, a part of London I never appreciated until becoming a parent last year. It's manifest safety and quiet, compared to anywhere else I've lived in London, are now much more important than the stained futuristic penal-colony exterior which so turned me off in the past and which I now find merely bleak. I've lurked here for a few months (and am familiar with the state of play of the \"kids will be kids\" versus the \"stop the rot\" positions) but going on the evidence of barbicantalk.com alone there is a distinct heating up of crime and disorder. The Barbican seems, to this outsider, to be a nigh-on perfect place to live if you've got small children, but drunks (of any age) shouting and smashing windows at BJH can overturn that in a trice. I'm with the 'stop the rot' faction. You can be young and hang around with your mates and get drunk without shouting and wrecking.", 
      "date": "2006-10-09 11:45:00", 
      "id": 3208, 
      "responses": 50, 
      "subject": "Violence, noise (and vermin) - just another day in EC2Y ?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2669"
    }, 
    {
      "body": "Posted: Tue Dec 19, 2006 7:34 pm    Post subject: First Barbican Gay/LGBT & Friends Residents Gathering     -------------------------------------------------------------------------------- Following on from the Only Straights on the Estate string, the first First Barbican Gay/LGBT & Friends Residents Gathering will be held on 9th January at the Wood St Bar from 7.30pm.  I've had to pay a deposit and I need to have some rough idea of numbers, so that we can make sure we have the best possible space on the night.  Please PM me if you'd like to come or email  . Please let other people know so that as many people come along as possible. I'll be inviting a few friends just to make sure it's not me sitting on my own with Paul all night!!", 
      "date": "2006-12-20 12:23:00", 
      "id": 3460, 
      "responses": 25, 
      "subject": "First Gay / LGBT & Friends Residents' Gathering - Jan 9t", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2849"
    }, 
    {
      "body": "Following on from the Only Straights on the Estate string, the Second Barbican (and Golden Lane) Gay/LGBT & Friends Residents Gathering will be held on Tuesday 13th January at the Wood St Bar from 7.30pm. Please PM me if you'd like to come or email  . If the numbers are looking strong, we might be able to take over the downstairs room and, following lots of positive ideas from everyone who came last time, I shall buy some nibbles and bits to eat this time. Please let me know if you can make it.  Danny", 
      "date": "2007-01-14 21:34:00", 
      "id": 3257, 
      "responses": 14, 
      "subject": "2nd LGBT Residents Gathering - 13 Feb at Wood St Bar", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2908"
    }, 
    {
      "body": "It's 8pm and I've just walked along the podium and come across several beer cans and smashed spirit bottles with puddles of alcohol outside the conservatory. Nearby litres of white paint have been thrown on the paving and splashed over a considerable area.  3 nights ago there were more smashed and discarded alcohol bottles near Bryer Court at about 9pm. WHY do we never see police patrolling the podium at night when these problems occur. Don't tell me they're isolated incidents! Police please respond.", 
      "date": "2008-03-01 20:07:00", 
      "id": 3532, 
      "responses": 11, 
      "subject": "Vandalism", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4075"
    }, 
    {
      "body": "whilst reading about the mendohlson tree, i wondered ...  whilst recognising that we are indeed very lucky in our police resources, is there a specific reason why the bored-out-of-their-minds security staff from the arts centre can't cast their net wider ... ? I ask because the  lovely gardens by bunyan / jt / bryer are a bit of an attraction for the \"malcontents\" because they're so lovely and lush and screen things from public view ... the group of youths, for example, referred to in previous posts i think, have taken to drinking under bunyan - having re-located from jt ...  presumably the answer is the security guards are employed by the arts centre but i wonder how whether the financial equation to extend their duties to the rest of the estate would be a cheaper option than using the police and the cost of repairs (when things can be repaired, that is, unlike the tree sculpture...) just a thought", 
      "date": "2006-05-01 23:08:00", 
      "id": 3084, 
      "responses": 8, 
      "subject": "security", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2244"
    }, 
    {
      "body": "Calling on Barbican-based folk working in the creative industries.  How about meeting up in a local pub for a neighbourly drink or two? There's a few of us (Photographer, Publisher, New media guys) wondering if there may be more of us working at home on artistic, visual, literary, publishing, musical, new media, architectural etc  type things. We're meeting up on Wednesday 7th May at 7.30pm at the Wood Street Bar for a drink. You're very welcome to join us. [/b]", 
      "date": "2008-04-20 16:21:00", 
      "id": 3877, 
      "responses": 3, 
      "subject": "Barbican Creatives Social", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4254"
    }
  ]
}