{
  "summary": [
    {
      "body": "I've gone on about this one before but purleeeeeze if you have a moth infestation (not that uncommon on the estate   ) get it treated professionally. Attempting to eradicate them with mothballs or just hoping they will go away just doesn't seem to work well enough.   We are having a bit of a problem in Andrewes. In fact we have been having a 'bit of a problem' for some time now but no-one seems to talk about it.  The thing is that if you have moths in your flat, they are going to make their way into other flats via the ducts or by flying in through an open door or window and so the problem perpetuates.  I used Albany Environmental Services as recommended by the estate office.  Their number is 7287 8845.  The treatment is not organic or holistic in any way but in my experience, it works.", 
      "date": "2006-04-17 23:15:00", 
      "id": 3203, 
      "responses": 27, 
      "subject": "Moth Problems", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2205"
    }, 
    {
      "body": "I know we've had threads about the mosquitos before, but I ended up in an emergency clinic this morning because the bite I got on Saturday afternoon somewhere on the podium went septic. I'm now on a strong and lengthy course of antibiotics. The doctor I saw told me that they are seeing a much larger number of infected bites than usual, possibly because the mosquitos are carrying something different this year, although they don't know what. Possibly from raw sewage overflowing in the heavy rains.  Whatever the reason, you're advised to see someone asap if your insect bite goes blistered or weepy and/or a red rash starts spreading away from the site.Plus the tthing itches or throbs. If this happens, antihistamine is NOT the answer - you need antibiotics. I'm just beginning to feel a bit better, but I'm still very tired and with a slight temperature. Hope no-one else suffers!", 
      "date": "2007-08-27 18:39:00", 
      "id": 3415, 
      "responses": 1, 
      "subject": "Infected mozzy bites", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3611"
    }
  ]
}