{
  "summary": [
    {
      "body": "Does anyone know a charity which will collect books, ornaments etc.  I know there are clothing and shoe drop-offs around the Estate but I have books, ornaments etc that I would like to give to a womens' shelter or charity. I have no transport so charity must collect.", 
      "date": "2007-01-15 11:23:00", 
      "id": 3277, 
      "responses": 5, 
      "subject": "Books etc for Charity", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2914"
    }, 
    {
      "body": "Hi there I'm sorry because I know this question has been dealt with before but I can't find the thread. Does anyone know of a local place where I can donate books, videos and DVDs (mostly books)? Cheers", 
      "date": "2007-03-16 07:00:00", 
      "id": 3288, 
      "responses": 3, 
      "subject": "Where to donate books/videos/DVDs?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3148"
    }, 
    {
      "body": "Does anyone know any local charity shops which accept good condition second hand clothes?  Failing that any womens hostels nearby which might want donations?", 
      "date": "2005-09-27 15:38:00", 
      "id": 3056, 
      "responses": 2, 
      "subject": "second hand donations", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1857"
    }, 
    {
      "body": "After slowly dying over the past year, my video recorder has finally packed up. Although I guess I could dispose of it in the rubbish skip in the car-park, I was wondering if there was  a special service for recycling electrical items. A lot of local councils run these schemes, partially to stop landfills getting contaminated with nasties, and also to recycle scrap copper etc. On another point, I'm going to replace my elderly computer soon. It seems a pity to just throw it away as it still works perfectly well, although it's not up to the demands of running today's software. Does anybody know if there's any charity or similar who would be interested in taking it? Cheers, Charles.", 
      "date": "2006-05-02 19:47:00", 
      "id": 3080, 
      "responses": 1, 
      "subject": "Recycling electrical items", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2248"
    }, 
    {
      "body": "Does anyone know of a charity which can put  old Macs to good use?  I have one to dispose of and Computeraid International only takes PCs.  Joanna", 
      "date": "2007-12-06 02:21:00", 
      "id": 4164, 
      "responses": 1, 
      "subject": "Charity for old Macs?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3848"
    }
  ]
}