{
  "summary": [
    {
      "body": "I can see someone playing with a lapdog in the Barbican small garden. 1. Aren't dogs prohibited in the gardens? 2. Aren't dogs prohibited in the Barbican flats? It's a small dog, but still. Is there a recommended course of action? Lots of children play in the garden everyday.", 
      "date": "2007-05-04 19:18:00", 
      "id": 4338, 
      "responses": 29, 
      "subject": "Dog in the garden", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3304"
    }, 
    {
      "body": "I know that the following is going to cause a stir. I swear I am writing this with no intention whatsoever of provoking anyone but to canvass views on the subject. I have a friend whose dream is to move to the Barbican. His only \"problem\" is that he owns a little, cute, lovely and well trained dog.  The dog does bark every now and then. But, having said that the new born baby opposite screams keeping me awake most nights and the next door neighbour blows her hair dry at 6.30-6.45 every morning (saturdays and sundays included)!   My friend fully understand that keeping a dog in a block of flats requires extra care to minimise the impact on other residents (e.g. he would never let the dog running around in the gardens fouling the grass-mind the geese already do!). In fact, he already lives in a \"well-to-do\" block of flats in Clerkenwell and has never had any complaints about the dog. Most residential leases of blocks of flats contain restrictive covenants about the keeping of pets. However, these are generally regarded as \"old fashioned\" and as such largey ignored and seldom enforced. Why cannot be the same in the Barbican? Why people have to be deprived of the joy of having a pet? Why cannot pets be allowed (perhaps subject to introducing \"ad hoc\" rules)?   I am also thinking here of the elderly residents to whom the company of a cat and/or small dog could make such a difference.", 
      "date": "2006-08-18 11:19:00", 
      "id": 3167, 
      "responses": 27, 
      "subject": "Pets", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2537"
    }, 
    {
      "body": "I know that in the lease it says pets are not allowed, but what about the pets of visitors? is it OK for guests to bring their dogs? and if so, can they be walked in the gardens, or is that absolutely banned?  ", 
      "date": "2005-10-16 14:27:00", 
      "id": 4450, 
      "responses": 26, 
      "subject": "Dogs (woof!)", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1890"
    }, 
    {
      "body": "One of the reasons I moved here was the no pets policy as I have asthma.  However I frequently notice a black and white cat with a collar wandering round Thomas More garden and last night a woman was sitting on the grass playing with what looked like a Yorkshire terrier puppy.  I have also seen a man walking a labrador.  Given the number of very small children playing there in the day time I don't think they should be exposed to faeces and urine from these animals, it's bad enough with the Canada geese!  Perhaps if the rules have changed a small area especially for pets could be fenced off although how you tell the geese is problematic.", 
      "date": "2006-06-08 10:18:00", 
      "id": 4424, 
      "responses": 21, 
      "subject": "Pets in the Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2344"
    }, 
    {
      "body": "Has anyone else been bothered by a dog barking on  a balcony in Shakespear tower?  I'm in Lauderdale and with the doors open, all I've been hearing today is a regular yapping from what sounds like a puppy.   I think the noise is coming from a flat roundabout the 9th floor, but I'm sure the flats above and below are aware of just which floor the dog is on! I'm hoping that the dog is just a weekend visitor, but does anyone know what the situation would be if it turns out to be a permanent resident?  Keeping pets is not allowed in the lease, but how is this enforced by the Corporation?", 
      "date": "2005-09-10 13:46:00", 
      "id": 2998, 
      "responses": 11, 
      "subject": "Barking dog", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1838"
    }
  ]
}