{
  "summary": [
    {
      "body": "People should be aware of the unscrupulous  activity of nPower door-to-door salesman in the area. My wife was recently visited by someone who said that he was just checking that we were on the right electricity tariff. He filled out a form and got her to sign it; she asked specifically if there would be any change to our supplier and he said no. Lo and behold two weeks later (conveniently after the end of the 14-day cancellation period - which he did not mention) a letter comes from nPower saying we have changed our supply to them.  Misselling of this nature is not just scandalous, it is fraudulent. I have reported it to our MP and would urge City of London police also to look into the behaviour of nPower doorstep sellers in the Barbican.", 
      "date": "2008-04-04 09:22:00", 
      "id": 5522, 
      "responses": 5, 
      "subject": "nPower scam", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=4186"
    }, 
    {
      "body": "IF you are disturbed by the current illegal cable laying in Aldersgate street, please call the guidhall to complain 606 3030.  They then tell environmental health. They've just run away, leaving all their kit but they are the kelley group, and the more complaints the better my big question is why is there no enforcement of the rules on raod works?", 
      "date": "2008-02-25 22:29:00", 
      "id": 3527, 
      "responses": 2, 
      "subject": "Aldersgate St roadworks 10 pm", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4060"
    }, 
    {
      "body": "Twice in recent weeks the new lift at the eastern end of the estate has broken down.  The telephone number posted for emergencies actually leads to the Guildhall switchboard.  They have no record of who is responsible.  The Corporation failed to pass relevant material sent to them from the then builder Ardmore-Mace (now fired by Gerald Ronson for not being tough enough in their dealings with residents and the Environmental Health people when damage was caused to a number of flats due to their work).  Ardmore-Mace says it is not responsible.  So the fire brigade had to be called.  Anyone using the lift should be aware that aside form shouting no help is available.  The Corporation was informed at least a fortnight ago and still no telephone numbers have been posted. They even claimed that the lift should be maintained by the Estate!  News to the Estate and our excellent engineers.  The Estate was unaware of this and, in any case, the Estate would not assume responsibility for a year after construction.  One trusts that the Estate will charge the Corporation for staff time.   So use that lift at your own risk.  If you press the bell no one who can do anything is altered.  If you use the telephone you get the staff at the Guildhall or the new call centre and the reply that the lift does not exist or they know nothing.  The name of the contractor and an emergency telephone number should be there by law.  It is not.  The Corporation has done nothing about this that has led to an improved situation.   However, the alternative of the exit from Willoughby 03 car park is also very uncertain.  The door has been out of action at least twice over the last fortnight nicely coinciding, on occasion, with the lift on the podium being out of action. People in wheelchairs and other people with walking difficulties have no way out from that corner of the estate unless someone with a pass key kindly takes them through Willoughby House and that is a long way around.", 
      "date": "2008-02-03 10:22:00", 
      "id": 3625, 
      "responses": 2, 
      "subject": "Corporation incompetence?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3977"
    }, 
    {
      "body": "Once again British Land was working illegally on Saturday afternoon.  If the exceed the normal working hours the City of London Environmental Health Department can intervene, as they did. Technically only Islington Council can take action but as they do not work at weekends the City can step in.  Islington has long suspected that British Land were working beyond agreed hours and on Monday the City will contact them so action can be taken. If the same problem occurs again in Whitecross Street please ring the City on 7606 3030 and get the switchboard to contact the duty environmental health officer.  They can take action.", 
      "date": "2008-03-09 03:07:00", 
      "id": 3813, 
      "responses": 2, 
      "subject": "Ropermaker St. construction and spin off for Whitecross", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4100"
    }
  ]
}