{
  "summary": [
    {
      "body": "If objecting to an islington Licnese application (Essence, Boudoir) you can e mail  .  Include your name and address.", 
      "date": "2005-08-06 10:20:00", 
      "id": 2959, 
      "sentiment": 1, 
      "subject": "E mail address for Islington License Applications", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1790"
    }, 
    {
      "body": "There is a sign from the COL Planning department on the building on the corner of Aldersgate Street/ Carthusian Street stating that Tesco has applied to change the doors and if anyone thinks that this will \"affect the character and appearance of Charethouse Square\" they should write in before Auggust 17th.  Apparently plans may be viewed at their office on the 18th Floor of St Alphage House, Fore Street and protests may be sent to - Department of Planning and Transportation, COL, Po Box 270, Guildhall.", 
      "date": "2006-07-28 10:26:00", 
      "id": 3142, 
      "sentiment": 1, 
      "subject": "Tesco Doors", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2485"
    }, 
    {
      "body": "Not sure how official this demonstration is, but still seems like a worthwhile cause to me..... BLACKOUT LONDON 4th November 2006 Starting at Sunset, 4.30 pm to 7.30 pm You are invited to take part in the largest demonstration of People Power that London has ever seen on Saturday 4th November 2006, by turning off all your lights, and switching off all your non-essential electrical equipment at Sunset. Climate Change is already compromising the water supply, crops, habitat and livelihoods of millions of people worldwide, and threatens to undermine the Global Economy within a few decades, as well as creating waves of Climate Refugees, and driving countless animals and plants to extinction. The principal cause of Global Warming is the rising Carbon Dioxide emissions into the atmosphere from the burning of Fossil Fuels, for electricity generation, transport, manufacturing, industry, space heating and air conditioning. REMEMBER, REMEMBER, THE FOURTH OF NOVEMBER ! For one day in November, we are asking everyone who receives this message to think about what they can turn off, switch off and unplug, to show support. We want the power demand in the United Kingdom to reduce so much that the newspapers are obliged to report it. We want the lights to go out in London, so that on the evening of 4th November 2006, the dimming effect will be visible from space. To protect us from the Enemy of Climate Change, we need a War on Energy Abuse. Just like Britain during World War Two, we need to see a Blackout all over London. CELEBRATE THE NIGHT OF POWER : TURN OFF ! SWITCH OFF ! UNPLUG ! If you are a security guard for an office block in London, please ask your employers when you should be turning the lights out. If you are a church warden, please check with your church council to see if they agree to switching off the floodlights. If you are working for your local Council, ask if you can help them implement an energy reduction plan to turn off lights, computers and fans at the weekend. If you are at home, switch off your set-top boxes, pull all the chargers out of the wall sockets, turn off lights in any room you are not using, switch off any machine with a digital clock in it, unplug the hi-fi and the TV and the games console, de-frost your freezer, switch off your fridge for a couple of hours. Turn the central heating thermostat down to 16 degrees and put a woolly sweater/jumper on if you're cold. for more information go to: ", 
      "date": "2006-11-03 10:08:00", 
      "id": 3190, 
      "sentiment": 1, 
      "subject": "Blackout London - 4th November", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2720"
    }, 
    {
      "body": "I've found the planning applications for Milton Court.   This first one details the demolition etc    This second one gives details of a new bridge to replace exisiting one    The details show that both applications have been received by the City of London and you are able to submit your comments on both.", 
      "date": "2007-01-15 14:48:00", 
      "id": 3250, 
      "sentiment": 1, 
      "subject": "Planning application details - MILTON COURT", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2915"
    }, 
    {
      "body": "Have you filled in the NHS questionnaire? The on-line consultation on changes to London's healthcare closes THIS WEEK on 7 March 2008. It proposes for example that many services now provided by hospitals will be moved to big new 'polyclinics' (with 25 or more GPs).  This is part of the Darzi Review [by Health Minister Lord Darzi], which you've probably heard about?  Visit  . You can also comment on    For other parts of England, visit   You can also Freephone: 0808 238 5430, email:   or write to FREEPOST Consulting the Capital", 
      "date": "2008-03-01 17:29:00", 
      "id": 3529, 
      "sentiment": 1, 
      "subject": "NHS questionnaire closes 7 March. Have your say!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4074"
    }
  ]
}