{
  "summary": [
    {
      "body": "Has anyone ever set eyes on our MP?  Does Mark Field hold public \"surgeries\" round here?", 
      "date": "2008-03-11 17:14:00", 
      "id": 603, 
      "sentiment": 2, 
      "subject": "Our MP", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4110"
    }, 
    {
      "body": "I note a few messages about Crossrail on another thread - and thought it might make sense to start a new one here.  I think one of the messages says that there is a plan B regarding the Crossover cavern under Defoe House.  There is indeed a Plan B, but that doesn't stop the crossover being constructed - but it might enable the engineers to do away with the proposed surface works on Aldersgate Street as the plan involves removing the muck through the tunnels back to Liverpool street, rather than through a shaft at Aldersgate Street/Beech Street.  Regarding subsidence, residents will be exceedingly unlucky if they are affected at all.  Virtually all underground works make for some subsidence (most of the Barbican falls within a prospective area where up to 10mm of subsidence might be expected) - but if this occurs evenly across the structures it is unlikely that anyone will notice apart from the engineers with their precision monitoring instrumentation.  Bear in mind that the Crossrail route under the Barbican is actually directly underneath the existing Metropolitan Line/Circle line/Thameslink tracks - and for safety reasons any subsidence will have to be very tightly controlled under the existing tracks.  I don't think Defoe residents should have anything to worry about.  Plenty of tunnelling has taken place under London recently without damage to overlying structures. Regarding the Crossover cavern - this is a structure where the twin tunnels are merged effectively into one much wider one so that trains can be switched from one track to the other.  These are necessary for both safety and operational reasons.  I am not sure why such a cavern needs to be directly under Defoe, but it is necessary for it to be somewhere, and in an urban environment it is virtually bound to be under some building and the plans place it  below Defoe and I doubt that that will be changed, but I reiterate that I still don't believe that Defoe, or any other Barbican residents will have anything to worry about from the tunnels themselves as they are 30 m down and modern engineering should be able to cope very well with this kind of problem.  The noise etc. from works in Aldersgate Street is another factor altogether and i think the current plans call for works to be carried out there for up to 43 months! - If we can do anything to get Crossrail to implement Plan B then we should.  Traffic disruption alone will be pretty horrendous, and there will also be major traffic problems in Moorgate where a major sewer has to be diverted and then replaced.  We do live in 'interesting times.'", 
      "date": "2005-04-13 20:06:00", 
      "id": 2909, 
      "sentiment": 2, 
      "subject": "Crossrail", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1560"
    }, 
    {
      "body": "When Somerfield acquired 115 stores from Morrisons, the Office of Fair Trading referred the matter to the Competition Commission.  The Competition Commission has this morning issued its provisional findings. It believes that there are competition concerns in 14 of the areas. These are listed, but do not include Whitecross Street. This surprised me as Somerfield seems to have our local market thoroughly stitched up (particularly on Sundays). If only Somerfield were required to sell on the Whitecross Street store to another operator...  Anyone wishing to comment on the findings is invited to e-mail  . A summary of the provisional findings report is available on ", 
      "date": "2005-07-26 06:32:00", 
      "id": 2950, 
      "sentiment": 2, 
      "subject": "Calling all anti-Somerfield campaigners", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1762"
    }, 
    {
      "body": "The Boudoir hearing is set for 10 am on August 1st.  Islington are expecting a good turnout so we shouldn't disappoint. Also people who have had personal bad experiences with the bar need to turn up and give their experiences.  Cntact   (phone number on the BA website).  This is really important as Islington sent officers down to observe what was going on and have reported that they witnessed no problems.", 
      "date": "2005-07-21 10:03:00", 
      "id": 2952, 
      "sentiment": 2, 
      "subject": "Boudoir Hearing - Need WITNESSES and a GOOD Turnout", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1754"
    }, 
    {
      "body": "Hello Neighbours, I live on Golden Lane Estate, and I'm tring to rally up support for objecting to the late license that the Shakepeare pub (on Aldersgate Street) have applied for. Does the noise  reach as far as the Barbican, John Trundle Court perhaps?", 
      "date": "2005-07-29 11:40:00", 
      "id": 2966, 
      "sentiment": 2, 
      "subject": "Shakespeare pub late license", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1768"
    }
  ]
}