{
  "summary": [
    {
      "body": "I hate to tell you this, but I have been stopped twice since the weekend by groups of Spanish kids with cases looking for the Barbican YMCA. I hope we're not in for a repeat of last summer....  ", 
      "date": "2007-08-02 08:57:00", 
      "id": 3626, 
      "responses": 29, 
      "subject": "YMCA new Spanish invasion?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3553"
    }, 
    {
      "body": "i have been informed by an other resident that a new group of people that have recently moved into the ymca are offenders serving probation,as a resident sharing facilities ie showers bathrooms and toilets and this situation is true would we not have a right to be informed about this?", 
      "date": "2007-01-16 18:01:00", 
      "id": 4187, 
      "responses": 7, 
      "subject": "ymca", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2921"
    }, 
    {
      "body": "Anybody know to which body I should address a letter of complaint about the music from the keep fit classes in the early evening? It's like having a rave foised upon the area each day. Pub noise I expect and accept within reason but thudding megawatt soundsystems in order to shift a few calories is several steps too far. I'm afraid i'm not going to be satisfied with approaching 'the management' either in this case. They have paying customers to satisfy so there is a conflict of interests for a start.  I want to lodge something with a body that cannot simply turn a blind eye nor file my complaint in a folder marked 'trash'. I'm thinking upon the lines of a local noise abatement officer or similar. Please feel free to PM me with accurate details if you have them  or simply don't want to to broadcast the information. Having said that ,unless i'm the only one ready to pop a valve over this irritant, then i'm sure others may be wish to object or lobby too. Regards, L", 
      "date": "2007-05-21 18:21:00", 
      "id": 3323, 
      "responses": 3, 
      "subject": "Enough! YMCA gym music", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3352"
    }, 
    {
      "body": "i heard that a italia conti student died after falling out a window at the ymca last week i cant find anything in the news about it?", 
      "date": "2007-12-11 09:44:00", 
      "id": 4171, 
      "responses": 3, 
      "subject": "barbican ymca death ?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3861"
    }
  ]
}