{
  "summary": [
    {
      "body": "My JLP sources confirm that the Waitrose is definately coming to Cherry Tree Walk!", 
      "date": "2006-03-09 11:10:00", 
      "id": 4459, 
      "responses": 254, 
      "subject": "Waitrose", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2122"
    }, 
    {
      "body": "Headline on page three of Islington Tribune. Apparently the land lord of Cherry Tree walk - UBS, is not going to re-new the leases on the shops there, next June.  As you can imagine the small shop keepers are up in arms and organising a petition, no more chemist, cleaners, stationers, cafes.  What a shame and all because of Waitrose. UBS wishes to develop the shopping centre!  Hmm.", 
      "date": "2006-10-14 09:28:00", 
      "id": 4176, 
      "responses": 94, 
      "subject": "Global giant plans to evict traders from shopping Mall", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2678"
    }, 
    {
      "body": "I noticed that there is a letter from Waitrose on the communal noticeboard acknowledging the petition many of us signed in favour of a Barbican branch. Looks like positive stuff. PS Crispins is selling Andrex 4-packs for 1.55 so hurry!", 
      "date": "2005-10-06 17:49:00", 
      "id": 4530, 
      "responses": 21, 
      "subject": "Waitrose in Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1871"
    }, 
    {
      "body": "Does anyone know if a new Tesco is coming to the building on the corner of Aldersgate Street and Carthusian Street?  It's the building currently covered in scaffolding, next to the NatWest Bank.  I know planning permission has been given for flats and a bookies.", 
      "date": "2006-05-27 11:09:00", 
      "id": 3122, 
      "responses": 20, 
      "subject": "Planning permission - Tesco?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2322"
    }, 
    {
      "body": "As I was walking past the new Tesco on my way home, I stopped in and had a quick look round. Teeny-weeny sections of everything except revolting-looking 'do-nuts' and sandwiches. I suppose if my false leg fell off as I came out of the Tube I might be persuaded to stop in for a pint of milk, but can't think of any other reason for using it. I don't think any of the existing shops need worry, quite frankly. ", 
      "date": "2006-11-17 22:08:00", 
      "id": 3219, 
      "responses": 18, 
      "subject": "That new T***co", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2758"
    }, 
    {
      "body": "My JLP sources confirm that the Waitrose is definately coming to   Tree Walk!", 
      "date": "2006-03-09 11:10:00", 
      "id": 1176, 
      "responses": 14, 
      "subject": "Waitrose", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&hilit=Organic+Morello+Cherry+Preserve&t=2122"
    }, 
    {
      "body": "Has anyone heard that Tescoo is not now coming to the corner of Aldersgate Street and Carthusian Street?  The paper shop people have collected a petition and written to three councillors and two MP's about not wanting them there due to noise, congestion and the fact that they will have to close.", 
      "date": "2006-07-18 15:07:00", 
      "id": 4236, 
      "responses": 14, 
      "subject": "Tesco cancels", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2461"
    }, 
    {
      "body": "I see today that Frank Harris have a couple of 1 beds, one in BJH , on for 400K  and above  I'm astounded by this,  are they really shifting flats at this level???  Is it all because of Waitrose??", 
      "date": "2007-02-12 13:55:00", 
      "id": 4388, 
      "responses": 14, 
      "subject": "Flat Price Shock", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3056"
    }, 
    {
      "body": "The refurbishment work seems to be completed now and I've just about worked out where everything is.  My impression is that there is less fresh food to choose from than before. The extra space seems to have gone to takeaway, convenience and non-food. At least two thirds of the food floor feels irrelevant to me as a resident. M&S must have realised there is a local contingent shopping here, otherwise the store would not be open on Saturdays.  The only positives for me are  1. the new wine display stand, which is possibly a bit too attractive (!) and easy to shop and 2. shorter queuing times. I'd be interested to know what other people think of it though.", 
      "date": "2005-11-10 09:18:00", 
      "id": 4539, 
      "responses": 14, 
      "subject": "Refurbished M&S Finsbury Pavement", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1929"
    }, 
    {
      "body": "Sorry that my list below doesn't tabulate properly when it is submitted.  perhaps there is a way, but I don't know it - but I think most readers can work it out! We see from time to time assertions that Waitrose is far more expensive than other supermarkets, but never backed up by hard data.  So, in the interests of good Barbican citizenship I decided to conduct a comparison with the Somerfield by Old Street Station.  The results may surprise some of you - particularly Romi who claims never to have been in Waitrose because it is too expensive.  I compiled a fairly random shopping list and priced it first at Somerfield.  Had to knock a few items off my list because they weren't available.  Then I looked at the same products at Waitrose.  Here are the results: Item                          Som Price/        Wait price/          Wait price diffnce Davidstow Cheddar/      9.40/kg /            8.55/kg /           -0.85/kg/ Colgate Total t'paste /     2.19 /                  1.99/              -0.20/ Persil liquid (1.5l) /         3.49/                   3.25 /             -0.24/ Lurpak spreadable  /       1.09 /                   1.04  /            -0.05/ Lurpak lighter  /              1.19 /                  0.99  /            -0.20/ Little Gem lettuce (2) /      0.69  /                  0.65 /             -0.04/ Cheapst sliced W'meal bd /0.99  /                  0.86  /           -0.13/ Bananas /                        .99/kg /                .89/kg /      - 0.10/kg Kitch Towels (Bountyx2) / 1.69*  /               1.49   /          -0.20 Basmati Rice (kg) /           1.09 /                   .99  /           -0.10 Pepsi - bottle  /                 1.54  /                1.36  /           -0.18 Heinz baked beans  /         0.50  /                0.43  /           -0.07 Heinz Spaghetti  /             0.53  /                 0.40  /          -0.13/ Weetabix (48)  /               3.09  /                 2.78  /          -0.31/ Milk  /                                .34  /                  .33  /          -0.01 2l Evian  /                          .77  /                  .85  /          +.08 Chick Breast fillets  /         7.13/kg*           9.99/kg /       +2.83/kg Pork Chops  /                   3.80/kg             4.99/kg  /      +1.19/kg 6 Free Range Eggs (Lg)  /  1.07   /              1.13  /            +0.06 *=Special Offer So - from the above, meat looks to be quite a lot more expensive at Waitrose - most other things are not, although I suspect if one dug down into the fresh veg, Waitrose may also be more expensive.  But the disparities on some of the other items are perhaps surprising.  None of the items picked at Waitrose were on special offer.  I also appreciate that Somerfield is not the cheapest of Supermarkets, but the idea that people would be priced out because of Waitrose replacing Somerfield is patent rubbish!  If you're worried about cost - source your meat elsewhere, otherwise you might just as well use Waitrose", 
      "date": "2006-07-28 12:59:00", 
      "id": 3135, 
      "responses": 12, 
      "subject": "Waitrose more expensive? - The facts", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2486"
    }, 
    {
      "body": "I had the following message forwarded to me and thought that this should be brought to wider attention: > > FW: Closing Borough Market > To those of you who know London... Please have a look at the   > following... And maybe sign petition.... > > Borough market is London's oldest market. It was established on  > the  south bank of the Thames when the Romans build the first  > London  Bridge and people have been trading on this site for over  > 2000  years. it's a beautiful undercover food market and a truly   > wonderful part of London's history. > > Some bright spark has decided to expand the railway line running   > through the roof of the market, which will also involve knocking   > down 23 of the beautiful listed and unlisted buildings in the   > closely surrounding area. > > They already have planning permission, but are waiting funding  > and  there is a strong local campaign to put a stop to it. > > If you know and love the market in its present state, please sign  >  the petition to prevent this from happening. The plans,  > photographs  and the petition are on the following site:  >   > > Unfortunately not a lot of people are aware of it so please sign  > it  and pass it on to anyone else you know who loves this great  > bit of  London heritage.. > >    > > >", 
      "date": "2007-02-06 12:44:00", 
      "id": 4224, 
      "responses": 11, 
      "subject": "Closing of Borough Market", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3040"
    }, 
    {
      "body": "Is it just that I have turned into a grumpy old man or do fellow Barbican citizens find the muzak in M&S Finsbury Pavement extremely annoying? I now refuse to shop there. Perhaps the M&S management should consider not chasing business away, particularly with the advent of Waitrose in June.  Anyone feeling similarly annoyed mught like to send an email to M&S at the following address:", 
      "date": "2006-03-10 08:33:00", 
      "id": 4630, 
      "responses": 11, 
      "subject": "M&S moan", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2124"
    }, 
    {
      "body": "There was wide publicity when the monthly food market was set up, but there has been hardly any about the recent changes. The market now takes place every week, Thursdays and Fridays 11am to 5pm.", 
      "date": "2008-04-27 12:40:00", 
      "id": 3736, 
      "responses": 9, 
      "subject": "Whitecross Street Food Market", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4280"
    }, 
    {
      "body": "Has anyone else noticed that the M&S food department has been very poorly stocked recently - at least on Saturdays? We tend to shop late morning, so it is not a question of getting there at the very end of the day and finding that certain items have sold out. On the last few weekends, there have been lots of empty shelves. Certain areas are terribly depleted - for example, the fresh meat section. If you fancied pork this weekend, you were totally out of luck - I think we managed to buy the only package of pork in the shop (and it wasn't even the cut we wanted). And the fresh herbs are very hit and miss. It makes it pretty hard to shop for a particular recipe. I spoke to the manager, who said that parts of their order had been diverted to other stores because of the bank holiday. Doesn't make much sense to me, and also doesn't explain the previous weekends with the same problem.  It seems bizarre, as M&S could have a monopoly on high-end grocery purchases here if they just made a little effort. At present I wonder whether they are planning to run this store down until it's at a point where it's not worth opening on Saturdays.  So many retailers don't seem to have any common sense anymore.", 
      "date": "2005-05-02 10:46:00", 
      "id": 2929, 
      "responses": 8, 
      "subject": "more supermarket woes", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1603"
    }, 
    {
      "body": "There is a sign from the COL Planning department on the building on the corner of Aldersgate Street/ Carthusian Street stating that Tesco has applied to change the doors and if anyone thinks that this will \"affect the character and appearance of Charethouse Square\" they should write in before Auggust 17th.  Apparently plans may be viewed at their office on the 18th Floor of St Alphage House, Fore Street and protests may be sent to - Department of Planning and Transportation, COL, Po Box 270, Guildhall.", 
      "date": "2006-07-28 10:26:00", 
      "id": 3142, 
      "responses": 8, 
      "subject": "Tesco Doors", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2485"
    }, 
    {
      "body": "re cherry tree walk debate we have lived in the area for 30 years and we also had a deli opposite waitrose which we had to close because we were eaten alive by the sharks we had very nice people coming in but not enough to keep us going firstly waitrose is far to expense for the pensioners and working class people and we dont want a mini covent garden on our dooorstep ,  many of the residents in this area have gotten used to a way of life like meeting in the cafe for coffee or a chat why should they have to find somewhere else to meet just because these people want to make more money and sod the rest of us ,the supermarkets are taking over and the litttle shops that we had when i was a girl are all gone and ruining everything for the small shop owners who are trying to make a living", 
      "date": "2006-10-19 18:08:00", 
      "id": 4295, 
      "responses": 7, 
      "subject": "re cherry tree walk debate and waitrose", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2693"
    }, 
    {
      "body": "Hi!! We have just moved in to John Trundle. I am Sarahjayne, a graphic designer and my partner Jonnie is a Management Consultant. We have been here for a few weeks now and absolutely love it! There are a few things we are unsure of and would appreciate any advice. Is it possible to get Sky +, if so, how? Do we have to use a specific broadband internet provider? If we have visitors, where can they park? Our bathroom occassionally smells - is there a problem with the drains in John Trundle???!!! Where is best to do our food shopping? We have visited Sainsbury's in Angel and weren't impressed!! We don't have car, so ideally would love somewhere nearby other than the 'local' or 'express' variety of supermarkets where the selection is not great. This is probably wishful thinking!!  We look forward to learning more about our new area!! Many thanks", 
      "date": "2005-09-27 15:48:00", 
      "id": 4438, 
      "responses": 7, 
      "subject": "Hello! We've just moved in and have a few questions!!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1858"
    }, 
    {
      "body": "Hi this is not some tired and trivial request for help on behalf of whichever politically-fashionable cause currently requires funding. Nor is it designed to touch the consciences of the developed world and change our bahaviour.  It is, quite simply, far more important than that. In comparison to this issue, the environment can go hang, milton court can be converted into a disco, and Crossrail can burrow through the Concert Hall. I am obviously talking about the disappearance of the Chocolate Donuts (Berliners) from Waitrose. For 2 consecutive days, there have been no donuts on the shelves. This is of vital significance and essential to my wellbeing - after a week of hard work and a weekend morning of hard rowing, I am entitled, under the Barbican Residents' Tastebud Appeasement Act, to scoff 2 chocolate donuts. Please, write to Mark Field, the Chief Exec of the John Lewis Partnership, Tony Blair, the Queen and anyone else you can think of. In fact, forget Blair and write to Prescott instead: he has the look of a man who would appreciate this catastrophe... thanks M PS Is it me, or were the chocolate fillings getting concerningly less gloopy ?", 
      "date": "2006-09-17 14:46:00", 
      "id": 4500, 
      "responses": 7, 
      "subject": "Help! Undercover are you there ?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2608"
    }, 
    {
      "body": "When Somerfield acquired 115 stores from Morrisons, the Office of Fair Trading referred the matter to the Competition Commission.  The Competition Commission has this morning issued its provisional findings. It believes that there are competition concerns in 14 of the areas. These are listed, but do not include Whitecross Street. This surprised me as Somerfield seems to have our local market thoroughly stitched up (particularly on Sundays). If only Somerfield were required to sell on the Whitecross Street store to another operator...  Anyone wishing to comment on the findings is invited to e-mail  . A summary of the provisional findings report is available on ", 
      "date": "2005-07-26 06:32:00", 
      "id": 2950, 
      "responses": 6, 
      "subject": "Calling all anti-Somerfield campaigners", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1762"
    }, 
    {
      "body": "I know it's become a bit of a joke on this site, but i am genuinely addicted to the Organic Morello Cherry preserve, and now that the cold mornings are here, and i'm back on the porridge daily, i'm now regretting ever mentioning it on this site because apparently the secret store that was once available at Waitrose has now all gone ( i only ever got 2 jars of it boo hoo). I keep on asking in store if they can get any more in, and am met with either blank faces, or, even worse, a complete denial that they ever had it in, and the assumption that i'm mad. Is there any chance you can get some more in...? please? pretty please? with morello chery preserve on top, perhaps?", 
      "date": "2006-11-07 21:54:00", 
      "id": 3211, 
      "responses": 6, 
      "subject": "Undercover: A plea if you're reading this", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2738"
    }, 
    {
      "body": "Will our Waitrose be one of the shops piloting this packaging?  I do feel that the current packaging for milk is wasteful for its purpose - a container that would probably last a lifetime for a product consumed within a few days.", 
      "date": "2007-06-25 05:59:00", 
      "id": 3482, 
      "responses": 6, 
      "subject": "milk in a bag at Waitrose?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3442"
    }, 
    {
      "body": "In perusing the many comments on BarbicanTalk I thought I'd introduce to those who on occasion pop a lowly egg into a frying pan ( naughty ) or possibly poach the rascal or whatever a most delightful addition to my cupboard and hopefully yours. Waitrose stocks a large variety of the orb, and not overpriced for those who think our new shop is only for the rich, and in choosing my dozen one day recently I hit upon a sure winner!         In opening the box to check whether any might be broken I came upon a charming description of the product written over the lady's name whose layers laid the goodies,Mrs.Mabel Pearman's Burford Browns!!           I'll impart that message if I may but not before telling the reader that never in my long life have I tasted a more delicious egg, the flavour unsurpassed I do believe. But the colour truly beautiful, not a sallow and pale little yellow thing but almost orange and reminding me of many a sundown just before the heavenly star sank into the sea out there beyond that Greek Island. Oh dear I waffel so onward if you have a moment!            \" Clarence Court Free Range Eggs are special, not only for their superior flavour and quality, but because the poulturer's attention to the health and welfare of her hens , which are free to range and forage on green pasture from dawn till dusk, leading a natural and hapy life.            Our birds enjoy a gererous helping of sun drenched maize corn in their non-GM vegitarian diet, the privacy of warm secluded nest boxes, trees and scrubs for cover, dust baths - in fact, everything that a healthy hen requires for it's freedom of expression and fullness of life, to bring you a truly Free Range Farm Egg! \"               Somehow I feel that I've done the reader a service and I shall forever be in Mrs. Peaman's debt knowing full well that a succession of Burford Browns will be popping pullets for years to come!  ", 
      "date": "2006-08-13 10:21:00", 
      "id": 3151, 
      "responses": 5, 
      "subject": "A wonderful discovery via Waitrose!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2523"
    }, 
    {
      "body": "our lovely Barbican cleaner (Harry) told me today that there is a petition  to support a Waitrose store opening in the new building on Aldersgate Street (on same side as tube diagonally opposite Holmes Place) ...  true - or just a wild and hopes-raising rumour?  Just think - no more somerfield...", 
      "date": "2005-07-12 15:59:00", 
      "id": 4701, 
      "responses": 5, 
      "subject": "wild (nice) rumour", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1741"
    }, 
    {
      "body": "Is it just us or have Tesco Home delivery gone to the dogs? We have used them for about 3 years here and they used to be really efficient. Of our last six transactions, only one made the delivery slot and the last one arrived 24 hours late. Has anyone tried any of the other suppliers with more luck?", 
      "date": "2006-09-15 18:24:00", 
      "id": 4492, 
      "responses": 4, 
      "subject": "Tesco Home Delivery", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2604"
    }, 
    {
      "body": "I've heard that the Crescent is being considered for shops - as in the original plan.  Firstly, is this correct? Could we convince Waitrose to open something that fits the surroundings?", 
      "date": "2006-02-19 22:35:00", 
      "id": 4593, 
      "responses": 4, 
      "subject": "Waitrose at the Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2091"
    }, 
    {
      "body": "Does anyone know if Columbia Road will be on as usual this Sunday 24th December? I need Christmas greenery! Thanks", 
      "date": "2006-12-18 20:39:00", 
      "id": 3367, 
      "responses": 3, 
      "subject": "Columbia road flower market", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2846"
    }, 
    {
      "body": "This morning, at Columbia Road market, my friend (also a Barbican resident), had her wallet taken from her bag, at around 10.50 a.m..  This was in one of the shops as you approach the market from the western end of Columbia Road.  With hindsight she realised she had been jostled by two or more females, early twenties, for whom we and the shop owner could have given a reasonable description.  My friend immediately cancelled the one credit card in her wallet.  Another shop owner gave me the telephone number for Bethnal Green Police Station, who we were told cover that area.  I was cut off after about 10 minutes holding trying to get through.  I then tried Barbican Police on the basis that they might either have another number for Bethnal Green or a way of contacting any police who might be in the Columbia Road area, in case the thieves were working their way through the market.  As one was clutching a bunch of small sunflowers (which admittedly could have been thrown away), they were potentially easy to identify, together with the description of appearance we could have given.  There was no reply from Barbican Police and at the time I couldn't find the Snow Hill number, though I found it subsequently.  When we got back to the Barbican, my friend tried the Bethnal Green number again.  After around 15 minutes she got to speak to someone, who asked which postcode Columbia Road was in.  Surprised that they did not know Columbia Road (well known Sunday plant market etc) was in E2, local to Bethnal Green, my friend was then told she was not through to Bethnal Green police but through to a central office dealing with both general and emergency calls and noting incidents.  She was told someone from Bethnal Green Police would get back to her (presumably now tomorrow). At what stage is it warranted to phone 999?  No-one had been hurt so it was not an emergency in that sense, merely a stolen wallet with all the inconvenience (membership cards, congestion charge card, library card etc), but time was lost during which the thieves may have continued their thieving and if police were in the area, they could have been notified promptly and maybe the perpetrators could have been caught.  I always understood prompt reporting of incidents was important.    Please can you tell me what we should have done in the circumstances described?", 
      "date": "2007-07-22 20:32:00", 
      "id": 5354, 
      "responses": 3, 
      "subject": "What should we do if pick-pocketed?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=3529"
    }, 
    {
      "body": "On Friday the cashier at M&S told me I was entiltled to a free bottle of Cava as i'd spent over 35 on food shopping. I was astonished when checking my receipt yesterday to find she'd charged me 4-99 for the said bottle!  I must start checking my receipts more carefully at the time. It's difficult with 4 bags of shopping and a queue behind you.", 
      "date": "2006-07-02 09:17:00", 
      "id": 3176, 
      "responses": 2, 
      "subject": "M&S \"Free\" Cava!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2422"
    }, 
    {
      "body": "Is anyone else getting a liitle hacked off with the seemingly endless deliveries at the newly opened Tesco? There have been half a dozen juggernauts so far today (Sunday), and each time they arrive the tailgate is allowed to hit the road making an incredibly loud noise. Then theres the clanking of the storage cages as theyre dragged along the pavement. Its bad enough during the day but they also do it before dawn! Does anyone know if there are any restrictions on this kind of noise? I must be really noisy for people living in John Trundle Court.", 
      "date": "2006-11-19 18:28:00", 
      "id": 3212, 
      "responses": 2, 
      "subject": "Noisy Tesco", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2760"
    }, 
    {
      "body": "Nothing to do with Macs, rather a bit of detective work for Undercover. Last week I bought some apples labelled, both collectively and individually, as Braeburns, from Waitrose. I thought at the time that they looked pretty unlike any Braeburns I had seen before - a much too uniform deep red - but I thought, naively, that Waitrose would not have got it wrong. When I got them home it became perfectly clear from the taste and texture that they were not Braeburns, so I took them back,explained the problem, and my money was refunded without question. However, I noticed that the same apples were still on sale some days later and took it up with a member of staff who was stocking the produce shelves. I pointed out the clear difference in appearance between the loose \"Braeburns\" and the ones in bags, which looked as they should. His explanation was that the loose ones were grown in a different country and that was why they were different in appearance, taste and texture! When I persisted, he said he would take it up with the manager. Today the same apples were still on sale, so I'd like to know when a Braeburn is not a Braeburn!", 
      "date": "2006-09-04 22:38:00", 
      "id": 4468, 
      "responses": 2, 
      "subject": "Apple confusion", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2580"
    }, 
    {
      "body": "I just been to Crispins, admittedly on a Sunday and a 400gm white loaf cost me 99p. An 800 grm white loaf in Tesco Express costs 38p. Roll on the new Tesco in Aldersgate Street, can't wait!!", 
      "date": "2006-08-13 14:01:00", 
      "id": 3147, 
      "responses": 1, 
      "subject": "Crispins", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2525"
    }, 
    {
      "body": "I am deeply disppointed to see the waitrose thread disappearing down the screen - after such a record breaking run could it be that everyone is now bored with the topic.  Never in such a short time has a supermarket caused such a rumpous.  So to all Waitrose fans /detractors - here's the chance for a whole new thread (or a great big raspberry for flogging a dead horse !!!!)", 
      "date": "2006-07-06 22:03:00", 
      "id": 3181, 
      "responses": 1, 
      "subject": "Waitrose ..... again", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2435"
    }, 
    {
      "body": "It seems we have acquired yet another Tesco Metro, this time on Smithfield just past Carluccios. Surely we must have reached saturation point by now?", 
      "date": "2008-01-23 23:01:00", 
      "id": 3612, 
      "responses": 1, 
      "subject": "new Tesco", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3946"
    }, 
    {
      "body": "I love the villagy atmosphere of our local shops in Aldersgate Street/Goswell Road and it would be such a shame for the opening of Tesco to force these shops out of business.   All of these shops have petitions against the opening of a Tesco store and it would be wonderful if as many people as possible signed them.", 
      "date": "2006-07-19 22:42:00", 
      "id": 4234, 
      "responses": 1, 
      "subject": "Petition against Tesco", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2463"
    }
  ]
}