{
  "summary": [
    {
      "body": "The latest edition of Barbican Life came out last week and should have been delivered to most blocks over the weekend.  Just trying to ascertain how deliveries have gone - so could anyone who hasn't received a copy yet let me know - either via this forum, or directly to  . I'd also be interested in feedback on editorial topics - current and future - if people have any ideas, constructive comments, likes and dislikes etc.  We are trying to make it a magazine serving the interests of the whole Barbican community so anything that helps us do this in terms of ideas etc. is appreciated. Thanks", 
      "date": "2005-12-14 13:53:00", 
      "id": 3011, 
      "responses": 19, 
      "subject": "Barbican Life deliveries", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1988"
    }, 
    {
      "body": "I'm looking at covering Health Clubs and Gyms in close proximity to the Barbican in the next issue of Barbican Life.  Those I'm looking at are:  Champneys, Holmes Place Barbican, Holmes Place Moorgate, Lambs Club (Fitness Exchange), LA Fitness, Fitness First and the YMCA.  Comments appreciated as long as they don't stimulate a thread like the long running one - 'The Hell that is Holmes Place'!  Interested in facilities, service, pricing etc.  Obviously I'm asking the health clubs themselves to send in photographs and details on their services, but users comments would also be appreciated and may be used anonymously.", 
      "date": "2006-01-14 10:19:00", 
      "id": 3044, 
      "responses": 14, 
      "subject": "Health Clubs etc.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2034"
    }, 
    {
      "body": "When first I picked the BARBICAN LIFE magazine from my mail box some months aago I mistakenly thought it was the Association magazine that reported items and issues important to the residents on the estate, namely the BARBICAN RESIDENT. Many topics in that publication were of value since they had to do with the operating of the estate and even more importantly, at least to me, what our Association was accomplishing on our behalf.         Needless to say that isn't so. This wonderfully glossy magazine seems to be a vehicle extolling the virtues of the many eateries round about, the  dishes put before one in the neighborhood resturants, the riches of their cellar etal. The rising number of real estate groups swooping in on us picturing great values of property on the Albert Embankment and even distant Bridgewater Square. Of the number of pages in the current autumn issue, namely fifty two, there appear exactly forty seven advertisements! There are sixten full page adds and three spreads totaling six full pages! This leaves a grand total of thirty pages for editorial material much having absolutely nothing to do with resident interests.           I realize revenue from advertising keeps pubications from going bust, so be it, but does it keep the reader rivited who might be looking for what's happening about his or her ears here on the estate? Don't misunderstand I love eateries, good wine, real estate values, good old Dan Defoe's many faces but how about giving room to this Grade 2 listed spot and it's future. Let me know the Barbican Association is questioning the Corporation and their many fait accompli's slotted in our lives when we weren't looking. Comments?  ", 
      "date": "2006-10-01 14:47:00", 
      "id": 4277, 
      "responses": 7, 
      "subject": "The new Barbican Life Magazine!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2648"
    }, 
    {
      "body": "Noticed in the latest BA Newsletter that 2006 membership of the BA now costs 7 if you want to pay by cheque (it is still 5 if you pay by standing order) I know the BA are trying to encourage people to pay by standing order but this is a bit sneaky isn't it? If the sub is 5 it should be 5 for everyone. Residents shouldn't be penalized for the convenience of the BA. The most recent edition of Barbican Life magazine has a membership form in it with no mention of the 7 cheque option, I'd advise people to dig out their copy and pay using that!", 
      "date": "2005-11-19 14:06:00", 
      "id": 3015, 
      "responses": 6, 
      "subject": "BA Membership £7 by cheque", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1941"
    }, 
    {
      "body": "We haven't received a copy of Barbican Life this time (3rd floor Willoughby House). I know there's a new issue out because I saw copies for sale in Crispins at 3 each. Is BL still delivered free to residents? Thanks, anyone who can help.", 
      "date": "2006-03-18 13:15:00", 
      "id": 4623, 
      "responses": 6, 
      "subject": "Barbican Life magazine - still free?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2142"
    }, 
    {
      "body": "i've just picked up a a Walking guide\" to the Barbican ... its ok - some nice pictures - there's a crap map in the middle of it all and if you live in BJ or Bunyan or Bryer or John Trundle you won't find yourself ... but anyway, my favourite line is :  so although i've bagged myself a triplex worth ? (make that ? +++ because Frank Harris says there's a surge a-commin) I will zip off to work this morning nspired by the knowledge that I still have many years of corporate struggle ahead of me before i can finally say \"Reader, I'm done...\"   ", 
      "date": "2006-08-18 07:48:00", 
      "id": 3158, 
      "responses": 4, 
      "subject": "Discover the Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2534"
    }, 
    {
      "body": "I am astonished to read on p26 of Barbican News that Frobisher Crescent is to be considered for conversion to residential accommodation but that \"No element of affordable ......housing will be included within the Barbican Estate\". I know what they mean, but a better way of expressing it may have been appropriate!", 
      "date": "2006-06-03 11:48:00", 
      "id": 4412, 
      "responses": 3, 
      "subject": "Frobisher Crescent", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2332"
    }, 
    {
      "body": "I've been reading Barbican Talk for the last couple of years since somebody at work put me on to it.  It was during a period  where there was a lot of contact between the residents and Perry Ridley one of the P.O. managers. I work for the Post Office that delivers to the Barbican ( although thankfully I'm not one of your \"delivery officers.\") That's too much hard work. I've found the site both entertaining and informative. Carry on the good work.", 
      "date": "2006-11-04 19:47:00", 
      "id": 3193, 
      "responses": 2, 
      "subject": "New Member", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2727"
    }, 
    {
      "body": "The latest Barbicanews has just arrived, and whilst mostly helpful and informative, several items are made incomprehensible through the overuse of acronyms. Can someone please explain what are CRB, SLA and KPI? (And if the editor sees this, please KISS in the next issue  - that's Keep It Simple, Stupid!)", 
      "date": "2007-02-19 15:10:00", 
      "id": 3260, 
      "responses": 1, 
      "subject": "Acronym overload", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3070"
    }, 
    {
      "body": "Has everyone in the Barbican been added to the mailing list of the Listed Property Owners Club? A few months ago I started receiving their mailshots. Their glossy brochures shows a variety of doorways on the front - Gothic, vernacular medieval, Georgian, Tudor, Art Nouveau - but sadly no Brutalist. And their very attractive magazine has classified ads for companies that offer historic limes and mortars, gilding, pargetting (whatever that is) and sand cast lead. I'm sure there is someone in there who does hammered concrete - just have to look a bit harder . . . The covering letter referred to me as the owner of a listed property, which I suppose I am to some small degree, and I do think the magazine is pretty, but I think this 'organization' (if it really is one and not just a vehicle for marketing) is probably not particularly relevant to us in the Barbican. Not complaining - I just find it all rather amusing.", 
      "date": "2008-03-09 17:04:00", 
      "id": 3539, 
      "responses": 1, 
      "subject": "Listed Property Owners Club?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4101"
    }, 
    {
      "body": "Armagnac-tasting and financial planning talk 8pm 10th April This event hgas been postponed as it clashes with the BA AGM. A fresh date will be notified in the next Barbican Life magazine. Please email me at   if you are intersted provisionaly.", 
      "date": "2008-04-08 06:31:00", 
      "id": 3853, 
      "responses": 1, 
      "subject": "Armagnac-tasting 8pm 10th April POSTPONED", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4211"
    }, 
    {
      "body": "Does anyone have any digital pictures taken during the last Architecture Biennale two years ago (specifically looking for one of the cattle in St John Street) and/ or of the last St Bartholomews Fair?  I need them to illustrate an article on this year's event for the Summer issue of Barbican Life which goes to press at the end of next week.  If anyone has anything I could use please could you email to  .  Happy to give picture credit to the photographer in the magazine. Thanks", 
      "date": "2006-05-25 22:56:00", 
      "id": 4404, 
      "responses": 1, 
      "subject": "Photos of last biennale/Bartholomews Fair", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2318"
    }
  ]
}