{
  "summary": [
    {
      "body": "Dear All, I wanted to drop you a line to say thanks for the fantastic response to the Maison Aubert tasting on Wednesday evening.  We had a great time and hope you did also. I'll aim to do the next tasting soon with different wine and stories so I'll keep you posted. For those of you who weren't able to make it, here's what we tasted:-    If you thought youd tasted Champagne, drink again! Pierre Gerbaiss grows his grapes and makes the wine in the Ctes des Bar, on the sunny slopes of the Valle de lOurce, the most southern point of Champagne. These are deliciously balanced Champagnes, punching well above their weight, as good as many offerings from the big Grand Marques which are twice the price. This is the traditional blend in the Ctes des Bar made with a majority of Pinot Noir.     Cheverny is north of Touraine where Sauvignon is king. This organic wine has aromas of exotic fruit, almond and freshly cut hay. Its unctuous, dense, fresh and savoury. A blend of 70% Sauvignon and 30% Chardonnay, it stayed on fine lees in tank until spring 2006 to give it some weight.   An estate born from a collaboration between two family growers established in the 1930s in the village of Nissan-les-Enserune. The vineyard follows the Canal du Midi in the South-West of France. Wonderful textbook Sauvignon, nose of very ripe peach,  lemon marmalade, its crisp with a finish of citrus zest.   A very young estate created in 2002  check out the art-school labels drawn by a well-known calligrapher. These are highly distinctive wines, fine and savoury with beguiling aromatics. A blend of 90% Grenache Blanc and 10% Roussanne, offering aniseed, fennel and citrus on the nose. The palate is at first mellow and engaging then a delicious crunch kicks in  a wake-up call for the senses!    Following on from the Sauvignon by this family estate, here is their elegant Chardonnay. Ripe, white peach with a touch of mango and caramel. The clean and crisp finish makes this wine food friendly and a lovely summer sipping white.   Chablis on another level! This is a classic unoaked version of Andr Philippon. Coming from a tiny parcel of 1.5 hectares, the vines are over seventy years old it is one of the oldest post phylloxera Chablis 1er cru vines. Andr, who married a polish girl harvesting his vines in 1974, has just retired and their two children, Beatrice & Benoit took over in 2006. Mont de Milieu is south facing, and is named Hill in the Middle because it represents the separation between Champagne and Burgundy.  ", 
      "date": "2007-06-08 19:00:00", 
      "id": 3340, 
      "sentiment": 4, 
      "subject": "Thanks from Maison Aubert", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3410"
    }, 
    {
      "body": "hello all. i've been considering moving to the barbican estate for a long time now - it's near to work, public transport is good. most importantly, the estate itself is quite beautiful - in an odd way. and the barbican centre is incredible. so i've spent a few hours looking over estate agents and this site. service charges are a recurring question though - i've lived in a mansion block before so i'm used to phenomenal service charges. does anyone know round-about annual service charges. i'm looking at type 28/29 , or larger studios w/ \"bed areas\" (type 44?). the flat would have to be in a \"north-south\" terrace - i really can't afford being hit by a mega-lift-charge. if anyone knows really approximate for a studio/1bed/2bed flats in one of the north-south terraces i would really appreciate it. thanks.", 
      "date": "2006-08-25 22:31:00", 
      "id": 4458, 
      "sentiment": 4, 
      "subject": "service charges", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2560"
    }
  ]
}