{
  "summary": [
    {
      "body": "I note a few messages about Crossrail on another thread - and thought it might make sense to start a new one here.  I think one of the messages says that there is a plan B regarding the Crossover cavern under Defoe House.  There is indeed a Plan B, but that doesn't stop the crossover being constructed - but it might enable the engineers to do away with the proposed surface works on Aldersgate Street as the plan involves removing the muck through the tunnels back to Liverpool street, rather than through a shaft at Aldersgate Street/Beech Street.  Regarding subsidence, residents will be exceedingly unlucky if they are affected at all.  Virtually all underground works make for some subsidence (most of the Barbican falls within a prospective area where up to 10mm of subsidence might be expected) - but if this occurs evenly across the structures it is unlikely that anyone will notice apart from the engineers with their precision monitoring instrumentation.  Bear in mind that the Crossrail route under the Barbican is actually directly underneath the existing Metropolitan Line/Circle line/Thameslink tracks - and for safety reasons any subsidence will have to be very tightly controlled under the existing tracks.  I don't think Defoe residents should have anything to worry about.  Plenty of tunnelling has taken place under London recently without damage to overlying structures. Regarding the Crossover cavern - this is a structure where the twin tunnels are merged effectively into one much wider one so that trains can be switched from one track to the other.  These are necessary for both safety and operational reasons.  I am not sure why such a cavern needs to be directly under Defoe, but it is necessary for it to be somewhere, and in an urban environment it is virtually bound to be under some building and the plans place it  below Defoe and I doubt that that will be changed, but I reiterate that I still don't believe that Defoe, or any other Barbican residents will have anything to worry about from the tunnels themselves as they are 30 m down and modern engineering should be able to cope very well with this kind of problem.  The noise etc. from works in Aldersgate Street is another factor altogether and i think the current plans call for works to be carried out there for up to 43 months! - If we can do anything to get Crossrail to implement Plan B then we should.  Traffic disruption alone will be pretty horrendous, and there will also be major traffic problems in Moorgate where a major sewer has to be diverted and then replaced.  We do live in 'interesting times.'", 
      "date": "2005-04-13 20:06:00", 
      "id": 2909, 
      "sentiment": 2, 
      "subject": "Crossrail", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1560"
    }, 
    {
      "body": "Hello Neighbours, I live on Golden Lane Estate, and I'm tring to rally up support for objecting to the late license that the Shakepeare pub (on Aldersgate Street) have applied for. Does the noise  reach as far as the Barbican, John Trundle Court perhaps?", 
      "date": "2005-07-29 11:40:00", 
      "id": 2966, 
      "sentiment": 2, 
      "subject": "Shakespeare pub late license", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1768"
    }, 
    {
      "body": "At risk of sounding like Disgusted of Willoughby, not only did we have the police drama in the night on Sunday, but we also had noisy building work going on all through Sunday morning and afternoon from the Austral House site at London Wall/Coleman Street. It finally finished at 3.30pm That has been 7 days of construction noise from three sites within view of our balcony ALL week.  I did log my complaint with Guildhall on Sunday, and the Environmental Health duty office did call me back. He told me that the Austral House site work had been authorised becuase they had applied for a permit and been granted one. On a Sunday! It is likely they have applied for and been granted others too. Can anyone else bothered by this please also log their complaint with the City. During the week, speak to the Pollution Team on 020 7332 3630. At the weekends, when the noise nusiance is happening, call Guildhall switchboard on 020 7606 3030 and say you have a noise nusiance complaint. We really must bring pressure to bear on the City to not issue noisy works permits for Sundays so close to the Barbican Estate.", 
      "date": "2006-04-24 22:26:00", 
      "id": 3068, 
      "sentiment": 2, 
      "subject": "Weekend Constuction", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2221"
    }, 
    {
      "body": "Although there have been a few posts on bike parking, I thought that - before approaching the Estates Office - it would be helpful to see whether there is support for better ( ) facilities to lock up bikes in the car parks. Although the bike park coffins are available, at 70 p/a these are fairly pricey ... Would anybody else support me in asking for just some basic racks that took up a couple of (empty) car park spaces that we could actually lock bikes to? This would cost virtually nothing.  Surely the Corporation could do this to enhance its green credentials?", 
      "date": "2007-08-16 18:06:00", 
      "id": 3432, 
      "sentiment": 2, 
      "subject": "Support for basic bike rack in car park?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3594"
    }, 
    {
      "body": "The City has objected to the Post Office's running down of postal services and is even arguing for increased provision. To register your own concern and sign the petition, go to  .", 
      "date": "2008-03-06 09:30:00", 
      "id": 3537, 
      "sentiment": 2, 
      "subject": "Post Office Closures", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4087"
    }
  ]
}