{
  "summary": [
    {
      "body": "All As you might have seen the postal service of leaving parcels and letters with CPA's was restored following our meeting on Friday.  Thanks must go to Nicola Baker and Richard Morrison who led the meeting and discussions with the Post Office and Sharon McLaughlin from the BEO who pushed the issue from the Estate Office perspective. The resumption is however tempororary and was made possible by the BA making a formal request for the service to be resumed.  The Post Office wanted indemnities from us absolving them of responsibility for non deliveries which we refused to give as this would let the Post Office off the hook for non delivery of items due to their negligence (which is the usual cause). We will have to look for a longer term solution which will probably take the form of an opt out register of those people who do not want mail left with CPA's and would rather trek to Mount Pleasant.  I envisage a bureaucratic quagmire with this but we will probably have to go through the motions to keep the Post Office on side. We will keep on top of this.  Hopefully however we will not get a repeat of this nonsense for another 15 years (when I gather it happenned before). Stephen Horrocks PS  Sorry to leave you in suspense all weekend - I've been recuperating from a operation", 
      "date": "2004-12-13 08:17:00", 
      "id": 2905, 
      "sentiment": 3, 
      "subject": "Postal Service Restored", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1382"
    }, 
    {
      "body": "One of the nice things about the Barbican gardens has been the fact that they are free of mess.  At the weekend I went to the Defoe garden and couldn't believe how much crap there was on the ground.  It wasn't hard to see why since there were two geese and five half-grown geese parading up and down.  Seven big and quite aggressive geese is beyond a joke and stepping around mounds of goose turds is not funny either.  I seem to remember reading that the Corporation hadn't received enough complaints to justify the hassle of getting rid of the geese.", 
      "date": "2006-06-27 14:18:00", 
      "id": 3144, 
      "sentiment": 3, 
      "subject": "Goose crap in the gardens", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2400"
    }, 
    {
      "body": "Developers are threatening to end the lease at The Light Bar (shoreditch high street) and knock it down to redevelop the site into more big office blocks.  It is an incredible building that has been at the heart of Shoreditch for years and it would be a real shame to lose it to another glass skyscraper.  Please take a minute to sign the petition, which they are going to present to the local council in an attempt to prevent the destruction of this historic building.", 
      "date": "2007-06-25 21:49:00", 
      "id": 3363, 
      "sentiment": 3, 
      "subject": "Save the Light!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3446"
    }, 
    {
      "body": "We have just received the questionnaire about the refurbishment, and I hope that many residents will complete it and return it to the estate office. Overall the refurbishment looks great, and the automatic doors are a big improvement. However, the budget was 190,000 - quite an astonishing amount of money to spend on the podium entrance and car park entrance. The budget apparently did not stretch to the following items which I think residents should consider, as I had understood that they would be included: -- the porters' desk was not renewed and is showing lots of signs of wear and tear -- there is no parcel store - as before, parcels are left on the floor, which I find rather astonishing. Nowadays people order more and more online, and there is no provision for the storage of delivered items. -- the doors at podium level (possibly elsewhere) were poorly repainted. You can see that old layers of paint were not removed, and already the new paintwork is showing signs of damage. I'd be interested in hearing opinions from my neighbours on this. The house committee has been silent, to my knowledge. The whole job took an extraordinary amount of time, and cost an unfathomable amount of money, and I think that in less than 12 months we will all have serious misgivings - if we don't already.", 
      "date": "2007-11-24 20:32:00", 
      "id": 3614, 
      "sentiment": 3, 
      "subject": "Shakespeare lobby refurb questionnaire", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3815"
    }, 
    {
      "body": "All given that we would presumably all like to remove the blight that is British telecom from our lives, could I ask: a) would people be onboard with a direct appeal to Virgin to install their fibreoptic wizardry throughout the estate b) if the technical gurus amongst us are 100% convinced that this would be better than what we now have I believe that a substantial number of local residents made a real difference in replacing the awful safeways/morrisons/somerfields with waitrose. Maybe enough of us could do similar with Virgin? PM me if you think the idea has legs and I'll happily knock up some form of petition or ecircle-up. cheers Matt", 
      "date": "2008-03-14 17:59:00", 
      "id": 3825, 
      "sentiment": 3, 
      "subject": "Virgin Media", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4125"
    }
  ]
}