{
  "summary": [
    {
      "body": "I have just received my Thames Water bill for 2006/07, which has now climbed to 644, and represents a huge increase over the past few years.  I note that there is a process whereby one can apply for a water meter, which I presume in Barbican flats cannot be fitted (?), and then be offered an alternative charging basis, called the 'Average Household Charge'.    Questions that spring to mind: Has anybody gone through this process (especially in a tower flat, like mine)?   Can Thames Water fit meters, or do you end up with the Average Household Charge?  Does it in fact lead to lower water bills?  Any information/thoughts would be gratefully received.  Thanks.", 
      "date": "2006-02-21 10:18:00", 
      "id": 4604, 
      "responses": 16, 
      "subject": "Water Bills/Tower Flats", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2095"
    }, 
    {
      "body": "Thames Water has sent me a letter asking the size of the flat in order to assess next year's rates 'because we were unable to fit a meter at your property when you requested on'.   I understood we all had some sort of fixed rate because it is not viable to fix meters here.  Was just wondering how I should respond?", 
      "date": "2007-07-15 15:50:00", 
      "id": 4043, 
      "responses": 4, 
      "subject": "water rates query", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3498"
    }, 
    {
      "body": "I would be grateful to hear from anyone living in a studio flat in the Barbican as to how much they pay Thames Water each year for water rates. Having paid 246.89 for the past year, I queried this high rate for a Breton House studio flat, containing one water-frugal occupant who showers (not bathes) and uses the water-machine just once a week.  Thames Water's response was to close my account (unilaterally), then open a new one with a \"revised\", reduced annual charge of 245.00 (a saving of 1.89!). I understand that Thames Water \"cannot\" fit water meters in the Barbican Estate, but wondered if other studio occupants are paying the same as I?  If you're paying less, then HOW did you swing it?! Thanks Nigel", 
      "date": "2007-10-17 15:34:00", 
      "id": 3453, 
      "responses": 1, 
      "subject": "Water rates (Average Household Charge)", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3732"
    }
  ]
}