{
  "summary": [
    {
      "body": "I have been commissioned by the Barbican Centre to write a self guided walking tour leaflet  to the estate and centre. The leaflet will be given out free and it will be printed ready for the London Architecture Biennale taking place in mid June. Before anyone gets upset I would like to point out that as well as being a design historian I am a resident and therefore won't be suggesting those using the guide trespass or interfere with the bucolic barbie bliss we all enjoy. I do however want to produce an informative history to the site and surrounding area. The routes will begin at the tube stations/silk street etc and go around the highwalks leading the visitor into the Centre or down to the fountains. Hopefully this guided map will also be of use to residents who can pass them out to friends and family visiting, instead of having to rescue tearful lost first timers or those that arrive slightly distressed having spent 20mins walking around the estate in the wrong direction....... If any residents have nice Barbican urban myths, stories,quotes and history they think should be included do let me know ( eg the squirrel resident in Willoughby). I have of course lots of material/books on the history of the site and the estate and have consulted barbicanliving. But I thought there might be some hidden gems in the collective barbie brain bank. Many thanks", 
      "date": "2006-03-16 12:37:00", 
      "id": 4639, 
      "responses": 8, 
      "subject": "walking tour guide/leaflet on the Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2139"
    }, 
    {
      "body": "A long time ago I remember a conversation where people would like access to a site that gave them walking or running directions in London. Well...ta da! I was rather impressed by it I must say.", 
      "date": "2007-03-18 18:00:00", 
      "id": 3295, 
      "responses": 4, 
      "subject": "Walking/Jogging...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3158"
    }, 
    {
      "body": "This is to back up Perdita's posting on the heating thread about arranging something social on the estate.  I wonder if enough people are aware of Amigos as the social association within the Barbican.  If not, take a look at   and you can see what is currently on offer.  I went on an Amigos walk around Clerkenwell on Sunday with Brian, our very own estate-dwelling Blue Badge Guide who blew me away with his knowledge of the area.  I hope we get to do more of the City with him in time.  Mary Piper does a stirling job of trying to get us together and amigos deserves support.", 
      "date": "2005-10-04 16:50:00", 
      "id": 3109, 
      "responses": 1, 
      "subject": "Just being sociable", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1868"
    }
  ]
}