{
  "summary": [
    {
      "body": "Found a couple of quotes from Peter Rees on the metropoliswest website from the 2007 Cities Conference on Urban Design, thought they might be of interest. \"The worst thing you can have in downtown is families. Families kill cities. Families are boring. What you must not do is create a downtown that is mixed-use residential. The City of London about is only one square mile, and we dont have room for everything. I would direct your attention to the fact that important things like world financial centers and world centers of nightlife are easily killed by residents. Residents move into SoHo, and the first thing they do is complain about the noise and late night activity, and you wonder why they moved in there in the first place. Now of course other cities have residents downtown, but in the heart of a world financial center, where weve renewed 50 percent of the floor space in the last 15 years, we cant afford to have NIMBYs stopping that process.", 
      "date": "2008-05-01 17:33:00", 
      "id": 3563, 
      "responses": 13, 
      "subject": "Peter Rees Quotes", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4295"
    }, 
    {
      "body": "A long time ago I remember a conversation where people would like access to a site that gave them walking or running directions in London. Well...ta da! I was rather impressed by it I must say.", 
      "date": "2007-03-18 18:00:00", 
      "id": 3295, 
      "responses": 4, 
      "subject": "Walking/Jogging...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3158"
    }, 
    {
      "body": "Might be of interest ", 
      "date": "2007-06-20 09:58:00", 
      "id": 3355, 
      "responses": 2, 
      "subject": "Smithfield Nocturne", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3429"
    }, 
    {
      "body": " rather than .co.uk ", 
      "date": "2007-03-06 13:30:00", 
      "id": 3276, 
      "responses": 1, 
      "subject": "Not a million miles apart?     try this..........", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3110"
    }, 
    {
      "body": "For any cyclists enthusiasts, you may be interested in this today", 
      "date": "2007-06-23 09:19:00", 
      "id": 3362, 
      "responses": 1, 
      "subject": "Smithfield Nocture", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3438"
    }, 
    {
      "body": "I came across this site where people put their pictures of particular streets or places in London.  They had a section on Milton Court and I thought we might like to have the link for posterity.", 
      "date": "2008-04-18 15:39:00", 
      "id": 3875, 
      "responses": 1, 
      "subject": "Milton Court pics", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4248"
    }
  ]
}