{
  "summary": [
    {
      "body": "Hello I am an interloper so I hope it's okay to ask this.  I don't live in the Barbican yet and perhaps never will (as you all no doubt know, there is a dearth of properties) but I wondered if any of you would be generous enough to share your thoughts on living there and good points/bad points. I've lived in flats all my life (we currently live near Old Street and hurrah for the new Waitrose even if, yes, some of the staff are very incongruous for JLP) so I know that properties can differ wildly and that it's also a matter of personal choice. But these are the things I'd like to ask (in no particular order): Am I correct in thinking the biggest flats are in the towers? Is it generally a quiet and safe place to live or does it vary wildly from block to block? What's it like for children? The private gardens seem amazing but in reality what's it like? Is the service charge astronomical (I realise it depends on size of flat)? What will happen when all TV goes digital and the Barbican has no digital cable?? Is the listed building classification a pain if you want to do any work in the flat? Garchey, good or bad? Are parking places readily available to rent or is there a shortage? Anything to look for that an outsider may not know about.  I'd be really grateful for any answers. If I can reciprocate in any way...my specialities are fly fishing, beauty products, nutrition and fashion. I know, ecletic and slightly bizarre! Thank you. AB", 
      "date": "2006-06-05 17:37:00", 
      "id": 3180, 
      "responses": 29, 
      "subject": "What's it like living in the Barbican?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2338"
    }, 
    {
      "body": "Posted: Tue Dec 19, 2006 7:34 pm    Post subject: First Barbican Gay/LGBT & Friends Residents Gathering     -------------------------------------------------------------------------------- Following on from the Only Straights on the Estate string, the first First Barbican Gay/LGBT & Friends Residents Gathering will be held on 9th January at the Wood St Bar from 7.30pm.  I've had to pay a deposit and I need to have some rough idea of numbers, so that we can make sure we have the best possible space on the night.  Please PM me if you'd like to come or email  . Please let other people know so that as many people come along as possible. I'll be inviting a few friends just to make sure it's not me sitting on my own with Paul all night!!", 
      "date": "2006-12-20 12:23:00", 
      "id": 3460, 
      "responses": 25, 
      "subject": "First Gay / LGBT & Friends Residents' Gathering - Jan 9t", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2849"
    }, 
    {
      "body": "Following on from the Only Straights on the Estate string, the Second Barbican (and Golden Lane) Gay/LGBT & Friends Residents Gathering will be held on Tuesday 13th January at the Wood St Bar from 7.30pm. Please PM me if you'd like to come or email  . If the numbers are looking strong, we might be able to take over the downstairs room and, following lots of positive ideas from everyone who came last time, I shall buy some nibbles and bits to eat this time. Please let me know if you can make it.  Danny", 
      "date": "2007-01-14 21:34:00", 
      "id": 3257, 
      "responses": 14, 
      "subject": "2nd LGBT Residents Gathering - 13 Feb at Wood St Bar", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2908"
    }, 
    {
      "body": "Are  there any experienced Mah Jong players who would like to have a game? Although I have a Mah Jong set I haven't played for a few years - and I would need help and guidance to have even a rudimentary game. We would need at least four participating players to start up a school.", 
      "date": "2007-04-13 10:47:00", 
      "id": 3347, 
      "responses": 14, 
      "subject": "Mah Jong players?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3226"
    }, 
    {
      "body": "Our last LGBT gathering had about 60 people. And we're growing.  So, we've decided to go a bit more formal. From now on, we'll be known as EC2Gayz. And we're a group of Barbican and Golden Lane residents. And we're about EC2 gay and lesbian residents (and friends) getting together to get to know each other and swap scary amounts of local gossip.  Michelle has kindly offered to help as my co-host at the next gathering.  Our next meet will be downstairs at the Wood St Bar & Restaurant on Tuesday 27 March.  We'll be putting some flyers up around the Estate and hope to capture more people who don't use BarbicanTalk at our next gathering.  Looking forward to seeing everyone again on Tuesday 27 March.  Danny", 
      "date": "2007-02-23 13:55:00", 
      "id": 3262, 
      "responses": 8, 
      "subject": "March 27 Gay and Lesbian Residents Gathering - EC2 Gayz", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3079"
    }, 
    {
      "body": "I have been commissioned by the Barbican Centre to write a self guided walking tour leaflet  to the estate and centre. The leaflet will be given out free and it will be printed ready for the London Architecture Biennale taking place in mid June. Before anyone gets upset I would like to point out that as well as being a design historian I am a resident and therefore won't be suggesting those using the guide trespass or interfere with the bucolic barbie bliss we all enjoy. I do however want to produce an informative history to the site and surrounding area. The routes will begin at the tube stations/silk street etc and go around the highwalks leading the visitor into the Centre or down to the fountains. Hopefully this guided map will also be of use to residents who can pass them out to friends and family visiting, instead of having to rescue tearful lost first timers or those that arrive slightly distressed having spent 20mins walking around the estate in the wrong direction....... If any residents have nice Barbican urban myths, stories,quotes and history they think should be included do let me know ( eg the squirrel resident in Willoughby). I have of course lots of material/books on the history of the site and the estate and have consulted barbicanliving. But I thought there might be some hidden gems in the collective barbie brain bank. Many thanks", 
      "date": "2006-03-16 12:37:00", 
      "id": 4639, 
      "responses": 8, 
      "subject": "walking tour guide/leaflet on the Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2139"
    }, 
    {
      "body": "what's happened to easygays or whatever it was called - any plans for a christmas gathering?", 
      "date": "2007-12-12 12:50:00", 
      "id": 3533, 
      "responses": 7, 
      "subject": "Gay drinks", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3864"
    }, 
    {
      "body": "I am new to the Barbican and would like to play chess against a person instead of my machine. Reasonable standard but not too pompous to be beaten.", 
      "date": "2006-08-20 07:55:00", 
      "id": 4469, 
      "responses": 5, 
      "subject": "chess", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2542"
    }, 
    {
      "body": "Hello everyone! Does anyone know of baby or expectant parents clubs (formal or informal) here in the Barbican? We are expecting our first child at the end of March. I know there are a lot of new parents here as we see them in the gardens - it would be great to get to know some of them - anyone any experience of this? Many thanks in advance for any suggestions.", 
      "date": "2006-08-09 20:54:00", 
      "id": 3156, 
      "responses": 4, 
      "subject": "Baby/Expectant Parents Clubs", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2516"
    }, 
    {
      "body": "Do any Barbicanites go horse riding in the local-ish area? I would love to find a decent school. I know there is a school in Hyde Park but would appreciate any informed  recommendations or suggestions (or warnings). Thanks", 
      "date": "2006-07-11 21:37:00", 
      "id": 3242, 
      "responses": 4, 
      "subject": "Horse riding", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2448"
    }, 
    {
      "body": "Does anyone on here attend this church as I would like to do so . Can anyone tell me the times of the services . It looks a lovely church and is close to where Im living . I attend church every week and want to continue doing so as a commited christian .", 
      "date": "2005-11-22 17:34:00", 
      "id": 4544, 
      "responses": 4, 
      "subject": "St Giles Church Cripplegate in the Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1952"
    }, 
    {
      "body": "is anyone insterested in playing 5 a side football on a weekly basis, for a couple of hours on the court next to the resident's garden?", 
      "date": "2007-03-08 15:36:00", 
      "id": 3297, 
      "responses": 3, 
      "subject": "5-a-side football", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3122"
    }, 
    {
      "body": "Calling on Barbican-based folk working in the creative industries.  How about meeting up in a local pub for a neighbourly drink or two? There's a few of us (Photographer, Publisher, New media guys) wondering if there may be more of us working at home on artistic, visual, literary, publishing, musical, new media, architectural etc  type things. We're meeting up on Wednesday 7th May at 7.30pm at the Wood Street Bar for a drink. You're very welcome to join us. [/b]", 
      "date": "2008-04-20 16:21:00", 
      "id": 3877, 
      "responses": 3, 
      "subject": "Barbican Creatives Social", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4254"
    }, 
    {
      "body": "In my professional journal (I'm a retired librarian) there is a note on  .  It provides satellite pictures of almost everywhere in the 'great globe itself', with detailed pictures with street names of larger cities. For street names click on 'Hybrid'.  Navigation is easy and it is possible to get magnifications as from 50 feet altitude. The Estate shows up well, but the horizontals - the Towers - are not so clearly visible as the verticals,  for example Brandon Mews.  Edward Dudley", 
      "date": "2006-09-01 10:22:00", 
      "id": 4474, 
      "responses": 3, 
      "subject": "Barbican Estate: a celestial view", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2569"
    }, 
    {
      "body": "Are there any musical Barbicanites out there who would be interested in forming a string quartet - for a fun once-a-week practice rather than performance? Alternatively, are there any existing chamber music groups in need of a violinist? I am a reasonable amateur (Grade 8-ish) and a fairly good sight-reader, slightly out-of-practice at the moment but that can be rectified!", 
      "date": "2005-08-08 09:20:00", 
      "id": 2992, 
      "responses": 2, 
      "subject": "Amateur string quartet in the Barbican?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1795"
    }, 
    {
      "body": "It seems very quiet on the gay-drinks front - what happened to ECGayz or whatever it was finally called. Left a message on here a few months ago but no definitive answer as to whether or not it's still on. Or has everyone just jacked it in and headed off to Fire?", 
      "date": "2008-04-08 19:30:00", 
      "id": 3856, 
      "responses": 2, 
      "subject": "Gay Drinks??", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4215"
    }, 
    {
      "body": "Hi, I am keen to improve my Spanish and am looking for any Spanish or L.American Barby residents who might be similarly keen to improve their English... Hola, tengo ganas de mejorar mi espanol y busco residentes espanoles o latinoamericanos del Barby quienes del mismo modo quisieran mejorar su ingles... Clare Lauderdale Tower 07809 200214", 
      "date": "2007-05-29 12:39:00", 
      "id": 3331, 
      "responses": 1, 
      "subject": "SPANISH/ENGLISH INTERCAMBIO", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3369"
    }, 
    {
      "body": "Anyone else go to see Israel Lopez tonight? It was FANTASTIC. Plenty of dancing in the aisles. Now I want to go samba/salsa/latin dancing so if anybody knows where I can do that locally, please tell.", 
      "date": "2007-04-29 21:41:00", 
      "id": 4259, 
      "responses": 1, 
      "subject": "ISRAEL LOPEZ CONCERT", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3286"
    }, 
    {
      "body": "Hi everyone, Are there any local clubs / pubs who play regular footy?  I would be keen to join up.", 
      "date": "2007-04-27 23:30:00", 
      "id": 4262, 
      "responses": 1, 
      "subject": "Football teams looking for players", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3277"
    }
  ]
}