{
  "summary": [
    {
      "body": "There is a conman operating in the area - we have been approached twice by him now , once by Moorgate Station and once near Cromwell Tower. His blag is that he has been mugged / pickpocketed - he needs 15 to get home and is happy to leave his \"expensive\" leather jacket with you as a deposit.  he's in his late 40's early 50's about 5'8\". We almost fell for it until we quizzed him on his \"mugging\" (it happened at Waterloo and he couldn't explain why he was in Moorgate on the way to Euston Station).  We felt awful for being suspicious but with the second approach obviously vindicated. There 's a similar guy who operates near Euston always dressed in a suit. The worst part is that if it ever happened to me I would hate everyine to treat me with suspicion. Anyway - don't fall for it.", 
      "date": "2007-02-21 23:00:00", 
      "id": 2054, 
      "sentiment": 3, 
      "subject": "Conman operating in the area", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3076"
    }, 
    {
      "body": "We were surprised to find that the station was closed this weekend - not because of the consequences of recent bombings, but because of planned track replacement. Fair enough, maintenance needs to be done. However, no replacement bus service was supplied. I asked about this and was told \"there is never a replacement bus from this station\". I pointed out that I had taken replacement buses dozens of times from Barbican station, and was just met with shrugged shoulders and advice to walk to St Paul's station - which, apart from being a good 10 minutes away, is of course on a totally different line. I've called London Underground to ask why this stretch of line no longer qualifies for replacement bus service. There always seemed to be plenty of people on those buses and if this is going to be policy in future, it will cause a lot of inconvenience.", 
      "date": "2005-07-31 07:48:00", 
      "id": 2949, 
      "sentiment": 3, 
      "subject": "Barbican station closure this weekend", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1773"
    }, 
    {
      "body": "the other day my partner was on the balcony (we're in bunyan) and saw two large chavettes walking their dog near the lake under bunyan court. they were repeatedly throwing a ball into the water and trying to get their dog to attack the big golden carp in the lake. the dog didn't seem very interested, but they kept trying. my partner yelled out, \"hey! you! leave that fish alone!\" so they sauntered off.  about 20 minutes later, they were back doing the same thing. he shoo'ed them away again. so if anyone's on their balcony in the area, keep an eye out for them. they seemed like they were regular visitors to the lake.  has anyone noticed, btw, that they've added five new goldfish to the bunyan lake? they like to hide under the duck slide. i think the carp is excited to have the company.", 
      "date": "2005-08-27 12:46:00", 
      "id": 2983, 
      "sentiment": 3, 
      "subject": "estate fish in vicious chav dog attack danger!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1820"
    }, 
    {
      "body": "Good Morning I have received infomation on the following mobile telephone scam. People have been receiving calls on their mobiles from the following number, 02920368700 there will be no speech.   DO NOT ANSWER THE CALL AND DO NOT CALL IT BACK.   OFCOM are investigating Regards John", 
      "date": "2006-05-18 07:51:00", 
      "id": 3120, 
      "sentiment": 3, 
      "subject": "Telephone Scam", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2301"
    }, 
    {
      "body": "twice in the last moth i have seen two different people doing this to other people,they will walk past you then aproach with a gold ring saying they have just found it on the ground they get you to take the ring (i think some sort of greed element thing) and ask you for some sort of cash reward for a worthless goldplated brass ring with a hallmark on it ", 
      "date": "2007-05-22 11:26:00", 
      "id": 3324, 
      "sentiment": 3, 
      "subject": "Gold Ring SCAM!!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3353"
    }
  ]
}