{
  "summary": [
    {
      "body": "We have had a bit of an accident with the carpet in our flat - Irn Bru was spilt on it! Nothing has worked and we are moving out in 2 weeks. Does anyone have any ideas as to how to get rid of it? We can't afford to lose any of our deposit so any suggestions are most welcome.", 
      "date": "2005-08-05 08:52:00", 
      "id": 2965, 
      "responses": 5, 
      "subject": "Carpets", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1785"
    }, 
    {
      "body": "We are investigating having the carpet replaced in our flat in Thomas More. Does anyone know what kinds and colours of carpets the flats had when the building was new, or how to find out what they might have had? Any advice about good places to source carpet from would be good too (we've already taken advice from the good people at John Lewis). Thanks.", 
      "date": "2006-04-26 14:10:00", 
      "id": 3069, 
      "responses": 5, 
      "subject": "Carpeting", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2226"
    }, 
    {
      "body": "We've inherited a beige carpet which has got some nasty black streaks - they're at right angles to the carpet edges, several inches long, and an inch or two apart.  Does anyone know what causes this, and how to remove (or preferably prevent) it?  Hoovering & shampooing make no difference. We want to replace the carpet, but don't want the new one to suffer the same fate. Thanks to anyone who can advise.", 
      "date": "2006-08-05 14:50:00", 
      "id": 3138, 
      "responses": 4, 
      "subject": "black streaks on carpet", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2509"
    }, 
    {
      "body": "Hi, can anyone recommend a good carpet cleaner please? I have a flyer for Martyn Everett (if you've used his services, let me know please if he was any good/ how much he charges!) but I usually like to get a couple of quotes. Any advice about carpet dry cleaning generally - it sounds better, but is it smelly?", 
      "date": "2008-05-06 09:45:00", 
      "id": 3583, 
      "responses": 4, 
      "subject": "Carpet cleaner rec please", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4309"
    }, 
    {
      "body": "It seems like there are mini-volcanoes growing from my living room floor, under my carpet.  I'm wondering if it's something to do with the underfloor heating / concrete. They are very hard, and there seem to be quite a lot of them. I've only noticed them in the last few months, having lived here for 14 years. Before I pull up the carpet or contact the Estate Office, I'm wondering if  anyone else has had anything like this happen?", 
      "date": "2006-02-09 11:40:00", 
      "id": 4572, 
      "responses": 4, 
      "subject": "Bumps under carpet", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2063"
    }, 
    {
      "body": "Anyone used a good carpet cleaning service (steam or pref dry cleaning)  lately please? Or had a good experience with DIY hire cleaner?", 
      "date": "2007-03-19 18:56:00", 
      "id": 3298, 
      "responses": 2, 
      "subject": "carpet cleaning wanted", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3163"
    }
  ]
}