{
  "summary": [
    {
      "body": "In case anyone didn't get today's junk mailing inside the \"City Resident\" magazine, the St Alphage House redevelopment is to be exhibited at the City of London Girls School, Weds 26th March 6pm - 8pm and Thurs 27th March 4pm - 7pm.  There is very little extra \"real\" information in the mailing, other than confirming the footprint of the building, which will include the Fore Street Telephone Exchange. Strangely enough they chose not to include any renderings of the proposed building - guess we'll all have to go along to see the alleged elephantine building.", 
      "date": "2008-03-18 23:08:00", 
      "id": 3587, 
      "responses": 77, 
      "subject": "St Alphage House Exhibition at Girls School, 26/27 March", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4138"
    }, 
    {
      "body": "Maybe it's because I saw it at night, but what on earth is the Whitcross Street frontage of the new school supposed to look like. If it's supposed to look like a due to be demolished laundry building or to blend in with the dated look of the block Waitrose resides in then it's a perfect fit, but in my humble opinion it looks as though they have given the Golden lane area and Whitecross street something that some looks an absolute eye sore. I hope the graffity artists can do something to improve it, coz that looks like what it was designed for!!!   Rant over...  NB Happy new year all.", 
      "date": "2008-01-08 12:05:00", 
      "id": 3617, 
      "responses": 31, 
      "subject": "OMG - Rant", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3916"
    }, 
    {
      "body": "WEDS 7TH SEPT 3.30-8.00pm at Fortune Park Campus(the old Prior Weston School) entrance on Whitecross Street just in case you fancy a gander ", 
      "date": "2005-09-02 19:41:00", 
      "id": 3053, 
      "responses": 27, 
      "subject": "GOLDEN LANE CAMPUS  (exibition of plans)", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1826"
    }, 
    {
      "body": "Does anyone have any information as to how high, how wide, the number of students, the age of said inhabitants, when will the structure be finished, when will the first kids be under roof etc. etc.! I've heard all kinds of stories, some plausable, some pretty far fetched, a few wanting me to sell up and flee. Having risen from the ashes of the old seat of learning the structure at present looks pretty formidable to say the least! Many months ago I was under the impression it would be a one story group of buildings. If one looks at what has risen so far that couldn't be gospel. I've even heard that there will be situated a football pitch on the roof!!! Enough rumours and neighborhood horror stories...any REAL information to give we who are interested to the point of distraction!", 
      "date": "2007-03-02 17:59:00", 
      "id": 3568, 
      "responses": 25, 
      "subject": "That shiney new school on Whitecros Street.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3095"
    }, 
    {
      "body": "I would like to make a formal complaint about the building site of the school.Plus I would like to address the issue of the safety of the project with interested authorities. Who Do I contact? I am not against a school I am against that project!", 
      "date": "2006-09-27 14:47:00", 
      "id": 4271, 
      "responses": 24, 
      "subject": "prior weston school", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2636"
    }, 
    {
      "body": "Another Saturday, another 8 a.m. start for jackhammering. Skanska/EDF is digging up Whitecross St. outside the school for \"emergency\" cable work so the curb can be installed. Obviously the companies have figured out there is no enforcement, so they can call everything an \"emergency\" and do what they like. I have contacted the city environmental services but the work may be in Islington and the duty officer wasn't well versed in the work rules.", 
      "date": "2008-02-23 10:43:00", 
      "id": 3523, 
      "responses": 9, 
      "subject": "Saturday noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4049"
    }, 
    {
      "body": "Do any Barbican parents have any views on the Charterhouse Square School and The Lyceum School ? I have seen in the press that there was a controversial OFSTED report on Charterhouse Square.  I haven't managed to arrange a visit to Lyceum yet.  Thanks.", 
      "date": "2008-01-03 13:23:00", 
      "id": 3548, 
      "responses": 9, 
      "subject": "Charterhouse Square School and The Lyceum School", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3904"
    }, 
    {
      "body": "will it be open on time april ", 
      "date": "2008-02-07 21:45:00", 
      "id": 3785, 
      "responses": 8, 
      "subject": "golden lane campus", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3991"
    }, 
    {
      "body": "Do many residents attend GSMD concerts/productions? In general, are they any good?", 
      "date": "2006-01-03 14:25:00", 
      "id": 3023, 
      "responses": 7, 
      "subject": "Guildhall School", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2006"
    }, 
    {
      "body": "The City of London School for Girls has a planning application in with the City to replace the grass playing surface below Thomas More and Mountjoy with an all weather synthetic surface.  The application admits that local residents may notice the 'loss of the \"feel\" of a real grass area'. To mitigate this, the school proposes to relandscape the surrrounding planters so as to enhance biodiversity, including planting native shrubs which will encourage birds and butterflies.   What do we think about this and why haven't we been asked to comment? What does the 'real' feel like?  I'm concerned that we might get some hideous bright green fake sward (or purple, or blue, or brown). The improved planting and maintenance propsed in the biodiversity report sounds good, but I wonder whether this is a proposed simply to placate opposition. It would be better to have the enhanced biodiversity planting and the feel of real grass.", 
      "date": "2006-12-29 11:45:00", 
      "id": 4121, 
      "responses": 7, 
      "subject": "Playing Field at City of London School for Girls", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2863"
    }, 
    {
      "body": "Hello I've got a 9 month old baby here in the Barbican, and I've been trying to get information from the Corporation about Childcare places (and, later on, school places) in the City. The Corporation themselves don't seem very sure what they offer. I know that there are several private nurseries (that I can't afford). Does anyone know what's the deal with 'local authority' provision of nursery care? And, if Sir John Cass is the only primary school in the City, is that where my son has to go? Does he automatically get in? (even though we're not C of E). Thanks for any help! A Confused Parent...", 
      "date": "2005-04-19 15:47:00", 
      "id": 2916, 
      "responses": 5, 
      "subject": "City childcare & schooling", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1577"
    }, 
    {
      "body": "Does anyone have any details of the planning application for the school in Whitecross Street to be extended extensively to cover the whole playground area? It's under Islington Council. This will mean at the very least that all the lovely trees will come down, more congestion in Whitecross Street etc.", 
      "date": "2005-06-20 08:27:00", 
      "id": 4671, 
      "responses": 5, 
      "subject": "PLANNING APPLICATION", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1699"
    }, 
    {
      "body": "Our son is due to start primary school this year and we have to decide which of the schools to send him to. Does anyone have experience with either of these schools? We woud be grateful of any pointers... Thank you.", 
      "date": "2005-05-09 20:24:00", 
      "id": 4711, 
      "responses": 5, 
      "subject": "Prior Weston or Cass?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1621"
    }, 
    {
      "body": "where can one find information about pre-prep(age 3 to 7) schools  around barbican...any websites/forums etc...any help is appreciated.", 
      "date": "2007-06-15 21:32:00", 
      "id": 3354, 
      "responses": 4, 
      "subject": "pre-prep schools near barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3424"
    }, 
    {
      "body": "Does anyone know what goes on in the school on sundays? Twice I've walked past to see a Chinese community gathering and yes, I'm very nosey, so just wanted to see what was happening!", 
      "date": "2006-12-18 10:51:00", 
      "id": 3271, 
      "responses": 3, 
      "subject": "City of London school on Sundays", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2843"
    }, 
    {
      "body": "... a friend is looking for a Central London fee paying school for her 3/4 year old girl.  Any recommendations?  Both parents are working so it needs some post 3 pm arrangements.", 
      "date": "2005-08-22 12:10:00", 
      "id": 2978, 
      "responses": 2, 
      "subject": "City Centre Pre Schools ....", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1816"
    }, 
    {
      "body": "Our 5 year old is starting primary school at Prior Weston in September and we wonder if there is any suitable after school club in the vicinity that you could recommend.", 
      "date": "2005-07-05 08:17:00", 
      "id": 4681, 
      "responses": 2, 
      "subject": "After School Care", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1726"
    }, 
    {
      "body": "if the corporation can provide private schools in the city can it not provide a state school for city residents no matter how small do we not pay council tax for this?should our children be fobbed of to other bourghs ", 
      "date": "2005-04-25 12:50:00", 
      "id": 2922, 
      "responses": 1, 
      "subject": "corporation owned schools in the city", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1588"
    }, 
    {
      "body": "is there somewhere on the estate that teach children music at the weekends? any info would be helpfull thanks", 
      "date": "2006-01-08 09:47:00", 
      "id": 3025, 
      "responses": 1, 
      "subject": "childrens music lessonson the estate", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2023"
    }, 
    {
      "body": "We're overseas at the moment but coming home within the next 2 years so I'm looking at schooling in readiness.  How is the Academy and are there any alternatives? Any advice appreciated!", 
      "date": "2008-02-10 13:19:00", 
      "id": 3497, 
      "responses": 1, 
      "subject": "secondary schools - any advice sppreciated", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4005"
    }, 
    {
      "body": "why have they decided to chop half a meter of the width of the pavement  ouside the shops and school?", 
      "date": "2008-02-26 13:31:00", 
      "id": 3526, 
      "responses": 1, 
      "subject": "pavement reduction whitecross st", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4063"
    }, 
    {
      "body": "As I remember, when the Girls School was getting permission to replace the grass on their playing surface with a synthetic all-weather surface, one of the blandishments tossed up to nearby residents was that the planting around the field would be renovated. There's a strip of planters along the southern edge, and a larger, wilder section above the playing surface on the northern side (with numerous lost tennis balls amongst the wild flowers and shrubbery).  I can't see that any new landscaping has happened, especially on the planters on the southern side. I realize that I should be asking the CoL School about this, but before I do, I wonder if anyone has any inside news, or better ideas? (ps: Tuesday nights seems to be football night for a bunch of large hairy men, who play seven a side football on the all weather surface. I've no problem with that, but I'm surprised that a girl's school can furnish a team for a competition like that).", 
      "date": "2008-05-06 21:15:00", 
      "id": 3570, 
      "responses": 1, 
      "subject": "Gardening around CoL Girls School all weather play surface", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4312"
    }, 
    {
      "body": "I have just picked up a flyer distributed by the school on Whitecross Street advertising their open days on Saturdays 26 April, 3 May, 10 May and 17 May when they are offering tours of the building between 10am and 11am on those days. It is well worth taking a look inside the building, which is beautiful in my opinion.", 
      "date": "2008-04-22 18:19:00", 
      "id": 3883, 
      "responses": 1, 
      "subject": "GoldenLaneCampus School open day", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4266"
    }
  ]
}