{
  "summary": [
    {
      "body": "For residents information. 18 Jun 2007  ALLOW EXTRA TIME FOR FORMALITIES IF FLYING TO SPAIN As of 19 June the Spanish authorities will require passengers flying in from the UK to provide personal details prior to departure.  The new security measures are likely to cause delays at check-in; passengers should allow additional time for airport formalities. Some airlines are reportedly enabling travellers to provide the relevant personal details online; personnel should check with their carrier for the availability of such a service, which would reduce delays at the airport. Personnel should comply fully with the request for such information, because failure to do so could result in the airline refusing permission to travel. The Spanish government has introduced the advance passenger information (API) regime as part of its counter-terrorism measures. Passengers are obliged to provide airlines with their name, date and place of birth and passport number; the information will then be sent to the Spanish authorities before the flight is allowed to depart. The rules apply to any passenger travelling from the UK to Spain, irrespective of nationality. Spain is the first member state of the European Union (EU) to introduce the API requirement, which will be rolled across the bloc over the next 12 months. Regards  John", 
      "date": "2007-06-19 08:34:00", 
      "id": 3351, 
      "sentiment": 1, 
      "subject": "FLIGHTS TO SPAIN", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3426"
    }, 
    {
      "body": " Welcome to our thread! Through this section, you will be able to post problems that you believe the Neighbourhood Policing Team for the Barbican and Golden Lane Estates should know about.  Using the email contact details below, you can also contact us directly.   This thread is also a fast and reliable way of keeping you informed of any events or news we feel you should be made aware of.  Please feel free to post any ideas / feedback about this thread.   Thank you.  (Barbican Residential)  Duty Mobile: 07921 095346 E-mail:     (Barbican Business)    Duty Mobile: 07711 036488 E-mail:     (Coleman Street Ward) Duty Mobile: 07921 095336 E-mail:    Barbican Police Office Number: 020 7601 2456  (Golden Lane Estate) Tel:0845 456 35 95 (Local number)  Contacts the Golden Lane Police Office then if not answered diverts , at no extra cost to the caller, to Officer's mobile phone(24hrs). E-mail:    To learn more about the Team, please click on the website icon below.[/b]", 
      "date": "2006-05-05 17:52:00", 
      "id": 4274, 
      "sentiment": 1, 
      "subject": "Your Police - WANTED POSTERS (2)", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2257"
    }, 
    {
      "body": "Hello John, In your latest update, you note the four offences involving driving and mobiles.  I understand the last two but what are Cause use of mobile phone while driving motor vehicle on a road Permit use of mobile phone while driving motor vehicle on a road Could you explain please? thanks, Portia", 
      "date": "2007-02-23 19:56:00", 
      "id": 5244, 
      "sentiment": 1, 
      "subject": "Question about mobile phone use while driving", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=3081"
    }, 
    {
      "body": "City of London Police Information Update National Threat Level  The current threat level is SEVERE The Security Service offer two e-mail lists to provide subscribers with updates on the national threat level and notifications of new items being published on the Security Service website. Further information can be obtained from  . If you have any information, The Anti-Terrorist hotline can be called on 0800 789321. Further information regarding press releases can be obtained from the police uk website at    International Terrorism The City of London Police are investigating a small number of incidents of suspected hostile reconnaissance.  These incidents are currently being assessed to establish the exact nature of the behavior.   The City of London Police request that you remain vigilant and report any suspicious activity or behavior promptly. Sri Lankan Tamil Tigers (LTTE) have carried out attacks on Colombo in Sri Lanka. The rebels have been fighting the armed forces of the predominantly Sinhalese government for much of the past twenty years.  They want to establish an independent homeland for the minority Tamils in the north and east of the country.  Domestic Terrorism & Extremism SHAC protests have continued in London over the past week, and in particular two protests in the City of London.  Demonstrations were peaceful, low in numbers, and compliant with Police requests.  Information has emerged that a demonstration is being planned for the 27th April 2007, to be titled March Against the Money Men II.  At this time the City of London Police has no information on anticipated numbers for the event, however at this stage it is not expected to be a large event.  A similar event last year passed off without significant incident.   On 26th March, Sinn Fein & the Democratic Unionist Party held an unprecedented face-to-face meeting in which they committed to sharing power in a devolved Northern Ireland Assembly to be reconvened on 8th May.  This is a major step forward in the restoration of peace in Northern Ireland. Dissident republican groups are still committed to disrupting the efforts of Sinn Fein/PIRA and the Unionists to restore peace and shared power in Northern Ireland. All Dissident Groups have the aspiration to remount an attack on the UK mainland.  The threat from Irish Dissident Republicans remains Real and Credible.  Images of England Images of England, is an English Heritage, Lottery Funded project, which aims to create and make accessible via the Internet a point in time photographic record of Englands listed buildings.  A website, featuring photographs taken for the project is available at   Volunteers from camera clubs will take the photographs.  Each has a signed identification card, with their photograph.  They will also carry leaflets for occupiers of listed buildings, which include contact details, if they have any questions about the project.  Local press campaigns will advertise the event.  Occupiers uncomfortable with the idea of photographs of their premises appearing on the Internet may apply to have the publication of the photograph to be postponed until September 2013. The City of London Police advise that the community be aware of the possibility for hostile reconnaissance, and report all suspicious activity promptly.  City of London Police named Lead on Fraud The Attorney General, Lord Goldsmith has announced the creation of a National Fraud Strategic Authority and National Fraud Reporting Centre, extending the remit and providing an increased role for City of London Police. In a response to the Fraud Review consultation, the Government has set out a range of next steps in tackling fraud:  Setting up a new fraud-busting body, a National Fraud Strategic Authority, to co-ordinate and lead fraud prevention work;  Designing a National Fraud Reporting Centre to gather intelligence and measure fraud, and provide a one-stop shop for victims from across the public, private industry, and government departments;  Support extending the remit of the City of London Police to become the national lead police force on fraud (presently lead force for fraud in the South-East);  Create a Programme Board made up of key stakeholders in the fight against fraud to drive forward progress;  Review of how fraud is dealt with in the courts, looking at the potential benefits of a financial courts jurisdiction with specialist judges so that all aspects of fraud proceedings can be dealt with in one place;  Explore a way of encouraging early guilty pleas through a safe legal framework, which protects defendants rights but also improves the experience of victims.  The findings of an independent report commissioned by the Association of Chief Police Officers Economic Crime Portfolio Group, consisting of representatives from both public and private bodies, estimated that fraud costs the UK nearly 14 billion per year.  Fraud advice, call the Fraud Desk 0207 601 2229 The Fraud Desk operates between 0800 and 1800 hours Monday to Friday.  It is a telephone-based service to take initial action concerning fraud within the jurisdiction of the City of London Police.  They will be your first point of contact.  (Outside these hours, in an emergency only, call 020 7601 2222).  They respond to all initial allegations of fraud, liaise with other forces and agencies, assist with 'in-force' requests for advice and offers fraud prevention advice.  Early recognition of a fraud can be vital to reducing the loss and maximising the recovery of assets and prosecution of the offender(s).  If you require advice, want to report a crime, or even discuss a suspicion that a crime is being carried out call the Fraud Desk on 0207 601 2229.  Do not delay - waiting could make the investigation more difficult. City companies who would like a presentation on preventing fraud, given by City of London Police officers using a specially prepared presentation pack, should also phone Fraud Desk to enquire about arrangements. Forthcoming Events 3rd April 2007 - A demonstration is expected at St Pauls Cathedral by Friends of the Earth.  No significant incidents are currently anticipated as a result of this demonstration.  Traffic Bulletin MAJOR WORKS THIS WEEKEND: FRIDAY 30/3/2007 to SUNDAY 1/4/2007 Thus (a telecommunications company) are currently working in the southbound bus lane in FARRINGDON ST undertaking remedial works.  Works are expected to continue until early Sat morning. CHEAPSIDE will be closed eastbound between New Change and Gutter Lane, with a diversion via New Change, Cannon St, Queen Victoria St, and Queen St (8am Sat to 6pm Sun). A crane operation will close the junction of OLD BROAD ST and THREADNEEDLE ST, with northbound / eastbound traffic diverted via King William St, Gracechurch St and Bishopsgate, and southbound / westbound traffic via Wormwood St, Camomile St, Outwich St, Houndsditch, Bishopsgate, Gracechurch St and King William St to Bank. TfL will close UPPER THAMES ST eastbound between Puddle Dock and Arthur St for a crane operation from 8am on Sat to 6pm on Sun.  Traffic will be diverted via Blackfriars Bridge and Southwark St to London Bridge. LB Islington will close CHISWELL STREET between Moor Lane and Finsbury St for a crane operation on Fri (evening), Sat, and Sun. Minor road closures expected this weekend include Beehive Passage, Playhouse Yard, Plumtree Court, St Bride Street, Bread St (Cannon St to Watling St), Lime St and Austin Friars. Filming will take place this Saturday in Lombard St and Princes St around Bank junction, with parking in Lombard St, Nicholas Lane, and George Yard.   MAJOR WORKS NEXT WEEK: MONDAY 2/4/2007 to THURSDAY 5/4/2007 LONDON WALL west of Old Broad St has been reduced to one lane westbound for south footway improvements until April 2007.   LUDGATE HILL - Works continue in Ludgate Hill on temporary lights until mid April. BISHOPSGATE / CAMOMILE ST / WORMWOOD ST : Lane closures expected to last until late May.  Camomile St and Wormwood St reduced to one lane eastbound and Bishopsgate to two lanes southbound.  Heavy traffic disruption is anticipated. QUEEN ST / QUEEN VICTORIA ST  Queen St is closed southbound for kerb works by FM Conway until 31 March. Long-term road closures include Great Winchester St, Southampton Buildings, Foster Lane, Salisbury Court, Old Jewry, Lombard St, Carter Lane, St Bride Street, Whitehorse Yard, Throgmorton St, Charterhouse Square, Wood St south of Gresham St (s/b), Tudor St (w/b) at Kingscote St and Bow Lane. TfL will close VICTORIA EMBANKMENT SLIP ROAD FROM BLACKFRIARS BRIDGEHEAD for anti-skid resurfacing from 8pm each evening, Mon to Thurs night.  LIME ST between Leadenhall St and Fenchurch Ave will be closed for crane operations from 7pm each evening from Mon to Fri. Following the completion of works on Lower Thames St, Clancy for Thames Water have re-established their site at CANNON ST by WALBROOK.  This requires the use of temporary traffic lights and will be in place until June. THAMES WATER VICTORIAN MAINS RENEWAL PROGRAMME Thames Waters contractor, Clancy Docwra, can be contacted direct at  , and continue to work in the following locations: Road Closures: Mansion House St, Tudor St, Rood Lane, Idol Lane, Dorset Rise and St Mary Axe Free movement: Salisbury Court, Great St Helens, Fleet St, Whitefriars St, Temple Ave, Devonshire Sq, Victoria Embankment, Gravel Lane, Middlesex St, Bury St, Cutler St, Gloucester Ct, Fenchurch St, Mincing Lane and Bishopsgate / Camomile St / Wormwood St. Traffic Lights: Cannon St by Walbrook ADVANCE WARNING For the first time in several years, the underside of 125 LONDON WALL at the junction with Wood St will be cleaned and repaired over the four day Easter weekend.  This involves the use of a contra-flow along London Wall from Noble St to Coleman St, and the closure of either Wood St north of London Wall, or Wood St south of London Wall, depending on which side of the London Wall carriageway works are taking place at the time.  Further details will be included in next weeks bulletin. Dates for your diary  major events this year include: 22 April  London Marathon 3 June  Race for Life Road Race 8 July  Tour de France  19 July  Great City Race 10 November Lord Mayors Show A full list of all current and future highway activities on the Citys road network can be found on the City Corporations web site:   Details of works on the Transport for London Road Network (the Red Routes) can be found on TfLs web site:   PLEASE NOTE: The City of London Police is unable to guarantee the timeliness of the community e-mail system due to current technological difficulties with the system.  This may mean that some recipients may not receive this message as quickly as we would wish.  We hope to rectify this problem within the next month.  For active messaging, we will continue to use the Pager Alert system.  This message was originated at 1435 hours on 30.03.07 for your information.", 
      "date": "2007-03-30 13:49:00", 
      "id": 5245, 
      "sentiment": 1, 
      "subject": "Community Infomation Update 30/03/07", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=3190"
    }, 
    {
      "body": "At a local Ward Panel Meeting held at the YMCA on 29th March 2007, the Ward Constables agreed to investigate and tackle the following issues in the area defined as Cluster 6. (Please click on the website icon below for further information about Cluster 6):  Ward Constables will complete a progress report to be presented on the 10th of MAY 2007. Should you wish further information about Ward Panels and how you could get involved, please e mail me using the cluster 6 e mail address below. Yours", 
      "date": "2007-04-10 20:26:00", 
      "id": 5246, 
      "sentiment": 1, 
      "subject": "Local Policing Priorities:", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=3217"
    }
  ]
}