{
  "summary": [
    {
      "body": "Hi, I live in Andrewes and want to fit a timer to my water boiler. Has anyone had any experience doing this?  I was thinking about putting it on the face plate near the switch to turn it on but believe it may be possible to use one of those timer plugs. Slight problem with the second option - i have no idea where the tank is! Any ideas?", 
      "date": "2005-11-30 17:06:00", 
      "id": 4626, 
      "responses": 10, 
      "subject": "Fitting a timer to the water heater", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1967"
    }, 
    {
      "body": "Hello everyone - I've just moved into a large studio in John Trundle.  I was wondering if anyone could help advise on a question regarding the hot water. After I've run a bath I find that if I want to top it up the water that comes through is cold.  Looking at the boiler it seems big enough to hold water for more than one bath - so I can only imagine that the used hot water is immediately replaced by cold water straight from the mains, which then cools down what is left of the hot water in the boiler.  Any advice would be appreciated! Alex", 
      "date": "2005-11-19 16:24:00", 
      "id": 3004, 
      "responses": 8, 
      "subject": "Hot Water", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1942"
    }, 
    {
      "body": "Hello all - am hoping someone can help us out as to the whereabouts of our bathroom water boiler! A couple of nights ago the water suddenly went cold, and will not re-heat. We got a plumber round but he couldn't find the boiler anywhere so couldn't fix the problem. He rang Frank Harris, who also professed to have no idea. Apparently they will do an \"investigation\" although I fear that this will mean waiting rather a long time for them to make various phone calls to the Estate Office. Does anybody know where the bathroom water heaters in Andrewes House are located? We have viewed a fair few Barbican flats and most of them do seem to have heaters located in wardrobes or in their own cupboards but this doesn't seem to be the case with Andrewes. Any help greatly appreciated.", 
      "date": "2006-09-27 09:18:00", 
      "id": 4272, 
      "responses": 7, 
      "subject": "Bathroom water boiler", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2635"
    }, 
    {
      "body": "Does anyone know of an alternative to the huge boilers in the cupboards. They take up so much space in the cupboards that I'm sure a modern equivalent would be smaller. Alternatively, could they be mounted higher so giving more room for clothes.", 
      "date": "2007-04-24 20:41:00", 
      "id": 4252, 
      "responses": 6, 
      "subject": "Replacing large Barbican boilers", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3269"
    }, 
    {
      "body": "I have had my Water Heater switch on all day and I have no hot water. The light has also gone off. Aside of 'your boiler is broken'...am I missing a trick?", 
      "date": "2007-04-22 17:07:00", 
      "id": 4249, 
      "responses": 5, 
      "subject": "boiler", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3258"
    }, 
    {
      "body": "The water from my hot water cylinder is heated to a very high temperature. Yesterday a toddler got a nasty burn from the hot water tap, so I must now turn the thermostat to a lower setting. From a book I have this looks like quite a simple operation, but I would like to know if anyone has done it themselves and can confirm my impression.", 
      "date": "2007-04-09 12:10:00", 
      "id": 4371, 
      "responses": 3, 
      "subject": "Thermostat adjustment", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3213"
    }, 
    {
      "body": "Does the fact that I couldn't get any hot water in my studio (rented) today mean that its a problem with my hot water tank, or a building problem. I probably sound like an idiot, but I really don't know the answer.  Any enlightenment appreciated  Ruby", 
      "date": "2007-08-10 21:33:00", 
      "id": 3393, 
      "responses": 2, 
      "subject": "HOT WATER IN JOHN TRUNDLE", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3579"
    }, 
    {
      "body": "We live in Willoughby House and the hot water in the kitchen is run from a separate boiler from the hot water in the bathroom, I assume that this is the same system in other flats in WH. Has anyone else suffered problems with the small boiler under the kitchen sink, and if so can you recommed a reliable plumber?", 
      "date": "2006-10-29 20:17:00", 
      "id": 4309, 
      "responses": 2, 
      "subject": "Hot Water", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2709"
    }, 
    {
      "body": "Does anyone know how long hot water cylinders are supposed to last? Ours is about 5 years old, the heatign elements have been changed once in that time - they were absolutely caked in limescale.", 
      "date": "2007-10-02 21:16:00", 
      "id": 3441, 
      "responses": 1, 
      "subject": "Hot Water Cylinders", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3705"
    }
  ]
}