{
  "summary": [
    {
      "body": "Hi - can anyone enlighten me re long leaseholds? I read an article (not re Barbican) that suggested leaseholders should negotiate a lease extension at the earliest opportunity (ie with as long left on as possible) as this would be much cheaper than waiting until there were even say 80 or 90 years left. Is this an option with Barbican flats? How many years do the long leaseholds have left to run? I suspect it is a non issue (possibly estate agents touting for business elsewhere), but would appreciate any views Thx", 
      "date": "2005-05-09 11:54:00", 
      "id": 2932, 
      "sentiment": 2, 
      "subject": "Long Leasholds", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1617"
    }, 
    {
      "body": "One page flier advertising a one evening consultation meeting posted through Speed House doors today.  Private company to build the flats and sell them but not clear if the freehold will remain with corporation.", 
      "date": "2008-01-24 00:15:00", 
      "id": 3613, 
      "sentiment": 2, 
      "subject": "Frobisher crescent to be turned in to flats", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3947"
    }, 
    {
      "body": "An article today in the Sunday Times makes interesting reading.  Is it indicative of how choices concerning building in the City are made?  I wonder if Mr. Ronson, who they point out was convicted of fraud, will take legal action?  I wonder if the principal person who backed the scheme and is behind the Morgan scheme will now have to justify himself?  I wonder if the procedures by which planning applications are dealt with need review.  Is a judicial review required?", 
      "date": "2008-03-16 09:32:00", 
      "id": 3816, 
      "sentiment": 2, 
      "subject": "Milton Court and Sunday Times claims", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4129"
    }, 
    {
      "body": "I am very much looking forward to moving into a large-style studio later next month.  It currently has a badly-laid, cheap, laminate floor throughout.  I realise this is in breach of the lease, and shall be removing it. I'm considering stripping the floor back to its original concrete, and painting it white.  Has anyone already done this in their flat?  Any tips or warnings?  Is special paint required because of the under-floor heating?  Being a DIY-loser, could you recommend someone who knows how to make good, paint and seal a concrete floor? Any sage words would be much appreciated! Nigel", 
      "date": "2006-08-24 10:31:00", 
      "id": 4461, 
      "sentiment": 2, 
      "subject": "Concrete floor", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2554"
    }, 
    {
      "body": "I've noticed recently that the corporation seem to be selling off a lot of their flats. Presumably this is because the tenants that lived in them have died or moved on and the corporation doesn't want to get new tenants in. Does anyone know what will happen when they sell off all their flats, which presumably they will do at some point? Will this have any implications for our lease? i wonder if we're going to all have to buy a share of the freehold or something. On a seperate point, has anyone extended their lease?", 
      "date": "2005-10-27 17:22:00", 
      "id": 4504, 
      "sentiment": 2, 
      "subject": "Being sold on behalf of the corporation...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1909"
    }
  ]
}