{
  "summary": [
    {
      "body": "I know that the following is going to cause a stir. I swear I am writing this with no intention whatsoever of provoking anyone but to canvass views on the subject. I have a friend whose dream is to move to the Barbican. His only \"problem\" is that he owns a little, cute, lovely and well trained dog.  The dog does bark every now and then. But, having said that the new born baby opposite screams keeping me awake most nights and the next door neighbour blows her hair dry at 6.30-6.45 every morning (saturdays and sundays included)!   My friend fully understand that keeping a dog in a block of flats requires extra care to minimise the impact on other residents (e.g. he would never let the dog running around in the gardens fouling the grass-mind the geese already do!). In fact, he already lives in a \"well-to-do\" block of flats in Clerkenwell and has never had any complaints about the dog. Most residential leases of blocks of flats contain restrictive covenants about the keeping of pets. However, these are generally regarded as \"old fashioned\" and as such largey ignored and seldom enforced. Why cannot be the same in the Barbican? Why people have to be deprived of the joy of having a pet? Why cannot pets be allowed (perhaps subject to introducing \"ad hoc\" rules)?   I am also thinking here of the elderly residents to whom the company of a cat and/or small dog could make such a difference.", 
      "date": "2006-08-18 11:19:00", 
      "id": 3167, 
      "sentiment": 3, 
      "subject": "Pets", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2537"
    }, 
    {
      "body": "I discovered recently that Holmes Place Barbican has significantly reduced its off-peak hours (but of course without any corresponding reduction in its membership fee). They've also introduced a new rule that off-peak members aren't admitted more than 30min before the end of the off-peak period and need to leave before it ends - before so long as you entered within the off-peak time you could stay as long as you liked. Aside from meaning they now offer considerably worse value for money for off-peak members, this is plainly in breach of their membership conditions (which do not mention them having any right to vary off peak hours). I strongly urge any off-peak members to write to the manager, Andy Francis, and ask him to reinstate the previous rules, or at least offer a significant reduction in price.", 
      "date": "2005-09-09 18:18:00", 
      "id": 3234, 
      "sentiment": 3, 
      "subject": "Holmes Place hours change", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1835"
    }, 
    {
      "body": "No one else has probably noticed, but the Arts Centre have installed a couple of new chillers on the roof for the air conditioning for the art Gallery (over by the conservatory). I'm not fussed about what they look like but when the winds in the wrong direction they make a terrible racket which I can hear from my flat. Does any one else in the east & south facing Shakespeare flats and Gilbert hear it? It's a short .. er .. farting sound as the fans start and stop, every 20 seconds or so. Most annoying.  Checking out the planning application, it seems as if they should have an acoustic enclosure and be modified not to start and stop so abrupty. But this has not been done yet. Does anyone know who I should write to in the arts centre to jolly them along and discharge their planning conditions? Ta BB", 
      "date": "2007-09-25 17:55:00", 
      "id": 3433, 
      "sentiment": 3, 
      "subject": "Strange noises from the roof of the Arts Centre", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3689"
    }, 
    {
      "body": "One of the advantages of living in the Barbican is the availability of car parking spaces to all residents (for a fee), and also the availability of spaces for guests (free of charge, for up to 5 hours I think). If the Corporation reduces the number of spaces, and creates scarcity, then first of all it will feel justified in increasing the fees associated with the parking - that's simple economics (cf the huge rent increases they wanted to impose on our underground storage rooms, where there is scarcity).  And secondly new residents may find that a parking space is very difficult to get hold of - thereby potentially reducing the value of our property in the market. When I bought my flat the ease of acquiring a parking space directly below my building was a distinct selling point. It seems to me that the easy availability of parking is a benefit we all currently enjoy (even if we don't have a car), and if we lose that benefit then the Corporation should compensate us.", 
      "date": "2007-11-11 12:49:00", 
      "id": 3468, 
      "sentiment": 3, 
      "subject": "loss of car parking spaces", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3785"
    }, 
    {
      "body": "IF you are disturbed by the current illegal cable laying in Aldersgate street, please call the guidhall to complain 606 3030.  They then tell environmental health. They've just run away, leaving all their kit but they are the kelley group, and the more complaints the better my big question is why is there no enforcement of the rules on raod works?", 
      "date": "2008-02-25 22:29:00", 
      "id": 3527, 
      "sentiment": 3, 
      "subject": "Aldersgate St roadworks 10 pm", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4060"
    }
  ]
}