{
  "summary": [
    {
      "body": "We live in a type 21 flat in Speed House which had the garchey removed a couple of years ago [thankfully]. However we still find that charming garchey smell makes it's way through the plumbing into our flat - meaning we have to rememeber to put the plugs in the sinks and fill them with water before we go out. Can anyone tell me if this problem is enedemic to the estate or is there perhaps just a problem with one garchey on the services column that we share?  Or to put it another way, is this something that might be solved by helping a neighbour get their garchey cleaned, or is it just something we are going to have to live with?", 
      "date": "2008-02-09 13:32:00", 
      "id": 3502, 
      "responses": 9, 
      "subject": "Garchey smells", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4001"
    }, 
    {
      "body": "Hello everyone,  We love the Barbican and have been renting here for a while but now want to buy. However the price of the apartments here are astronomical (and we are looking for a 2 bed flat). We have noticed though that the Golden Lane flats seem to be a lot cheaper. But what is it actually like to live there? Ok I am not expecting it to be as fabulous as the Barbican (chiefly because I suspect nowhere can be!) but what is it like in terms of safety, in terms of neighbours, in terms of flat construction (ie noise problems?), in terms of Estate Office responsibility (ie they are very responsive to Barbican dwellers - is it the same with Golden Lane?). Are there any communal areas like the Barbican Gardens? What is the mix of residents like? Any views or information, positive or negative is welcomed!", 
      "date": "2006-06-19 20:10:00", 
      "id": 4431, 
      "responses": 7, 
      "subject": "What's it like living in Golden Lane Estate?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2378"
    }, 
    {
      "body": "I have heard on the grapevine that one of the residents of Andrewes House has an interest in a company that provides moth control at an exhorbitant price. Has anyone approached you about moth control of offered bizarre and incorrect information about these creatures?  If so, be aware that their intersts are not your interests! Moreta", 
      "date": "2006-10-05 22:52:00", 
      "id": 4279, 
      "responses": 5, 
      "subject": "Moths", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2660"
    }, 
    {
      "body": "Anyone know who's having a party in Speed Gdns tonight ?", 
      "date": "2007-07-11 17:49:00", 
      "id": 3788, 
      "responses": 4, 
      "subject": "party in Speed Gdns ?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3489"
    }, 
    {
      "body": "Why do we bother lobbying to have pubs and clubs around the Barbican controlled for opening hours and noise disruption, when our own neighbours cause such a ruckus? Last night someone in Speed House held a really obnoxiously noisy party. Every few minutes there was some mad screaming until about 2.30 am. The noise enemy is within.", 
      "date": "2005-08-06 10:41:00", 
      "id": 2960, 
      "responses": 3, 
      "subject": "Noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1791"
    }, 
    {
      "body": "Riots in and outside the YMCA, paint colour wars, satanic children and smashed glass in BJH and drunken hoodies under Bunyan. What's going on on our northern fringes? Is there something in the water? ", 
      "date": "2006-05-06 22:29:00", 
      "id": 3097, 
      "responses": 2, 
      "subject": "what's up??", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2266"
    }, 
    {
      "body": "In 2006 the Breton House and Ben Jonson House Groups consulted with residents and recommended colour schemes for pending external redecoration. A few residents in BJH  complained about the process and the colour recommended by the Breton House Group was rejected as being outside the accepted palatte of colours, so those proposals were scrapped. This year the Estate Office initiated a formal ballot of lease holders of the two blocks within a limited and accepted palette of colours.  Agreement was achieved. Redecoration was due to start next week.   Following complaints from three leaseholders about the agreed colour scheme, the work has been put on hold and is now due to be referred to the full City Planning Committee in September. Further appeals to English Heritage may follow. All of this costs us money. I've lived here for over 25 years and have never encountered anything like this.  ", 
      "date": "2007-08-10 17:14:00", 
      "id": 3391, 
      "responses": 2, 
      "subject": "Redecoration Breton and BJH", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3577"
    }, 
    {
      "body": "For those wondering where the Thanksgiving Fireworks are coming from - 9PM on 22 Nov - you'll no doubt be delighted to know some decent resident in the West Half of Ben Jonson is actually launching them of his or her balcony on the 4th floor facing south.", 
      "date": "2007-11-22 21:02:00", 
      "id": 4148, 
      "responses": 1, 
      "subject": "THANKSGIVING FIREWORKS", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3811"
    }
  ]
}