{
  "summary": [
    {
      "body": "i've just had broadband installed into my flat in defoe house and i need someone to come in and help set it up on my laptop as i'm completely useless at this sort of thing. Does anyone know of someone/a company that will do this? everywhere i've tried through the yellow pages have said that they only deal with businesses etc. it's getting desperate. thanks.", 
      "date": "2006-01-23 11:25:00", 
      "id": 4569, 
      "responses": 9, 
      "subject": "computer help", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2040"
    }, 
    {
      "body": "I want to upgrade my phone line to broadband.  My flat has phone/ethernet wiring running from a wiring closet to all rooms in my flat.  I suspect that the best thing would be to put the modem/router in the wiring closet. Does anyone know a firm/person who can do telephone/computer wiring?", 
      "date": "2008-02-20 22:13:00", 
      "id": 3831, 
      "responses": 3, 
      "subject": "Telephone wiring", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4043"
    }, 
    {
      "body": "My laptop is broken. Can anyone recommend a good computer repair person? Thanks", 
      "date": "2008-02-27 08:18:00", 
      "id": 3833, 
      "responses": 3, 
      "subject": "looking for good computer repair person: any recommendations", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4064"
    }, 
    {
      "body": "Hi I've finally got around to convincing myself that I need a new laptop (mine is 7 years old) and would appreciate any advice on where to go to arrange for it to be installed.  I'm planning to buy a wireless router and printer too.  I suppose I will also need to transfer what's on my existing laptop to my new one (just a few photos and some music). I imagine that it would be pretty easy for someone who knows what they are doing, but I don't so I know it would be a disaster if I tried myself! In an ideal world, it would be a company that could come this Saturday as have bought myself a fancy new iphone but my old laptop is too rubbish to support it (needs USB 2 apparently) so it is just sitting there feeling sorry for itself at the moment... I have tried doing a google search and searched this forum but not had any success.  PC World can't do it this Saturday unfortunately (they are also quite pricey). Thanks very much in advance for any assistance.  And merry christmas! Matt", 
      "date": "2007-12-17 13:27:00", 
      "id": 4179, 
      "responses": 2, 
      "subject": "Setting up laptop/wireless", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3877"
    }, 
    {
      "body": "Hello All,  I'm about to pull my hair out with my printer.  I've successfully set up my wireless broadband and decided to introduce my printer to my router.  My Mac can now see my printer and trys sending stuff to it, but to no avail.  I suspect it's something to do with the way my security is set up on my router but I've exhausted my limited knowledge of wireless networks.  To add to the confusion, we're using both Mac & PC in our flat hence not just having an airport to run everything from.   Any suggestions anyone? Or better still, does anyone know of anyone who charges to come around and sort such IT matters out?  I seem so near, yet so far! Thanks all!", 
      "date": "2006-09-04 10:10:00", 
      "id": 4471, 
      "responses": 2, 
      "subject": "wireless printing hell...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2578"
    }
  ]
}