{
  "summary": [
    {
      "body": "Apologies if this is obvious. Since my last question about maps of the estate, we have been provided with magnificent new maps to guide vistors to our happy homes. These are very nice, especially as they show the high walks and the relation between levels.  Does anyone know where to find an online copy of the new map. The CoL site still gives the old and useless one (useless becuase it doesn't show the high walks). The old map is at <http://www.cityoflondon.gov.uk/Corporation/our_services/barbican_estate/estate_map.htm>. Thanks ps: I think it is a bit odd that the new maps are reoriented in each location they are displayed, so that the supposed way ahead is up. This strikes me as both idiotic and condescending: idiotic because in most locations there are numerous destinations one might be travelling from and to, and condescending, because it presupposes that the readers of the maps can't reorient it themselves.", 
      "date": "2007-08-08 21:55:00", 
      "id": 3405, 
      "responses": 8, 
      "subject": "More on maps of the estate", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3575"
    }, 
    {
      "body": "A long time ago I remember a conversation where people would like access to a site that gave them walking or running directions in London. Well...ta da! I was rather impressed by it I must say.", 
      "date": "2007-03-18 18:00:00", 
      "id": 3295, 
      "responses": 4, 
      "subject": "Walking/Jogging...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3158"
    }, 
    {
      "body": "It may not be widely known (because the library doesn't promote it) that with our library cards we can consult AT HOME such reference works as the OED, DNB, Encyc.Brit.,and others, and listen to the Naxos Music catalogue. From the library's home page click on Online Catalogue / Catalogue (body of text 2nd para.) / Search / Online Resources. Then enter your card number preceded by CLP.", 
      "date": "2008-02-23 14:38:00", 
      "id": 3512, 
      "responses": 4, 
      "subject": "Barbican Library", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4051"
    }, 
    {
      "body": "The full draft [4.2mb] of the revised City of London Community Strategy is on CoLs website for consultation until 14 April 2008. [/url]", 
      "date": "2008-03-31 14:20:00", 
      "id": 3859, 
      "responses": 3, 
      "subject": "Another consultation! - Community Strategy", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4168"
    }, 
    {
      "body": "These aren't specifically relevant to the Barbican -- they're very useful wherever you live -- but I think they'll appeal to a lot of us...  lets you sign up to receive emails when a planning application near your postcode appears on the council's website. It seems to work, and you even get links to the City of London website page for commenting on each application.  lets you report problems near you that the council should deal with: holes in the road, fly-tipping, graffiti, etc. All reported problems are then sent direct to the council to deal with. I've heard that it can actually work... Oh yes, and they're both free!", 
      "date": "2007-05-09 08:41:00", 
      "id": 4336, 
      "responses": 1, 
      "subject": "Two handy websites: Planning Alerts and Neigbourhood Fix-It", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3314"
    }
  ]
}