{
  "summary": [
    {
      "body": "There is a conman operating in the area - we have been approached twice by him now , once by Moorgate Station and once near Cromwell Tower. His blag is that he has been mugged / pickpocketed - he needs 15 to get home and is happy to leave his \"expensive\" leather jacket with you as a deposit.  he's in his late 40's early 50's about 5'8\". We almost fell for it until we quizzed him on his \"mugging\" (it happened at Waterloo and he couldn't explain why he was in Moorgate on the way to Euston Station).  We felt awful for being suspicious but with the second approach obviously vindicated. There 's a similar guy who operates near Euston always dressed in a suit. The worst part is that if it ever happened to me I would hate everyine to treat me with suspicion. Anyway - don't fall for it.", 
      "date": "2007-02-21 23:00:00", 
      "id": 2054, 
      "sentiment": 1, 
      "subject": "Conman operating in the area", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3076"
    }, 
    {
      "body": "We were surprised to find that the station was closed this weekend - not because of the consequences of recent bombings, but because of planned track replacement. Fair enough, maintenance needs to be done. However, no replacement bus service was supplied. I asked about this and was told \"there is never a replacement bus from this station\". I pointed out that I had taken replacement buses dozens of times from Barbican station, and was just met with shrugged shoulders and advice to walk to St Paul's station - which, apart from being a good 10 minutes away, is of course on a totally different line. I've called London Underground to ask why this stretch of line no longer qualifies for replacement bus service. There always seemed to be plenty of people on those buses and if this is going to be policy in future, it will cause a lot of inconvenience.", 
      "date": "2005-07-31 07:48:00", 
      "id": 2949, 
      "sentiment": 1, 
      "subject": "Barbican station closure this weekend", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1773"
    }, 
    {
      "body": "For information, Standard Chartered have their \"Great City Race\" on the evening of 20 July. Some roads on the periphery of the Estate (Aldersgate, London Wall, Moorgate) will be closed, between approx 6.30pm and 8.30pm. All roads will be closed inside a rectangle bounded by London Wall, Old Broad St, Threadneedle St, Cheapside, Newgate St, King Edward St and Montague St.", 
      "date": "2006-07-09 12:42:00", 
      "id": 3187, 
      "sentiment": 1, 
      "subject": "Road Closures - 20 July: Standard Chartered Great City Race", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2441"
    }, 
    {
      "body": "The Neighbourhood Policing Team has been asked to remind BarbicanTalk members that advice on how to lessen the impact of the current heatwave can be found at   or by phoning nhs direct on Tel: 0845 4647 We would also ask, if your neighbour is elderly or infirm, that you just check on them during this time. Although stormy weather is forecast, the temperature is forecast to remain 'high'. If you are worried about the lack of response from a neighbour's premises, please contact the City Police switchboard (020 7601 2222) as soon as possible. Yours", 
      "date": "2006-07-04 12:29:00", 
      "id": 3248, 
      "sentiment": 1, 
      "subject": "Current Heatwave", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2427"
    }, 
    {
      "body": "twice in the last moth i have seen two different people doing this to other people,they will walk past you then aproach with a gold ring saying they have just found it on the ground they get you to take the ring (i think some sort of greed element thing) and ask you for some sort of cash reward for a worthless goldplated brass ring with a hallmark on it ", 
      "date": "2007-05-22 11:26:00", 
      "id": 3324, 
      "sentiment": 1, 
      "subject": "Gold Ring SCAM!!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3353"
    }
  ]
}