{
  "summary": [
    {
      "body": "the other day my partner was on the balcony (we're in bunyan) and saw two large chavettes walking their dog near the lake under bunyan court. they were repeatedly throwing a ball into the water and trying to get their dog to attack the big golden carp in the lake. the dog didn't seem very interested, but they kept trying. my partner yelled out, \"hey! you! leave that fish alone!\" so they sauntered off.  about 20 minutes later, they were back doing the same thing. he shoo'ed them away again. so if anyone's on their balcony in the area, keep an eye out for them. they seemed like they were regular visitors to the lake.  has anyone noticed, btw, that they've added five new goldfish to the bunyan lake? they like to hide under the duck slide. i think the carp is excited to have the company.", 
      "date": "2005-08-27 12:46:00", 
      "id": 2983, 
      "sentiment": 2, 
      "subject": "estate fish in vicious chav dog attack danger!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1820"
    }, 
    {
      "body": "Good Morning I have received infomation on the following mobile telephone scam. People have been receiving calls on their mobiles from the following number, 02920368700 there will be no speech.   DO NOT ANSWER THE CALL AND DO NOT CALL IT BACK.   OFCOM are investigating Regards John", 
      "date": "2006-05-18 07:51:00", 
      "id": 3120, 
      "sentiment": 2, 
      "subject": "Telephone Scam", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2301"
    }, 
    {
      "body": "The Milton Court Project Team would like to ensure that Barbican residents are aware that there are currently notices up on the Milton Court site from the City of London.  These notices are to inform people of the closure of the walkway through Milton Court from next week. The new stairs and lift by Willoughby House are now fully operational for you to use.  A newsletter will be sent out next week to those Barbican residents in closer proximity to the site to inform you of the planned works for the next few weeks.  Should you have any problems with the works on site, please contact Cantillon's Project Manger, Andy Dyson on 07823 442024 or ", 
      "date": "2008-01-04 16:07:00", 
      "id": 3531, 
      "sentiment": 2, 
      "subject": "Milton Court", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3907"
    }, 
    {
      "body": "Barbican Library will be closed to the public between Friday 21 March and Wednesday 9 April whilst the first phase of the programme to replace the Librarys minor electrical wiring and lighting is carried out.  The work will continue in phases throughout the summer and early autumn and will include not only the replacement of existing circuits but also some welcome improvements in terms of increased lux levels and improved provision in areas where, by contemporary standards, lighting levels are inadequate. In a separate piece of work during this closed period new fiction shelving will be installed and the shelf signage for all areas of the General Library replaced with the aim of providing a more welcoming and easily comprehensible layout. I look forward to your feedback on the improvements and apologise for any inconvenience caused by the closure of the Library over the above period.  John Lake Librarian, Barbican Library", 
      "date": "2008-03-11 18:29:00", 
      "id": 3807, 
      "sentiment": 2, 
      "subject": "Barbican Library Closure Period", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4111"
    }, 
    {
      "body": "take care crossing the streets in Feb....!  Shell backs Ferrari F1 with world's costliest ad (from Marketing mag 23 Jan) LONDON - Shell is to seal off the City of London and turn it into a mini Grand Prix-style racing circuit, as part of the filming of an ad highlighting its partnership with the Ferrari Formula One team. The TV execution, whose production cost 2m, making it the most expensive ad ever, will promote Shell's high-performance V-Power fuel. It is intended to support Shell's positioning as the most innovative fuel brand.  The ad will feature Ferrari F1 cars racing through some of the world's most famous cities, including New York and Sydney. The London leg of the ad, being created by JWT London, will be shot on 17 February, with the execution set to air globally in March.", 
      "date": "2007-01-27 22:45:00", 
      "id": 4230, 
      "sentiment": 2, 
      "subject": "Formula 1 in the City: 17 Feb", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2966"
    }
  ]
}