{
  "summary": [
    {
      "body": "Forgive the rant... Today I put my Volvo S60 into the Volvo main dealer (yes I know they're dearer, but the car's quite new and I wanted to maintain the Volvo Service History). Usual thing - they were to give me a call with the prices of the work that was required. Well, the list was as long as the arm of a really tall person (possibly even an orang-utan) and included a number of things that struck me as a bit iffy. 30 quid for a windscreen wiper blade - when I have recently driven the car in the rain and the wiper worked perfectly - struck me as both overpriced and also as an attempt to take advantage. There were a number of other fiddles that I spotted, but the crowning glory was the quote of 225 quid to replace engine coolant. Now I'm not a mechanic, but even I know its nowhere near that expensive, so I rang the ever friendly Batt Bros who usually do my MOT. After collapsing in giggles, they suggested I have a chat with their friends at Cremer Street garages (just off Hackney Road, a 10 minute drive from the Barbican). I took the car there just now and was a) shown how to check the engine coolant myself, and how to change it if it ever needed changing (a 15 minute job, tops) b) shown categorically that the engine coolant was completely full and that, assuming normal usage, there will be no need to top up any further unless we anticipate UK weather being below - 25 to -31 degrees centigrade So on that basis, I would like to suggest that  a) drivers avoid Volvo main dealers like the plague,  b) any lawyers who can advise me if this is attempted fraud get in touch, and  c) that the chaps at Cremer Street and Batt Bros on Cambridge Heath Road are top fellas and deserve our custom. (see recommendation on classified board).", 
      "date": "2007-04-02 17:49:00", 
      "id": 4357, 
      "sentiment": 3, 
      "subject": "A tale of two garages...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3201"
    }, 
    {
      "body": "Hey Paul Could I ask if there might be some way City residents could be warned of the location of weekend road closures within the square mile ?  Obviously, it is much more preferable for works to happen on the weekend and minimise the impact but it would be great if we could have a look on a particular website - preferably this one - and see which road closures are in force. I would certainly have altered this morning's run of errands had I known of the works being carried out along London Wall and the Aldgate roundabout. I am of course assuming that the roadblockers need to inform your good selves ? thanks Matt", 
      "date": "2006-11-26 16:56:00", 
      "id": 5043, 
      "sentiment": 3, 
      "subject": "Roadworks - is there a map for residents ?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=2782"
    }
  ]
}