{
  "summary": [
    {
      "body": "Anybody notice the police activities in Barbican tonight, Police dogs and all sorts  whats going on??", 
      "date": "2006-08-24 21:13:00", 
      "id": 4475, 
      "responses": 9, 
      "subject": "Police presence in Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2559"
    }, 
    {
      "body": "I've just returned home and learned from a neighbour that there have been enquiries from police going house to house in the block about a theft?  Any information on that please?  Anything to do with the dogs being deployed around here late last night?  I realise that if there is an investigation under way right now, you may not be able to reply. Thanks Barbie.", 
      "date": "2008-03-07 20:42:00", 
      "id": 5519, 
      "responses": 9, 
      "subject": "Trouble in Andrewes?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=4097"
    }, 
    {
      "body": "Residents, I am sure you will be aware of the robbery that occurred at Defoe House around 11.30pm on Friday evening (8th March). A lady left Barbican Tube Station, crossed over in to Aldersgate Street and went in to Lauderdale Place, she then took the stairs up to the Podium Level with the intention of entering a block in the Barbican. This lady was followed into Defoe House lift by two women in their late teens to early twenties, who trapped her in the lift where she was subjected to a serious assault and was robbed. I want to take this opportunity to reassure you that as a Force we are doing all we can to find her attackers.  In order to do this you may notice an increased number of City Police Officers in the area, in particular around Defoe House.  If anyone thinks they may have seen or heard anything suspicious around the time the offence took place please contact our C.I.D. office on 020 7601 2472 or the Barbican Police Office  020 7601 2456. If you see anyone acting suspiciously please contact City of London Police on 020 7601 2222.  In an emergency dial 999 Thank you for your co-operation at this time. Regards Sgt. Hector Mckoy, Barbican and Golden Lane Estates Message posted by John Levey", 
      "date": "2008-03-11 13:36:00", 
      "id": 5487, 
      "responses": 8, 
      "subject": "Robbery", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=4109"
    }, 
    {
      "body": "Am I imagining things or are the police doing motorbike patrols on the Podium? I thought I caught sight of one the other night but I couldn't quite make it out. I keep imagining I can hear motorbikes on the Podium but I don't know if it is just sound reflected from Beech Street tunnel - is there a problem of lost pizza delivery bikes or something of the sort?? Confused & puzzled ", 
      "date": "2006-09-13 15:24:00", 
      "id": 4488, 
      "responses": 4, 
      "subject": "Police motorbike patrols??", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2597"
    }, 
    {
      "body": "At risk of sounding like Disgusted of Willoughby, not only did we have the police drama in the night on Sunday, but we also had noisy building work going on all through Sunday morning and afternoon from the Austral House site at London Wall/Coleman Street. It finally finished at 3.30pm That has been 7 days of construction noise from three sites within view of our balcony ALL week.  I did log my complaint with Guildhall on Sunday, and the Environmental Health duty office did call me back. He told me that the Austral House site work had been authorised becuase they had applied for a permit and been granted one. On a Sunday! It is likely they have applied for and been granted others too. Can anyone else bothered by this please also log their complaint with the City. During the week, speak to the Pollution Team on 020 7332 3630. At the weekends, when the noise nusiance is happening, call Guildhall switchboard on 020 7606 3030 and say you have a noise nusiance complaint. We really must bring pressure to bear on the City to not issue noisy works permits for Sundays so close to the Barbican Estate.", 
      "date": "2006-04-24 22:26:00", 
      "id": 3068, 
      "responses": 3, 
      "subject": "Weekend Constuction", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2221"
    }, 
    {
      "body": "On a different subject entirely and to give us all welcome diversion from broadband traumas - did you read in the Islington local newspaper that a brothel's been raided in Andrewes House? Who'd have thought?.......", 
      "date": "2008-03-20 17:44:00", 
      "id": 3823, 
      "responses": 2, 
      "subject": "Brothel", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4144"
    }, 
    {
      "body": "I was surprised to see a (female) officer in the THM gardens this morning, living on the ground floor I am sure I would have noticed if this was a regular occurance.  Does anyone know if this was for a specific puroose or just part of their rounds? Do they have pass keys?", 
      "date": "2007-05-30 17:12:00", 
      "id": 5346, 
      "responses": 1, 
      "subject": "police in the gardens", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=3378"
    }, 
    {
      "body": "We watched the police chase someone along the podium under Thomas More House on Saturday night. Shortly after, police dogs were on the scene.  Can you enlighten us as to the nature of the incident?", 
      "date": "2007-09-23 10:27:00", 
      "id": 5356, 
      "responses": 1, 
      "subject": "The Chase", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=3680"
    }
  ]
}