{
  "summary": [
    {
      "body": "Desperately looking for an evening yoga class near here. Iyengar preferably. But  beggars can't be chosers - any type of yoga would do.", 
      "date": "2006-12-14 23:17:00", 
      "id": 4136, 
      "responses": 6, 
      "subject": "YOGA", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2833"
    }, 
    {
      "body": "Has anyone taken a tai chi class in the city or surrounding area? Any recommendations - please let me know, I'd like to start a class in the new year. cheers", 
      "date": "2006-12-15 13:56:00", 
      "id": 3317, 
      "responses": 3, 
      "subject": "tai chi in the city?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2836"
    }, 
    {
      "body": "Sorry to bother again. I want to set up my own company ( Tuscan real estate) so I need a website I need to learn how to make one.I know nothing about web design so I need a course for beginners but I quite like design and computers so I learn fast... Where can I learn? Any suggested course? I prefer to attend lessons than an internet course, possibly the best and cheapest.. I ask too much these days..I know...Thank you in advance! Ta ta PS In Tuscany is freezing..bbrrrr", 
      "date": "2006-12-12 18:11:00", 
      "id": 3313, 
      "responses": 2, 
      "subject": "web design?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2827"
    }, 
    {
      "body": "Hello, Does anyone know of a local karate class for beginners? Many thanks.", 
      "date": "2007-06-01 13:01:00", 
      "id": 3336, 
      "responses": 2, 
      "subject": "Karate", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3384"
    }, 
    {
      "body": "Just moved to the Barbican and I am a super-beginner and would love any updates on possible yoga classes in the area or a good instructor who does private instruction.  Am not well versed in the various types but have been told iyengar (?sp) is good for my needs....increasing flexibility, etc   Thanks so much for the advice!", 
      "date": "2008-05-07 07:57:00", 
      "id": 3573, 
      "responses": 2, 
      "subject": "beginner Yoga", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4313"
    }
  ]
}