{
  "summary": [
    {
      "body": "I am finally going to send in my application to be a freeman of the City of London after six years of living here. Would any Aldermen, Common Councilmen or Liverymen happen to be around in the Barbican this weekend or next week and be willing to sign my application? I need two signatures and unfortunately don't know anyone qualified.  Many thanks  Alasdair", 
      "date": "2008-03-06 19:08:00", 
      "id": 3812, 
      "responses": 14, 
      "subject": "Freedom of the City of London", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4089"
    }, 
    {
      "body": "Hello All - am hoping someone can help out... I am applying for the Freedom but need to be nominated by 2 members of the Common Council. Do you know how I can get their attention - or actually who they are? I have tried to contact them through the Corporation web site and have had one v helpful response (Stephen Quilter) but still need a second nominee. Any ideas or experience? Many thanks", 
      "date": "2006-11-28 22:02:00", 
      "id": 3223, 
      "responses": 9, 
      "subject": "Freedom of the City", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2787"
    }, 
    {
      "body": "After years of promising to do it, I've finally got round to doing it. Unfortunately, I need to be nominated by two Alderman, Liverymen or Common Councilmen. Since I don't know any - and they certainly won't know me, does anyone have any ideas as to how I could do this? If you know of any pubs where they hang out, I'd greatly appreciate the tip. Now that I've a head of steam to do this, I'd be terribly disappointed if I couldn't do it just because I couldn't meet the \"eligibility\" \"criteria\". Joke intended.  Thanks in advance...", 
      "date": "2007-03-20 13:13:00", 
      "id": 3294, 
      "responses": 7, 
      "subject": "Freedom of the City", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3164"
    }, 
    {
      "body": "Hi there Normally we live in Defoe House, but this year we decided to rent our flat out and attempt to cycle from the Barbican to Dehli for charity. We are currently in Romania. You can follow our adventure on   John and Sally ps. we are struggling to get a visa for Iran. If anybody has any contacts at the Iranian embassy please drop me a note at ", 
      "date": "2006-06-29 15:07:00", 
      "id": 3177, 
      "responses": 1, 
      "subject": "Cycle trip from London to India", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2415"
    }
  ]
}