{
  "summary": [
    {
      "body": "Do talkers think officers of the City of London should use this facility to respond to comments raised? It came up in the YMCA meeting tonight so to assist officers in their deliberations, so I thought I'd ask ... good idea or bad idea? Paul from the Police does already, and I personally find his interventions v useful ...", 
      "date": "2006-05-10 22:32:00", 
      "id": 3105, 
      "sentiment": 1, 
      "subject": "barbican talk", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2280"
    }, 
    {
      "body": "Hi Thanks to those who answered my request for moderators. Please welcome on board Mary and Cycad as moderators.  They're here to help make sure the site is free of spam / offensive messages. Like me, they won't go overboard - BarbicanTalk.com is a friendly little community; we all appreciate free speech and prefer to avoid censorship.  If you need to comment on a post you've seen, in the first instance please do contact me, but if you can't get through to me then Mary and Cycad should be able to help. Thanks Horseradish Administrator", 
      "date": "2008-02-05 21:55:00", 
      "id": 3777, 
      "sentiment": 1, 
      "subject": "Welcome to our two moderators", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3985"
    }, 
    {
      "body": ".", 
      "date": "2007-12-27 08:55:00", 
      "id": 4186, 
      "sentiment": 1, 
      "subject": "Announcement", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3887"
    }, 
    {
      "body": "Hi all Just wanted to say how much I enjoy reading Barbican talk.  Residents show a good sense of humour, and some messages leave me in stitches (choice of vocabulary, jokes, usernames etc). I don't go on this site regularly (once a month or so), but every time it's good fun. This site is also very helpful, full of practical tips. Glad I have access to it. Violet    ", 
      "date": "2007-02-13 21:26:00", 
      "id": 4229, 
      "sentiment": 1, 
      "subject": "Sense of humour", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3057"
    }, 
    {
      "body": "Hi! I just wanted to say how fantastic I think this site is! I've just moved over  from the States and I am really excited about living in the Barbican. I plan to spruce up my flat a little as its somewhat dated, and this site is such a great source of all kinds of information... its fantastic!", 
      "date": "2007-03-15 22:31:00", 
      "id": 4243, 
      "sentiment": 1, 
      "subject": "New to the Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3147"
    }
  ]
}