{
  "summary": [
    {
      "body": "The Barbican Association has now launched its website,  , although it will be a while before it reaches its full state.  I am the webmaster.  A bulletin board for this website is clearly a possibility, but with barbicantalk already active it seems a little pointless to reinvent the wheel. I need, however, to discuss the question of linkage with the administrator of barbicantalk.com andto my surprise I have not found a \"contact us\" email linkage - something I thought was conventional if not mandatory on websites. Could the administrator get in contact with me and let me know his/her thoughts? Geoffrey Rivett", 
      "date": "2004-11-30 15:27:00", 
      "id": 2904, 
      "sentiment": 2, 
      "subject": "barbican association web site and linkages", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1361"
    }, 
    {
      "body": "so its seems that access has now been restricted to registered members only. so what did i miss? (maybe i shouldnt ask this question and risk banishment to the nuclear family gulag ?!)", 
      "date": "2005-04-13 22:20:00", 
      "id": 2915, 
      "sentiment": 2, 
      "subject": "no more guests", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1561"
    }, 
    {
      "body": " who deleted the smokkie meat thread and why?", 
      "date": "2005-05-08 23:15:00", 
      "id": 2934, 
      "sentiment": 2, 
      "subject": "smokkie meat thread", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1616"
    }, 
    {
      "body": "Where is Strawby? I miss her contributions to the discussions.", 
      "date": "2005-08-11 16:06:00", 
      "id": 2980, 
      "sentiment": 2, 
      "subject": "Strawberry", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1800"
    }, 
    {
      "body": "A new neighbour asked me how long the board had been running, and it encouraged me to see how far back I had posted, I seem to be sixth in line, but remember that you changed over to PHP and the original dates are no longer shown. Do you remember how far back the board actually goes ? I also wanted to say \"thank you\" for hosting this forum, something I sometimes think gets forgotten, you've given up a lot of time and space on your business website to enable BarbicanTalk, and it is very much appreciated by a great many of us ! OK, on to the special request, I wondered (and feel free to say \"no, I don't agree\" or \"no, I don't have time\" etc. ) but I wondered if you would consider adding a couple of new entries on the Forum Index? I was thinking specifically of maybe adding 'Your Neighbourhood Policing Thread', because I think we are extremely lucky that the local Police, especially Paul Gilmour, are willing to take so much time and effort to communicate to the community, something that doesn't happen in many other boroughs. I also thought perhaps, doing the same for the BA-CHAIR ? And one, close to my heart, 'Resident Recommendations', to highlight those who provide A1 services to the estate, from Garchey cleaners to removal men. Feel free to tell you have a lot of better things to do then set this up, but no matter what, \"thanks\", really, for supporting all of us.  Rich.", 
      "date": "2006-06-27 18:03:00", 
      "id": 3168, 
      "sentiment": 2, 
      "subject": "Horseradish, a special request !", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2402"
    }
  ]
}