{
  "summary": [
    {
      "body": "Hello All - am hoping someone can help out... I am applying for the Freedom but need to be nominated by 2 members of the Common Council. Do you know how I can get their attention - or actually who they are? I have tried to contact them through the Corporation web site and have had one v helpful response (Stephen Quilter) but still need a second nominee. Any ideas or experience? Many thanks", 
      "date": "2006-11-28 22:02:00", 
      "id": 3223, 
      "responses": 9, 
      "subject": "Freedom of the City", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2787"
    }, 
    {
      "body": "After years of promising to do it, I've finally got round to doing it. Unfortunately, I need to be nominated by two Alderman, Liverymen or Common Councilmen. Since I don't know any - and they certainly won't know me, does anyone have any ideas as to how I could do this? If you know of any pubs where they hang out, I'd greatly appreciate the tip. Now that I've a head of steam to do this, I'd be terribly disappointed if I couldn't do it just because I couldn't meet the \"eligibility\" \"criteria\". Joke intended.  Thanks in advance...", 
      "date": "2007-03-20 13:13:00", 
      "id": 3294, 
      "responses": 7, 
      "subject": "Freedom of the City", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3164"
    }, 
    {
      "body": "Hi, we would like to have our bathroom re-grouted. Would anyone have the contact details of someone who does this? Many thanks.", 
      "date": "2007-06-14 12:44:00", 
      "id": 3350, 
      "responses": 4, 
      "subject": "Bathroom re-grouting", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3421"
    }, 
    {
      "body": "in need of estimates to carry out work in my flat ,Seddon house. Is there anybody who can help me with a useful list of a few telephone numbers? Christine[/b]", 
      "date": "2006-10-17 14:16:00", 
      "id": 4294, 
      "responses": 4, 
      "subject": "Need a list of electricien, plumbers, other crafmen", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2688"
    }, 
    {
      "body": "Anybody know to which body I should address a letter of complaint about the music from the keep fit classes in the early evening? It's like having a rave foised upon the area each day. Pub noise I expect and accept within reason but thudding megawatt soundsystems in order to shift a few calories is several steps too far. I'm afraid i'm not going to be satisfied with approaching 'the management' either in this case. They have paying customers to satisfy so there is a conflict of interests for a start.  I want to lodge something with a body that cannot simply turn a blind eye nor file my complaint in a folder marked 'trash'. I'm thinking upon the lines of a local noise abatement officer or similar. Please feel free to PM me with accurate details if you have them  or simply don't want to to broadcast the information. Having said that ,unless i'm the only one ready to pop a valve over this irritant, then i'm sure others may be wish to object or lobby too. Regards, L", 
      "date": "2007-05-21 18:21:00", 
      "id": 3323, 
      "responses": 3, 
      "subject": "Enough! YMCA gym music", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3352"
    }, 
    {
      "body": "The cable reception went down last night, came on again this morning... and now there's no reception again. Anyone else with the same problem our is it just in my flat? (also, does anyone have the number to call at hand?) Thanks", 
      "date": "2007-05-02 16:39:00", 
      "id": 4319, 
      "responses": 3, 
      "subject": "Willoughby House TV reception", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3296"
    }, 
    {
      "body": "Both my loo and my washbasin have cracks and I wish to have them replaced by pieces of identical original design. I was told a couple of years ago that Mick Butler was the man to contact, but he has since died and I am certain I saw an advertisement placed by his son in a recent Barbican publication, saying that he was continuing in his father's business. I cannot track down this ad., so would be grateful if someone could help me out by letting me have the firm's number.", 
      "date": "2007-05-29 12:00:00", 
      "id": 3328, 
      "responses": 2, 
      "subject": "Loos and basins", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3367"
    }, 
    {
      "body": "Hello! I need the environmental office of the city...any help?Thank you in  adavance!", 
      "date": "2006-09-26 13:58:00", 
      "id": 4263, 
      "responses": 2, 
      "subject": "environemtal office", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2633"
    }, 
    {
      "body": "Does anyone have the number of someone who will come around monthly to clean the Garchey?  I find it very unwieldy to take the thing apart so I'd like to use this service.  I did have the number of someone called Brian a while ago but he was impossible to contact. Thanks for any suggestions.", 
      "date": "2006-10-25 14:39:00", 
      "id": 4301, 
      "responses": 2, 
      "subject": "Garchey cleaner", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2702"
    }, 
    {
      "body": "No one else has probably noticed, but the Arts Centre have installed a couple of new chillers on the roof for the air conditioning for the art Gallery (over by the conservatory). I'm not fussed about what they look like but when the winds in the wrong direction they make a terrible racket which I can hear from my flat. Does any one else in the east & south facing Shakespeare flats and Gilbert hear it? It's a short .. er .. farting sound as the fans start and stop, every 20 seconds or so. Most annoying.  Checking out the planning application, it seems as if they should have an acoustic enclosure and be modified not to start and stop so abrupty. But this has not been done yet. Does anyone know who I should write to in the arts centre to jolly them along and discharge their planning conditions? Ta BB", 
      "date": "2007-09-25 17:55:00", 
      "id": 3433, 
      "responses": 1, 
      "subject": "Strange noises from the roof of the Arts Centre", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3689"
    }, 
    {
      "body": "I am planning to decorate part of the flat and would be pleased to receive recommendations of reliable contractors. Neighbours have recommended Emma James, who has worked on the estate, but the telephone number I have been given seems to be incorrect. Happy New Year to everyone.", 
      "date": "2007-01-04 11:22:00", 
      "id": 4125, 
      "responses": 1, 
      "subject": "INTERIOR DECORATOR/EMMA JAMES", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2877"
    }
  ]
}