{
  "summary": [
    {
      "body": "Is anyone about to die wondering what the hell is going on with the snagging lists for Ben Jonson.... I still have no new fire door, damp and painting that needs completed. The temp repair to my 7th Flr firedoor consists of a wooden strap across the handle. Well Done the Corporation.", 
      "date": "2006-02-03 13:02:00", 
      "id": 4568, 
      "responses": 7, 
      "subject": "Ben Jonson Repairs", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2059"
    }, 
    {
      "body": "Ben Jonson fire doors have been smartened up with a white plastic strip, very dinky, but THE FIRE DOORS NO LONGER CLOSE !!! Is this work in progress, powers that be, or do we start to get worried? Answers on a piece of toast, please ... ", 
      "date": "2008-05-06 09:36:00", 
      "id": 3591, 
      "responses": 6, 
      "subject": "Fire doors - slightly missing the point", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4308"
    }, 
    {
      "body": "Twice in recent weeks the new lift at the eastern end of the estate has broken down.  The telephone number posted for emergencies actually leads to the Guildhall switchboard.  They have no record of who is responsible.  The Corporation failed to pass relevant material sent to them from the then builder Ardmore-Mace (now fired by Gerald Ronson for not being tough enough in their dealings with residents and the Environmental Health people when damage was caused to a number of flats due to their work).  Ardmore-Mace says it is not responsible.  So the fire brigade had to be called.  Anyone using the lift should be aware that aside form shouting no help is available.  The Corporation was informed at least a fortnight ago and still no telephone numbers have been posted. They even claimed that the lift should be maintained by the Estate!  News to the Estate and our excellent engineers.  The Estate was unaware of this and, in any case, the Estate would not assume responsibility for a year after construction.  One trusts that the Estate will charge the Corporation for staff time.   So use that lift at your own risk.  If you press the bell no one who can do anything is altered.  If you use the telephone you get the staff at the Guildhall or the new call centre and the reply that the lift does not exist or they know nothing.  The name of the contractor and an emergency telephone number should be there by law.  It is not.  The Corporation has done nothing about this that has led to an improved situation.   However, the alternative of the exit from Willoughby 03 car park is also very uncertain.  The door has been out of action at least twice over the last fortnight nicely coinciding, on occasion, with the lift on the podium being out of action. People in wheelchairs and other people with walking difficulties have no way out from that corner of the estate unless someone with a pass key kindly takes them through Willoughby House and that is a long way around.", 
      "date": "2008-02-03 10:22:00", 
      "id": 3625, 
      "responses": 2, 
      "subject": "Corporation incompetence?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3977"
    }, 
    {
      "body": "Don't know if anyone else has noticed, but the door to Willoughby House, level 03 South stair isn't closing automatically behind you as you enter the building. I have called the Estate Office, but in the meantime please make sure that you pull it shut.", 
      "date": "2006-06-12 14:48:00", 
      "id": 4418, 
      "responses": 2, 
      "subject": "Willoughby House Security", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2361"
    }, 
    {
      "body": "Well, just one member of staff, but it's the first time I've had someone speak to me in that way from the Estate Office.  I rang the main Estate switchboard and asked for Technical Services, expecting to be asked the reason for my call and to be directed to the right person.  Instead, a very belligerent man asked who I wanted to talk to. When I started saying I didn't know, he barked that there were over 400 people working for Technical Services so how could he decide who to put me through to. I was so flabbergasted by his sarcastic tone I didn't bother explaining the reason for my call, and simply said I'd call back and try to find someone more helpful. Luckily when I called back I got a normal person who asked the reason for my call and put me through to the repairs line. She seemed a bit confused though....so perhaps I was asking for something unusual??  Seeing as I was calling because I'd reported a fault with a fire door about a month ago, and nothing had been done about it, it wasn't a particularly good experience. Especially as the fault was caused by a previous dodgy and unfinished repair, which in itself was necessary after the door was (allegedly) damaged by Estate staff renovating a rental flat in the corridor.  I wish I'd got the switchbaord man's name ... obviously someone who shouldn't have been let loose on the general public.", 
      "date": "2005-11-28 10:51:00", 
      "id": 4541, 
      "responses": 2, 
      "subject": "Rude Estate Office Staff", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1958"
    }
  ]
}