{
  "summary": [
    {
      "body": "Headline on page three of Islington Tribune. Apparently the land lord of Cherry Tree walk - UBS, is not going to re-new the leases on the shops there, next June.  As you can imagine the small shop keepers are up in arms and organising a petition, no more chemist, cleaners, stationers, cafes.  What a shame and all because of Waitrose. UBS wishes to develop the shopping centre!  Hmm.", 
      "date": "2006-10-14 09:28:00", 
      "id": 4176, 
      "responses": 94, 
      "subject": "Global giant plans to evict traders from shopping Mall", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2678"
    }, 
    {
      "body": "Does anyone know of a good cheese shop in the area? I need a proper cheese shop rather than a supermarket. Thanks in advance!", 
      "date": "2006-08-04 17:07:00", 
      "id": 3143, 
      "responses": 15, 
      "subject": "Cheese", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2507"
    }, 
    {
      "body": "Nearby bookshop- Books Etc on Cowcross St, just off Charterhouse St, is closing down. Nearly everything is 50% off or more. Big mix of books and some other stuff. Good if you like a rummage! Buy now for Christmas.", 
      "date": "2008-02-12 14:35:00", 
      "id": 3760, 
      "responses": 14, 
      "subject": "local Books etc! closing down sale", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4012"
    }, 
    {
      "body": "There is a new charity shop in whitecross! For those of you who want to get rid of anything they get almost anything functioning and proper it is for widows I am kind of at the moment plus I was annoyed by the fact that bins of the salvation army were always full to the brim and I do not like armies in general... Open also Sats what a pleasure to clean up your wardrobe and be goood Love peace freedom Hva a look on the BANKSY on the way tehre a real pleasure the art gallery director is taking care of him...", 
      "date": "2008-01-29 15:32:00", 
      "id": 3620, 
      "responses": 10, 
      "subject": "New charity shop in whitecross", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3958"
    }, 
    {
      "body": "Can anybody recommend any nice coffee shops in the area? (not Starbucks!)", 
      "date": "2006-01-11 10:08:00", 
      "id": 3039, 
      "responses": 9, 
      "subject": "Coffee shops", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2028"
    }, 
    {
      "body": "I think that the Waitrose thread includes a mention of Fresh & Wild, the 'health' food shop in Old Street, near the roundabout. I have heard that it will shortly be closing.  Can anyone confirm this?", 
      "date": "2006-05-09 12:33:00", 
      "id": 3093, 
      "responses": 9, 
      "subject": "Fresh & Wild", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2274"
    }, 
    {
      "body": "There's a planning application in for a new EAT sandwich bar on the corner of Aldersgate St and Long Lane (opposite the Pret a Manger and Frank Harris, if that makes sense, just down from Barbican tube). EAT is an independent sandwich chain, a pret-a-manger-a-like, but not as good, in my opinion. Chains are dull satisfaction, but I suppose we get what we go to.", 
      "date": "2008-04-16 15:36:00", 
      "id": 3996, 
      "responses": 9, 
      "subject": "new EAT on Aldersgate St", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4239"
    }, 
    {
      "body": "Not the furry kind but the shop variety. I finally had the excuse to go into the lovely shop Fox by Moorgate and London Wall and it was worth the wait. Although I couldn't find everything I needed the service was brilliant and I've now got matching belt and shoes... gorgeous! If ever you find yourself with an excuse (& cash) or just curious I can certainly recommend it. Stark contrast to my encounter in Ede and Ravenscroft (Cambridge branch) last week when buying clothes for my Civil Ceremony. Having gone through the whole measuring and trying bit for 1/2 hour, the shop assistant (boring dry personality) asked what the suit was for. When I told him, it was just like the scene of the conservative lady in Little Britian, I thought he was going to ask to wash his hands! Needlessly to say I just left.", 
      "date": "2008-04-25 11:00:00", 
      "id": 3891, 
      "responses": 6, 
      "subject": "Fox", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4274"
    }, 
    {
      "body": "I see \"Spianata\" are opening a shop on Moorfields. Their   looks enticing - has anyone eaten at their other shops? Less excitingly, Pret a Manger are opening a branch in what used to be Extra Time on Long Lane.", 
      "date": "2007-07-31 11:56:00", 
      "id": 4111, 
      "responses": 5, 
      "subject": "New lunch options", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3548"
    }, 
    {
      "body": "Hi all I'm after faux fur for Halloween costumes. Does anyone know if there are any shops/wholesalers that might stock it around the area or around Brick Lane?", 
      "date": "2007-10-26 16:29:00", 
      "id": 3459, 
      "responses": 4, 
      "subject": "Fabric / Haberdashers in area", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3748"
    }, 
    {
      "body": "Just read this on Timesonline   and even though we wouldn't mind a few more shops open on the weekend, we wouldn't want the City to become another West End. The reason we live here is for the peace and quiet. We would hate to see this beautiful part of London spoilt by a mass of high street shops. ", 
      "date": "2008-02-04 20:28:00", 
      "id": 3779, 
      "responses": 4, 
      "subject": "Rival to Blue Water Shopping Centre", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3981"
    }, 
    {
      "body": "I'd be grateful for tips on where to find the nearest shops selling interior wall/floor paints, brushes, rubble bags, etc.  I have no car, so am reliant on public transport or cabs.  My internet research points to Essex Road, N1, being the closest, but I'd love to hear of anywhere closer. Thanks.", 
      "date": "2006-09-26 16:02:00", 
      "id": 4266, 
      "responses": 4, 
      "subject": "DIY provisions", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2634"
    }, 
    {
      "body": "Does anyone know if there are any within reasonable walking distance of the Barbican?", 
      "date": "2006-09-25 15:27:00", 
      "id": 4268, 
      "responses": 4, 
      "subject": "Charity Shops", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2631"
    }, 
    {
      "body": "I've heard that the Crescent is being considered for shops - as in the original plan.  Firstly, is this correct? Could we convince Waitrose to open something that fits the surroundings?", 
      "date": "2006-02-19 22:35:00", 
      "id": 4593, 
      "responses": 4, 
      "subject": "Waitrose at the Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2091"
    }, 
    {
      "body": "Is the retail butcher next to Smiths in Smithfield any good? I was going to buy a whole fillet of beef but it's all vacuum packed in plastic so I couldn't even see if it looked ok. Consumer comments welcome, thanks", 
      "date": "2007-08-23 09:49:00", 
      "id": 3412, 
      "responses": 3, 
      "subject": "SMITHFIELD BUTCHER", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3603"
    }, 
    {
      "body": "Hi - washer in one of my taps finally went on Saturday am (couldn't turn the said tap off. All a bit worrying!). Wanted to share 2 positive experiences with you all: 1. Car Park attendant - was able to lend me a hammer & a very big adjustable spanner (I only possess a small electrical screw-driver. Not much use in the circumstances!) 2. The hardware shop just past the YMCA is great! Having removed the tap (with the big spanner) I took it along to buy a new washer. One of the guys there removed the old washer (easy) and fitted the new one for me (v hard - had to use a vice + big spanner as the small nut holding the washer on was siezed), whilst the other discussed Mexico with me (his wife is apparently Mexican). It could be that they knew I was a complete novice (reminding me that I should use PTFE tape in refitting the tap & seeing the look on my face probably gave the game away!) Very strong recommendation for both of above! Taps now a speciality. Oh - and the cost? 50 pence!!!", 
      "date": "2008-04-06 16:22:00", 
      "id": 3849, 
      "responses": 3, 
      "subject": "Bryer Car Park Attendant & our local hardware shop", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4194"
    }, 
    {
      "body": "now safeways has stopped selling it, where is the closest place on foot that sells compost? alternatively, does anyone have about four small four bags they'd be prepared to sell?", 
      "date": "2004-09-07 16:47:00", 
      "id": 4766, 
      "responses": 2, 
      "subject": "Soil/compost for window boxes", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1252"
    }, 
    {
      "body": "I'm sure all residents posted all their Christmas cards weeks ago so this is a bit late, but I'd like to draw people's attention to the excellent cards they sell in the Survival International shop on Goswell Road. Slightly arty photos of life in the Arctic - 10 cards for 4.95", 
      "date": "2005-12-19 17:45:00", 
      "id": 3014, 
      "responses": 1, 
      "subject": "Christmas cards", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1996"
    }, 
    {
      "body": "why have they decided to chop half a meter of the width of the pavement  ouside the shops and school?", 
      "date": "2008-02-26 13:31:00", 
      "id": 3526, 
      "responses": 1, 
      "subject": "pavement reduction whitecross st", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4063"
    }, 
    {
      "body": "Anyone who enjoys authentic Japanese food might be interested to know that Matsuri Restaurant, High Holborn has a special deal on Saturday lunch during August - you pay only 50% of normal prices. Normally keenly priced, this is excellent value and highly recommended based on a recent visit. The restaurant is being fairly coy about this promotion but it seems already to be well known to the local Japanese community so make sure they can accommodate you. If you are still hungry, cross the road on the way back and take home one of the excellent cakes from Paul, the highly recommended French baker. For the avoidance of doubt, I have no financial interest whatsoever in either of these establishments.", 
      "date": "2007-08-06 23:35:00", 
      "id": 4115, 
      "responses": 1, 
      "subject": "Half Price Japanese Lunch", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3566"
    }, 
    {
      "body": "Fully endorse what Mr Dudley says re the fishmonger, butcher and greengrocer on Essex Road.  Worth the trip but it does take time.", 
      "date": "2006-03-20 11:28:00", 
      "id": 4620, 
      "responses": 1, 
      "subject": "Waitrose", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2146"
    }
  ]
}