{
  "summary": [
    {
      "body": "Hello I am an interloper so I hope it's okay to ask this.  I don't live in the Barbican yet and perhaps never will (as you all no doubt know, there is a dearth of properties) but I wondered if any of you would be generous enough to share your thoughts on living there and good points/bad points. I've lived in flats all my life (we currently live near Old Street and hurrah for the new Waitrose even if, yes, some of the staff are very incongruous for JLP) so I know that properties can differ wildly and that it's also a matter of personal choice. But these are the things I'd like to ask (in no particular order): Am I correct in thinking the biggest flats are in the towers? Is it generally a quiet and safe place to live or does it vary wildly from block to block? What's it like for children? The private gardens seem amazing but in reality what's it like? Is the service charge astronomical (I realise it depends on size of flat)? What will happen when all TV goes digital and the Barbican has no digital cable?? Is the listed building classification a pain if you want to do any work in the flat? Garchey, good or bad? Are parking places readily available to rent or is there a shortage? Anything to look for that an outsider may not know about.  I'd be really grateful for any answers. If I can reciprocate in any way...my specialities are fly fishing, beauty products, nutrition and fashion. I know, ecletic and slightly bizarre! Thank you. AB", 
      "date": "2006-06-05 17:37:00", 
      "id": 3180, 
      "responses": 29, 
      "subject": "What's it like living in the Barbican?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2338"
    }, 
    {
      "body": "Finally after a couple of years I'm getting a classic car again. Being in Thomas More the car park here looks overcrowded and open to the elements, with too much chance of doors knocking or car reversing into each other; Speed looks as though it has quite good security on show; Bunyan (last time I looked looked quite sparse and closed off from the elements; Willoughby looks too risky; Andrews I don't know at all. Does anyone know which car park would give the best security, fewer knocks and dry conditions for an older car, that's if I have a choice? Thanks for any advice given.", 
      "date": "2006-10-17 08:49:00", 
      "id": 4297, 
      "responses": 13, 
      "subject": "Preferred Car Park", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2685"
    }, 
    {
      "body": "Please could someone give me an idea of how much a parking bay in the Shakespeare Tower/Defoe car park might sell for?", 
      "date": "2007-03-28 14:39:00", 
      "id": 4350, 
      "responses": 8, 
      "subject": "Going rate for car park bay?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3187"
    }, 
    {
      "body": "Hi!! We have just moved in to John Trundle. I am Sarahjayne, a graphic designer and my partner Jonnie is a Management Consultant. We have been here for a few weeks now and absolutely love it! There are a few things we are unsure of and would appreciate any advice. Is it possible to get Sky +, if so, how? Do we have to use a specific broadband internet provider? If we have visitors, where can they park? Our bathroom occassionally smells - is there a problem with the drains in John Trundle???!!! Where is best to do our food shopping? We have visited Sainsbury's in Angel and weren't impressed!! We don't have car, so ideally would love somewhere nearby other than the 'local' or 'express' variety of supermarkets where the selection is not great. This is probably wishful thinking!!  We look forward to learning more about our new area!! Many thanks", 
      "date": "2005-09-27 15:48:00", 
      "id": 4438, 
      "responses": 7, 
      "subject": "Hello! We've just moved in and have a few questions!!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1858"
    }, 
    {
      "body": "Please can someone tell me where the removal van can park up to unload for moving in to BJH. I can't fathom it out. Thanks", 
      "date": "2008-04-03 18:18:00", 
      "id": 3863, 
      "responses": 5, 
      "subject": "Moving in to BJH", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4181"
    }, 
    {
      "body": "Please could someone remind me on the protocol for giving a christmas tip to those hardworking carpark attendants. Is their a central collection or do we residents just do their own thing tucked discretely in an envelope? thanks", 
      "date": "2007-12-16 21:20:00", 
      "id": 4178, 
      "responses": 2, 
      "subject": "Christmas tips", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3875"
    }
  ]
}