{
  "summary": [
    {
      "body": "Does anyone know why a no right turn sign has suddenly appeared on the traffic lights at the southbound City Rd, right turn into Chiswell St junction? It seems you now have to take a loop round Finsbury Square to make this turn.", 
      "date": "2006-09-16 16:55:00", 
      "id": 4499, 
      "responses": 9, 
      "subject": "No right turn from City Rd into Chiswell St", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2605"
    }, 
    {
      "body": "Life just gets better and better here . . . the new zebra crossing opposite the Barbican Tandoori has now opened and is getting lots of use. Much needed! And I've seen two cyclists being cautioned by police at the corner of Aldersgate and Beech Street in the last week. Hopefully the message will get round that cyclists should ride responsibly . . .  [cue the flame war]", 
      "date": "2007-01-29 22:34:00", 
      "id": 3281, 
      "responses": 8, 
      "subject": "Aldersgate zebra crossing", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2974"
    }, 
    {
      "body": "why have they decided to chop half a meter of the width of the pavement  ouside the shops and school?", 
      "date": "2008-02-26 13:31:00", 
      "id": 3526, 
      "responses": 1, 
      "subject": "pavement reduction whitecross st", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4063"
    }, 
    {
      "body": "Has anyone else noticed that there are now a couple of loose manhole covers on Aldersgate Street (on on the northbound side and the other on the southbound by the pedestrian crossing) that now make a considerable racket when cars/buses run over them? I reported the first of these to the Corporation a few weeks ago but nothing was done and now the problem has doubled. It's just about tolerable when we have our windows shut but is going to be hell once the warmer weather comes.....", 
      "date": "2008-04-14 11:53:00", 
      "id": 3868, 
      "responses": 1, 
      "subject": "Noisy manhole covers on Aldersgate Street", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4237"
    }, 
    {
      "body": "Whilst waiting for a bus outside the Barbican Music shop yesterday I couldn't help noticing how dangerous the corner immediately outside our lovely new Barbican Centre entrance is.  Vans were parked on both sides of the corner in spite of double yellow lines.  Taxis etc. were hurling themselves round the vans and the corner even though they couldn't see where they were going or more to the point what was coming the other way.  It seems like a nasty accident waiting to happen, would red lines help?  Other than that a large first aid box for the Barbican reception staff?", 
      "date": "2006-10-04 09:37:00", 
      "id": 5040, 
      "responses": 1, 
      "subject": "Dangerous corner", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=2652"
    }
  ]
}