{
  "summary": [
    {
      "body": "We are about to complete on a purchase in the Barbican, a part of London I never appreciated until becoming a parent last year. It's manifest safety and quiet, compared to anywhere else I've lived in London, are now much more important than the stained futuristic penal-colony exterior which so turned me off in the past and which I now find merely bleak. I've lurked here for a few months (and am familiar with the state of play of the \"kids will be kids\" versus the \"stop the rot\" positions) but going on the evidence of barbicantalk.com alone there is a distinct heating up of crime and disorder. The Barbican seems, to this outsider, to be a nigh-on perfect place to live if you've got small children, but drunks (of any age) shouting and smashing windows at BJH can overturn that in a trice. I'm with the 'stop the rot' faction. You can be young and hang around with your mates and get drunk without shouting and wrecking.", 
      "date": "2006-10-09 11:45:00", 
      "id": 3208, 
      "responses": 50, 
      "subject": "Violence, noise (and vermin) - just another day in EC2Y ?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2669"
    }, 
    {
      "body": "Last night I watched 13 young men of about 18-19 years old break into the gardens. They arrived in several groups and spent about an hour shouting, hanging around by the lake and climbing up and down a section of fence. This is a cause for concern, especially for residents at ground level. I have often thought that it's all too easy to access the gardens from outside. Obviously others know this too.", 
      "date": "2006-10-27 08:45:00", 
      "id": 4306, 
      "responses": 12, 
      "subject": "Security in the gardens", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2704"
    }, 
    {
      "body": "Received the latest copy of Barbican News this morning. Apart from the usual updates, I was most interested in one article. It was the one about the lift doors in John Trundle and Bunyan. How have these lift doors got into such a state? From what I could make out in the small photograph, they appear to have suffered a lot of vandalism. Do these block suffer from feral youth and other such problems? And if so why has nothing been done. Will be the lifts themselves next?", 
      "date": "2005-07-29 16:04:00", 
      "id": 2961, 
      "responses": 10, 
      "subject": "Feral Vandals?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1769"
    }, 
    {
      "body": "whilst reading about the mendohlson tree, i wondered ...  whilst recognising that we are indeed very lucky in our police resources, is there a specific reason why the bored-out-of-their-minds security staff from the arts centre can't cast their net wider ... ? I ask because the  lovely gardens by bunyan / jt / bryer are a bit of an attraction for the \"malcontents\" because they're so lovely and lush and screen things from public view ... the group of youths, for example, referred to in previous posts i think, have taken to drinking under bunyan - having re-located from jt ...  presumably the answer is the security guards are employed by the arts centre but i wonder how whether the financial equation to extend their duties to the rest of the estate would be a cheaper option than using the police and the cost of repairs (when things can be repaired, that is, unlike the tree sculpture...) just a thought", 
      "date": "2006-05-01 23:08:00", 
      "id": 3084, 
      "responses": 8, 
      "subject": "security", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2244"
    }, 
    {
      "body": "i have been informed by an other resident that a new group of people that have recently moved into the ymca are offenders serving probation,as a resident sharing facilities ie showers bathrooms and toilets and this situation is true would we not have a right to be informed about this?", 
      "date": "2007-01-16 18:01:00", 
      "id": 4187, 
      "responses": 7, 
      "subject": "ymca", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2921"
    }, 
    {
      "body": "It's not very nice, is it? And the only wildlife it seems to attract is bathing Vicky Pollards. Why don't we have it filled in?", 
      "date": "2005-06-20 19:38:00", 
      "id": 4679, 
      "responses": 3, 
      "subject": "The Dolphin Fountain", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1702"
    }, 
    {
      "body": "Riots in and outside the YMCA, paint colour wars, satanic children and smashed glass in BJH and drunken hoodies under Bunyan. What's going on on our northern fringes? Is there something in the water? ", 
      "date": "2006-05-06 22:29:00", 
      "id": 3097, 
      "responses": 2, 
      "subject": "what's up??", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2266"
    }
  ]
}