{
  "summary": [
    {
      "body": "We currently have an old style kitchen, which we'd like to re-furbish back to it's former glory, as it is looking a bit tired. However my question is , is it worth trying to source all the bits and pieces, as nothing is made anymore. Would it be better financially in the long run to install a new kitchen in a modern style in-keeping with the streamlined 60's/ 70's white feel that the originals have? Does anyone have experience of whether this would add value or lessen it?  It does seem that many people are now getting fed up of the crankiness of the old kitchens , and maybe new buyers would also prefer this as they may find out how difficult it is to repair / source original fittings. So is it worth spending money on re-furbishing the original....or on completely re-fitting in a suitable 'in-keeping with' style?", 
      "date": "2005-08-02 13:09:00", 
      "id": 2989, 
      "responses": 14, 
      "subject": "Kitchen Dilemma", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1778"
    }, 
    {
      "body": "I've given up waiting for an original dark grey, so does anyone have any good recommendations for a kitchen worktop that looks authentic-ish? I've only got two small surfaces to re-cover -at the moment it's a horrid wood in a nearly all original kitchen. But I'm concerned laminate or plastic will look cheap- does any one have any brilliant suggestions?", 
      "date": "2007-06-04 15:52:00", 
      "id": 3352, 
      "responses": 11, 
      "subject": "Kitchen - Brilliant suggestions wanted.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3391"
    }, 
    {
      "body": "Does anyone know where I can source original style taps? I would like to replace most of ours as they are looking pretty grotty. I think it would spruce the place up nicely to have new shiny taps, so any advice would be lovely! ", 
      "date": "2005-08-01 17:07:00", 
      "id": 2955, 
      "responses": 9, 
      "subject": "bathroom and kitchen taps", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1777"
    }, 
    {
      "body": "I have two things that i'd be really grateful for some ideas about... Firstly, i want the soil from two of the large 'architectural troughs' outside my window removed. Helping Hands Garden Service appear to be winding down and can't help. Does anyone know of any other gardeners/handymen etc that would be willing to remove and dispose of the soil? Secondly, and related to the first problem, is that the troughs have nothing in them except 2 large plants (one in each trough). I don't know what they are - they look to me to be something like an overgrown ugly aloe vera, although my mum is convinced they're Trifids! They're succulents with little thorns on. And they're green. Anyway, i've noticed them around the estate (although not as big) - there's one in a raised bed at the barbican centre end of Thomas More Gardens, and there are a few in the conservatory. Anyone has any ideas what i should do with them? seems a bit mean to throw them away (and logistically probably quite tricky given their size). I thought about seeing if the gardeners might want them to plant somewhere in the grounds, but don't know how to get hold of them. Any other bright ideas though?", 
      "date": "2006-04-26 17:38:00", 
      "id": 3079, 
      "responses": 8, 
      "subject": "Soil and plant problems", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2228"
    }, 
    {
      "body": "Given the current vogue to 'save the planet' (quite how it managed without our help I'll never know) I've been thinking about Double Glazing the flat. Has any one done this and are there businesses that make listed friendly units - not secondary glazing - proper double glazing units?", 
      "date": "2007-07-09 20:14:00", 
      "id": 3787, 
      "responses": 8, 
      "subject": "Double Glaze Barbican Flats", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3484"
    }, 
    {
      "body": "Hello One of my kitchen worktop strip lights seems to have died.  Does anyone know where I can buy a new one? Thanks.", 
      "date": "2007-02-10 09:20:00", 
      "id": 4232, 
      "responses": 8, 
      "subject": "Kitchen worktop strip light", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3051"
    }, 
    {
      "body": "We're about to rent a flat in Willoughby but it doesn't have an oven.  We want to fit one but, in traditional Barbican style, the gap is 57cm rather than the standard 60cm.  Apart from a really expensive Siemens model, does anyone know an oven that would fit?", 
      "date": "2006-03-26 10:42:00", 
      "id": 3062, 
      "responses": 7, 
      "subject": "Oven width ...?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2155"
    }, 
    {
      "body": "Has anybody found bathroom cabinets to fit underneath original Barbican basins ?", 
      "date": "2007-08-10 12:32:00", 
      "id": 3397, 
      "responses": 7, 
      "subject": "under basin bathroom cabinets", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3576"
    }, 
    {
      "body": "Hi, I have the traditional curtain pulley system on all three windows in my flat. In one of them, the plastic tensioner at the bottom of the wall is broken. The DIY shop on Aldersgate Street couldn't help, and no British websites seem to stock them. After a bit of investigation, I found that the part is 9943E.025 by Levolor Kirsch Newell. Googling for it found I found a few US web sites (the most promising I've listed below) - very cheap - from $4 - nothing with the exchange rate these days. However in my experience, US websites normally take 2 months to ship anything across the pond.   So, before I place my order and wait 2 months for the snail mail, does anyone else have any other suggestions, or alternate parts they've used? Thanks Paul.", 
      "date": "2006-09-02 12:21:00", 
      "id": 4487, 
      "responses": 6, 
      "subject": "Curtain Pulley Tensioner", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2573"
    }, 
    {
      "body": "We live at the Aldersgate end of the estate and are wanting to buy our tree this week - any ideas where the closest sales point is? Vaguely remember from last year that there was a delivery service out there somewhere, does anyone have any details? Many thanks.", 
      "date": "2005-12-12 16:25:00", 
      "id": 3006, 
      "responses": 5, 
      "subject": "X-mas tree - where from?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1983"
    }, 
    {
      "body": "We are investigating having the carpet replaced in our flat in Thomas More. Does anyone know what kinds and colours of carpets the flats had when the building was new, or how to find out what they might have had? Any advice about good places to source carpet from would be good too (we've already taken advice from the good people at John Lewis). Thanks.", 
      "date": "2006-04-26 14:10:00", 
      "id": 3069, 
      "responses": 5, 
      "subject": "Carpeting", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2226"
    }, 
    {
      "body": "My original oven/grill has sadly gone! Does anyone know where to buy a replacement in keeping? R", 
      "date": "2007-05-30 09:22:00", 
      "id": 3332, 
      "responses": 5, 
      "subject": "Oven", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3372"
    }, 
    {
      "body": "I am after a 17ft long floor to cieling vertical blind on track - I have found some pretty good options, but would like blinds that provide full blackout, and possibly with a material finish - like grey felt. Any ideas? Thanks Max", 
      "date": "2005-12-08 00:10:00", 
      "id": 3000, 
      "responses": 4, 
      "subject": "vertical blinds", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1975"
    }, 
    {
      "body": "Hi all I'm after faux fur for Halloween costumes. Does anyone know if there are any shops/wholesalers that might stock it around the area or around Brick Lane?", 
      "date": "2007-10-26 16:29:00", 
      "id": 3459, 
      "responses": 4, 
      "subject": "Fabric / Haberdashers in area", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3748"
    }, 
    {
      "body": "With the hope that summer might be on the way (and in fact first sunshine of the weekend seems to have just arrived) I am trying to find a very simple sail awning for my balcony.  however all the ones i have researched online are way too big, and even Habitat's version is too wide to fit. has anyone come across anything that works for Barbie balcony (I am top floor lowrise with L-shaped balcony) thanks", 
      "date": "2008-04-20 13:54:00", 
      "id": 3881, 
      "responses": 4, 
      "subject": "Balcony shade", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4253"
    }, 
    {
      "body": "Does anybody know whether anybody still manufactures Barbican bathroom tiles?", 
      "date": "2005-10-20 10:53:00", 
      "id": 4508, 
      "responses": 4, 
      "subject": "Bathroom tiles", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1897"
    }, 
    {
      "body": "Hi, I need to get a small washing machine (500 cm wide) for a barbican studio original kitchen. Has anyone any idea where you can get a good one? Thanks Max", 
      "date": "2005-11-14 16:08:00", 
      "id": 4532, 
      "responses": 4, 
      "subject": "small washing machines", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1935"
    }, 
    {
      "body": "the thermostat on one of my (original) hob rings has broken and I wondered if anyone has any experience of fixing/replacing? I am assuming the thermostat control will be behind the electricity knob on the overhead panel but it may be that it is under the ring itself. also, has anyone found a supplier for replacement rubber seal rings for the hobs? mine are on their last legs....", 
      "date": "2006-01-05 08:07:00", 
      "id": 3043, 
      "responses": 3, 
      "subject": "kitchen question....", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2015"
    }, 
    {
      "body": "Hi I was thinking of changing the flooring in my kitchen and loo as the old vinyl (I think?) is looking a bit worn.  Does anyone have any suggestions as to what to replace it with or have any recommendations as to where  to buy?   I'm looking for something dark (ish), sleek and modern that won't be damaged by my jupming washing machine... Thanks very much.", 
      "date": "2006-07-29 16:53:00", 
      "id": 3125, 
      "responses": 3, 
      "subject": "Flooring for kitchen and loo", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2489"
    }, 
    {
      "body": "I have recently moved here to a virtually original flat.  The oven door no longer closes fully and heat is escaping.  Is there an alternative to a new oven? Can someone let me know what the original kitchen floors were and if there is a modern day equivalent. Thanks", 
      "date": "2007-07-28 16:47:00", 
      "id": 4107, 
      "responses": 3, 
      "subject": "Oven door and kitchen floor", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3540"
    }, 
    {
      "body": "Hi everyone, I am in early pregnancy stage now.  The bath tub in our flat in andrewes house is 60cm(equal to 2 feet) tall.  Although i am able to get into the bath tub now, i dont think it will be easy for me to do that in a few months time (i am 160cm tall). i am worried it would be slippery and risky. We rent this flat and are planning to ask the landlord permission to change the bath into a walk in shower. We checked with a plumber to change the bath tub into a walk-in shower, and the estimate he gave is around 6000 pounds. My queries are: 1)does all barbican flats have this tall bathtubs. Landlord/estate agent say this is an original bathtub. what does \"original\" mean....size, shape, material..??? 2)How do pregnant women here manage to get in..any tips? 3)Is there any other less expensive solution available? (like power bath tubs that lifts the user and drop in..like those used by elderly people...are they less expensive to replace the existing normal tubs) 4)what is typically done when some modification effort is undertaken. (other than getting permission from landlord, informing estate office and dropping a note to neighbouring flats about the planned work) we plan to ask the barbican estate office for some contacts of plumbers familiar with barbican issues any suggestion or info or pointers would be useful. Thanks", 
      "date": "2006-06-04 18:48:00", 
      "id": 4410, 
      "responses": 3, 
      "subject": "barbican bath tub query", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2336"
    }, 
    {
      "body": "A bit early I know but... does anyone know where I could get a real Christmas tree for my flat this year? Any recommendations? Thanks", 
      "date": "2005-10-12 16:57:00", 
      "id": 4436, 
      "responses": 3, 
      "subject": "Christmas Trees", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1879"
    }, 
    {
      "body": "Does anyone know where to get an oven that fits into the kitchen space provided in the studio type 2 apartments in the Barbican?  This seems to be slightly smaller than the 'standard' size ovens available, and we are having trouble locating one/ stockists. Our space accomodates 540mm width.  Any suggestions or help would be much appreciated, especially with the onset of winter!", 
      "date": "2005-11-12 12:55:00", 
      "id": 4525, 
      "responses": 3, 
      "subject": "Ovens", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1932"
    }, 
    {
      "body": "Hi Does anyone have a supply of spare Barbican light switches? Or, does anyone know where to buy one? Or, failing that, has anyone successfully repaired one?? (the rocker has stopped working). Thanks!", 
      "date": "2005-11-22 11:01:00", 
      "id": 4540, 
      "responses": 3, 
      "subject": "Replacement light switches", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1951"
    }, 
    {
      "body": "For the last few years, I have used wooden planters on the top balcony of my Willoughby House flat.  Inevitably, after two years at best , they disintegrate.  Does anyone know of good alternatives, and where to find them?  Size is a problem - the wooden ones are about 120 centimetres long, and 14c wide and deep, too big probably for ceramic cotainers.", 
      "date": "2006-04-15 08:39:00", 
      "id": 4651, 
      "responses": 3, 
      "subject": "Planters", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2200"
    }, 
    {
      "body": "Hi We're looking into changing our floor from (a worn-out) carpet to something fresh-looking (and hopefully long-lasting) like rubber. Has anyone got any good advice on suitable rubber flooring? In particular, can anyone recommend a system which is as good as carpet for stopping sound transmission to the floor below? I don't want to annoy the neighbours!", 
      "date": "2006-05-08 06:48:00", 
      "id": 3090, 
      "responses": 2, 
      "subject": "Rubber floors", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2271"
    }, 
    {
      "body": "Anyone know where I can buy a small double bed? I found one in John Lewis (of course) but when it arrived it was a complete disaster and had to be returned. Now I can't find another (or rather I can't find a shop which has them on display so I can see before I buy). Any suggestions gratefully received, thanks.", 
      "date": "2006-06-27 19:22:00", 
      "id": 3169, 
      "responses": 2, 
      "subject": "SMALL DOUBLE BED", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2404"
    }, 
    {
      "body": "Has anyone had experience of replacing an original barbican sink unit (or complete kitchen come to that!) whilst retaining the garchey? We have just bought a flat whose previous owner seems to have spent many happy years 'redesigning' the kitchen. Now all that is original is the garchey, sink and surrounding stainless worktop.  The rest is either missing or replaced with non-original parts in various states of disrepair. We would like to replicate an original Barbican kitchen around the garchey, but are wondering whether we should keep the sink/surrounding stainless and do our best to fit everything else around this unit, or remove everything but the garchey and start again, sourcing a specialised 'garchey' sink from somewhere. Any advice would be much appreciated!", 
      "date": "2007-09-04 10:25:00", 
      "id": 3417, 
      "responses": 2, 
      "subject": "Replacing Barbican sink whilst retaining garchey - possible?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3629"
    }, 
    {
      "body": "Hi Does anyone have one of these?  My husband wants one, but the door frames in Shakespeare Tower are not significant enough to hold a bar.  Would appreciate any suggestions? Thanks Wendy", 
      "date": "2008-01-02 14:15:00", 
      "id": 3542, 
      "responses": 2, 
      "subject": "Pull Up/Chin Up Bar", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3900"
    }, 
    {
      "body": "Does anyone know where to get inner cotton (net) curtains for the length and width of the Barbican windows, preferably cheap? Thanks", 
      "date": "2008-05-12 07:27:00", 
      "id": 3582, 
      "responses": 2, 
      "subject": "Curtains", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4330"
    }, 
    {
      "body": "My oven dial/knob has broken. Does anyone know please how I can get another one or who could fix it for me? If I end up having to get a new oven, does anyone know whether John Lewis or anyone has the correct size? I have visions of having to get an entirely new kitchen. Thank you.", 
      "date": "2008-05-14 21:08:00", 
      "id": 3596, 
      "responses": 2, 
      "subject": "Oven dial/knob", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4341"
    }, 
    {
      "body": "Does anyone have problems with the brush seals between sliding windows of the type found in below podium/brandon mews/wallside? The majority of mine were missing when I moved in and now the cold wind howls in. Does anyone know (a) if it's possible to get new brush seals which fit into the existing metal slots and (b) if fitting the seals is a simple DIY job or something needing a glazier with Barbican experience?", 
      "date": "2005-11-19 09:26:00", 
      "id": 4531, 
      "responses": 2, 
      "subject": "Window seals", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1940"
    }, 
    {
      "body": "Hi, I am restoring my bathroom as best as i can, but am struggling to find a non flashy, functional shower head that fits in with the barbican style. Can anyone point me in the direction of the appropriate firm? Thanks Max", 
      "date": "2006-03-07 18:35:00", 
      "id": 4611, 
      "responses": 2, 
      "subject": "barbican shower fittings", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2119"
    }, 
    {
      "body": "Anyone know where I can get plastic sheeting large enough to wrap a king sized mattress in?", 
      "date": "2005-04-14 16:22:00", 
      "id": 2912, 
      "responses": 1, 
      "subject": "plastic sheeting", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1563"
    }, 
    {
      "body": "Does anyone know where I can obtain swivel hooks for indoor hanging plants?", 
      "date": "2006-08-20 12:20:00", 
      "id": 3163, 
      "responses": 1, 
      "subject": "Plant hooks", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2543"
    }, 
    {
      "body": "Oddly enough, another bathroom question. Our original loo has suddenly cracked all the way around the U-bend near the wall, for no apparent reason. No knocks or accidents (and we are both lightweight people!) It will have to be replaced, as it is now leaking badly. We've tried patching it up with various plumbers' supplies, but I think the damage is too extreme. Has anyone else had an original loo suddenly crack so dramatically? Has anyone managed to get another original loo out of the original fittings store, and was it OK?", 
      "date": "2007-03-06 15:07:00", 
      "id": 3273, 
      "responses": 1, 
      "subject": "Cracked loo!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3111"
    }, 
    {
      "body": "I need to replace the oven and grill below the hob in my small studio flat.  Any ideas please as it obviously has to fit in the small space available? Thanks", 
      "date": "2007-05-04 21:30:00", 
      "id": 4325, 
      "responses": 1, 
      "subject": "cooker in studio flat", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3305"
    }, 
    {
      "body": "I want to hang some window-box style planters from the wall of our balcony, on the inside facing our windows. Does anyone know where I can buy the metal brackets that I can see others use (I don't know if they come with the boxes or not?)? Thanks.", 
      "date": "2005-05-15 18:48:00", 
      "id": 4659, 
      "responses": 1, 
      "subject": "Source for brackets for planters", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1633"
    }
  ]
}