{
  "summary": [
    {
      "body": "Dear All, I do not know if you have received the letter from the estate office about the Garchey. Practically we have to vote about the removal. I am in favour of the removal because the garchey is a polluting system of disposal: I invite the people who oppose this to look at the functioning:just google garchey+ Corporation - [b]the rubbish is treated twice with polluting agents such as thick bleach which is  very polluting plus the chemicals you use to keep the monster clean.[/b] What I oppose is the fact that I have to pay again for the removal when I ahve already paid for it , the average cost for the removal of the syphon is about 500 pounds which I will be happy to spend on a romantic week end but not for the Corporation. I am willing to pay for the removal of the pipes and parts in common but not for the syphon etc in my flat. [u]I propose to write yes to the removal but not willing to pay for the removal of the syphon as already removed[/u] I am already paying for a service that i do not receive I mean I pay for people to use it 110 pounds and I think this is enough in terms of contribution for the community. So I invite the people who support this to form a lobby or write directly to the Corporation. Union makes strength as we say in Italian.[b]   [/b]", 
      "date": "2006-08-02 08:31:00", 
      "id": 4480, 
      "responses": 55, 
      "subject": "Garchey! We have to vote...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2501"
    }, 
    {
      "body": "I was talking to a friend of mine who lives in a large block of flats in Hammersmith and the subject of service charges arose.  When I told him what my service charges were, and that Barbican residents tended to complain about service charge levels he fell about laughing - his were around 4 x higher than mine - admittedly for a larger flat.  And his was an all freehold block run by a management company controlled by the residents themselves.  Anyway his charges were around 6,000 a year, which perhaps puts into perspective some of the bleats about high service charges in the Barbican.  They did get heating and hot water within their charges, but no gardens, no daily rubbish collection and no general back-up which we seem to be able to get from the Estate office.  Just thought I would make that point to this forum.  Personally I feel we do pretty well - and no I don't work for the City of London!", 
      "date": "2006-11-30 23:34:00", 
      "id": 3228, 
      "responses": 3, 
      "subject": "Service charges", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2793"
    }
  ]
}