{
  "summary": [
    {
      "body": "My JLP sources confirm that the Waitrose is definately coming to Cherry Tree Walk!", 
      "date": "2006-03-09 11:10:00", 
      "id": 4459, 
      "responses": 254, 
      "subject": "Waitrose", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2122"
    }, 
    {
      "body": "Headline on page three of Islington Tribune. Apparently the land lord of Cherry Tree walk - UBS, is not going to re-new the leases on the shops there, next June.  As you can imagine the small shop keepers are up in arms and organising a petition, no more chemist, cleaners, stationers, cafes.  What a shame and all because of Waitrose. UBS wishes to develop the shopping centre!  Hmm.", 
      "date": "2006-10-14 09:28:00", 
      "id": 4176, 
      "responses": 94, 
      "subject": "Global giant plans to evict traders from shopping Mall", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2678"
    }, 
    {
      "body": "I hate to tell you this, but I have been stopped twice since the weekend by groups of Spanish kids with cases looking for the Barbican YMCA. I hope we're not in for a repeat of last summer....  ", 
      "date": "2007-08-02 08:57:00", 
      "id": 3626, 
      "responses": 29, 
      "subject": "YMCA new Spanish invasion?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3553"
    }, 
    {
      "body": "Great news - the plans for the new GSMD tower and scheme have NOT been passed by the planning committee today. The application was \"sent back\" rather than being rejected, as rejection would rule out any development on the site. But this appears to mean that the plans proposed are dead and it is back to the drawing board.  Well done to everyone who has been involved in objecting and campaigning against this. Perhaps someone that was there can fill in a bit more detail as I only heard this indirectly. Hopefully something that will work for everyone will come out of this in the end.", 
      "date": "2007-05-15 12:35:00", 
      "id": 3729, 
      "responses": 29, 
      "subject": "Milton Court - the tower has been rejected", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3332"
    }, 
    {
      "body": "Does anyone have any information as to how high, how wide, the number of students, the age of said inhabitants, when will the structure be finished, when will the first kids be under roof etc. etc.! I've heard all kinds of stories, some plausable, some pretty far fetched, a few wanting me to sell up and flee. Having risen from the ashes of the old seat of learning the structure at present looks pretty formidable to say the least! Many months ago I was under the impression it would be a one story group of buildings. If one looks at what has risen so far that couldn't be gospel. I've even heard that there will be situated a football pitch on the roof!!! Enough rumours and neighborhood horror stories...any REAL information to give we who are interested to the point of distraction!", 
      "date": "2007-03-02 17:59:00", 
      "id": 3568, 
      "responses": 25, 
      "subject": "That shiney new school on Whitecros Street.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3095"
    }, 
    {
      "body": "We've just come back from a lovely first visit to the Wood Street Restaurant and Bar. Gorgeous food, great service, wonderful setting.  When it came to paying the bill, we asked if we could pay the main part with a card but pay the service charge in cash to ensure the staff get it. We have no problem excercising this legal right in other restaurants. You may or may not be aware but whenever the service charge is paid with a card, the staff do not get it but the corporation who owns the restaurant does. Time Out Magazine wrote a piece about a year ago stating that if you want to ensure the staff who served you are rewarded with a tip, then pay the service charge in cash. Our friendly and efficient waitress asked the manager on our behalf if we could do this, but she refused. We HAD to pay it with the card.  We were shocked that the manager refused point blankly and didn't even come over to explain why but decided not to go any further, we had a lovely meal in wonderful surroundings but ended up paying the waitress some more on top of the service charge as we left, just because we felt so bad for her.  She seemed to have no idea that she was entitled to the service charge. At St Paul's Chez Gerard, our regular haunt we often pay the service charge in cash and it goes directly to the staff. NB: the manager of the Wood Street Bar is the daughter of one of the three owners, who also own other restaurants, which is probably why she didn't want the staff to get the tips but her father's company instead. When we go next week, we'll have to point blankly refuse to pay the service charge with a card or bring extra cash. I understand Wood Street Restaurant is very popular with us Barbican residents on Sundays. May I suggest, if you'd like the service charge to go to the staff (and not just the manager's family and business partners), that you consider paying it in cash and ask for this right if they refuse you. We will, as otherwise, there's no incentive for good service.  In other London restaurants (and other parts of the world, especially the States) , waiters and waitresses thrive on their good tips, it's a shame that their right to this has been eroded at our local.  Has anyone else experienced the same problem at the Wood Street or any other local restaurants?", 
      "date": "2007-04-18 14:59:00", 
      "id": 4326, 
      "responses": 25, 
      "subject": "Tips at the Wood Street Restaurant and Bar", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3242"
    }, 
    {
      "body": "Work men seem to be refitting it.  Does anyone know if/when it is reopening?", 
      "date": "2006-09-25 13:26:00", 
      "id": 4313, 
      "responses": 23, 
      "subject": "Crowders Well to Re-Open?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2630"
    }, 
    {
      "body": "I understand that Heron, the  company owned by Gerald Ronson, has supplied Linklaters with excellent secondary glazing as a form of minimising noise during the demolition/construction opposite. As far as I know the same offer was not made to the residents of Speed and possibly Willoughby who are even closer to the site. Why have the house committees and the BA itself not taken action on behalf of the residents?  Why has there not been any public information?  Heavy and noisy destruction is about to start and nothing has been done. Answer please!", 
      "date": "2008-02-04 08:35:00", 
      "id": 3501, 
      "responses": 21, 
      "subject": "Milton Court:  Failure to protect Speed and Willoughby", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3978"
    }, 
    {
      "body": "Had a letter and saw an application in the Standard last night (Tues.) for conversion of the turret in Aldersgate Street (sort of above the Indian restaurant) in to a flat.How bizarre.  They are going to have windows - obviously but they are currently slits, hence the turret like look. Hope they whoever they are will not spoil it.  This is a nicer addition to the Barbican than the dreadful fire station so I hope someone keeps an eye on it.  I don't object at all just hope the outside is not changed.  The Estate office seems to be \"selling off\" odd bits like 60 Aldersgate Street and now Pinxtos.  Maybe the old police station will change to.", 
      "date": "2007-01-31 10:19:00", 
      "id": 3275, 
      "responses": 20, 
      "subject": "Turret planning permission", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2985"
    }, 
    {
      "body": "My JLP sources confirm that the Waitrose is definately coming to   Tree Walk!", 
      "date": "2006-03-09 11:10:00", 
      "id": 1176, 
      "responses": 14, 
      "subject": "Waitrose", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&hilit=Organic+Morello+Cherry+Preserve&t=2122"
    }, 
    {
      "body": "Hello.  Does anyone know why two free newspapers, their flag indicating they published by the same thisislondon.co.uk that issues the 50p Evening Standard, now seem to need to employ five or more people to push them directly at pedestrians along both sides of the road at Barbican Station?  Is it possible to restrict this form of harassment?  I seem to be a target even when carrying a Standard. Pushers now operate in the Beech Street tunnel; one of those haunts the Bus Stop thrusting at those getting off and those waiting; two block the Station entrance, and another has pitched outside the new Tesco.  Metal stands similar to the Metro paper stands are available for anyone simply to pick up a paper if they want it.  The mess left by residual papers on the pavement is also getting worse.", 
      "date": "2006-12-13 19:00:00", 
      "id": 3314, 
      "responses": 14, 
      "subject": "Newspaper pushers at Barbican Station", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2830"
    }, 
    {
      "body": "I see that the offices in Roman House (corner of Wood and Fore streets and facing Andrewes House) have been vacated and sold on to a developer for 20mil. Does anyone know whether this is also part of the JP Morgan/St Alphage massive development and whether they are also due to be demolished and redeveloped?", 
      "date": "2007-12-13 12:37:00", 
      "id": 3556, 
      "responses": 14, 
      "subject": "Roman House - Fore/ Wood Street", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3866"
    }, 
    {
      "body": "In case anyone's interested but hasn't heard the news, it looks like part of Smithfield market is to be replaced with an office block:  I assume this is the bit at the west end of Smithfield, with Simply Sausages in it? It'd be so much nicer to see it all fixed up and used as is, but I guess \"nicer\" is nowhere near as important as \"more lucrative\" for the people involved.", 
      "date": "2006-05-18 14:23:00", 
      "id": 3731, 
      "responses": 14, 
      "subject": "Part of Smithfield to be demolished", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2303"
    }, 
    {
      "body": "I see today that Frank Harris have a couple of 1 beds, one in BJH , on for 400K  and above  I'm astounded by this,  are they really shifting flats at this level???  Is it all because of Waitrose??", 
      "date": "2007-02-12 13:55:00", 
      "id": 4388, 
      "responses": 14, 
      "subject": "Flat Price Shock", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3056"
    }, 
    {
      "body": "i see on \"skyscrapernews.com\" that j.p.morgan are planning a 21 story office block for the site completion by 2011.well that leaves us more or less living in a valley, very new york. i expect we will loose yet another pedestrian bridge!", 
      "date": "2007-05-04 05:53:00", 
      "id": 4324, 
      "responses": 13, 
      "subject": "st alphage house redevelopment", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3301"
    }, 
    {
      "body": "Does anyone know of any independent pubs in the City of London? Pubs that are not owned by big companies, and are not part of a brewery chain. Genuine free houses. I've been looking for one, and I can't find one anywhere. Someone who works in a pub told me that as far as she knows there aren't any - the rents are just too high here. Anyone know if this is true?", 
      "date": "2006-12-06 16:03:00", 
      "id": 3235, 
      "responses": 10, 
      "subject": "Are there any independent pubs in the City?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2811"
    }, 
    {
      "body": "I think that the Waitrose thread includes a mention of Fresh & Wild, the 'health' food shop in Old Street, near the roundabout. I have heard that it will shortly be closing.  Can anyone confirm this?", 
      "date": "2006-05-09 12:33:00", 
      "id": 3093, 
      "responses": 9, 
      "subject": "Fresh & Wild", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2274"
    }, 
    {
      "body": "Life just gets better and better here . . . the new zebra crossing opposite the Barbican Tandoori has now opened and is getting lots of use. Much needed! And I've seen two cyclists being cautioned by police at the corner of Aldersgate and Beech Street in the last week. Hopefully the message will get round that cyclists should ride responsibly . . .  [cue the flame war]", 
      "date": "2007-01-29 22:34:00", 
      "id": 3281, 
      "responses": 8, 
      "subject": "Aldersgate zebra crossing", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2974"
    }, 
    {
      "body": "i have been informed by an other resident that a new group of people that have recently moved into the ymca are offenders serving probation,as a resident sharing facilities ie showers bathrooms and toilets and this situation is true would we not have a right to be informed about this?", 
      "date": "2007-01-16 18:01:00", 
      "id": 4187, 
      "responses": 7, 
      "subject": "ymca", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2921"
    }, 
    {
      "body": "Does anyone know if there are exciting archaeological discoveries being made on the site of the new school in Whitecross St.? I can see it from my windows and was surprised to see that a large white protective roof has gone up over part of the site. There's a notice saying 'Danger Deep Excavation' on the surrounding fencing. The people who've been visible on site today are certainly not the usual workforce, either. As an historian specialising in this area I'm fascinated!", 
      "date": "2006-05-05 14:56:00", 
      "id": 3108, 
      "responses": 6, 
      "subject": "Archaeology on the new school site?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2256"
    }, 
    {
      "body": "Not the furry kind but the shop variety. I finally had the excuse to go into the lovely shop Fox by Moorgate and London Wall and it was worth the wait. Although I couldn't find everything I needed the service was brilliant and I've now got matching belt and shoes... gorgeous! If ever you find yourself with an excuse (& cash) or just curious I can certainly recommend it. Stark contrast to my encounter in Ede and Ravenscroft (Cambridge branch) last week when buying clothes for my Civil Ceremony. Having gone through the whole measuring and trying bit for 1/2 hour, the shop assistant (boring dry personality) asked what the suit was for. When I told him, it was just like the scene of the conservative lady in Little Britian, I thought he was going to ask to wash his hands! Needlessly to say I just left.", 
      "date": "2008-04-25 11:00:00", 
      "id": 3891, 
      "responses": 6, 
      "subject": "Fox", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4274"
    }, 
    {
      "body": "I see \"Spianata\" are opening a shop on Moorfields. Their   looks enticing - has anyone eaten at their other shops? Less excitingly, Pret a Manger are opening a branch in what used to be Extra Time on Long Lane.", 
      "date": "2007-07-31 11:56:00", 
      "id": 4111, 
      "responses": 5, 
      "subject": "New lunch options", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3548"
    }, 
    {
      "body": "Rumoured yesterday that the King's Head on the corner of Chiswell and Silk streets is closing permanently in February for redevelopment of the block......first I heard!", 
      "date": "2007-12-03 13:24:00", 
      "id": 4160, 
      "responses": 5, 
      "subject": "King's Head", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3838"
    }, 
    {
      "body": "Further to the article Healthy Options in Barbican Life I thought I'd let people know that Champneys CityPoint has actually closed down. An enquiry to their Head Office leads me to believe that the premises are now up for sale.", 
      "date": "2006-03-28 08:56:00", 
      "id": 4635, 
      "responses": 5, 
      "subject": "Champneys CityPoint has closed down", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2161"
    }, 
    {
      "body": "our lovely Barbican cleaner (Harry) told me today that there is a petition  to support a Waitrose store opening in the new building on Aldersgate Street (on same side as tube diagonally opposite Holmes Place) ...  true - or just a wild and hopes-raising rumour?  Just think - no more somerfield...", 
      "date": "2005-07-12 15:59:00", 
      "id": 4701, 
      "responses": 5, 
      "subject": "wild (nice) rumour", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1741"
    }, 
    {
      "body": "Just read this on Timesonline   and even though we wouldn't mind a few more shops open on the weekend, we wouldn't want the City to become another West End. The reason we live here is for the peace and quiet. We would hate to see this beautiful part of London spoilt by a mass of high street shops. ", 
      "date": "2008-02-04 20:28:00", 
      "id": 3779, 
      "responses": 4, 
      "subject": "Rival to Blue Water Shopping Centre", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3981"
    }, 
    {
      "body": "A number of people have been disturbed by construction noise from the Islington side of the border. The Environmental Health Department in the borough of Islington is not as effective as our own.  They do not work at weekends which is when it appears that most of the problems have occurred.  In fact, they actually asked the City to monitor the behaviour of British Land at the Ropemaker", 
      "date": "2008-03-18 15:22:00", 
      "id": 3834, 
      "responses": 4, 
      "subject": "Islington construction noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4136"
    }, 
    {
      "body": "Someone once told me that you can get married at St Pauls if you are  a resident of the city. Is this true? Sounds a bit far fetched to me!", 
      "date": "2008-04-27 12:13:00", 
      "id": 3889, 
      "responses": 4, 
      "subject": "Weddings at St Pauls", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4279"
    }, 
    {
      "body": "The HSBC Poultry and Princess branch - the old Midland Bank Headquarters, next to the Bank of England - closes this Friday, 20th July. This branch has one of the last great Banking Halls still in use for it's original purpose. So if you want to see it before it closes, you better go now.  If you are not a HSBC customer, don't worry, there are two entrances, one at each end of the building, you enter at one, and walk the length of the banking hall to exit at the other. The branch has been doomed since HSBC moved their headquarters to the Docklands in 2004. The offices above the hall were closed at that date, HSBC sold the building for 40m and rented the ground floor for 1m a year. It has since been sold again for 72m. Since the building is Grade 1 listed, it cannot be demolished - it's supposedly going to become a grand hotel - the Banking hall becoming the hotel lobby, with the offices above being turned into hotel rooms. The replacement HSBC branch is in an inconvenient location (for the Barbican anyway) on the corner of Queen Victoria Street and Queen Street, close to Mansion House Tube. They converted the ground floor of some offices into a branch. I wouldn't hold out much hope for any architectural interest...", 
      "date": "2007-07-17 08:58:00", 
      "id": 4042, 
      "responses": 4, 
      "subject": "Closure of a Grand Banking Hall - HSBC Poultry and Princess", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3502"
    }, 
    {
      "body": "I was disappointed to see that the Fox and Anchor has closed as it was a really nice Art Nouveau-ish local pub - and still had Smithfield opening hours so that it did a great breakfast. Anybody know if anybody's got plans to take it over?", 
      "date": "2006-09-30 20:27:00", 
      "id": 4289, 
      "responses": 4, 
      "subject": "Fox and Anchor closed down", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2646"
    }, 
    {
      "body": "Did anyone see the former Merril Lynch demolition site building on the weekend? They seemed to have hit a water main on Friday and the whole (former) basement was filled with water!   It was amusing to see the bemused night watchman watching the site filling up. Pumps installed on Saturday morning slowly removed a few million litres over the weekend.", 
      "date": "2005-07-25 14:18:00", 
      "id": 4705, 
      "responses": 4, 
      "subject": "Ropemaker St demolition", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1761"
    }, 
    {
      "body": "Does anyone know what goes on in the school on sundays? Twice I've walked past to see a Chinese community gathering and yes, I'm very nosey, so just wanted to see what was happening!", 
      "date": "2006-12-18 10:51:00", 
      "id": 3271, 
      "responses": 3, 
      "subject": "City of London school on Sundays", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2843"
    }, 
    {
      "body": "i may have missed this elsewhere, so it might be old news, but I was intrigued in yesterday's observer to see that the Terry Farrell re-development of the far side of Smithfield incorporates the potential to re-locate both the Museum of London and the Barbican Arts Centre ...  doesn't strike me as realistic but stranger things have happened ...", 
      "date": "2007-11-05 09:03:00", 
      "id": 3465, 
      "responses": 3, 
      "subject": "arts centre move?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3773"
    }, 
    {
      "body": "This morning on the way to work I saw a little demo between St Pauls and the Millennium Bridge. There were signs up protesting against the City's plans to allow an incinerator to be built there, just by the Salvation Army building. Anyone know what this is all about?", 
      "date": "2007-07-09 21:13:00", 
      "id": 3483, 
      "responses": 3, 
      "subject": "incinerator near St Paul's?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3485"
    }, 
    {
      "body": "Hi - washer in one of my taps finally went on Saturday am (couldn't turn the said tap off. All a bit worrying!). Wanted to share 2 positive experiences with you all: 1. Car Park attendant - was able to lend me a hammer & a very big adjustable spanner (I only possess a small electrical screw-driver. Not much use in the circumstances!) 2. The hardware shop just past the YMCA is great! Having removed the tap (with the big spanner) I took it along to buy a new washer. One of the guys there removed the old washer (easy) and fitted the new one for me (v hard - had to use a vice + big spanner as the small nut holding the washer on was siezed), whilst the other discussed Mexico with me (his wife is apparently Mexican). It could be that they knew I was a complete novice (reminding me that I should use PTFE tape in refitting the tap & seeing the look on my face probably gave the game away!) Very strong recommendation for both of above! Taps now a speciality. Oh - and the cost? 50 pence!!!", 
      "date": "2008-04-06 16:22:00", 
      "id": 3849, 
      "responses": 3, 
      "subject": "Bryer Car Park Attendant & our local hardware shop", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4194"
    }, 
    {
      "body": "i heard that a italia conti student died after falling out a window at the ymca last week i cant find anything in the news about it?", 
      "date": "2007-12-11 09:44:00", 
      "id": 4171, 
      "responses": 3, 
      "subject": "barbican ymca death ?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3861"
    }, 
    {
      "body": "For those of you who are interested in what was on the school site in previous centuries, I've been doing some more research and found out the following. In the late 18th century a brewery called the Goat Brewhouse was operating. A 20 year old called Sam Whitbread starting working there, then moved to Whitbread's present site within a few years. By 1813 the Whitecross St site was a debtors' prison! It was built to separate debtors from the other prisoners who were held in Newgate, so that they (the debtors) wouldn't be led astray by hardened criminals. The medieval Jewish cemetery was further south than I thought and probably stretched from Thomas More Gardens up to Beech Street.   The dig under the marquee seems to have been completed now, although the soil being replaced is being sifted through, but there's a smaller dig opened up nearer Whitecross. No idea what's there.", 
      "date": "2006-06-22 08:26:00", 
      "id": 4434, 
      "responses": 3, 
      "subject": "A little more local history", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2382"
    }, 
    {
      "body": "just to let people know ... searcy's has stopped doing its \"prix fixe\" thing except for pre-performances which is stupidly early ... so the food still looks good but its whoppingly expensive - used to be about 26 for 3 courses before but now the mains alone are about 18-  20 ...  shame because the food is great and its so nice and easy to wander over there ...  funnily enough, it was deserted last night ...  on a brighter note, there's a gourmet burger company opening by St Paul's - the only one of the burger outfits that ever gets me eat that quantity of meat, but they really are the best, healthiest, loveliest burgers in town ... they also do a delicious mushroom burger to salve the conscience ...", 
      "date": "2006-11-16 20:46:00", 
      "id": 3216, 
      "responses": 2, 
      "subject": "searcys", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2755"
    }, 
    {
      "body": "An article today in the Sunday Times makes interesting reading.  Is it indicative of how choices concerning building in the City are made?  I wonder if Mr. Ronson, who they point out was convicted of fraud, will take legal action?  I wonder if the principal person who backed the scheme and is behind the Morgan scheme will now have to justify himself?  I wonder if the procedures by which planning applications are dealt with need review.  Is a judicial review required?", 
      "date": "2008-03-16 09:32:00", 
      "id": 3816, 
      "responses": 2, 
      "subject": "Milton Court and Sunday Times claims", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4129"
    }, 
    {
      "body": "Whilst you are all banging on about the signage on the doorways to our homes someone has merrily placed three giant ashtray bins just beyond the Pizza restaurant - presumably to serve J P Morgan employees et al? This is a 'substantially enclosed area' so are the city turning a blind eye due to London's importance as a financial centre / fear of another exit to Canary Wharf or are JPM just paying the fines as fringe benefit?  Clearly snitching on the freephone number is an option but the politicians tell me that's not the British way.  So stiff upper lips all round!", 
      "date": "2007-07-19 19:35:00", 
      "id": 4049, 
      "responses": 2, 
      "subject": "Smoking whilst Rome burns", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3513"
    }, 
    {
      "body": "Nothing to do with Macs, rather a bit of detective work for Undercover. Last week I bought some apples labelled, both collectively and individually, as Braeburns, from Waitrose. I thought at the time that they looked pretty unlike any Braeburns I had seen before - a much too uniform deep red - but I thought, naively, that Waitrose would not have got it wrong. When I got them home it became perfectly clear from the taste and texture that they were not Braeburns, so I took them back,explained the problem, and my money was refunded without question. However, I noticed that the same apples were still on sale some days later and took it up with a member of staff who was stocking the produce shelves. I pointed out the clear difference in appearance between the loose \"Braeburns\" and the ones in bags, which looked as they should. His explanation was that the loose ones were grown in a different country and that was why they were different in appearance, taste and texture! When I persisted, he said he would take it up with the manager. Today the same apples were still on sale, so I'd like to know when a Braeburn is not a Braeburn!", 
      "date": "2006-09-04 22:38:00", 
      "id": 4468, 
      "responses": 2, 
      "subject": "Apple confusion", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2580"
    }, 
    {
      "body": "Is it all back on again now?   I see the City of London have voted to make a 250m contribution", 
      "date": "2007-10-05 09:13:00", 
      "id": 3445, 
      "responses": 1, 
      "subject": "Crossrail!!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3711"
    }, 
    {
      "body": "As I remember, when the Girls School was getting permission to replace the grass on their playing surface with a synthetic all-weather surface, one of the blandishments tossed up to nearby residents was that the planting around the field would be renovated. There's a strip of planters along the southern edge, and a larger, wilder section above the playing surface on the northern side (with numerous lost tennis balls amongst the wild flowers and shrubbery).  I can't see that any new landscaping has happened, especially on the planters on the southern side. I realize that I should be asking the CoL School about this, but before I do, I wonder if anyone has any inside news, or better ideas? (ps: Tuesday nights seems to be football night for a bunch of large hairy men, who play seven a side football on the all weather surface. I've no problem with that, but I'm surprised that a girl's school can furnish a team for a competition like that).", 
      "date": "2008-05-06 21:15:00", 
      "id": 3570, 
      "responses": 1, 
      "subject": "Gardening around CoL Girls School all weather play surface", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4312"
    }, 
    {
      "body": "Does everyone already know this?  Planning consent has gone in for a change of use for the Butler's Wine Bar site in Defoe Place at the bottom of Shakespeare Tower, to be turned in to Livery Company accommodation. The Worshipful Company of Paviors: currently without a livery hall (motto: God Can Raise to Abraham Children of Stone; mission: to further the craft of paving). At least its not those Haberdashers, they can be pretty rowdy.  The reference is 07/00709/FULL  on the City's planning portal: there doesn't seem to be any associated documents at present to shine more light on the case. This is the same site that the City wanted temporary permission for offices for three years, but what became of that?", 
      "date": "2007-07-31 10:21:00", 
      "id": 4112, 
      "responses": 1, 
      "subject": "Shakespeare Tower Wine Bar Plans", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3546"
    }, 
    {
      "body": "it looks like like its being done up does anyone remember what it used to be like someone told me its been closed up for twenty odd years?", 
      "date": "2005-11-15 17:12:00", 
      "id": 4528, 
      "responses": 1, 
      "subject": "hat and feathers pub", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1938"
    }, 
    {
      "body": "Last Sunday i was passing through the Barbican Centre and thought I'd pop along to the conservatory. I hadn't been for years and was really shocked at how decrepit the place looked. Plants were falling over, some overgrown and others dying, there appeared to be a lack of any thoughtful planting, lots of random pots strewn about the place either empty or with straggeling plats in. Very little clear labelling of the plants that there were and the few labels regarding the areas that the plants were from were embarrassingly lame, giving little real information. The cacti room was closed. I felt depressed leaving the place. My thoughts about the place appear to be reflected by the comments on Babricanliving, and it's suggested that perhaps John Tusa wants to get rid of it, and therefore has cut funding and let it fall into disprepair on purpose. This would certainly be an explanation. Have anyother residents been recently and thought the same? i think it's such a wonderful place and that it's something worth saving. With some thoughtful planting and relevant, well planned labelling it could be a real educational attraction for schools etc. as well as a little haven for those attempting to escape from the city for an hour or so. In it's present state i'd never suggest to any guest visting me on a Sunday that we go. It's an embarrasment. What can we, as residents, do. except write a letter to John Tusa?", 
      "date": "2006-03-25 01:55:00", 
      "id": 4622, 
      "responses": 1, 
      "subject": "conservatory", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2153"
    }, 
    {
      "body": "I wonder if our local police office can cast any light on the rumour on the main discussion pages?", 
      "date": "2007-08-25 12:01:00", 
      "id": 5353, 
      "responses": 1, 
      "subject": "Barbican burglaries?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=3608"
    }
  ]
}