{
  "summary": [
    {
      "body": "What's the established practice for Christmas gift giving/tipping of Barbican staff - porters, window cleaners etc? Having only lived in the Barbican since May this year, this is my first Christmas here. Is the consensus to take the attitude that we already pay enough service charge, so do nothing? Or are people more generous than this? What gifts might people give? I don't want to innocently contribute towards overloading the Shakespeare porters with mince pies and Quality Street.", 
      "date": "2005-12-07 13:06:00", 
      "id": 2999, 
      "sentiment": 2, 
      "subject": "Established practice for Christmas tipping of BBcan staff?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1973"
    }, 
    {
      "body": "Apparently someone in Brandon Mews had some wine stolen from their kitchen windowsill (where it was cooling) a few days ago - it seems whoever took it just carried a ladder into Willoughby 03 car park, climbed up and took it. Fortunately whoever did it ignored my large pot of red cabbage chilling on my own kitchen sill (thieves these days have no taste), but this is a worrying development, since if someone can climb up to a window with a ladder without being challenegd it is only a minor further step to break in.  It seems likely to me that this would not  have happened if the Willoughby 03 CPA office was properly manned - these days it is empty 95% of the time. The Corp have said it will be replaced with an electric gate controlled by the 01 CPA but while the gate has been installed it's not yet in operation. How long until this lacuna is filled?", 
      "date": "2005-12-30 15:27:00", 
      "id": 3019, 
      "sentiment": 2, 
      "subject": "Brandon mews theft", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2002"
    }, 
    {
      "body": "Been out of the swim for a while, but since my return Ive noticed a bit of a cabinet reshuffle with the car park staff. What gives? I know one of our chaps retired recently, decent sort; sorry to see him go. Anyone heard anything?", 
      "date": "2007-09-06 19:30:00", 
      "id": 3430, 
      "sentiment": 2, 
      "subject": "Shake-up down below.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3638"
    }, 
    {
      "body": "Please could someone remind me on the protocol for giving a christmas tip to those hardworking carpark attendants. Is their a central collection or do we residents just do their own thing tucked discretely in an envelope? thanks", 
      "date": "2007-12-16 21:20:00", 
      "id": 4178, 
      "sentiment": 2, 
      "subject": "Christmas tips", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3875"
    }, 
    {
      "body": "Has anyone else lost their tv signal? I'm an Andrewes House resident and have been without a signal since at least Friday. I've played with the cable, connections and turned everyone on and off a few times but to no avail. I suspect it's the signal because the tv actually works fine in watching pre-recorded items off my freeview box. Although my quality of life has probably improved as a result, it would be nice to know whether the problem is localised to me or if anyone else has been affected? Secondly does anyone know if there's a standard e-mail address for the estate office or repairs to which we can send queries such as this to? Thanks.", 
      "date": "2007-04-15 15:00:00", 
      "id": 4380, 
      "sentiment": 2, 
      "subject": "TV signal down?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3233"
    }
  ]
}