{
  "summary": [
    {
      "body": "I just wanted to check whether my flat is the only one suffering this phenomenon, or whether there are others. We asked for the heating trim to be nudged down a month or so ago because we were finding it too warm. Now it is, if anything, a little too cold throughout the day and night.  But at approximately 6am, when we've been tucked up warm under our duvets, it gets so warm that we wake up. (This is occurring separately in two rooms for two groups of people.) I assume that what happens is the body temperature drops (?) to a comfortable level while sleeping, and then at 6am the heating comes on and makes us too hot. Oddly I don't remember this happening in the past, but it's beginning to be a pain, to the degree that I can sleep better elsewhere than I can in my own flat. I've never experienced it during the summer or indeed any other winter as far as I remember. Does anyone else experience this? Is the heating really going on at 6am? Does it need to? And why does it seem so cold later in the day / evening?", 
      "date": "2006-12-19 16:40:00", 
      "id": 3374, 
      "responses": 32, 
      "subject": "Woken up by the heating in the morning? Shivering in the day", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2848"
    }, 
    {
      "body": "I'm still feeling colder than usual in my BJH flat and I've noticed that the heating seems to be on a timer. It warms up for a couple of hours in the morning, but by 11.00 a.m. it's cold underfoot again, then it warms up again in the evening. This is all fine and dandy if you work 9-5, but lots of us don't and are here  all day. Today, despite being a weekend, the same timings seem to be operating. I'm fed up with being cold - this is my third winter here and the previous two had much higher heating levels. Anyone else getting the same heating levels? It's about to turn really cold, especially at night, and it's a bit worrying. We need heat to stay well, especially the older residents among us.", 
      "date": "2007-12-09 11:56:00", 
      "id": 4174, 
      "responses": 14, 
      "subject": "Is the heating on a timer?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3858"
    }, 
    {
      "body": "Hello everyone - I've just moved into a large studio in John Trundle.  I was wondering if anyone could help advise on a question regarding the hot water. After I've run a bath I find that if I want to top it up the water that comes through is cold.  Looking at the boiler it seems big enough to hold water for more than one bath - so I can only imagine that the used hot water is immediately replaced by cold water straight from the mains, which then cools down what is left of the hot water in the boiler.  Any advice would be appreciated! Alex", 
      "date": "2005-11-19 16:24:00", 
      "id": 3004, 
      "responses": 8, 
      "subject": "Hot Water", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1942"
    }, 
    {
      "body": "Has anyone else noticed substantially lower heating temperatures this year? Mine hovers around 58F and only just makes it to 60F in my tiny bathroom. The tiles only feel as though the chill has been taken off, not nice and warm as previously. It used to be too warm for anyone to consider sleeping on the floor and anything left on the floor felt very warm underneath. I have called the engineers twice, but have noticed no change from the chilly conditions prevailing. Obviously, I can top up with additional heaters but I am still also paying for for a severely depleted level of background heating. I understand the system is supposed to maintain at least 60F except in very severe conditions and today it is relatively mild. Brrrr!", 
      "date": "2007-12-04 15:15:00", 
      "id": 3492, 
      "responses": 5, 
      "subject": "Heating temperatures", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3843"
    }, 
    {
      "body": "Is the heating still on for everyone? We complained to the Estate Office last week who said that it had been turned off but would \"take a few days to work through the system\" - something I find rather hard to believe.", 
      "date": "2008-05-18 08:42:00", 
      "id": 3597, 
      "responses": 5, 
      "subject": "Heating...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4350"
    }, 
    {
      "body": "Is it just me or is anyone else suffering heating loss in BJ House this evening? It's freezing and my floors are stone cold.", 
      "date": "2007-11-14 21:20:00", 
      "id": 4141, 
      "responses": 5, 
      "subject": "What no heating?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3794"
    }, 
    {
      "body": "Hi, I am about to invest in quite an expensive floor for my flat. I was wondering what the chances are of needing the underfloor heating servicing, as I understand this is quite an intrusive job. Or, is it possible to get it serviced prior to having the floor put down? All help appreciated Max", 
      "date": "2006-01-04 16:25:00", 
      "id": 3030, 
      "responses": 4, 
      "subject": "underfloor heating / servicing", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2012"
    }, 
    {
      "body": "Hi Barbican I am in the process of buying the smallest kind of studio (F1A) in John Trundle (inward facing). I was wondering if there is anything I should be wary of - things like heating and wether it works, and any Garchey related  issues, for example. Or - huge future service charge bills - I know that the roof and lift has recently been done in JT, but the potential overhaul of Garchey and underfloor heating concerns me a bit.  Also, I will be looking for some original kitchen parts, so if anyone is thinking of selling anything, please let me know.  Also - are there any experts on windowbox plant options? Thanks Max", 
      "date": "2005-10-12 20:37:00", 
      "id": 4437, 
      "responses": 3, 
      "subject": "New resident - questions", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1880"
    }, 
    {
      "body": "Does the fact that I couldn't get any hot water in my studio (rented) today mean that its a problem with my hot water tank, or a building problem. I probably sound like an idiot, but I really don't know the answer.  Any enlightenment appreciated  Ruby", 
      "date": "2007-08-10 21:33:00", 
      "id": 3393, 
      "responses": 2, 
      "subject": "HOT WATER IN JOHN TRUNDLE", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3579"
    }, 
    {
      "body": "Has anyone ever experienced a hot spot on the floor related to underfloor heating? If so, how hot is it, what kind of area would it be, and what are the implicatins? Thanks Max", 
      "date": "2006-03-10 09:05:00", 
      "id": 4609, 
      "responses": 2, 
      "subject": "underfloor heating - hotspot", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2125"
    }, 
    {
      "body": "Is it just us or does anyone else have a very hot flat? We were told that the heating is not on at the moment but we still requested that our heating be turned off. This has not made any difference to the warm temperature in our flat and we wondered if the flats facing St Pauls all suffer from the same complaint.", 
      "date": "2008-05-08 09:56:00", 
      "id": 3575, 
      "responses": 1, 
      "subject": "Heating", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4316"
    }, 
    {
      "body": "Hello Has the heating been turned off? Ben Jonson House is freezing.", 
      "date": "2008-04-07 20:11:00", 
      "id": 3851, 
      "responses": 1, 
      "subject": "heating", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4209"
    }
  ]
}