{
  "summary": [
    {
      "body": "Hello I am an interloper so I hope it's okay to ask this.  I don't live in the Barbican yet and perhaps never will (as you all no doubt know, there is a dearth of properties) but I wondered if any of you would be generous enough to share your thoughts on living there and good points/bad points. I've lived in flats all my life (we currently live near Old Street and hurrah for the new Waitrose even if, yes, some of the staff are very incongruous for JLP) so I know that properties can differ wildly and that it's also a matter of personal choice. But these are the things I'd like to ask (in no particular order): Am I correct in thinking the biggest flats are in the towers? Is it generally a quiet and safe place to live or does it vary wildly from block to block? What's it like for children? The private gardens seem amazing but in reality what's it like? Is the service charge astronomical (I realise it depends on size of flat)? What will happen when all TV goes digital and the Barbican has no digital cable?? Is the listed building classification a pain if you want to do any work in the flat? Garchey, good or bad? Are parking places readily available to rent or is there a shortage? Anything to look for that an outsider may not know about.  I'd be really grateful for any answers. If I can reciprocate in any way...my specialities are fly fishing, beauty products, nutrition and fashion. I know, ecletic and slightly bizarre! Thank you. AB", 
      "date": "2006-06-05 17:37:00", 
      "id": 3180, 
      "responses": 29, 
      "subject": "What's it like living in the Barbican?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2338"
    }, 
    {
      "body": "I'd be interested in people's constructive comments about their experiences or opinions on refurbishing an original Barbican bathroom, versus replacing it with modern fittings in general keeping with the original Barbican design. I've already approached the BEO about the grade II listing constraints. I've also approached the salvage store to confirm availabilty of materials for the refurb route. Next stage is to make a decision about which route to take.", 
      "date": "2007-11-07 12:33:00", 
      "id": 4184, 
      "responses": 23, 
      "subject": "Pros & cons of refurb vs replacing an original bathroom?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3778"
    }, 
    {
      "body": "We currently have an old style kitchen, which we'd like to re-furbish back to it's former glory, as it is looking a bit tired. However my question is , is it worth trying to source all the bits and pieces, as nothing is made anymore. Would it be better financially in the long run to install a new kitchen in a modern style in-keeping with the streamlined 60's/ 70's white feel that the originals have? Does anyone have experience of whether this would add value or lessen it?  It does seem that many people are now getting fed up of the crankiness of the old kitchens , and maybe new buyers would also prefer this as they may find out how difficult it is to repair / source original fittings. So is it worth spending money on re-furbishing the original....or on completely re-fitting in a suitable 'in-keeping with' style?", 
      "date": "2005-08-02 13:09:00", 
      "id": 2989, 
      "responses": 14, 
      "subject": "Kitchen Dilemma", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1778"
    }, 
    {
      "body": "Hi  Does anyone know how to whiten these original Barbican bathtubs.  I am poised to sell/rent my flat and would like a whiter bathtub to be part of the picture. I once had a cleaner from Abracadabra or somewhere come in and they told me something about soaking the tub overnight with bio or non-bio washing powder - dissolved in cold water.  Does anyone know this or any other tricks? Thanks very much, Jeannie", 
      "date": "2007-12-01 14:33:00", 
      "id": 2625, 
      "responses": 11, 
      "subject": "A whiter bathtub", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3831"
    }, 
    {
      "body": "Some questions about the original tiling details to guide us as we refurbish our original bathroom at Bryer Court.   1.  The tiles on the wall adjacent to the bath meet the rolled edge of the bath creating a little valley between the tiles and the bath which traps splashed water.  Currently there is some caulking which tends to retain the water but the detail is messy and crude.   What was the standard original detail and what jointing material was used at this juncture? 2.  Are the original floor tiles different (slightly creamier in color) than the wall tiles?  They seem to be in our bathroom. 3.  What was the original colour of the grout in the joints (i) between the wall tiles, and (ii) between the floor tiles? Any information would be much appreciated.", 
      "date": "2007-03-03 22:33:00", 
      "id": 4781, 
      "responses": 8, 
      "subject": "Original Bathroom Tiling Details", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3099"
    }, 
    {
      "body": "First of all, I'm sorry if these have all been asked about a thousand times before, but i did try searching the forum and i couldn't quite get the answers i needed.  Before i consider making a move to the Barbican, i would be very grateful if anyone could answer these questions: 1. Are the blocks, (especially the high rise ones!) up to modern fire safety standards?  I have visited people in the high rise blocks, (and i have seen the flats on Open Buildings Weekend) and the blocks do not seem to have fire alarms or sprinkler systems, which would definitely be necessary in modern blocks of that height today.  I am not unnecessarily fussing, but i can imagine more pleasant things than being stuck 35 floors up in a fire, with only the balconies and their little fire escapes to escape by (!) 2. Estate agents, etc. make out that the Barbican Estate Office is really really strict about alterations, changing door locks, putting things on balconies etc, but are they really that strict?  Would you, for example, get into trouble for putting a new lock on your front door without telling them (and how would they find out anyway?), or how would they punish you? 3.  Can the Estate Office supply original Barbican fixtures and fittings, for example if the garchey system has been removed can they replace it?  I was told that that semicircular block, Frobisher Cresent, was intended to be flats, but they never built them, so they still have all the fixtures in storage. 4. If you want to change the kitchen or bathroom, would the Barbican office ever not grant permission?  Thank you very much", 
      "date": "2005-06-12 15:09:00", 
      "id": 4662, 
      "responses": 6, 
      "subject": "Some General Questions", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1682"
    }, 
    {
      "body": "I have an original enamel bath with very worn out chrome fittings eg at the plug hole. Does anyone have experience in updating these fittings ?  I know I can re-enamel the bath but the chrome parts need improvement.", 
      "date": "2007-07-16 11:52:00", 
      "id": 4044, 
      "responses": 5, 
      "subject": "Updating chrome fittings on original bath", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3500"
    }, 
    {
      "body": "I have inherited refurbished bath and shower rooms in a tower flat. The lighting in both rooms is from a single source placed near the doors above the basins. I find this single source does not light the room adequately and before I start pulling the entire lot to pieces (including wall to ceiling tiling) I'd appreciate some ideas on improving the lighting. Am I correct in assuming that ceiling lighting is not an option due to the underfloor heating in the flat above? I have a horrible feeling that I am going to have to rip all the tiles off and carry the wiring across the wall to add another wall light, but welcome ideas, especially if an old wiring point may be likely to be lurking behind the tiling. I have looked at the photos on Barbicanliving for clues but am none the wiser. Thanks", 
      "date": "2007-08-12 18:29:00", 
      "id": 3395, 
      "responses": 4, 
      "subject": "bathroom lighting", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3584"
    }, 
    {
      "body": "We're moving into a Barbican flat where the original wardrobes have all been stripped out. (That sounds as though it's against the guidelines...) We'd like to replace them with originals or close replicas and would welcome any advice from others who have done the same.  Is there by any chance a mysterious store of wardrobes next to the mythical store of original kitchens somewhere on the Estate??", 
      "date": "2005-05-16 12:16:00", 
      "id": 4710, 
      "responses": 4, 
      "subject": "Original Barbican wardrobes", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1634"
    }, 
    {
      "body": "If it is true that all of the kitchens and bathrooms originally designated for frobisher crescent are being stored somewhere, and at a cost passed on to us residents, shouldn't we be given the option to get our hands on them?  I would love a spanking new original", 
      "date": "2005-04-27 13:58:00", 
      "id": 4749, 
      "responses": 4, 
      "subject": "hidden gems in frobisher", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1594"
    }, 
    {
      "body": "I have recently moved here to a virtually original flat.  The oven door no longer closes fully and heat is escaping.  Is there an alternative to a new oven? Can someone let me know what the original kitchen floors were and if there is a modern day equivalent. Thanks", 
      "date": "2007-07-28 16:47:00", 
      "id": 4107, 
      "responses": 3, 
      "subject": "Oven door and kitchen floor", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3540"
    }, 
    {
      "body": "I was wondering if anyone has opened up the wall between their kitchen and lounge?  If so, who did the work and would you recommend them?  We're hoping to do the same in our new flat and would like to get someone who comes recommended.", 
      "date": "2007-05-15 19:56:00", 
      "id": 4347, 
      "responses": 3, 
      "subject": "Opening up a kitchen", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3335"
    }, 
    {
      "body": "Hi everyone, I am in early pregnancy stage now.  The bath tub in our flat in andrewes house is 60cm(equal to 2 feet) tall.  Although i am able to get into the bath tub now, i dont think it will be easy for me to do that in a few months time (i am 160cm tall). i am worried it would be slippery and risky. We rent this flat and are planning to ask the landlord permission to change the bath into a walk in shower. We checked with a plumber to change the bath tub into a walk-in shower, and the estimate he gave is around 6000 pounds. My queries are: 1)does all barbican flats have this tall bathtubs. Landlord/estate agent say this is an original bathtub. what does \"original\" mean....size, shape, material..??? 2)How do pregnant women here manage to get in..any tips? 3)Is there any other less expensive solution available? (like power bath tubs that lifts the user and drop in..like those used by elderly people...are they less expensive to replace the existing normal tubs) 4)what is typically done when some modification effort is undertaken. (other than getting permission from landlord, informing estate office and dropping a note to neighbouring flats about the planned work) we plan to ask the barbican estate office for some contacts of plumbers familiar with barbican issues any suggestion or info or pointers would be useful. Thanks", 
      "date": "2006-06-04 18:48:00", 
      "id": 4410, 
      "responses": 3, 
      "subject": "barbican bath tub query", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2336"
    }, 
    {
      "body": "Hi Barbican I am in the process of buying the smallest kind of studio (F1A) in John Trundle (inward facing). I was wondering if there is anything I should be wary of - things like heating and wether it works, and any Garchey related  issues, for example. Or - huge future service charge bills - I know that the roof and lift has recently been done in JT, but the potential overhaul of Garchey and underfloor heating concerns me a bit.  Also, I will be looking for some original kitchen parts, so if anyone is thinking of selling anything, please let me know.  Also - are there any experts on windowbox plant options? Thanks Max", 
      "date": "2005-10-12 20:37:00", 
      "id": 4437, 
      "responses": 3, 
      "subject": "New resident - questions", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1880"
    }, 
    {
      "body": "I want to get my bathroom renovated - regrouted etc. Has anyone had this done and can recommend someone?", 
      "date": "2005-12-10 18:03:00", 
      "id": 3001, 
      "responses": 2, 
      "subject": "bathroom renovation", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1979"
    }, 
    {
      "body": "Has anyone had experience of replacing an original barbican sink unit (or complete kitchen come to that!) whilst retaining the garchey? We have just bought a flat whose previous owner seems to have spent many happy years 'redesigning' the kitchen. Now all that is original is the garchey, sink and surrounding stainless worktop.  The rest is either missing or replaced with non-original parts in various states of disrepair. We would like to replicate an original Barbican kitchen around the garchey, but are wondering whether we should keep the sink/surrounding stainless and do our best to fit everything else around this unit, or remove everything but the garchey and start again, sourcing a specialised 'garchey' sink from somewhere. Any advice would be much appreciated!", 
      "date": "2007-09-04 10:25:00", 
      "id": 3417, 
      "responses": 2, 
      "subject": "Replacing Barbican sink whilst retaining garchey - possible?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3629"
    }, 
    {
      "body": "I'm redoing our kitchen and have removed the (enormous, over-engineered) oven hood and ducting. The Barbican Estate Office give instructions for how to replace it, that involves 'a mechanical volume control damper and suitably sized inlet grill... commissioned to achieve an extract rate of 30 litres per second.' I've tried calling them for advice and left messages, but as a shortcut has anyone here dealt with this issue? I have a suspicion a mechanical volume control damper might just be a slider on the grille... but how do you measure the extract rate?", 
      "date": "2005-11-05 19:34:00", 
      "id": 4521, 
      "responses": 2, 
      "subject": "kitchen ventilation adjustment", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1921"
    }, 
    {
      "body": "Read with interest the recent chain discussing the potential for solar energy (not sure if they manufacture panels sufficiently curved to fit over the barrel vault roofs!!) On a similar tack, has anyone tried refurbishing their windows? Seems to me they are a little below modern standards in terms of seals etc- even the glass seems a little thin. Sure the acoustic and thermal insulation could be improved greatly with use of (eg) neoprene seals and thicker glass. Most modern sealed units block out all but the loudest of external noises.  Also, we have noticed that one of glazing panels is cracked on the outside (could be the window cleaners could be the cold weather???) and that another two have been painted over in emulsion on the inside by a previous resident. Has anyone ever had to arrange for reglazing and, if so, could they recommend a glazier?Appreciate that any alterations involving glazing will be subject to listed building consents etc", 
      "date": "2006-03-05 17:59:00", 
      "id": 4605, 
      "responses": 2, 
      "subject": "Windows", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2111"
    }, 
    {
      "body": "Has anyone fitted a dishwasher instead of one of the kitchen cupboards.  We were recommended to move the sink water heater and put a smaller one next to the garchey.  Has anyone done that?  Who did you use?", 
      "date": "2007-05-20 11:05:00", 
      "id": 3321, 
      "responses": 1, 
      "subject": "Fitting a dishwasher", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3345"
    }, 
    {
      "body": "I have inheritaed a rather scabby, semi-original bathroom.  I would like to either renovate or replace it sympathetically.  Has anyone done similar and have recommendations for contractors, fittings, suppliers, unforeseen problems, etc?  Would be most grateful to hear of your experiences...", 
      "date": "2007-03-30 07:38:00", 
      "id": 4352, 
      "responses": 1, 
      "subject": "Bathroom renovation / replacement", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3189"
    }
  ]
}