{
  "summary": [
    {
      "body": "I know that the following is going to cause a stir. I swear I am writing this with no intention whatsoever of provoking anyone but to canvass views on the subject. I have a friend whose dream is to move to the Barbican. His only \"problem\" is that he owns a little, cute, lovely and well trained dog.  The dog does bark every now and then. But, having said that the new born baby opposite screams keeping me awake most nights and the next door neighbour blows her hair dry at 6.30-6.45 every morning (saturdays and sundays included)!   My friend fully understand that keeping a dog in a block of flats requires extra care to minimise the impact on other residents (e.g. he would never let the dog running around in the gardens fouling the grass-mind the geese already do!). In fact, he already lives in a \"well-to-do\" block of flats in Clerkenwell and has never had any complaints about the dog. Most residential leases of blocks of flats contain restrictive covenants about the keeping of pets. However, these are generally regarded as \"old fashioned\" and as such largey ignored and seldom enforced. Why cannot be the same in the Barbican? Why people have to be deprived of the joy of having a pet? Why cannot pets be allowed (perhaps subject to introducing \"ad hoc\" rules)?   I am also thinking here of the elderly residents to whom the company of a cat and/or small dog could make such a difference.", 
      "date": "2006-08-18 11:19:00", 
      "id": 3167, 
      "responses": 27, 
      "subject": "Pets", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2537"
    }, 
    {
      "body": "Could I say a public 'thank you' to David Graves as Chairman of the Barbican Association fo the work he has done on the legal and practical processes around extending our leases. Clearly it's a matter for personal decision but the agreements he has been able to reach and the document now available are most helpful. Many thanks, Pennie", 
      "date": "2007-04-26 22:00:00", 
      "id": 3474, 
      "responses": 20, 
      "subject": "The Guide to Lease Extensions", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3273"
    }, 
    {
      "body": "I saw that in today's CityAM paper that Wallside has been featured following the buyout of the lease from the Corporation of London (or whatever they are now) to freehold. According to some this adds 30K to this type of property. Mind you they have a valuation of between 1m and 1.2m", 
      "date": "2006-01-12 11:57:00", 
      "id": 3040, 
      "responses": 11, 
      "subject": "Leasehold", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2030"
    }
  ]
}