{
  "summary": [
    {
      "body": "What do people make of the daubing of small penguins on the pillars of Andrewes House? What is 'London Zoo'? Is it a guerrilla marketing exercise or just old fashioned graffit. bit odd. I think the paint looks water based so it must be quite easy to get off.", 
      "date": "2006-02-19 15:27:00", 
      "id": 4594, 
      "responses": 39, 
      "subject": "Penguins on Andrewes House", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2090"
    }, 
    {
      "body": "I complained to Transport for London that only one of the two platforms at Barbican Station was cleared of graffiti after Christmas. I have just received a phone call from Metronet, who say that their contractor has instructions to clean the other platform but cannot do so without access permission from Network Rail - which is not forthcoming. Network Rail's website states that Barbican Station is managed by TfL.   Who knows.  Who cares.  Just join me in bombarding them all with complaints until something happens!", 
      "date": "2008-02-01 14:27:00", 
      "id": 3809, 
      "responses": 10, 
      "subject": "Barbican Station update", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3973"
    }, 
    {
      "body": "There was a spate of graffiti alongside Defoe House over last weekend.  This was quickly removed by the Barbican staff on Monday but it's the first time I've seen this on the Estate.  Has anywhere else been affected?", 
      "date": "2006-02-07 20:08:00", 
      "id": 4570, 
      "responses": 4, 
      "subject": "Graffiti", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2062"
    }, 
    {
      "body": "Over Christmas Barbican tube station was subject to a serious graffiti attack.  Transport for London moved swiftly to remove the graffiti from the north side of the station, but have left it untouched on the now unused, southern platform. I really do not see the point of a job half finished.  The southern platform is now a total mess.   Before Christmas I had been trying to drum up support from members of the Barbican Horticultural Society to take over the planters on that platform and tidy the station up. No chance now I am afraid ", 
      "date": "2008-01-21 19:25:00", 
      "id": 3562, 
      "responses": 3, 
      "subject": "Graffiti at Barbican Station", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3941"
    }
  ]
}