{
  "summary": [
    {
      "body": "Could anyone recommend a good lawyer?. I have had a second opinion on my not healed foot ( 3 months)  by an orthopedic surgeon specialized in feet. My aunt a doctor with 30 years experience has always spoken of clinical negligence as my partner a pathologist, the second opinion has confirmed it. Any good lawyer specialized in clinical negligence to be recommended? I have spoken to a friend of mine but he works in cameron Mckenna and they are quite expensive. As at work my line manager thought I was cheating ( 3 months for a foot to heal?)  plus the NHS ( my employer) has a new policy for people too ill like me, basically they have pushed me into resigning, so I need a good one and cheap if possible...", 
      "date": "2006-11-01 15:32:00", 
      "id": 3189, 
      "sentiment": 4, 
      "subject": "I need a lawyer", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2717"
    }, 
    {
      "body": "Twice in recent weeks the new lift at the eastern end of the estate has broken down.  The telephone number posted for emergencies actually leads to the Guildhall switchboard.  They have no record of who is responsible.  The Corporation failed to pass relevant material sent to them from the then builder Ardmore-Mace (now fired by Gerald Ronson for not being tough enough in their dealings with residents and the Environmental Health people when damage was caused to a number of flats due to their work).  Ardmore-Mace says it is not responsible.  So the fire brigade had to be called.  Anyone using the lift should be aware that aside form shouting no help is available.  The Corporation was informed at least a fortnight ago and still no telephone numbers have been posted. They even claimed that the lift should be maintained by the Estate!  News to the Estate and our excellent engineers.  The Estate was unaware of this and, in any case, the Estate would not assume responsibility for a year after construction.  One trusts that the Estate will charge the Corporation for staff time.   So use that lift at your own risk.  If you press the bell no one who can do anything is altered.  If you use the telephone you get the staff at the Guildhall or the new call centre and the reply that the lift does not exist or they know nothing.  The name of the contractor and an emergency telephone number should be there by law.  It is not.  The Corporation has done nothing about this that has led to an improved situation.   However, the alternative of the exit from Willoughby 03 car park is also very uncertain.  The door has been out of action at least twice over the last fortnight nicely coinciding, on occasion, with the lift on the podium being out of action. People in wheelchairs and other people with walking difficulties have no way out from that corner of the estate unless someone with a pass key kindly takes them through Willoughby House and that is a long way around.", 
      "date": "2008-02-03 10:22:00", 
      "id": 3625, 
      "sentiment": 4, 
      "subject": "Corporation incompetence?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3977"
    }, 
    {
      "body": "After a long time, (almost a year?) and having complained politely (yeah, right) to our neighbors upstairs, we made a formal noise complaint at the Barbican offices. The folks upstairs  (an \"L-shaped 20\", I believe is what they're called,) have two 5 or 6 year olds, and a baby that will soon be old enough to stomp and bang itself. They have laminated floors throughout the entire apartment, and every morning, at precisely the legal time to make noise (7:30-8:00 A.M.) BANG! One jumps from it's bed. in the side front room, joined seconds later by the other child, also in the front room. They race to the parents bedroom and jump around there for a while, and run back and forth (I swear I have heard them call it \"the running and jumping game\") and this goes on until they go to school, and from when they return 3:30-ish (with school freinds, often) to run, jump, bang and wrestle until they all go to bed 11:00ish. Its only running and bouncing and kiddie stuff, you can't fault them, they are only kids having fun. But the parents only gave us blank looks when we went up to ask them to hold it down. In our book of Barbican rules it says \"Carpets must cover all floors, to avoid noise.\" (I'm paraphrasing) So we complained in the Barbican office. They took down the info, and told us not to expect anything to happen \"for a reasonable lenghth of time, which meant sometime in Dec. They then added that since it would be around Christmas time by then, the neighbors probably wouldn't want to be buying and installing carpets then...     In October, a month or so after our complaint, we got a letter from the Barbi Corp asking US to keep a log of THIER noise FOR A MONTH, and  submit it back to them. Um, why is it OUR responsibility to spy and report on our nieghbors? Very Maoist spy-on-your-neighbor policy. We did it, though, making us seem quite petty, writting down everytime they banged on the floor or jumped off the furniture The corp. sent back a notice telling us that most of the noise was \"within noisey hours\" (I said I was paraphrasing, folks!) except for once when it went past midnight, which was aparently our only valid complaint. Whaaa? The complaint is that THEY DO NOT HAVE CARPETS TO CUT DOWN ON NOISE. The reply also said we had \"Screamed at them in April\" (10 months earlier) during one of the brat's (I'm still parapharasing) birthday party. Aparently that was enough to negate our claim. Actually, the Corp had told them to get carpeting, but to give them time to do so, 3 months, and if they don't, we should feel free to complain again.      We are going to get a chimpanzee and a breeding pair of Lorries, a very beautiful and very songful bird. Let THEM complain! We'll tell 'em that carpeting their floors might cut down on some of the noise.     A rule is a rule innit? Does anybody know the \"real\" rules on carpeting floors? I'ver noticed somewhere on Barbican talk that somebody mentioned their wood floors. We've also noticed the Estate Agents sometimes advertise wood floors as a plus when offering Barbican apartments for sale. We wouldn't mind if it was a sweet, lightweight lady like Thelma walking in slippered feet on her cold, cold floor, but it ain't. This is the main reason I got on this site, to find out what the \"unwritten\" rules are. Thanks in advance for your upcoming input!", 
      "date": "2008-02-03 09:04:00", 
      "id": 3778, 
      "sentiment": 4, 
      "subject": "Barbican bylaws versus Ignoring Barbican bylaws.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3976"
    }, 
    {
      "body": "We've just come back from a lovely first visit to the Wood Street Restaurant and Bar. Gorgeous food, great service, wonderful setting.  When it came to paying the bill, we asked if we could pay the main part with a card but pay the service charge in cash to ensure the staff get it. We have no problem excercising this legal right in other restaurants. You may or may not be aware but whenever the service charge is paid with a card, the staff do not get it but the corporation who owns the restaurant does. Time Out Magazine wrote a piece about a year ago stating that if you want to ensure the staff who served you are rewarded with a tip, then pay the service charge in cash. Our friendly and efficient waitress asked the manager on our behalf if we could do this, but she refused. We HAD to pay it with the card.  We were shocked that the manager refused point blankly and didn't even come over to explain why but decided not to go any further, we had a lovely meal in wonderful surroundings but ended up paying the waitress some more on top of the service charge as we left, just because we felt so bad for her.  She seemed to have no idea that she was entitled to the service charge. At St Paul's Chez Gerard, our regular haunt we often pay the service charge in cash and it goes directly to the staff. NB: the manager of the Wood Street Bar is the daughter of one of the three owners, who also own other restaurants, which is probably why she didn't want the staff to get the tips but her father's company instead. When we go next week, we'll have to point blankly refuse to pay the service charge with a card or bring extra cash. I understand Wood Street Restaurant is very popular with us Barbican residents on Sundays. May I suggest, if you'd like the service charge to go to the staff (and not just the manager's family and business partners), that you consider paying it in cash and ask for this right if they refuse you. We will, as otherwise, there's no incentive for good service.  In other London restaurants (and other parts of the world, especially the States) , waiters and waitresses thrive on their good tips, it's a shame that their right to this has been eroded at our local.  Has anyone else experienced the same problem at the Wood Street or any other local restaurants?", 
      "date": "2007-04-18 14:59:00", 
      "id": 4326, 
      "sentiment": 4, 
      "subject": "Tips at the Wood Street Restaurant and Bar", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3242"
    }, 
    {
      "body": "Ive been wondering where on earth my service charge bill had got to, and now its here the *** thing has given me a conniption.  On top of the substantially increased quarterly service charge for 06-07, Im being charged 191.07 for Services 2005/06 Year End Balance From 01/04/2005 to 31/03/2006. But I only purchased my flat on 3 February 06, so surely I should be liable for less than a sixth of that 191. Of course I will be going to the estate office about this first thing Monday morning, but the bills have gone out so late this time  arrived Saturday 16/9, due date is 29/9  that Ill be in arrears and presumably getting penalised for it if I dont cough up almost immediately. While 191 might be peanuts to some people on the estate, its a serious problem for me. So in case I get the runaround, is anyone able to tell me ahead of time how theyve dealt with this situation? I assume it must happen to everyone who buys a flat here. Are the Corporation just trying it on, or have I agreed to be liable for this by buying my flat? Am I going to have to go back to my solicitor and ask her to extract the money from the dodgy letting company who owned this flat previously? And is that even possible six months after the sale is supposed to have been wrapped up? I appreciate any light anyone can shed on the matter. Its the fact that the bill is both late and timed to arrive on a weekend that makes me particularly angry. Thats two totally unnecessary days of worry.", 
      "date": "2006-09-16 23:21:00", 
      "id": 4491, 
      "sentiment": 4, 
      "subject": "Incorrect service charge", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2607"
    }
  ]
}