{
  "summary": [
    {
      "body": "For those of you that have wireless but no broadband (like myself at the moment, thanks to the endless inefficiencies of Wanadoo / Orange) there is a trial wireless network in the City called The Cloud ( ).   They will give you a user name and password enabling you to surf for free (at the moment, it will one day turn into a subscription service once past its test phase).   It can be a little unreliable but is fast and has proved most useful to me in the last few days.", 
      "date": "2007-03-20 17:24:00", 
      "id": 3366, 
      "responses": 39, 
      "subject": "Free wireless internet - The Cloud", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3165"
    }, 
    {
      "body": "I was just wondering what kind of broadband statistics people are getting at the moment? I'm particularly interested in the downstream attenuation to the Moorgate exchange on people's lines. I'm currently getting 40 db, which is quite poor, considering that Bunyan Court is only about 500 metres from the exchange. From what I can gather, an attenuation this high is roughly equivalent to about 2.5 km of cable!  It all means that I can only sync at about 4600 kbps and get speeds of about 3560 kbps. This is rather low in comparison to what I used to get. And I know that it is not my provider as they publish the speeds that each of their pipes are currently running at, and it is very rarely below 6500 kbps. I know that there is some work going on at Moorgate at the moment, so this might be causing the poor connection. However, if anyone else could post their statistics for: downstream attenuation; signal to noise ratio (my is 15 db, which is pretty good); sync speed; and  throughput  for Moorgate in particular (but other exchanges would be interesting), I would be very grateful. Thanks, Daryl", 
      "date": "2008-03-16 19:49:00", 
      "id": 3840, 
      "responses": 14, 
      "subject": "Broadband statistics - attenuation and Signal to Noise Ratio", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4130"
    }, 
    {
      "body": "If you hate calling NTL's customer service because calls get disconnected or you can't get connected to the Westminster call centre - use the following email address:   It's better than dealing with them over the phone and everything is recorded in writing.", 
      "date": "2005-04-19 09:08:00", 
      "id": 4709, 
      "responses": 11, 
      "subject": "NTL Westminster Customer Service Email Address", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1574"
    }, 
    {
      "body": "All given that we would presumably all like to remove the blight that is British telecom from our lives, could I ask: a) would people be onboard with a direct appeal to Virgin to install their fibreoptic wizardry throughout the estate b) if the technical gurus amongst us are 100% convinced that this would be better than what we now have I believe that a substantial number of local residents made a real difference in replacing the awful safeways/morrisons/somerfields with waitrose. Maybe enough of us could do similar with Virgin? PM me if you think the idea has legs and I'll happily knock up some form of petition or ecircle-up. cheers Matt", 
      "date": "2008-03-14 17:59:00", 
      "id": 3825, 
      "responses": 9, 
      "subject": "Virgin Media", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4125"
    }, 
    {
      "body": "Hello  Reading the below threads it is clear that a number of residents are suffering intermittent broadband faults. Either disconnection or slow speeds. Once again, I am not able to get online via my own connection, and I'm not able to make phone calls.  We understand from the fine work of the Barbican Association that BT has been moving some components related to the exchange, and also that there has been some sort of line fault. I sense from reading our experiences that there may be more going on that we have not been privy to. Firstly, is there anything more the BA can do on our behalf at this time? I am sick of spending hours on hold to BT's various departments, especially when I'm handed off to people in India who are not empowered to change the situation. Secondly, thank you to anyone who is leaving their wireless connections open at this time. I am able to get online, just about, thanks to someone whose connection is not password-protected. Be careful to ensure your connection is firewalled/virus protected and that you are not sharing your computer network along with your wireless internet. But thank you, because otherwise I would be spending most of the day going back and forth to various internet cafes / the library and spending a fortune.", 
      "date": "2008-03-17 12:24:00", 
      "id": 3822, 
      "responses": 7, 
      "subject": "Broadband faults: help from Association? + Wireless sharing", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4132"
    }, 
    {
      "body": "According to this site:   ...and indeed Be's own site   - Be (which offers vastly increased speeds - up to 24 meg but I'm told Moorgate will be capable of 15 meg or so) is set to hit Moorgate on 31st March 2008. This is part of LLU (local loop unbundling)...but it seems that a BT line is required and their FAQ says \"please allow up to 2 - 4 weeks for Be to be activated. This is the average time that it takes for BT to connect your phone line to our network.\"", 
      "date": "2008-03-18 14:23:00", 
      "id": 3848, 
      "responses": 7, 
      "subject": "Be broadband set to hit Moorgate 31 March??", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4135"
    }, 
    {
      "body": "We have a BT line (628 Moorgate exchange) and BT Broadband and for some months dismal download speeds, drop outs and difficulty in connection have been the norm. Our phone has been noisy - crackles and pops. A son, IT savvy and IBM employee, phoned BT on our behalf who sent an engineer to test the phone line.  He checked everything from the line entry into the room to connections below Brandon Mews.  He cleaned connections. Now we have more than 7000kbs download, ease of connection and no drop outs. Probable cause of problems was that the phone installation was made nearly 40 years ago during construction of the Estate and needed checking. We had thought problems were because exchange is in the process of moving and reported this on BarbicanTalk, but this as the engineer showed is not the case. So if you have a crackly noisy phone and poor Broadband, a visit by an engineer may solve the problems.  But beware: if it transpires that the fault is not the line but your phone you will charged 104. We took the precaution of checking the line with another phone beforehand which also was crackly.", 
      "date": "2007-11-30 11:47:00", 
      "id": 4155, 
      "responses": 4, 
      "subject": "Broadband and phone line.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3827"
    }, 
    {
      "body": "Hi all Just spent the last week without my BT ADSL. I rang their 0845 technical support number several times last week to find out why I had lost the connection, but because I use non-BT hardware they simply told to contact the manufacturer after doing some sort of line test and getting me to restart everything that could be restarted! I asked them many times if there was work being done in my area that would affect the service and they claimed not to know of anything happening here. Anyway, to cut a long story short, they  booked an engineer for a home visit to check my line after I explained to them how it couldn't be a problem with my computer hardware. Two engineers rang today to explain about the outage over the past week and claimed that customer service should have known about it. Well obviously not! If you want to save yourself some money contacting BT technical support, you can use 0800 800 030. I also used that number to try and cancel my internet option and they sent me a HomeHub and offered a discount to keep me on as a customer.", 
      "date": "2008-03-19 14:23:00", 
      "id": 3821, 
      "responses": 3, 
      "subject": "BT and ADSL Outage", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4141"
    }
  ]
}