{
  "summary": [
    {
      "body": "The Boudoir hearing is set for 10 am on August 1st.  Islington are expecting a good turnout so we shouldn't disappoint. Also people who have had personal bad experiences with the bar need to turn up and give their experiences.  Cntact   (phone number on the BA website).  This is really important as Islington sent officers down to observe what was going on and have reported that they witnessed no problems.", 
      "date": "2005-07-21 10:03:00", 
      "id": 2952, 
      "sentiment": 2, 
      "subject": "Boudoir Hearing - Need WITNESSES and a GOOD Turnout", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1754"
    }, 
    {
      "body": "just out of curiosity did you hear the gas fire explosion sunday morning? my windows shook and it woke me up, I had no idea what it was till I saw the news. Apparently they heard the explosion as far as Holland!", 
      "date": "2005-12-12 09:42:00", 
      "id": 3007, 
      "sentiment": 2, 
      "subject": "gas fire explosion", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1981"
    }, 
    {
      "body": "I have just called the City of London police and was told that there had not been any shooting on Friday night... How bizarre. Does anyone know anything???", 
      "date": "2005-10-03 12:18:00", 
      "id": 3059, 
      "sentiment": 2, 
      "subject": "Confused", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1863"
    }, 
    {
      "body": "I don't want to frighten anyone - but I was a bit surprised to see a couple of police go past my study window at 2:30am on Saturday night/Sunday morning. It was on the Moor Lane facing 6th floor of Willoughby. Anybody got any info of anything we should be aware of?", 
      "date": "2006-04-24 15:56:00", 
      "id": 3066, 
      "sentiment": 2, 
      "subject": "Police on Willoughby Balcony", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2218"
    }, 
    {
      "body": "Did anyone see the two people who were walking along the brick wall in the middle of the lake about 11pm last night?! Don't know how they got there or what they were doing btu they stood there for about 5 mins then turned around and walked back again!", 
      "date": "2006-04-07 09:47:00", 
      "id": 3134, 
      "sentiment": 2, 
      "subject": "Random walkers!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2184"
    }
  ]
}