{
  "summary": [
    {
      "body": "Anyone know what happene to the City Boot over Tuesday night?  Smashed out window, the smell of smoke and police on Wednesday morning leas to one conclusion. Any details anyone?", 
      "date": "2006-07-20 06:51:00", 
      "id": 3137, 
      "sentiment": 3, 
      "subject": "City Boot", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2464"
    }, 
    {
      "body": "Has anyone any info on several of the staff being taken away by the poice/immigration as illegal immigrants.I know this work is now contracted out,but surely Barbican management cannot be unaware they are using \"illigals\" and if not why not?", 
      "date": "2006-08-05 07:46:00", 
      "id": 3150, 
      "sentiment": 3, 
      "subject": "porters", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2508"
    }, 
    {
      "body": "I arrived home late last night by car, to find Aldersgate Street closed by the Police from the London Museum roundabout to the junction with Old Street, so I was unable to park my car away in the car park under John Trundle. Aparently the Police were investigating an accident or a crime scene. I tried again at 3.30am, as I was not happy for my classic car to be out all night, but was unable to access Fann Street because of Police barriers and the the anti rat run barriers there. I eventually parked in the visitors car park under Mountjoy where I live. Does anyone know what was going on?", 
      "date": "2006-07-01 19:21:00", 
      "id": 3179, 
      "sentiment": 3, 
      "subject": "Closure of Aldergate Street, Saturday at 1.am", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2421"
    }, 
    {
      "body": "Sorry for posting on the main board, but I'm sure you'll agree that this needs to be advertised widely. I'd be obliged if any reader could copy the main text below and ask their workplace if this could be emailed company wide. Thanks. The City of London Police are appealing for witnesses to a murder which took place at SHADANS nightclub on Monday 4th Decemeber 2006 at 01:30.  Anyone who was in the area of SHADANS nightclub, New Bridge Street, London, EC4 at the time or who has any information regarding this incident are urged to contact the City of London Police control room on 020 76012222.  Information can also be given anonymously to Crimestoppers on 0800 555 1111. Your ongoing vigilenece would be appreciated to ensure the City of London remains one of the safest places to live and work. A/DCI CHANDLER Please do not use these numbers to request information.", 
      "date": "2006-12-12 17:30:00", 
      "id": 3306, 
      "sentiment": 3, 
      "subject": "Murder  Appeal", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2826"
    }, 
    {
      "body": "The strangest thing happened on the podium on Saturday evening. My husband and were standing chatting on the podium when a woman jogger dressed in leopard skin barged between us, knocked me and carried straight on with out so much as a word. Is was so strange and rude that I'm now wondering if it was so bizarre part of the installation- she seemed to be running along the yellow line.  EIther that or there is a rude jogger on the podium.", 
      "date": "2007-06-05 10:14:00", 
      "id": 3338, 
      "sentiment": 3, 
      "subject": "Err... is it art?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3394"
    }
  ]
}