{
  "summary": [
    {
      "body": "I apologise in advance if this sounds too much like a moan, ramblings or some form of un-interpretable nonsenseit is 4am in the morning! I went to bed last night.  (Saturday 9, June) to what I have become accustomed. late night music, people shouting over the music and drunken people walking by on Aldersgate.  Several times now, it has been the Barbican YMCA in which they were throwing items out of their windows, screaming and yelling at which time we notified the police and all was calmed down. This time, it was the Cathedral House on Aldersgate that decided to host a roof top in house concert.  Woken up by a new DJ at 3:00am on Sunday morning. I called the city of London police (non-emergency for all those who might need it in the future: 020 7601 2222) and reported this, to which he said, Is that the music I hear in the background?.  YES! I then called back at 3:30 to report nothing had been done.  To which he gave me a number 02077041212 (supposedly environmental services), which it is not, it is the same department, (I had just called). To which I was given another number 02075273229 for environmental services.  Which I called and spoke with a woman gave her my details and she asked several times for me to repeat them, as she too could hear the music in the background; she would notify someone, BUT unfortunately the officer has to hear the music him/herself.  BUT, someone would be calling me back.  What?  Are you serious, the problem is that I dont want to speak to anyone at 3:30am in the morning!  How does them ringing me back solve this?   This is not rocket science.EVERYONE can hear the music.  My partner has to work tomorrow; I have things that I would like to do as well. None of which (at this point seem realistic unless I get a long nap in the day) will happen without me being a tad bit grumpy for loosing several hours sleep. I have got a really innovative idea, GO there, and tell them to shut it down, OR SHUT IT DOWN FOR THEM! Seriously, are you serious?  This is the most back-asswards concept I have come across.  Get it together City of London! I am tired.  I am grumpy and least of all do I want to hear a load of bureaucratic bull crap telling me why, a roof top terrace party could not be dismantled orderly. Dont get me wrong, I love living here in the Barbican.  AND I fully understand that our tax money goes to other places than policing our neighboursBUT seriouslythis is city living, not some backyard barn in which the neighbours across the field can't hear if someone is having a barnyard party! ARG!  Thank you for listening, at least this way, even if you completely disagree with me and want to shout at the top of your lungs it will have to be done in all caps.  (At least it wont be off your balconies). PS The environmental office just called 4:24am to say they are on there way to come visit me  I relayed to them that it would be a better idea to  visit the neighbours? Hey, as she said, how they work is that they have to hear it from MY balcony.. To all those sleepless nights.. PSS Don't you just know that as soon as they show up...it will all stop!", 
      "date": "2007-06-10 03:45:00", 
      "id": 3343, 
      "sentiment": 5, 
      "subject": "Are you serious?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3412"
    }
  ]
}