{
  "summary": [
    {
      "body": "My brother in law called me up tonight to tell me a team from the Barbican was on University Challenge competing against one from the Society for the Preservation of Ancient Buildings.  However, i missed the start and would like to write a news item on this for Barbican Life.  Can anyone who may have watched, or happens to know, whether the Barbican team was drawn from the staff of the Barbican Centre, or from residents?  I also only managed to pick up the team's surnames - can anyone supply me with their forenames too? Thanks", 
      "date": "2005-08-15 20:14:00", 
      "id": 2971, 
      "sentiment": 3, 
      "subject": "University Challenge", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1809"
    }, 
    {
      "body": "I apologise in advance if this sounds too much like a moan, ramblings or some form of un-interpretable nonsenseit is 4am in the morning! I went to bed last night.  (Saturday 9, June) to what I have become accustomed. late night music, people shouting over the music and drunken people walking by on Aldersgate.  Several times now, it has been the Barbican YMCA in which they were throwing items out of their windows, screaming and yelling at which time we notified the police and all was calmed down. This time, it was the Cathedral House on Aldersgate that decided to host a roof top in house concert.  Woken up by a new DJ at 3:00am on Sunday morning. I called the city of London police (non-emergency for all those who might need it in the future: 020 7601 2222) and reported this, to which he said, Is that the music I hear in the background?.  YES! I then called back at 3:30 to report nothing had been done.  To which he gave me a number 02077041212 (supposedly environmental services), which it is not, it is the same department, (I had just called). To which I was given another number 02075273229 for environmental services.  Which I called and spoke with a woman gave her my details and she asked several times for me to repeat them, as she too could hear the music in the background; she would notify someone, BUT unfortunately the officer has to hear the music him/herself.  BUT, someone would be calling me back.  What?  Are you serious, the problem is that I dont want to speak to anyone at 3:30am in the morning!  How does them ringing me back solve this?   This is not rocket science.EVERYONE can hear the music.  My partner has to work tomorrow; I have things that I would like to do as well. None of which (at this point seem realistic unless I get a long nap in the day) will happen without me being a tad bit grumpy for loosing several hours sleep. I have got a really innovative idea, GO there, and tell them to shut it down, OR SHUT IT DOWN FOR THEM! Seriously, are you serious?  This is the most back-asswards concept I have come across.  Get it together City of London! I am tired.  I am grumpy and least of all do I want to hear a load of bureaucratic bull crap telling me why, a roof top terrace party could not be dismantled orderly. Dont get me wrong, I love living here in the Barbican.  AND I fully understand that our tax money goes to other places than policing our neighboursBUT seriouslythis is city living, not some backyard barn in which the neighbours across the field can't hear if someone is having a barnyard party! ARG!  Thank you for listening, at least this way, even if you completely disagree with me and want to shout at the top of your lungs it will have to be done in all caps.  (At least it wont be off your balconies). PS The environmental office just called 4:24am to say they are on there way to come visit me  I relayed to them that it would be a better idea to  visit the neighbours? Hey, as she said, how they work is that they have to hear it from MY balcony.. To all those sleepless nights.. PSS Don't you just know that as soon as they show up...it will all stop!", 
      "date": "2007-06-10 03:45:00", 
      "id": 3343, 
      "sentiment": 3, 
      "subject": "Are you serious?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3412"
    }, 
    {
      "body": " We were made aware last weekend of complaints listed on this website about actions by us or our contractors. I immediately started an investigation as we take these complaints very seriously. We have spoken at length, prior to being allowed on site, to all workers about a number of issues including hours of working, attitude when working and respecting that this is a residential neighbourhood. I have repeated this following last weekend to ensure that all workers know that any failure to respect these rules will mean they risk disciplinary measures and dismissal from the site. Following my investigation I received an apology from the scaffolder who swore, he is the foreman and it was out of character. He denies the incident happened at the time stated and was clear that he was not present on site at that time and neither were his team. I cannot prove he was there but have given him a final warning over the swearing. He is going to write to the resident who first made us aware of the complaint (this has been made possible by your Chair asking the complainant for his address). The second issue was my email address, it is working now but was not last weekend and I apologise. Thirdly I delayed this statement to you until after we had met with your representative's on Thursday night as part of our regular consultation on the planning and construction of Milton Court. This was to ensure that we had covered all the issues and had made ourselves accountable. Fourthly I was asked if we could repeat the hours of working we are keeping to, these are: Monday to Friday hours, 08:00-10:00, 12:00-14:00 and 16:00-18:00 Saturday hours, 9:00-2:00pm with no noisy works Sunday, No work Fifthly for ease here are the ways of contacting me. I hope you will not need to but would prefer that you had it easily to hand. Please contact me on 07823 442024 or   Finally I wanted to update you on the fire that occurred on the Milton Court site on Thursday. The fire was restricted to the fire station training tower in the courtyard area of the site and was caused as a result of the burning operations that were being undertaken by Cantillon on the steel sections of the tower. Once the fire was detected, the Emergency Plan was put into effect by Cantillon - the site was evacuated and the emergency services contacted. The emergency services arrived within minutes and the fire was very quickly put under control. The sheeting around the site did its job in containing the fire for longer allowing for safe exit from the site and the arrival of the fire services. The sheeting shrank and melted on the upper floors, without giving off toxic fumes or separating from the structure.  The roads around the immediate site were sealed off by the police as a precaution. Once the dousing down was completed, the scaffold to the tower were inspected by Cantillon and the District Surveyor and it was found that there was no apparent structural damage caused to the scaffold itself. The scaffold sheeting is now being removed and a more thorough inspection of the scaffold has taken place along with the clean up operations generally. No one suffered any injuries and no evacuation of adjacent premises was necessary. No delay to the project is anticipated and the whole episode was dealt with over the space of a couple of hours. This incident has of course been reported to the statutory authorities. Thank you for your understanding over both these incidents. I hope I have given a helpful explanation and that as we go forward with this project we can be a good neighbour to you. Yours faithfully Andy Dyson", 
      "date": "2008-01-13 15:22:00", 
      "id": 3559, 
      "sentiment": 3, 
      "subject": "Statement from Andy Dyson, Project Director for Cantillon", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3926"
    }
  ]
}