{
  "summary": [
    {
      "body": " We were made aware last weekend of complaints listed on this website about actions by us or our contractors. I immediately started an investigation as we take these complaints very seriously. We have spoken at length, prior to being allowed on site, to all workers about a number of issues including hours of working, attitude when working and respecting that this is a residential neighbourhood. I have repeated this following last weekend to ensure that all workers know that any failure to respect these rules will mean they risk disciplinary measures and dismissal from the site. Following my investigation I received an apology from the scaffolder who swore, he is the foreman and it was out of character. He denies the incident happened at the time stated and was clear that he was not present on site at that time and neither were his team. I cannot prove he was there but have given him a final warning over the swearing. He is going to write to the resident who first made us aware of the complaint (this has been made possible by your Chair asking the complainant for his address). The second issue was my email address, it is working now but was not last weekend and I apologise. Thirdly I delayed this statement to you until after we had met with your representative's on Thursday night as part of our regular consultation on the planning and construction of Milton Court. This was to ensure that we had covered all the issues and had made ourselves accountable. Fourthly I was asked if we could repeat the hours of working we are keeping to, these are: Monday to Friday hours, 08:00-10:00, 12:00-14:00 and 16:00-18:00 Saturday hours, 9:00-2:00pm with no noisy works Sunday, No work Fifthly for ease here are the ways of contacting me. I hope you will not need to but would prefer that you had it easily to hand. Please contact me on 07823 442024 or   Finally I wanted to update you on the fire that occurred on the Milton Court site on Thursday. The fire was restricted to the fire station training tower in the courtyard area of the site and was caused as a result of the burning operations that were being undertaken by Cantillon on the steel sections of the tower. Once the fire was detected, the Emergency Plan was put into effect by Cantillon - the site was evacuated and the emergency services contacted. The emergency services arrived within minutes and the fire was very quickly put under control. The sheeting around the site did its job in containing the fire for longer allowing for safe exit from the site and the arrival of the fire services. The sheeting shrank and melted on the upper floors, without giving off toxic fumes or separating from the structure.  The roads around the immediate site were sealed off by the police as a precaution. Once the dousing down was completed, the scaffold to the tower were inspected by Cantillon and the District Surveyor and it was found that there was no apparent structural damage caused to the scaffold itself. The scaffold sheeting is now being removed and a more thorough inspection of the scaffold has taken place along with the clean up operations generally. No one suffered any injuries and no evacuation of adjacent premises was necessary. No delay to the project is anticipated and the whole episode was dealt with over the space of a couple of hours. This incident has of course been reported to the statutory authorities. Thank you for your understanding over both these incidents. I hope I have given a helpful explanation and that as we go forward with this project we can be a good neighbour to you. Yours faithfully Andy Dyson", 
      "date": "2008-01-13 15:22:00", 
      "id": 3559, 
      "responses": 13, 
      "subject": "Statement from Andy Dyson, Project Director for Cantillon", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3926"
    }, 
    {
      "body": "Another Saturday, another 8 a.m. start for jackhammering. Skanska/EDF is digging up Whitecross St. outside the school for \"emergency\" cable work so the curb can be installed. Obviously the companies have figured out there is no enforcement, so they can call everything an \"emergency\" and do what they like. I have contacted the city environmental services but the work may be in Islington and the duty officer wasn't well versed in the work rules.", 
      "date": "2008-02-23 10:43:00", 
      "id": 3523, 
      "responses": 9, 
      "subject": "Saturday noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4049"
    }, 
    {
      "body": "We were woken again by a late and loud party in Defoe House last night. A week or so ago there was another loud party late in the night in Seddon. Do people have no consideration for sleeping children and extremely tired neighbours? I wish the Estate office would enforce the noise rules.", 
      "date": "2005-09-24 09:52:00", 
      "id": 4439, 
      "responses": 7, 
      "subject": "Late loud parties", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1851"
    }, 
    {
      "body": "can someone get in contact with UBS at the back of BJH and tell them to shut their blinds.   i was under the impression that there was an agreement for UBS to do this by 6pm.", 
      "date": "2006-12-10 23:34:00", 
      "id": 3369, 
      "responses": 4, 
      "subject": "UBS", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2823"
    }, 
    {
      "body": "Sunday - from at least 9am until 12:45 last - hammering from the old green glass fronted building on Moor Lane/Chiswell St - fed up by 11am - went down to the site - Polish builder very reluctantly directed me to the site office, - he said  \"I am  just wasting my time now\" - I signed the site visitors book, since no-one there to complain to - and called the CoL environmental health line 7606-3030. Apparently I was not the first person to complain about this specific noise today - and the environmental health officer had already visited the site - but unable to find any perpetrators - and yet STILL (12:55) the noise goes on - not really very reassuring when Willoughby/Speed residents  are asked to accept promises from a new developer (Heron) about noise associated with the redevelopment of Milton Court, which will be monitoted by the CoL........(CoL terms -no work allowed after 13:00 Saturday, no work allowed Sunday) - message to CoL - your/our terms are being breached deliberately - what means do you propose to enforce the mutually agreed terms ??", 
      "date": "2007-03-04 13:07:00", 
      "id": 4250, 
      "responses": 4, 
      "subject": "NOISE from One Moor Lane construction site on Sunday", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3102"
    }, 
    {
      "body": "Is it Peckham what? I hear you say. Is it a Peckham council estate I ask myself. I would like to remind the residents that hanging your smalls out to dry on your balcony. Whether it be the more obvious clothes line or the carefully placed clothes maiden. Is against the lease as I understand it. I have no desire to live on a council estate, so please keeps your smalls and sheets out of public view. IT IS NOT A PLEASANT SIGHT. MANY THANKS", 
      "date": "2005-06-18 13:16:00", 
      "id": 4665, 
      "responses": 4, 
      "subject": "Is it Peckham", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1694"
    }, 
    {
      "body": "Last night Wednesday night a car alarm kept going off about every 20 minutes . This is unacceptable and what are the Police doing about it , or the Corporation . Nothing . Please ring 0207 601 2222 and complain now to the Police this practice / problem must stop now . One doesnt want to go over the top but these people who just let these alarms keep going are a nuisance . We are entitled to a good nights sleep are we not .", 
      "date": "2005-10-13 09:30:00", 
      "id": 4443, 
      "responses": 3, 
      "subject": "Car Alarms Noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1883"
    }
  ]
}