{
  "summary": [
    {
      "body": "Hello I am an interloper so I hope it's okay to ask this.  I don't live in the Barbican yet and perhaps never will (as you all no doubt know, there is a dearth of properties) but I wondered if any of you would be generous enough to share your thoughts on living there and good points/bad points. I've lived in flats all my life (we currently live near Old Street and hurrah for the new Waitrose even if, yes, some of the staff are very incongruous for JLP) so I know that properties can differ wildly and that it's also a matter of personal choice. But these are the things I'd like to ask (in no particular order): Am I correct in thinking the biggest flats are in the towers? Is it generally a quiet and safe place to live or does it vary wildly from block to block? What's it like for children? The private gardens seem amazing but in reality what's it like? Is the service charge astronomical (I realise it depends on size of flat)? What will happen when all TV goes digital and the Barbican has no digital cable?? Is the listed building classification a pain if you want to do any work in the flat? Garchey, good or bad? Are parking places readily available to rent or is there a shortage? Anything to look for that an outsider may not know about.  I'd be really grateful for any answers. If I can reciprocate in any way...my specialities are fly fishing, beauty products, nutrition and fashion. I know, ecletic and slightly bizarre! Thank you. AB", 
      "date": "2006-06-05 17:37:00", 
      "id": 3180, 
      "responses": 29, 
      "subject": "What's it like living in the Barbican?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2338"
    }, 
    {
      "body": "To all BarbicanTalk users I'm the administrator of this site and would like your assistance in a small matter, plus your feedback on ways to deal with it. As some of you have already been discussing, there are falcon chicks nesting within the Estate. This is quite unusual as apparently most falcons do not last long in urban areas. I have received a phone call from the City of London's Wildlife Officer, who is vociferous that the location of the birds should not be revealed. This is so that the birds can have the best shot at survival, without attracting attention from people who might want to steal the chicks' eggs (which are apparently relatively rare and valuable.) There is an additional danger that people could be injured trying to get up to watch the birds close up, or to steal the eggs - apparently something similar happened elsewhere last year. For the meantime, I have edited out all references to the location of the birds. Amending text is not something I have done often in the five years or so that this site has been around, but in this case I hope there's not too much serious injustice involved. What's more, I think most people would agree that we don't want to be attracting burglars (or birdwatchers!) onto the estate. In turn you could help by agreeing not to reveal the location in your postings. Ultimately it may prove academic if more mainstream media (newspapers/ TV etc) mention the exact location. In that case, of course, we can re-assess the situation. Please feel free to give me your feedback on this approach. Hopefully you'll agree this is a fair solution, but I'm happy to read any discussion.", 
      "date": "2006-06-19 15:50:00", 
      "id": 3170, 
      "responses": 10, 
      "subject": "Important - for all readers - bird issue", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2377"
    }, 
    {
      "body": "I have been commissioned by the Barbican Centre to write a self guided walking tour leaflet  to the estate and centre. The leaflet will be given out free and it will be printed ready for the London Architecture Biennale taking place in mid June. Before anyone gets upset I would like to point out that as well as being a design historian I am a resident and therefore won't be suggesting those using the guide trespass or interfere with the bucolic barbie bliss we all enjoy. I do however want to produce an informative history to the site and surrounding area. The routes will begin at the tube stations/silk street etc and go around the highwalks leading the visitor into the Centre or down to the fountains. Hopefully this guided map will also be of use to residents who can pass them out to friends and family visiting, instead of having to rescue tearful lost first timers or those that arrive slightly distressed having spent 20mins walking around the estate in the wrong direction....... If any residents have nice Barbican urban myths, stories,quotes and history they think should be included do let me know ( eg the squirrel resident in Willoughby). I have of course lots of material/books on the history of the site and the estate and have consulted barbicanliving. But I thought there might be some hidden gems in the collective barbie brain bank. Many thanks", 
      "date": "2006-03-16 12:37:00", 
      "id": 4639, 
      "responses": 8, 
      "subject": "walking tour guide/leaflet on the Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2139"
    }, 
    {
      "body": "Hi there would there by any chance be any members of Common Council around this weekend who might have time to countersign my Freedom of the City of London form? thanks Matt", 
      "date": "2007-07-13 20:59:00", 
      "id": 4041, 
      "responses": 7, 
      "subject": "CC-person around to sign a Freedom of City of London form?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3494"
    }, 
    {
      "body": "Hello, I am a final year student researching the Barbican for my dissertation. I am trying to find out people's opinions towards Brutalist architecture and the Barbican Estate. I have asked the general public to answer questions but would benefit from insight into the residents' perpectives.  I would really appreciate it if you could take a minute to complete the questionnaire from the address below to assist my research.  Many thanks, Emma", 
      "date": "2007-02-18 11:00:00", 
      "id": 3283, 
      "responses": 6, 
      "subject": "dissertation help!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3068"
    }, 
    {
      "body": "Hi, I have been asked by a Spanish friend to give English lessons to her daugher (10 years old, very intelligent; doesn't speak any English, having recently arrived from Spain). lessons based on conversation, stories etc.  I have given all sorts of lessons, but never English - it's not my first language after all! Has anyone any idea what sort of thing would work, what I could do?  I thought about some Roald Dahl, nursery rhymes...? If there are any experienced parents out there who could recommend me nice childrens' books, or if you have any other recommendations and advice etc...-anything-, I'd be very grateful! Thanks!", 
      "date": "2007-03-13 22:29:00", 
      "id": 3293, 
      "responses": 6, 
      "subject": "ideas for English lessons?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3140"
    }, 
    {
      "body": "hallo  i am currently working on an art project with the barbican gallery and I have a couple of  questions which some may be able to help me with.  I was wondering if barbican estate has ever considered or researched a wireless network covering all the flats, and if anyone here knows more... the other  question, which is not really a question but an invitation is that for my project i am wanting to collect some lists, and I wonder if anyone feels like sharing with me their current \"list of things to do\". I wont go into detail here abou twhy and what for but if you are at all interested i am happy to divulge more info! thankyou Anna", 
      "date": "2007-01-29 16:12:00", 
      "id": 4212, 
      "responses": 4, 
      "subject": "two questions to residents", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2972"
    }, 
    {
      "body": "For some crazy reason I am running the London Marathon next April for the Children's Society. I am currently trying to think of new and exciting ways to raise sponsorship money, but I just wondered what everyone thought about 'touting' (excuse the phrase) for sponsorship around the Barbican? I was planning on offering a car washing service, and potentially organising a cake sale, but any other ideas people have (as well as feedback as to the reception of these) would be gratefully received.", 
      "date": "2006-08-29 07:56:00", 
      "id": 4463, 
      "responses": 4, 
      "subject": "Sponsorship Ideas", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2564"
    }, 
    {
      "body": "Hi Everybody, im a student at the university of east london and as part of my history and theory have to write an essay, and have chosen the barbican. i was wondering if anyone would help in answering a few questions if i posted them here? thanks", 
      "date": "2006-02-15 21:32:00", 
      "id": 4582, 
      "responses": 2, 
      "subject": "anyone interested?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2079"
    }, 
    {
      "body": "I was hearing this morning on the radio about various difficulties people have had getting Energy Performance Certificates done for the Home Information Packs that are now required when buying/selling a house. That made me wonder how the Barbican rated in energy efficiency terms. Would anyone who has seen a Barbican EPC be prepared to divulge what it said? I'm not a buyer/seller, but curious to see how it works nonetheless  and to see if the Barbie is energy efficient of course.  The government's website describes the EPC like this: 'Each rating is based on the performance of the building itself and its services (such as heating and lighting), rather than the domestic appliances within it. This is known as an asset rating. The certificate also lists the potential rating of the building if all the cost-effective measures were installed. The ratings will vary according to the age, location, size and condition of the building. The potential rating on the certificate will take these factors into account, and the suggested measures will be tailored so that they are realistic for the particular building.'", 
      "date": "2008-01-03 13:18:00", 
      "id": 3546, 
      "responses": 1, 
      "subject": "HIPS and Energy Performance Certificate", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3903"
    }, 
    {
      "body": "Does anyone have any digital pictures taken during the last Architecture Biennale two years ago (specifically looking for one of the cattle in St John Street) and/ or of the last St Bartholomews Fair?  I need them to illustrate an article on this year's event for the Summer issue of Barbican Life which goes to press at the end of next week.  If anyone has anything I could use please could you email to  .  Happy to give picture credit to the photographer in the magazine. Thanks", 
      "date": "2006-05-25 22:56:00", 
      "id": 4404, 
      "responses": 1, 
      "subject": "Photos of last biennale/Bartholomews Fair", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2318"
    }
  ]
}