{
  "summary": [
    {
      "body": "Hi, I don't know whether this is the right section for my posting... A friend of mine is trying to earn a little bit of extra money...she has a degree in Political Sciences (and Maths, I think) and would be available for extra lessons, after-school-help/nannying/babysitting etc...that sort of thing. She is very nice; from Poland, but speaks English very well. If you are interested, please pm me! Thanks  Wanderer", 
      "date": "2007-11-02 11:39:00", 
      "id": 1295, 
      "sentiment": 1, 
      "subject": "after school help/nanny", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3767"
    }, 
    {
      "body": "Hi  Does anyone know how to whiten these original Barbican bathtubs.  I am poised to sell/rent my flat and would like a whiter bathtub to be part of the picture. I once had a cleaner from Abracadabra or somewhere come in and they told me something about soaking the tub overnight with bio or non-bio washing powder - dissolved in cold water.  Does anyone know this or any other tricks? Thanks very much, Jeannie", 
      "date": "2007-12-01 14:33:00", 
      "id": 2625, 
      "sentiment": 1, 
      "subject": "A whiter bathtub", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3831"
    }, 
    {
      "body": "Spice Corner will be arranging a two-course meal with coffee and a glass of wine for 17.50 on Tuesday 24th May, 7.30pm.  A wide selection of starters and main course dishes will be served buffet-style.  The shuffle?  Diners will be allocated different tables for the starters, main course and coffee so that everyone has a chance to mingle.  For more information, or to book, please contact  . Don't forget to look at our website ", 
      "date": "2005-05-08 18:26:00", 
      "id": 2938, 
      "sentiment": 1, 
      "subject": "\"Spice Corner Shuffle\", Tuesday 24th May", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1615"
    }, 
    {
      "body": "if interested please email   This will be 8090 west/north facing with views of St pauls and London eye. three bedrooms. on 31st floor", 
      "date": "2007-03-07 16:31:00", 
      "id": 3302, 
      "sentiment": 1, 
      "subject": "towerblock flat for sale", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3116"
    }, 
    {
      "body": "Hello, I'm trying to find a second hand lady's bike. I'll have a look on ebay as well but it would be nice to find one locally. Many thanks.", 
      "date": "2007-06-01 12:59:00", 
      "id": 3333, 
      "sentiment": 1, 
      "subject": "Second hand Lady's bike wanted", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3383"
    }
  ]
}