{
  "summary": [
    {
      "body": "We have the original bedroom wardrobe doors; on one, a hinge has pulled away from the door frame (they are soldered, not screwed). Can anyone advise on how to repair this (I am not a metal basher) or alternatively suggest who could do it for me?? many thanks - Roy S", 
      "date": "2006-02-09 15:58:00", 
      "id": 2753, 
      "responses": 7, 
      "subject": "Repairing wardrobe doors", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2064"
    }, 
    {
      "body": "I am very much looking forward to moving into a large-style studio later next month.  It currently has a badly-laid, cheap, laminate floor throughout.  I realise this is in breach of the lease, and shall be removing it. I'm considering stripping the floor back to its original concrete, and painting it white.  Has anyone already done this in their flat?  Any tips or warnings?  Is special paint required because of the under-floor heating?  Being a DIY-loser, could you recommend someone who knows how to make good, paint and seal a concrete floor? Any sage words would be much appreciated! Nigel", 
      "date": "2006-08-24 10:31:00", 
      "id": 4461, 
      "responses": 6, 
      "subject": "Concrete floor", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2554"
    }, 
    {
      "body": "Hi Similar to Sneezy's post, I know, but can anyone recommend someone to come and have a look at the sink in my bathroom which is draining more and more slowly these days.   I guess it's just slightly blocked but embarrassingly I have neither the tools nor even the most basic know-how to sort it out... Thanks", 
      "date": "2006-10-16 08:28:00", 
      "id": 3304, 
      "responses": 5, 
      "subject": "Slow draining sink", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2682"
    }, 
    {
      "body": "One of our wradrobe doors seems to have come adrift and no longer closes properly - can anyone advise on someone who can repair them", 
      "date": "2005-10-31 22:22:00", 
      "id": 4519, 
      "responses": 5, 
      "subject": "wardrobe door repair", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1916"
    }, 
    {
      "body": "I can't find the previous threads about this - so can anyone please recommend someone who has not emigrated or left on a 6-month holiday? Thanks.", 
      "date": "2007-06-28 07:50:00", 
      "id": 3476, 
      "responses": 3, 
      "subject": "Recommendations for handyman for small household jobs?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3451"
    }, 
    {
      "body": "Hi My washing machine seems to have decided to stop using hot water (becuase the clothes do not seem to be warm when I open the door at the end of the wash).  I'm not good at DIY and have no idea what could be causing this!  Does anyone have any bright ideas?  Or, even better, the name and number of someone reliable who could fix it...? Thanks", 
      "date": "2006-03-16 18:50:00", 
      "id": 4618, 
      "responses": 2, 
      "subject": "Cold washing machine", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2140"
    }, 
    {
      "body": "Does anyone know of anyone who could take a look at a rather ill washing machine?", 
      "date": "2006-01-04 17:38:00", 
      "id": 3041, 
      "responses": 1, 
      "subject": "Washing Machine Repair", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2013"
    }, 
    {
      "body": "Can anyone tell me who to use - or who not to use - when replacing my original bathrooms? I've searched the archives but thought someone might have more up-to-date information. And I've seen the ad in Barbican Life for Really Useful Handyman and wondered whether anyone has used them. Grateful for any tips people here can provide. Shaker", 
      "date": "2006-07-09 10:45:00", 
      "id": 3238, 
      "responses": 1, 
      "subject": "bathroom renovation - need recommendation", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2440"
    }, 
    {
      "body": "There are frequent requests on this site for people to carry out repairs, decorate etc.  Yesterday I used the Barbican handyman and can recommend him. He returned my call promptly, turned up punctually and fixed the problem for the agreed price. He is also keen to preserve original Barbican features rather than doing simpler replacements. His website is   which shows the services he offers as well as a transparent pricing policy. He can also be phoned on 07857 633148", 
      "date": "2007-10-16 13:44:00", 
      "id": 3451, 
      "responses": 1, 
      "subject": "Barbican handyman", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3730"
    }, 
    {
      "body": "Is there someone anyone can recommend who can do a few odd jobs around the flat - replace the leaky washer in the bathroom, replace a fluorescent light in the kitchen, fix a few loose doors and take a look at the oven door which refuses to shut properly? Or do I have to call separate carpenter/plumber/electrician? Thank you for any advice. PS: Or maybe someone can tell me how to change the kitchen lightbulb myself because I have no idea where to start (!)", 
      "date": "2006-10-15 12:16:00", 
      "id": 4296, 
      "responses": 1, 
      "subject": "odd jobs - recommendation?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2680"
    }
  ]
}