{
  "summary": [
    {
      "body": "Has anybody had any success in trying to stop the relentless influx of unsolicited mail that we seem to get shoved through our letterboxes? I'm fully aware that the Post Office have a statutory duty to deliver anything which has the address on it (hence their legal inability to avoid delivering stuff to \"the occupier\"). But I have registered with the mail preference service and I still get unsolicited, environment-unfriendly **** put through my door. I even have a sign above my letterbox, clearly asking people to avoid giving me flyers, menus and junk mail and yet it is constantly ignored: *     The Guildhall School of Music still chuck unwanted flyers at me, begging me to attend plays I don't want to see, and concerts I don't want to listen to. *     Ken Livingstone's propaganda newspaper, sorry \"mayoral communique\" is also forced upon me, and that rag isn't even absorbent. I can just about cope with taking these unread items and putting them straight in the recycling bin but I would rather be left in peace. Its not a lot to ask. Do any fellow residents have any decent strategies to avoid these annoying environmentally-harmful intrusions? And if not, could our friendly police advise me on the legality of lying in wait for these doorsteppers and dispatching them with harsh language and a water pistol?", 
      "date": "2007-09-01 21:29:00", 
      "id": 3434, 
      "responses": 12, 
      "subject": "Junk Mail- How can I stop it?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3621"
    }, 
    {
      "body": "Hello, I have read the news reports about the prosecution of a 15-year-old by the City of London Police over a placard he held at a demonstration at the Church of Scientology. Could the police please comment on the decision to prosecute and how this action was not covered by free speech. thank you", 
      "date": "2008-05-22 15:49:00", 
      "id": 5458, 
      "responses": 12, 
      "subject": "Scientology", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=4364"
    }, 
    {
      "body": "It's 8pm and I've just walked along the podium and come across several beer cans and smashed spirit bottles with puddles of alcohol outside the conservatory. Nearby litres of white paint have been thrown on the paving and splashed over a considerable area.  3 nights ago there were more smashed and discarded alcohol bottles near Bryer Court at about 9pm. WHY do we never see police patrolling the podium at night when these problems occur. Don't tell me they're isolated incidents! Police please respond.", 
      "date": "2008-03-01 20:07:00", 
      "id": 3532, 
      "responses": 11, 
      "subject": "Vandalism", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4075"
    }, 
    {
      "body": "Hi Paul/John I wanted to know the Police's view on a car being driven to an MOT Testing Station, if there is a pre-booked appointment, and the old MOT has run out. I've been told anecdotally that it's fine, but I wanted to know if I would need to get it trailered over... I don't want to leave my MOT to run out and then fall foul of the law! Many thanks Tim", 
      "date": "2007-07-17 17:48:00", 
      "id": 5349, 
      "responses": 3, 
      "subject": "Car legality - a query!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=3504"
    }, 
    {
      "body": "This morning, at Columbia Road market, my friend (also a Barbican resident), had her wallet taken from her bag, at around 10.50 a.m..  This was in one of the shops as you approach the market from the western end of Columbia Road.  With hindsight she realised she had been jostled by two or more females, early twenties, for whom we and the shop owner could have given a reasonable description.  My friend immediately cancelled the one credit card in her wallet.  Another shop owner gave me the telephone number for Bethnal Green Police Station, who we were told cover that area.  I was cut off after about 10 minutes holding trying to get through.  I then tried Barbican Police on the basis that they might either have another number for Bethnal Green or a way of contacting any police who might be in the Columbia Road area, in case the thieves were working their way through the market.  As one was clutching a bunch of small sunflowers (which admittedly could have been thrown away), they were potentially easy to identify, together with the description of appearance we could have given.  There was no reply from Barbican Police and at the time I couldn't find the Snow Hill number, though I found it subsequently.  When we got back to the Barbican, my friend tried the Bethnal Green number again.  After around 15 minutes she got to speak to someone, who asked which postcode Columbia Road was in.  Surprised that they did not know Columbia Road (well known Sunday plant market etc) was in E2, local to Bethnal Green, my friend was then told she was not through to Bethnal Green police but through to a central office dealing with both general and emergency calls and noting incidents.  She was told someone from Bethnal Green Police would get back to her (presumably now tomorrow). At what stage is it warranted to phone 999?  No-one had been hurt so it was not an emergency in that sense, merely a stolen wallet with all the inconvenience (membership cards, congestion charge card, library card etc), but time was lost during which the thieves may have continued their thieving and if police were in the area, they could have been notified promptly and maybe the perpetrators could have been caught.  I always understood prompt reporting of incidents was important.    Please can you tell me what we should have done in the circumstances described?", 
      "date": "2007-07-22 20:32:00", 
      "id": 5354, 
      "responses": 3, 
      "subject": "What should we do if pick-pocketed?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=3529"
    }, 
    {
      "body": "I would be grateful if you and/or the appropriate person from Snow Hill could respond to the following inter-related matters: 1.  As you know given that Corney and Barrow located opposte Willoughby House near Moor Lane cannot use what one can describe as the central piazza of City Point as a place where smokers can drink there has been a tendency for drinkers to stand in the street opposite Willoughby House and sometime directly under Willoughby House.  I understand on occasion the police have been called because despite the best efforts of the management of Corney and Barrow they have not been able to prevent groups congregating on the public highway.  This is quite disturbing to residents of \"'willoughby House and will get worse as the weather becomes warmer. Is there no way smokers cannot use the central piazza?  Is there no way C and B cannot put a notice on the appropriate door near Moor Llane reminding smokers that they cannot smoke in the street or the passageway? This would surely sC and B could lose their licence if complaints continue to mount up. 2.  Have the City of London police responded to the document about the \"greening\" of Fore Street, Moor Lane and Silk Street?  I spoke to the appropriate officer and my understanding is that the police would mwant modifications to the proposal to \"green\" the area opposite Corney and Barrow as it would turn it into a \"beer garden\"?  Has this now been put in writing? Thanks and keep up the good work.", 
      "date": "2008-03-04 14:15:00", 
      "id": 5515, 
      "responses": 2, 
      "subject": "Pub noise", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=4084"
    }
  ]
}