{
  "summary": [
    {
      "body": "Does anybody think that the birthday party celebrations in the gardens are getting a bit out of hand? Right now a huge party is being organised below me, involving trestle tables of food, a large circle of chairs, helium balloons, pirate-themed props, signs fixed to trees and so on and so on. Painstaking and involved planning for the party, little consideration for the neighbours I fear. I don't remember these sort of huge parties happening before this year (but maybe my memory is selective). What troubles me is that I find it rather inconsiderate for other garden users that such a mega-party essentially monopolises such a large segment of the garden.  By the way, I'm not against all parties! But surely they should either be smaller, or in somewhere more isolated like the basketball/tennis court (if only to avoid damaging the trees and grass) which is, after all, an area for child-use and would not impinge on others wanting to enjoy the garden.", 
      "date": "2006-07-29 14:49:00", 
      "id": 5532, 
      "responses": 17, 
      "subject": "Gardens are for communal use", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2488"
    }, 
    {
      "body": "In 2006 the Breton House and Ben Jonson House Groups consulted with residents and recommended colour schemes for pending external redecoration. A few residents in BJH  complained about the process and the colour recommended by the Breton House Group was rejected as being outside the accepted palatte of colours, so those proposals were scrapped. This year the Estate Office initiated a formal ballot of lease holders of the two blocks within a limited and accepted palette of colours.  Agreement was achieved. Redecoration was due to start next week.   Following complaints from three leaseholders about the agreed colour scheme, the work has been put on hold and is now due to be referred to the full City Planning Committee in September. Further appeals to English Heritage may follow. All of this costs us money. I've lived here for over 25 years and have never encountered anything like this.  ", 
      "date": "2007-08-10 17:14:00", 
      "id": 3391, 
      "responses": 2, 
      "subject": "Redecoration Breton and BJH", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3577"
    }
  ]
}