{
  "summary": [
    {
      "body": "Could I say a public 'thank you' to David Graves as Chairman of the Barbican Association fo the work he has done on the legal and practical processes around extending our leases. Clearly it's a matter for personal decision but the agreements he has been able to reach and the document now available are most helpful. Many thanks, Pennie", 
      "date": "2007-04-26 22:00:00", 
      "id": 3474, 
      "responses": 20, 
      "subject": "The Guide to Lease Extensions", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3273"
    }, 
    {
      "body": "Could the Residents' Meeting be our chance to put our views on St Alphage to the vote? On our RSVP card we have requested that there should be a vote on the current proposals. Should we contact the Chair prior to the meeting to get this officially on the agenda?  Perhaps it would be a good idea that residents attending the meeting refrain from participating in the electronic voting on the issues of the City's choice unless we can vote on a motion, along the lines of \"We reject the current proposals for St Alphage House\".  Of course if we propose such a vote we must win it convincingly. Perhaps we should put up information on block notice boards to make sure there is a good attendance - and give out information to residents as they arrive for the meeting. Is this something that the BA sub committee on St Alphage could co-ordinate? We would hope that asking for a vote is something that our elected representatives - the CCs of the relevant wards and the House Group chairs and committee members would support. Incidentally - isn't it time we heard about the BA St Alphage sub committee's strategy?", 
      "date": "2008-05-20 17:11:00", 
      "id": 3601, 
      "responses": 10, 
      "subject": "2nd June Residents' Meeting - Chance to vote on St Alphage?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4360"
    }, 
    {
      "body": "Hello  Reading the below threads it is clear that a number of residents are suffering intermittent broadband faults. Either disconnection or slow speeds. Once again, I am not able to get online via my own connection, and I'm not able to make phone calls.  We understand from the fine work of the Barbican Association that BT has been moving some components related to the exchange, and also that there has been some sort of line fault. I sense from reading our experiences that there may be more going on that we have not been privy to. Firstly, is there anything more the BA can do on our behalf at this time? I am sick of spending hours on hold to BT's various departments, especially when I'm handed off to people in India who are not empowered to change the situation. Secondly, thank you to anyone who is leaving their wireless connections open at this time. I am able to get online, just about, thanks to someone whose connection is not password-protected. Be careful to ensure your connection is firewalled/virus protected and that you are not sharing your computer network along with your wireless internet. But thank you, because otherwise I would be spending most of the day going back and forth to various internet cafes / the library and spending a fortune.", 
      "date": "2008-03-17 12:24:00", 
      "id": 3822, 
      "responses": 7, 
      "subject": "Broadband faults: help from Association? + Wireless sharing", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4132"
    }, 
    {
      "body": "Please register your dissatisfaction with the St Alphage House redevelopment proposals by signing the   today. We have already collected several hundred signatures in the paper version and are now supplementing this with an online version. We welcome signatures from anyone who cares about the Barbican, whether you live here, work in the area, have some other connection with the Barbican or even none at all.  If you have already signed the paper version, we ask you not to sign again online, as we can only count you once - no matter how strongly you feel. Please ask you neighbours, your friends, or anyone else you know who cares about the Barbican to consider signing too.  Our group is a sub-group of the Barbican Association, and we have been given the task to make explicit residents' strong objections to what has been proposed. We are currently engaged in extensive research so that when the scheme comes to planning, we will be able to make the strongest case for why the scheme should be refused. We will soon have more information and will do our best to keep you informed through this site, through the  , and for Barbican residents, through the BA Newsletter delivered to your letterbox. Tim Macer Chair, Barbican Association St Alphage House Group Tel. (020) 3291 2938", 
      "date": "2008-05-22 20:44:00", 
      "id": 3608, 
      "responses": 5, 
      "subject": "St Alphage House petition - now open online", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4365"
    }, 
    {
      "body": "As one often finds in a large community its inhabitants often find that they encounter severe problems and have serious complaints and do not know how to resolve them. Very recently, someone complained about excess light from neighbouring blocks of offices.  There is a law and it can and has been enforced.   However, using this as an example, the person concerned does not known who to contact and perhaps how to channel the complaint. It would be very useful if the Barbican Association and/or this site on its title page would put a list of the agents and agencies who handle complaints as well as the names and contact telephone numbers and E-Mail addresses of the possible offenders.  That would be extremely useful. One of the problems is that the Barbican Association is staffed by very few volunteers who cannot necessarily have the time to deal with matters that individuals or groups can deal with themselves.  House committees can take action but at least two of them are almost moribund and this at a time of crisis. So either individuals and groups can take action provided they are given proper information and here an organisation like the Barbican Association can come into play and/or  can go back to having a number of standing and active committees such as the one that so successfully dealt with the nightclub at City Point.  More recently, one has found that the BA has taken some very important actions such as concerning Milton Court but failed to follow them up.  I note that about two months ago someone wrote in and asked about secondary glazing etc., that was being provided for the legal firm opposite.  He or she was answered by the BA Chair that the matter was being dealt with.  We have heard nothing since. Now a BA Chair cannot do everything on his or her own and needs active backup by committed people.  It is no good complaining unless you will take action yourselves or at least help provide the back up in terms of advice and other forms of support for people who will take action.  The time is now nearing for elections to the association and it is important for people to be aware of who are the candidates.  Will they be people who will take a full and continuously active role in defending the Barbican or will they be elected just for the supposed glory of occupying a position?  I understand that the current chair is retiring from the post and should be congratulated for his efforts over the years.  Another person who is also quitting his post is Don Prichard who has done so very much to deal with planning applications and the like.  He will be greatly missed and must be placed with a person as knowledgeable, committed and skilled in negotiation. Do make sure you elect people who will take the association forward, make it  still more active, have it anticipate events and never act in a supine way of seeing some move by the Corporation as inevitable and therefore not worth fighting after a certain point. When the time comes make sure that the councillors we elect actually represent our interests.  There are cases of people who have been elected, get absorbed into the system to the point of adopting a Burke-like attitude that they represent \"the greater good\" rather than the people who elected them.  If they have not come up to scratch just throw them out.", 
      "date": "2008-03-29 18:12:00", 
      "id": 3837, 
      "responses": 4, 
      "subject": "Complaints and their resolution", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4165"
    }, 
    {
      "body": "Has anyone received their 2007 card yet? I sent my cheque off several weeks ago but haven't received a card back yet.  I use it mainly for Sunday cinema discounts so won't be able to do this until the card arrives which is irritating.", 
      "date": "2007-01-06 14:26:00", 
      "id": 4128, 
      "responses": 3, 
      "subject": "Barbican Association card", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2884"
    }, 
    {
      "body": "Is BA membership on a personal or a per-flat basis? If the latter, is it possible to get extra membership cards issued so that e.g. my wife (who has a different surname to me) doesn't try and persuade the dentist that she's me to get her discount?", 
      "date": "2005-04-26 22:22:00", 
      "id": 2925, 
      "responses": 1, 
      "subject": "BA membership", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1591"
    }
  ]
}