{
  "summary": [
    {
      "body": "The pushbutton on my toilet has broken and I need a plumber fairly urgently. I've followed some of the previous threads on plumbers, but does anyone have recent experience of a reliable plumber please? Thanks.", 
      "date": "2007-10-21 09:12:00", 
      "id": 3933, 
      "responses": 12, 
      "subject": "Plumber", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3739"
    }, 
    {
      "body": "I think I need to replace our dishwasher - it still washes fine but all the bits of plastic have snapped or crumbled.  Can anyone please recommend someone to remove the old dishwasher and fit the new one?  It's semi-integrated but I think it just needs some plumbing and a screwdriver.", 
      "date": "2007-04-02 17:05:00", 
      "id": 4363, 
      "responses": 5, 
      "subject": "Dishwasher installation", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3200"
    }, 
    {
      "body": "in need of estimates to carry out work in my flat ,Seddon house. Is there anybody who can help me with a useful list of a few telephone numbers? Christine[/b]", 
      "date": "2006-10-17 14:16:00", 
      "id": 4294, 
      "responses": 4, 
      "subject": "Need a list of electricien, plumbers, other crafmen", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2688"
    }, 
    {
      "body": "All sorts of problems with the taps and original water heater in my kitchen. Is D J Welch still working on the estate? And are there any other recommended plumbers?", 
      "date": "2007-04-21 16:53:00", 
      "id": 4343, 
      "responses": 4, 
      "subject": "Any recommended plumbers?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3254"
    }, 
    {
      "body": "The thermostat in my kitchen water heater seems to have gone (water coming out at near boiling point) - can anyone recommend an electrician/plumber (whichever is more appropriate) to fix it?", 
      "date": "2007-07-08 20:39:00", 
      "id": 3485, 
      "responses": 3, 
      "subject": "electrician/plumber?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3478"
    }, 
    {
      "body": "Hi everyone, I am in early pregnancy stage now.  The bath tub in our flat in andrewes house is 60cm(equal to 2 feet) tall.  Although i am able to get into the bath tub now, i dont think it will be easy for me to do that in a few months time (i am 160cm tall). i am worried it would be slippery and risky. We rent this flat and are planning to ask the landlord permission to change the bath into a walk in shower. We checked with a plumber to change the bath tub into a walk-in shower, and the estimate he gave is around 6000 pounds. My queries are: 1)does all barbican flats have this tall bathtubs. Landlord/estate agent say this is an original bathtub. what does \"original\" mean....size, shape, material..??? 2)How do pregnant women here manage to get in..any tips? 3)Is there any other less expensive solution available? (like power bath tubs that lifts the user and drop in..like those used by elderly people...are they less expensive to replace the existing normal tubs) 4)what is typically done when some modification effort is undertaken. (other than getting permission from landlord, informing estate office and dropping a note to neighbouring flats about the planned work) we plan to ask the barbican estate office for some contacts of plumbers familiar with barbican issues any suggestion or info or pointers would be useful. Thanks", 
      "date": "2006-06-04 18:48:00", 
      "id": 4410, 
      "responses": 3, 
      "subject": "barbican bath tub query", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2336"
    }, 
    {
      "body": "I am considering refurbishing my Lauderdale Tower bathroom as close as possible to the original. I wonder if anyone could recommend a good bathroom contractor who can cope with plumbing and tiling. I would not need a bathroom designer. Best wishes Ann George", 
      "date": "2006-09-04 08:44:00", 
      "id": 4476, 
      "responses": 3, 
      "subject": "Bathroom contractors - Lauderdale Tower", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2576"
    }, 
    {
      "body": "We live in Willoughby House and the hot water in the kitchen is run from a separate boiler from the hot water in the bathroom, I assume that this is the same system in other flats in WH. Has anyone else suffered problems with the small boiler under the kitchen sink, and if so can you recommed a reliable plumber?", 
      "date": "2006-10-29 20:17:00", 
      "id": 4309, 
      "responses": 2, 
      "subject": "Hot Water", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2709"
    }, 
    {
      "body": "Hi My washing machine seems to have decided to stop using hot water (becuase the clothes do not seem to be warm when I open the door at the end of the wash).  I'm not good at DIY and have no idea what could be causing this!  Does anyone have any bright ideas?  Or, even better, the name and number of someone reliable who could fix it...? Thanks", 
      "date": "2006-03-16 18:50:00", 
      "id": 4618, 
      "responses": 2, 
      "subject": "Cold washing machine", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2140"
    }, 
    {
      "body": "I have just bought a flat in Crescent House, Golden Lane Estate, I want to renovate the bathroom and kitchen and the original kitchen/dining room partition does antbody have any good contacts?", 
      "date": "2004-11-26 17:27:00", 
      "id": 2903, 
      "responses": 1, 
      "subject": "Renovators, carpenteters, plumbers, electricians, anyone!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1357"
    }, 
    {
      "body": "Does anyone have any experience (either positive or negative) with John Roberts who is a fairly new plumber working on the estate?", 
      "date": "2005-09-19 20:55:00", 
      "id": 3054, 
      "responses": 1, 
      "subject": "Plumbers", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1846"
    }, 
    {
      "body": "Can anyone tell me who to use - or who not to use - when replacing my original bathrooms? I've searched the archives but thought someone might have more up-to-date information. And I've seen the ad in Barbican Life for Really Useful Handyman and wondered whether anyone has used them. Grateful for any tips people here can provide. Shaker", 
      "date": "2006-07-09 10:45:00", 
      "id": 3238, 
      "responses": 1, 
      "subject": "bathroom renovation - need recommendation", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2440"
    }, 
    {
      "body": "Has anyone fitted a dishwasher instead of one of the kitchen cupboards.  We were recommended to move the sink water heater and put a smaller one next to the garchey.  Has anyone done that?  Who did you use?", 
      "date": "2007-05-20 11:05:00", 
      "id": 3321, 
      "responses": 1, 
      "subject": "Fitting a dishwasher", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3345"
    }, 
    {
      "body": "We're thinking of doing some alterations and I'm finding the listed building guidelines a bit confusing. For example, no consent is needed to change the sanitaryware or vanity surfaces in the bathroom unless the \"layout\" is affected - but does that mean that you can only replace things in the same positon (e.g. any new sink has to go in the same place as the original) or does it just refer to the architectual layout i.e. walls and doors. Also does anyone have experience of applying for LBC (some of the changes we're thinking of would definitely require it), and if so how long does it take and is it necessary to get a professional designer/architect to submit the application (the requirements for multiple scale drawings of various elevations to be submitted is rather daunting)? Finally, any recommendations of interior designers/architects and reliable builders/plumbers/decorators would be welcome.", 
      "date": "2007-01-18 22:06:00", 
      "id": 4191, 
      "responses": 1, 
      "subject": "Alterations advice/listed building consent", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2929"
    }
  ]
}