{
  "summary": [
    {
      "body": "Hi Anyone know of a local place where I can get a kettle repaired? Thanks", 
      "date": "2008-01-13 18:59:00", 
      "id": 3552, 
      "responses": 6, 
      "subject": "kettle repair?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3927"
    }, 
    {
      "body": "I have an ancient AEG dishwasher which theoretically is perfectly capable of functioning properly but makes the dishes dirtier than when they went in. Anybody know a fixing person? Plumbers won't touch. AEG won't reply. Suggestions welcome, thanks.", 
      "date": "2007-08-07 08:34:00", 
      "id": 3379, 
      "responses": 5, 
      "subject": "dishwasher doctor", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3568"
    }, 
    {
      "body": "I think I need to replace our dishwasher - it still washes fine but all the bits of plastic have snapped or crumbled.  Can anyone please recommend someone to remove the old dishwasher and fit the new one?  It's semi-integrated but I think it just needs some plumbing and a screwdriver.", 
      "date": "2007-04-02 17:05:00", 
      "id": 4363, 
      "responses": 5, 
      "subject": "Dishwasher installation", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3200"
    }, 
    {
      "body": "I think our original Barbican oven just \"died\" - flash of white light, bit of a bang, pleasantly toxic odour and all that. The orange indicator lights aren't coming on now suggesting that it has powered itself down, though I wouldn't mind isolating it from the mains power somehow just to be sure that nothing nasty happens while I hunt/wait for somebody to fix it. Does anybody have a clue what the fuses in the kitchen correspond with? We have a bank of eight unlabelled fuses in a panel within a cupboard above the stove - is it likely that one of these will knock the power from the oven? Any other suggestions? (And, does anybody know who to get to repair an original barbican oven? Or is it a lost cause?)", 
      "date": "2006-06-20 19:32:00", 
      "id": 4432, 
      "responses": 4, 
      "subject": "Dead Oven", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2379"
    }, 
    {
      "body": "My oven dial/knob has broken. Does anyone know please how I can get another one or who could fix it for me? If I end up having to get a new oven, does anyone know whether John Lewis or anyone has the correct size? I have visions of having to get an entirely new kitchen. Thank you.", 
      "date": "2008-05-14 21:08:00", 
      "id": 3596, 
      "responses": 2, 
      "subject": "Oven dial/knob", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4341"
    }, 
    {
      "body": "hi there could anyone recommend a local washer/dryer repair man? many thanks", 
      "date": "2006-06-09 08:45:00", 
      "id": 4415, 
      "responses": 2, 
      "subject": "washer/dryer repair person?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2348"
    }, 
    {
      "body": "My washing machine is on its last legs.  Any recommendations please for a local retailer who supplies and fits built in washing machines?  thanks Gandalf", 
      "date": "2008-01-11 09:07:00", 
      "id": 3547, 
      "responses": 1, 
      "subject": "Washing Machine:  Local retailer recommendation?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3923"
    }, 
    {
      "body": "Help it's just sitting there looking at me and the dial goes round on its own and then it switches itself off.  Can any one recommend a reliable washing machine repairer please?", 
      "date": "2007-01-17 14:09:00", 
      "id": 4189, 
      "responses": 1, 
      "subject": "Broken washing m/c", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2925"
    }
  ]
}