{
  "summary": [
    {
      "body": "We are about to complete on a purchase in the Barbican, a part of London I never appreciated until becoming a parent last year. It's manifest safety and quiet, compared to anywhere else I've lived in London, are now much more important than the stained futuristic penal-colony exterior which so turned me off in the past and which I now find merely bleak. I've lurked here for a few months (and am familiar with the state of play of the \"kids will be kids\" versus the \"stop the rot\" positions) but going on the evidence of barbicantalk.com alone there is a distinct heating up of crime and disorder. The Barbican seems, to this outsider, to be a nigh-on perfect place to live if you've got small children, but drunks (of any age) shouting and smashing windows at BJH can overturn that in a trice. I'm with the 'stop the rot' faction. You can be young and hang around with your mates and get drunk without shouting and wrecking.", 
      "date": "2006-10-09 11:45:00", 
      "id": 3208, 
      "responses": 50, 
      "subject": "Violence, noise (and vermin) - just another day in EC2Y ?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2669"
    }, 
    {
      "body": "A planning application for change of colour for external redecorations has arrived today in Ben Jonson.  I opened it thinking....please god...anything but red. And of course it's red.  Does anyone know why it has to change, and if so who chooses the colour and why? I have a huge personal dislike of red ... some primeval fear of the colour possibly ... this is actually a huge deal to me although I appreciate it probably doesn't bother most people.   Why mess with something that looks so good as it is? And surely it's harder to change the colour than simply to redecorate with the same shade.  Or maybe the intention is to make sure that the job is done well, so the colour change is a good way of checking it's all been done? I may have to move    ", 
      "date": "2006-04-21 18:59:00", 
      "id": 4393, 
      "responses": 48, 
      "subject": "Paintwork - change of colour for BJH", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2213"
    }, 
    {
      "body": "Hello I am an interloper so I hope it's okay to ask this.  I don't live in the Barbican yet and perhaps never will (as you all no doubt know, there is a dearth of properties) but I wondered if any of you would be generous enough to share your thoughts on living there and good points/bad points. I've lived in flats all my life (we currently live near Old Street and hurrah for the new Waitrose even if, yes, some of the staff are very incongruous for JLP) so I know that properties can differ wildly and that it's also a matter of personal choice. But these are the things I'd like to ask (in no particular order): Am I correct in thinking the biggest flats are in the towers? Is it generally a quiet and safe place to live or does it vary wildly from block to block? What's it like for children? The private gardens seem amazing but in reality what's it like? Is the service charge astronomical (I realise it depends on size of flat)? What will happen when all TV goes digital and the Barbican has no digital cable?? Is the listed building classification a pain if you want to do any work in the flat? Garchey, good or bad? Are parking places readily available to rent or is there a shortage? Anything to look for that an outsider may not know about.  I'd be really grateful for any answers. If I can reciprocate in any way...my specialities are fly fishing, beauty products, nutrition and fashion. I know, ecletic and slightly bizarre! Thank you. AB", 
      "date": "2006-06-05 17:37:00", 
      "id": 3180, 
      "responses": 29, 
      "subject": "What's it like living in the Barbican?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2338"
    }, 
    {
      "body": "Amid all the moans and groans we have living here, which this forum helps to bring to light, I feel we need a thread about all the wonderful things about the Barbican, which I hope you'll all add to so this might become the most prominent thread.  So I'll start the list, and please add to it or extrapulate on the points already made. 1. I love my home, with its corbusian dimensions and its south facing sitting room overlooking a garden. 2. I love being able to walk to work and to the West End, and home again.  3. I love my Sunday Walks though a quiet City of London down to St Paul's (sometimes stopping for evensong and other times walking on) across the bridge and along the river, back up again through the City to home again.  4. I love the wildlife on my door: wrens nesting in my window boxes; ducks, geese; falcons; gulls; ducks; blackbirds; wagtails; coots; moorhens ... to name but a few. 5. I love the gardens. Private, public spaces (especially the wildlife garden.  6. I love feeling safe, and having a police force for the city that respond to complaints about skateboarders with half the police station! 7. I love the Barbican Association; the way it fights on our behalf, produces great publications and most of all makes me feel I'll never have to worry about things going wrong here.  8. I love the Barbican arts center (or the theatre/cinema downstairs as we call it). 9. I love Barbicantalk. We exchange information, help out new residents, winge, moan, complain, have the occasional row, but ultimately, rare among internet forums it remains a place of polite communication.  10. I love the incredible rise of the Smithfields' Clerkenwell area -- we we first moved here there were no restaurants or bars open at the weekend, a total desert, and now we have on our doorstep one of the most vibrant parts of London and some of its great eateries.  11. I love the way people really care about the Barbican, and can become a bit obsessive about it (this threat: QED). 12. I love being equidistant to every London airport.  13. I love the CPA's, porters and cleaners, who always know what's going on; caring above and beyond the call of duty for our senior residents, knocking on doors (and breaking in if necessary if someone's not seen for a while). 14. I love having the corporation as a landlord. Never any problems.  !5. I love being a citizen of London (a freeman). Well, I could go on much longer, but I'll leave it now to others to add to the list.  x", 
      "date": "2006-08-20 01:44:00", 
      "id": 4470, 
      "responses": 18, 
      "subject": "Things I love about Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2541"
    }, 
    {
      "body": "The language in what follows is not mine.  I have taken it straight from the back right hand side of the newly-distributed PODIUM which claims - in its stap line - to be \"From the Barbican Centre for Residents\".  It is death by a thousand cuts (taken in conjunction with all the other development works around and invading the quality of life of the Estate) and written in the kind of jargon that makes NEWSPEAK warm, cuddly and comprehensible. \"As part of the Frobisher Redevelopment works, staff on Level 6 of the Barbican Centre are required to decant to other office spaces. The majority of Level 6 staff will be moving to a temporary site in Bonhill Street and the remainder, who cannot leave the site due to the nature of their work, will be located in two modular buildings located on the Sculpture Court.\" \"The delivery of the modular buildings is currently scheduled for Sunday 18 November. The delivery is certified as an abnormal load, due to its size, therefore the Metropolitan Police will only allow this to take place overnight or on a Sunday. With the residents in mind, the Barbican Centre did want want the delivery to be overnight and therefore Sunday was chosen as the only other option.\" For those of you old enough to remember BEYOND THE FRINGE in 1961 you may already hear the cackle of Dudley Moore in the background as I continue in my best Alan Bennett (or Peter Cook or Jonathan Miller voice) because this piece of idiocy would have been fought over by all the cast as it is such a gem. \"It is necessary to close Silk Street to allow the delivery to take place; road closure will be between the hours of 9am and 6pm. The modular buildings will then be craned into the Sculpture Court.\" \"The mobile crane will arrive on Silk Street at 8am and will be set up in preparation for the first lift at 9am. Units will then be unpacked and attached to the crane which will lift the unit from Silk Street on to Level 3. Power pallet trucks will then be used to skate the units into position on the Sculpture Court.\" \"There will be a total of 14 lifts taking place throughout the day and they will take approximately five minutes each....To address the environmental issue of noise, delivery vehicles will switch off engines between arrival and departure and the crane's engine will be switched off when not in operation.\" I've checked my blood pressure. Yes....it is up.  I do not want to use bad language on this site so I will let others scream the words for me as they read this (or as they react to the PODIUM delivery through their letterboxes). The convenient fiction - and it is one the City of London and our representatives on it to go along with -  seems to be that people do not live in the Barbican Estate, not really. And - if they do - then they bugger off at the weekend. And for those who stay then \"Hey, you'll wish you hadn't.\" The interest I declare - in this posting - is that, living in a flat in Shakespeare looking out over the Sculpture Court, means that Calypso and I will have to live through the stated (and probably under-estimated)14 lifts on that Sunday and we are being treated as if we were not here and shouldn't be here.  The trouble is it makes me want to hire a mobile crane and some modular buildings and to go and spend a weekend - maybe over the Christmas/New Year period of goodwill - doing exactly this close to the people who think this is OK....but that way lies madness, war and the destruction of civilisation.  I'd better get back in my box and keep taking the tablets.", 
      "date": "2007-11-04 23:53:00", 
      "id": 4149, 
      "responses": 12, 
      "subject": "Just when you thought it was safe to sleep in", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3772"
    }, 
    {
      "body": "Well, it had to happen. When I first saw it over a year ago, I couldn't stand the place. Concrete as far as the eye could see; stark lines and council-estate environment. Or so I thought. Yet now, a year on, I find myself totally smitten! A true urban village; neighbours who greet each other, societies to join and a real community to become part of. The architecture fascinates me, as it has done my partner who has lived here for the past three or four years. So now it is that I am leaving South-West London suburbia to move here to the Barbican. What more could I ask for: superbly designed living accommodation, service staff who smile and go way beyond the call of duty, views to die for, a cinema and arts centre in the basement, gardens with lakes and waterfalls, beautiful secure gardens, a jungle hothouse to rival Kew, virtually non-existent crime rates, police who really do care, considerate neigbours... and all the benefits of the City on the doorstep. Anyway, with that over, I just wanted to say \"Hi, I'm new here\" - I feel priviledged to be in such a superb place to live. Why would anyone want to live anywhere else? God, I'm gushing now. How embarrassing... Timbo", 
      "date": "2007-04-15 19:27:00", 
      "id": 4323, 
      "responses": 9, 
      "subject": "Hullo, I'm new here", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3234"
    }, 
    {
      "body": "Life just gets better and better here . . . the new zebra crossing opposite the Barbican Tandoori has now opened and is getting lots of use. Much needed! And I've seen two cyclists being cautioned by police at the corner of Aldersgate and Beech Street in the last week. Hopefully the message will get round that cyclists should ride responsibly . . .  [cue the flame war]", 
      "date": "2007-01-29 22:34:00", 
      "id": 3281, 
      "responses": 8, 
      "subject": "Aldersgate zebra crossing", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2974"
    }, 
    {
      "body": "Hello everyone,  We love the Barbican and have been renting here for a while but now want to buy. However the price of the apartments here are astronomical (and we are looking for a 2 bed flat). We have noticed though that the Golden Lane flats seem to be a lot cheaper. But what is it actually like to live there? Ok I am not expecting it to be as fabulous as the Barbican (chiefly because I suspect nowhere can be!) but what is it like in terms of safety, in terms of neighbours, in terms of flat construction (ie noise problems?), in terms of Estate Office responsibility (ie they are very responsive to Barbican dwellers - is it the same with Golden Lane?). Are there any communal areas like the Barbican Gardens? What is the mix of residents like? Any views or information, positive or negative is welcomed!", 
      "date": "2006-06-19 20:10:00", 
      "id": 4431, 
      "responses": 7, 
      "subject": "What's it like living in Golden Lane Estate?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2378"
    }, 
    {
      "body": "Is it true that one of the penthouses, in Shakespeare tower was specified with a terrace large enough for the first owner to land his helicopter or was it even Harrier jump jet (?) on - although planning rules or something prevented this from ever happening? I am quite interested in the tower block penthouses; does anyone on here own one, and if so are they good to live in (and do you land your helicopter on the roof!)  Does anyone else know how often penthouses in tower blocks come up for sale?  I remember about two years ago there was one in Cromwell for about 1.5mil, but it was the smaller one and had the less desirable north-west view.", 
      "date": "2005-06-14 13:06:00", 
      "id": 4745, 
      "responses": 6, 
      "subject": "Penthouses", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1684"
    }, 
    {
      "body": "Newer members of this forum may wish to read earlier installments of the Parable before reading this posting:   ------------------------------------------------------------------------------------------------------------------ It had been ages since I had seen my neighbour 1179. He had finally been released from Pols Bonne Chambers, and had been signed off as fully re-educated. Never again would he even dream of replacing his original skirting boards, nor would anyone ever hear him muttering about smells emanating out of his Garchey. He was now a Barbicanite through and through, and he would adhere to the listings guidelines like a limpet to a two-ton anchor.  The Committee had even found him employment; he had been appointed into the new role of Lake Guardian, which had been created after the lakes and fountains were renovated last year. One fine morning I decided to track him down by the lakeside. Greetings, adherer, he said. And be you ever grateful for your Listing, I replied, using the Committees recommended salutation. Nice to see that youve come back from Pols Bonne Chambers. Oh yes, the Chambers were fabulous but nothing can compare with living here, right in the beating heart of Brutalism, he said. Youve found yourself a great position here as Lake Guardian. A stroke of luck, wasnt it? The Lakes are such an integral part of the original Barbican vision. If they werent here, the whole place wouldnt be so reminiscent of Venice, would it. Absolutely! And it was so clever of the conservationists to ensure that mosquitoes would now be able to breed here, just as in La Serenissima itself. Mosquitoes? But there are no mosquitoes here; havent you read the notices which have gone up in each block? Samples have been taken from the lake and there are absolutely no mosquitoe larvae. Its those insurgents again, always stirring up trouble. They are determined to undermine the Brutalist vision, and are surreptiously dropping nits onto peoples heads from one of the balconies of Shakespeare Tower. But were on to them now and will soon put a stop to this. It was so reassuring to hear 1179 speak this way. The trainers at Pols Bonne Chambers had done wonders. Here was surely a man who put the rut into Brutalism. I asked him about the rumours concerning the lake plantings. Oh yes, those silly people who say that the lake in front of the Arts Centre was never meant to be planted with two rows of greenery. Have they never seen a Brutalist waterhedge? The ignorance of these people is just staggering. I had to agree that one heard a lot of nonsense spouted by the uninformed. And the way people moan about the green slime in the lakes now. Did anyone ever say Brutalism was meant to be clean? I think there are some idiots out there who cant tell the difference between Minimalism and Brutalism. That slime has been carefully cultured to counter the antiseptic characteristics of water features in suburban developments. Whats right for Kingston is certainly NOT right for EC2. Hear, hear I said. Where have these moaners been living all their lives  on the moon? Come to think of it, the surface of the moon is actually rather Brutalist. Maybe the Almighty spent some time in Pols Bonne Chambers and got some inspiration there, halfway through the Creation. Interesting theory; worth further study. Must get going now; Im doing my weekly patrol for terracotta containers on the balconies  theyre like weeds: just when you think you are rid of them, a couple more crop up somewhere else and have to be eradicated before they spread further. Who in their right mind would think that you can put terracotta next to hammered concrete? Nice chatting to you, I said. A very good day to you, sir - and may you always be Adhering,  he said as he strolled off.", 
      "date": "2005-09-09 20:54:00", 
      "id": 2997, 
      "responses": 5, 
      "subject": "the parable of the lake", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1836"
    }, 
    {
      "body": "Only joking... I'm not at all. I'm very cross about it ...BUT That said, is it worth discussing what we should lobby for in the medium to long term with regards to the St Alphage site?  We might get lucky and Chase JP Bear away this time. The economy might collapse. Bear JP might be rouge traded, I don't know. But the fact remains that someone at some point will try and develop the land. It may be 5-10 years from now, but surely, it will happen.  Putting aside the ghastly injustices of the political situation which've been detailed on other posts, what is clear is that the hilariously impartial planning department regard us as nothing more than a bunch of self-serving fascists who don't understand the basics of the  London economy.  It seems to me that this their way of writing off our concerns as a form of selfish Nimbyism that damages the productivity of the City.  This is clearly ridiculous, but it seems entrenched in the mind of the planning department.  Surely then, we have to present ourselves as people who care deeply about the City ( not untrue I would imagine) and who lobby for the Barbican on belhalf of the 300 000 workers we have been sterotyped as being against? We should argue for an architecture that is bold and as landmark as the Barbican itself.  We should present ourselves as people who not only care about The Barbican- but care about other people having acess to the Barbican? Not just the arts centre, but the place as a whole? If this is a grandmother suck eggs situation, forgive me. My white rage at the proposal has made me want to do all kinds of things! But should we also be working out what would be acceptable- or is this giving up before we've even started? Perhaps it is a dangerous strategy. Perhaps me saying this is all part of their darstardly plan. I put nothing past their evil cunning. And I'm sure I'm absolutely stating the obvious here and everyone else is five steps ahead of me on this- for example- the Save the Barbican T-shirts I thought struck the right note I thought! I personally would rather another Gherkin or even a 'Shard of Glass' outside my living room than the bulky monstosity we've been offered. But more importantly, I want to be able to walk to the Guildhall / Cheapside without crossing a big road. I want to get to Moorgate without getting in a lift and I want the safety offered by having a steady stream of people coming in and out of the Barbican. These are, to me, more important that the height of the building. A landmark beauty would, in my view, benefit us all. But discuss... And apologies for the provocative subject title, I was concerned that the telephone had knocked the issue off the top spot. Don't even get me started on BT. [/i]", 
      "date": "2008-04-12 14:20:00", 
      "id": 3866, 
      "responses": 5, 
      "subject": "Pro the St Alphage Development", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4229"
    }, 
    {
      "body": "crikey! it's getting busy around here... I remember with considerable nostalgia moving into the area around 8 years ago and it being quiet. it may just be recent events but the \"aggro\" levels do seem to be increasing... it is just me or do other longish term residents have the same feeling", 
      "date": "2007-02-06 20:40:00", 
      "id": 4221, 
      "responses": 3, 
      "subject": "Witness appeal opposite bbcan tube", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3041"
    }, 
    {
      "body": "For me, there are three main reasons for wishing to live in the Barbican 1/ Walk to work (and to South Bank, West End etc) 2/ Pedestrian only 3/ The Barbican Centre on your doorstep We go to The Barbican Centre a lot: pretty much it's the main arts venue in London we go to regularly. I was wondering how often Barbican residents make use of this wonderful venue. Look forward to your responses! What sort of events do you go to, and what have you been to recently?", 
      "date": "2006-10-02 09:23:00", 
      "id": 4276, 
      "responses": 3, 
      "subject": "How often do you attend cultural events at The Barbican?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2649"
    }, 
    {
      "body": "Riots in and outside the YMCA, paint colour wars, satanic children and smashed glass in BJH and drunken hoodies under Bunyan. What's going on on our northern fringes? Is there something in the water? ", 
      "date": "2006-05-06 22:29:00", 
      "id": 3097, 
      "responses": 2, 
      "subject": "what's up??", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2266"
    }, 
    {
      "body": "Way back in 1990s I move into ECx as it was close to my work - how much joy I had then when I was seven (yes 7) minutes door to door. There wasn't much around here then - fluid was the only bar and the italian on the corner was the only restaurant but even then the bug had started to bite... after that relationship fell though I rented in whitecross street then (briefly and badly) went to pimlico. After that in '03 into BJ house. Gloomy (east side) but spacious and close to the supermarket. And 65m2 is not to be sniffed at - and I did make it very nice. But now it's in my blood. There is nowhere else in London I want to live; *hams don't do it for me, mayfair is too dull & expensive, whitechappel is too edgy.  I think I've found home. I've moved now from my slightly dark flat in BJ to a little studio in JT and it's wonderful! The light, the big windows. The Barbican was an exceptional piece of '60s / '70s architecture.  When I come in from the east on the train after visting a friend I see so many bleak blocks of badness; some old and plenty new. Small mean windows and cheap construction. Now, just now 30/40 years later the Barbican kitchens are fading... that's a long time compared to the new brick boxes! I feel so at home here - curiously my current JT rented studio is directly opposite the flat I had when I first moved into ECx.  In spite of the influx of clicky heels on a Friday, it still feels good. And the best thing is... there are more blocks to discover! I've only done two so far  :-) B", 
      "date": "2007-04-26 22:05:00", 
      "id": 4256, 
      "responses": 2, 
      "subject": "I genuinely can't think of anywhere else I'd rather live", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3274"
    }, 
    {
      "body": "First of all, please forgive me - I am not actually a resident of the area, but I'm sure all you Barbican inhabitants may be able to answer my question, which is.. Why has the Barbican become so madly popular recently? I have always considered it on and off, and just a month or two ago nearly every estate agent in town had a vast choice of different Barbican properties, but now there is literally not a single property available, and in a tower block with a view... forget it.  It was always the case for years that there were consistently many Barbican properties available, but now they've all gone.  I saw in another thread that someone recommended calling the estate agent on the day they release details of a new sale, and they're quite right!  This has become like trying to buy a property in Primrose Hill! Prices have skyrocketed too, there is currently a tower block apartment for 700,000 (under offer), whilst this time last year tower apartments were about 550,000 with the desirable views, and much less (400k region) with the north (and west?) aspect.  There was a penthouse in one of the tower blocks that sat on the market for about 3 years, but recently it appears that two newly for sale penthouses in tower blocks have been snapped up in about a month. Are you (Barbican residents) noticing more people in the area? Has anything specific brought about these changes, or are people finally opening their eyes to how magnificant the Barbican estate actually is?  Are the original generation of Barbican dwellers (who perhaps have a second home too, out of London) starting to sell up and move out?   Whatever it is, i'm rather annoyed now!", 
      "date": "2006-06-10 12:40:00", 
      "id": 4416, 
      "responses": 2, 
      "subject": "Current mad popularity of Barbican...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2354"
    }
  ]
}