{
  "summary": [
    {
      "body": "whilst reading about the mendohlson tree, i wondered ...  whilst recognising that we are indeed very lucky in our police resources, is there a specific reason why the bored-out-of-their-minds security staff from the arts centre can't cast their net wider ... ? I ask because the  lovely gardens by bunyan / jt / bryer are a bit of an attraction for the \"malcontents\" because they're so lovely and lush and screen things from public view ... the group of youths, for example, referred to in previous posts i think, have taken to drinking under bunyan - having re-located from jt ...  presumably the answer is the security guards are employed by the arts centre but i wonder how whether the financial equation to extend their duties to the rest of the estate would be a cheaper option than using the police and the cost of repairs (when things can be repaired, that is, unlike the tree sculpture...) just a thought", 
      "date": "2006-05-01 23:08:00", 
      "id": 3084, 
      "sentiment": 3, 
      "subject": "security", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2244"
    }, 
    {
      "body": "Do you remember not all that long ago when one could wander over to the Centre amble up to the seventh floor ( or even take the lift ) and enter the wilds of what at one time was a haven of tranquility surrounded with the lush collection of plants, trees and heaven knows what from all over the world that abounded all about one. Fat old carp merrily swimming about two pools, one situated in a mini jungle and the other in a display pool. At one time all about the visitor were displays of many a colourful variety of named and mystery plants all beautiful in their glory.         On a floor above is situated a collection of cactus growing in all shapes and sizes and if one visits during the blooming period one can admire the hanging baskets filled to overflowing with the cascading variety. Upon leaving this wonderment look down and to the right and see a large grouping of terrapins.           All this was brought to a screetching halt some years ago when the Management of the Centre came to the conclusion that money could be made by barring residents during the week and selected weekends and letting it out, naturally for a price, to functions, receptions bla, bla,bla. Kind of makes one wonder where the priorities lie, with those who it was given to originally years ago or to a profit making group who put profit before resident! ", 
      "date": "2006-08-11 10:07:00", 
      "id": 3148, 
      "sentiment": 3, 
      "subject": "The lost gardens of the conservatory!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2518"
    }, 
    {
      "body": "Can anyone please advise what the procedure is for sorting out neighbours with noisy plumbing - as ever it is so hard to know which flat is actually responsible for the noise.  At the moment when one of our neighbours (unsure which) runs their water taps we hear a loud whining noise throughout our flat - the noise seems to be getting worse too. Has anyone else experienced a similiar problem? Is this something the Corporation can deal with - how will they identify the flat?", 
      "date": "2006-08-19 12:15:00", 
      "id": 3162, 
      "sentiment": 3, 
      "subject": "Noisy Plumbing", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2540"
    }, 
    {
      "body": "Am I the only one to be annoyed at the proposals for Silk Street? One of the key things promised as part of the Milton Court development was to enhance the Silk Street to turn it into an \"Arts Centre Promenade\", but more importantly calm the traffic and rat running that happens at the moemnt. Instead we end up with a wider pavement ( maybe) and a few trees.  The Corp rips us off again I think! (I do however like what they are porposingnfor Moor Lane though the new JP Morgan Building will probably wreck it)", 
      "date": "2008-02-14 13:43:00", 
      "id": 3516, 
      "sentiment": 3, 
      "subject": "Street Upgrade Consultation", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4019"
    }, 
    {
      "body": "Ok, people, here's another hardy perennial. It's now getting VERY COLD.  I feel the cold quite badly and am at home much of the time (like many others in the Barbican) and the free-standing electric heaters which we have just don't do the job properly. Not to mention the fact that we've already spent a small fortune this summer on using them because the weather was so cold some of the time. I rang the BEO to be given the usual \"oh, we never turn the heating on until October\". I pointed out that if it gets cold before the beginning of October, and enough people request it, then it can be turned on earlier (as has happened in previous years) so I was getting my request in early this year. This went down like the proverbial lead balloon. Apart from being cold, I'm also very annoyed. It seems to escape the notice of BEO staff that RESIDENTS PAY FOR THEIR HEATING through the service charge and if we need it turned on slightly earlier then we're perfectly entitled to have it. It's always a rather worrying situation when those in charge of your heating system a) don't live here and b) have a vested interest in keeping the cost down. I know that our heating system is an ongoing concern because of its incredibly complicated time/temperature triggers (nothing like a simple thermostat here) and also because it is hopelessly antiquated but it shouldn't be such a battle to get it turned on every year. I don't want to knock the BEO staff because usually they provide a very good service - but this one really gets me going   So, please - ring your House Officers and request that we have access to our own heating. It still takes about a month for the buildings to warm up properly so, even if it goes on now, it will some time before we really start to feel it. House Officers' telephone numbers are:-   Andrewes, Brandon, Cromwell, Gilbert, Speed and Willoughby - Helen Davinson on 7029 3963 Defoe, Lambert Jones, Lauderdale, Mountjoy, Postern, Seddon, Thomas More and Wallside - Sarah Styles on 7029 3962 BJH, Breton, Bryer, Bunyan, John Trundle and Shakespeare - Rebecca Marshall on 7029 3964. Yours in scarves and sweaters etc. etc.", 
      "date": "2007-09-26 15:09:00", 
      "id": 3804, 
      "sentiment": 3, 
      "subject": "HEATING!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3692"
    }
  ]
}