{
  "summary": [
    {
      "body": "Could the Barbican office supply a new garchey unit, if the one in your flat had been removed by the previous owners?", 
      "date": "2005-06-14 13:07:00", 
      "id": 4684, 
      "responses": 50, 
      "subject": "New Garchey?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1685"
    }, 
    {
      "body": "We're about to rent a flat in Willoughby but it doesn't have an oven.  We want to fit one but, in traditional Barbican style, the gap is 57cm rather than the standard 60cm.  Apart from a really expensive Siemens model, does anyone know an oven that would fit?", 
      "date": "2006-03-26 10:42:00", 
      "id": 3062, 
      "responses": 7, 
      "subject": "Oven width ...?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2155"
    }, 
    {
      "body": "Has anyone recently sucessfully replaced the hob unit with halogen whilst maintaining a nearly completely original kitchen?", 
      "date": "2006-11-07 17:37:00", 
      "id": 3210, 
      "responses": 6, 
      "subject": "Halogen Hobs", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2736"
    }, 
    {
      "body": "Does anyone have any tips for preventing limescale building up? It's really tiring keeping the sinks and traps free of limescale. I was wondering if those electrical gadgets that one can attach to pipes are actually effective.", 
      "date": "2005-11-21 13:44:00", 
      "id": 4536, 
      "responses": 6, 
      "subject": "Hard Water & Limescale", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1947"
    }, 
    {
      "body": "Any helpful suggestions would be much appreciated. We have an original kitchen in a type 21 flat and wish to fit a slimline 45cm dishwasher underneath the breakfast bar unit. We will remove the sliding breakfast bar to provide height clearance. However freestanding dishwashers appear to be too deep and would \"jut-out\" by 6cm or so. Integrated dishwashers are shallower but need to have a front panel attached to match the rest of the kitchen- which I don't think are available for original barbican kitchens? Has anybody else encountered the same problem and have the managed to find a solution or a suitably sized dishwasher? Thanks", 
      "date": "2005-07-27 13:41:00", 
      "id": 2945, 
      "responses": 5, 
      "subject": "Fitting a dishwasher to an original barbican kitchen", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1764"
    }, 
    {
      "body": "I moved here six months ago and have had two very high electricity bills.  The original oven would appear to be the culprit.  Have those of you who have replaced the original oven noticed a significant reduction in their bills?", 
      "date": "2007-10-20 10:44:00", 
      "id": 3455, 
      "responses": 5, 
      "subject": "Original oven", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3736"
    }, 
    {
      "body": "On the standard electric CredaPlan barbican oven, could some-one help me translate the numbers on the dial so I can cook my ovenready meals safely? The Oven dial runs from 0 to 5 ..... Now are those the same as 'gasmarks' referred to on ready meals?  - clearly not Centigrade or Fahrenheit. Any enlightenment would be appreciated, many thanks,", 
      "date": "2005-04-17 21:49:00", 
      "id": 2913, 
      "responses": 4, 
      "subject": "Settings on CredaPlan Oven", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1569"
    }, 
    {
      "body": "I think our original Barbican oven just \"died\" - flash of white light, bit of a bang, pleasantly toxic odour and all that. The orange indicator lights aren't coming on now suggesting that it has powered itself down, though I wouldn't mind isolating it from the mains power somehow just to be sure that nothing nasty happens while I hunt/wait for somebody to fix it. Does anybody have a clue what the fuses in the kitchen correspond with? We have a bank of eight unlabelled fuses in a panel within a cupboard above the stove - is it likely that one of these will knock the power from the oven? Any other suggestions? (And, does anybody know who to get to repair an original barbican oven? Or is it a lost cause?)", 
      "date": "2006-06-20 19:32:00", 
      "id": 4432, 
      "responses": 4, 
      "subject": "Dead Oven", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2379"
    }, 
    {
      "body": "Hi, I need to get a small washing machine (500 cm wide) for a barbican studio original kitchen. Has anyone any idea where you can get a good one? Thanks Max", 
      "date": "2005-11-14 16:08:00", 
      "id": 4532, 
      "responses": 4, 
      "subject": "small washing machines", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1935"
    }, 
    {
      "body": "the thermostat on one of my (original) hob rings has broken and I wondered if anyone has any experience of fixing/replacing? I am assuming the thermostat control will be behind the electricity knob on the overhead panel but it may be that it is under the ring itself. also, has anyone found a supplier for replacement rubber seal rings for the hobs? mine are on their last legs....", 
      "date": "2006-01-05 08:07:00", 
      "id": 3043, 
      "responses": 3, 
      "subject": "kitchen question....", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2015"
    }, 
    {
      "body": "The thermostat in my kitchen water heater seems to have gone (water coming out at near boiling point) - can anyone recommend an electrician/plumber (whichever is more appropriate) to fix it?", 
      "date": "2007-07-08 20:39:00", 
      "id": 3485, 
      "responses": 3, 
      "subject": "electrician/plumber?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3478"
    }, 
    {
      "body": "I have recently moved here to a virtually original flat.  The oven door no longer closes fully and heat is escaping.  Is there an alternative to a new oven? Can someone let me know what the original kitchen floors were and if there is a modern day equivalent. Thanks", 
      "date": "2007-07-28 16:47:00", 
      "id": 4107, 
      "responses": 3, 
      "subject": "Oven door and kitchen floor", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3540"
    }, 
    {
      "body": "Does anyone know where to get an oven that fits into the kitchen space provided in the studio type 2 apartments in the Barbican?  This seems to be slightly smaller than the 'standard' size ovens available, and we are having trouble locating one/ stockists. Our space accomodates 540mm width.  Any suggestions or help would be much appreciated, especially with the onset of winter!", 
      "date": "2005-11-12 12:55:00", 
      "id": 4525, 
      "responses": 3, 
      "subject": "Ovens", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1932"
    }, 
    {
      "body": "We are used to getting small electric shocks from the metal light switches.  However, this morning my boyfriend got a slightly nastier, but non life threatening, shock from the red oven switch in the kitchen. We have an original kitchen although I'm not sure if that switch is original.  Does anyone know if this is this something that needs to be looked at by an electrician or is it just one of those Barbican things that you learn to live with (ie don't touch the switch with bare hands?). Thanks!", 
      "date": "2006-04-07 12:10:00", 
      "id": 4649, 
      "responses": 3, 
      "subject": "Electric shocks", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2186"
    }, 
    {
      "body": "Hi there. Have been looking to move from one Barbican flat to another. The one I have seen has an original oven. Anyone here used one? They look good but small. Maybe fab for cakes but not so good for the Christmas turkey. Any thoughts?", 
      "date": "2005-04-13 22:24:00", 
      "id": 2908, 
      "responses": 2, 
      "subject": "Chefs ahoy", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1562"
    }, 
    {
      "body": "My oven dial/knob has broken. Does anyone know please how I can get another one or who could fix it for me? If I end up having to get a new oven, does anyone know whether John Lewis or anyone has the correct size? I have visions of having to get an entirely new kitchen. Thank you.", 
      "date": "2008-05-14 21:08:00", 
      "id": 3596, 
      "responses": 2, 
      "subject": "Oven dial/knob", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4341"
    }, 
    {
      "body": "Hello. Does anyone know if it's possible to turn off the original built in oven at the mains? I can't seem to find a switch...", 
      "date": "2006-10-27 08:48:00", 
      "id": 4302, 
      "responses": 2, 
      "subject": "oven question", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2705"
    }, 
    {
      "body": "I'm redoing our kitchen and have removed the (enormous, over-engineered) oven hood and ducting. The Barbican Estate Office give instructions for how to replace it, that involves 'a mechanical volume control damper and suitably sized inlet grill... commissioned to achieve an extract rate of 30 litres per second.' I've tried calling them for advice and left messages, but as a shortcut has anyone here dealt with this issue? I have a suspicion a mechanical volume control damper might just be a slider on the grille... but how do you measure the extract rate?", 
      "date": "2005-11-05 19:34:00", 
      "id": 4521, 
      "responses": 2, 
      "subject": "kitchen ventilation adjustment", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1921"
    }, 
    {
      "body": "Hi My washing machine seems to have decided to stop using hot water (becuase the clothes do not seem to be warm when I open the door at the end of the wash).  I'm not good at DIY and have no idea what could be causing this!  Does anyone have any bright ideas?  Or, even better, the name and number of someone reliable who could fix it...? Thanks", 
      "date": "2006-03-16 18:50:00", 
      "id": 4618, 
      "responses": 2, 
      "subject": "Cold washing machine", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2140"
    }, 
    {
      "body": "Hi, can anyone give me advice about replacing an original Creda hotplate?  One of my hotplates stopped working, and a resident who was replacing his kitchen kindly gave me one of his. I went to fit it today, but can't seem to take the old hotplate out just by prising it. It seems to be fixed underneath. I would have a go at unscrewing the hotplate from below, but there's what looks worryingly like a sheet of asbestos there, and I'm not sure it's safe to slide it out. Is there anyone out there who's done this before? Any advice would be much appreciated.", 
      "date": "2005-04-24 14:37:00", 
      "id": 2924, 
      "responses": 1, 
      "subject": "Creda hotplates and asbestos", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1585"
    }, 
    {
      "body": "Does anyone know of anyone who could take a look at a rather ill washing machine?", 
      "date": "2006-01-04 17:38:00", 
      "id": 3041, 
      "responses": 1, 
      "subject": "Washing Machine Repair", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2013"
    }, 
    {
      "body": "Has anyone fitted a dishwasher instead of one of the kitchen cupboards.  We were recommended to move the sink water heater and put a smaller one next to the garchey.  Has anyone done that?  Who did you use?", 
      "date": "2007-05-20 11:05:00", 
      "id": 3321, 
      "responses": 1, 
      "subject": "Fitting a dishwasher", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3345"
    }, 
    {
      "body": "Has anyone had any experience of successfully replacing a broken belt or able to offer a top tip on how to do so before I admit defeat and call the professionals?!! Many thanks", 
      "date": "2007-12-19 22:38:00", 
      "id": 4181, 
      "responses": 1, 
      "subject": "washing machine drive belt!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3879"
    }, 
    {
      "body": "I need to replace the oven and grill below the hob in my small studio flat.  Any ideas please as it obviously has to fit in the small space available? Thanks", 
      "date": "2007-05-04 21:30:00", 
      "id": 4325, 
      "responses": 1, 
      "subject": "cooker in studio flat", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3305"
    }
  ]
}