{
  "summary": [
    {
      "body": "We have the original bedroom wardrobe doors; on one, a hinge has pulled away from the door frame (they are soldered, not screwed). Can anyone advise on how to repair this (I am not a metal basher) or alternatively suggest who could do it for me?? many thanks - Roy S", 
      "date": "2006-02-09 15:58:00", 
      "id": 2753, 
      "sentiment": 2, 
      "subject": "Repairing wardrobe doors", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2064"
    }, 
    {
      "body": "I love my original Barbican bathroom, and have stuck with it as long as I possibly can, but it is now in such a bad state I am afraid I have to do a major renovation. Any spare parts will, of course, be offered for re-use. My questions are: Can anyone recommend a designer? Preferably, one who would stay as close as possible to the original design. Any ideas about how much this will cost and how long it will take? I would appeciate any advice or information.", 
      "date": "2006-01-24 00:02:00", 
      "id": 2882, 
      "sentiment": 2, 
      "subject": "Renovating a bathroom", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2041"
    }, 
    {
      "body": "That's television, rather than transvestite by the way.  Anyone know a decent technician who would install and set up a new dvd to my telly. I know this must sound feeble to all of you who know what you are talking about on the massive posting about our new television system, but my expertise lies in other directions.", 
      "date": "2005-07-28 12:55:00", 
      "id": 2947, 
      "sentiment": 2, 
      "subject": "TV technician", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1766"
    }, 
    {
      "body": "Anybody here use a box delivery service for veg? I tried freshfood.co.uk but they stuffed up the delivery so am looking for someone tried and tested.", 
      "date": "2005-07-03 19:30:00", 
      "id": 2979, 
      "sentiment": 2, 
      "subject": "Organic Box Delivery", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1725"
    }, 
    {
      "body": "Has anyone used a minicab to get to Heathrow, and do they have any recommendations? There's too much luggage to take on public transport, and a minicab would be cheaper than a black cab, but I'm worried a minicab will get lost around the Barbican unless they're local. Thanks", 
      "date": "2005-11-28 12:50:00", 
      "id": 3031, 
      "sentiment": 2, 
      "subject": "Cab to Heathrow", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1959"
    }
  ]
}