{
  "summary": [
    {
      "body": "I know this has been discussed before but the posts I saw dated back to 05/06 and wondered how up to date it all was. We're looking for a hygienist and, possibly in time, a dentist too, preferably in the area but would be prepared to travel for someone really fantastic. My current dentist was great but now seems to be more interested in filling his surgery with staff under the age of 25, charging me 80 for a scrape and polish from a 22 year old who was more concerned with chatting and showing me how white her teeth were, and generally doing 'cosmetic surgery' (Botox, teeth whitening etc) than actual dentistry. There are also only so many DVDs of Friends - which you watch whilst he does your teeth - I can watch whilst I listen to water dripping (the new water feature in the surgery).  I had an horrendous experience as a child with the dentist so any recommendations would be most gratefully received.", 
      "date": "2007-03-14 21:18:00", 
      "id": 3291, 
      "sentiment": 3, 
      "subject": "Dentists", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3144"
    }, 
    {
      "body": "Am I the only one who thinks this practice is run like a processing plant and a referral agency. Does anyone know of an alternative doctor in the area who chooses to know your name and who you are and what concerns you?", 
      "date": "2007-11-22 10:46:00", 
      "id": 4159, 
      "sentiment": 3, 
      "subject": "Neaman Practice", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3808"
    }, 
    {
      "body": "My partner just sold his flat (not a Barbican one but one down the road) through Currell and I've been so impressed with them I wanted to pass it on. I haven't got any connection with them aside from that they sold the flat, but appreciate you only have my word for it. We used an other agent at first (best not name them for fear of libel but it's a big company) and I was appalled at the service they offered, booking viewings in with people that didn't turn up (and the agent didn't turn up) shouting at me down the phone if I couldn't do a viewing with one hour's notice, that sort of thing. As I had to do most of the day to day stuff I found it hideously stressful. Anyway, eventually we changed and we've been really pleased and I thought others might find this nugget of information helpful..or not.", 
      "date": "2007-01-21 10:47:00", 
      "id": 4195, 
      "sentiment": 3, 
      "subject": "A positive experience of estate agents", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2940"
    }, 
    {
      "body": "Has anyone tried Hypnosis for giving up smoking?   Im looking for a local practitioner who can rid me of this horrid habit.  Ive tried everything in the past and given up for periods of 3  6 months at a time. All recommendations would be greatly appreciated. Paul", 
      "date": "2006-10-24 16:42:00", 
      "id": 4303, 
      "sentiment": 3, 
      "subject": "Hypnosis for giving up smoking.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2698"
    }, 
    {
      "body": "All sorts of problems with the taps and original water heater in my kitchen. Is D J Welch still working on the estate? And are there any other recommended plumbers?", 
      "date": "2007-04-21 16:53:00", 
      "id": 4343, 
      "sentiment": 3, 
      "subject": "Any recommended plumbers?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3254"
    }
  ]
}