{
  "summary": [
    {
      "body": "Does anyone know a decent tiler? The last one never turned up when he said he would, he put the bathroom out of commission for two weeks, ripped me off, tiled over the old ones and now the new ones have started to fall off!!!!!!!!!!!!!! (I don't mind paying a bit extra for quality and reliability). ", 
      "date": "2006-04-10 08:51:00", 
      "id": 3061, 
      "sentiment": 4, 
      "subject": "Bathroom tiles", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2190"
    }, 
    {
      "body": "Could anyone recommend a good lawyer?. I have had a second opinion on my not healed foot ( 3 months)  by an orthopedic surgeon specialized in feet. My aunt a doctor with 30 years experience has always spoken of clinical negligence as my partner a pathologist, the second opinion has confirmed it. Any good lawyer specialized in clinical negligence to be recommended? I have spoken to a friend of mine but he works in cameron Mckenna and they are quite expensive. As at work my line manager thought I was cheating ( 3 months for a foot to heal?)  plus the NHS ( my employer) has a new policy for people too ill like me, basically they have pushed me into resigning, so I need a good one and cheap if possible...", 
      "date": "2006-11-01 15:32:00", 
      "id": 3189, 
      "sentiment": 4, 
      "subject": "I need a lawyer", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2717"
    }, 
    {
      "body": "Hello All,  I'm about to pull my hair out with my printer.  I've successfully set up my wireless broadband and decided to introduce my printer to my router.  My Mac can now see my printer and trys sending stuff to it, but to no avail.  I suspect it's something to do with the way my security is set up on my router but I've exhausted my limited knowledge of wireless networks.  To add to the confusion, we're using both Mac & PC in our flat hence not just having an airport to run everything from.   Any suggestions anyone? Or better still, does anyone know of anyone who charges to come around and sort such IT matters out?  I seem so near, yet so far! Thanks all!", 
      "date": "2006-09-04 10:10:00", 
      "id": 4471, 
      "sentiment": 4, 
      "subject": "wireless printing hell...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2578"
    }
  ]
}