{
  "summary": [
    {
      "body": "In case anyone didn't get today's junk mailing inside the \"City Resident\" magazine, the St Alphage House redevelopment is to be exhibited at the City of London Girls School, Weds 26th March 6pm - 8pm and Thurs 27th March 4pm - 7pm.  There is very little extra \"real\" information in the mailing, other than confirming the footprint of the building, which will include the Fore Street Telephone Exchange. Strangely enough they chose not to include any renderings of the proposed building - guess we'll all have to go along to see the alleged elephantine building.", 
      "date": "2008-03-18 23:08:00", 
      "id": 3587, 
      "responses": 77, 
      "subject": "St Alphage House Exhibition at Girls School, 26/27 March", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4138"
    }, 
    {
      "body": "I've just received this notification of another application to turn the turret into a flat. I thought this horrible idea had been defeated! Any insights?", 
      "date": "2008-01-23 13:23:00", 
      "id": 3593, 
      "responses": 54, 
      "subject": "Planning application for John Wesley Highwalk Turret", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3943"
    }, 
    {
      "body": "I have just received a letter from the corporation notifying me about Heron's planning application to convert much of the Speed/Willoughby car parks over to the exclusive use of the new Milton Court developers. Call me a nimby, but I would encourage as many people as possible to object.  - the application involves turning ALL the spaces on Speed 03 and Willoughby 02 over to the exclusive use of Milton Court. That is over 150 spaces to be removed from residents' use. (Together with developments in Lauderdale, there seems to be a trend developing here.) - Milton Court drivers would share the existing entry into 03 level with us, but have their own entrance to 02 level from the existing ramp on Moor Lane. Both entrances will have no CPAs, just electric gates plus CCTV. Pedestrian entry for Milton Court residents into 02 and 03 levels would be by a new door at the corner of silk street and Moor lane, again with electronic entry. In my view the combination of large numbers of people using 03 level together with no CPA leads to an unacceptable reduction in security. Brandon Mews residents have their back doors opening onto the car park plus there are a number of storage lockers there. Given that it's all too easy for someone to slip in before the electric gates close, this greatly increases the scope for intruders. (And I don't put much faith in CCTV - it's only effective if someone's watching it all the time, in which case why not put them in the car park instead of behind a screen?) This also affects flats overlooking Speed Gardens, which can be accessed from the car park directly (the door currently has no lock on the car park side). Note that there will be pedestrian access between the Milton Court and resident parts of the car parks, so security will be compromised for resident car park spaces as well - anyone slipping in behind a Milton Court user will be able to get into the resident areas of 02/03 without having to pass a CPA.  Further the spaces (& CCTV cameras) proposed for 02 level are directly opposite Brandon Mews kitchens/2nd bedrooms, resulting in increased noise and less privacy for residents. The plan is also stupid from the perspective of Milton Court residents who (following the removal of their bridge) would have to cross the road (with no pedestrian crossing) to get to their car park.   Last but not least, if you're opposed to the Milton Court tower, then opposing the parking scheme is another way to scupper it as it could not proceed without the car park.  The deadline for objections is 23 November. Details of the application can be found at ", 
      "date": "2007-11-04 00:16:00", 
      "id": 3684, 
      "responses": 49, 
      "subject": "Milton Court car park proposal", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3770"
    }, 
    {
      "body": "Does anybody know the latest??", 
      "date": "2007-07-10 13:57:00", 
      "id": 3458, 
      "responses": 37, 
      "subject": "Milton Court", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3486"
    }, 
    {
      "body": "Since BA Chair isn't interested in finding out what a majority of residents think on this issue, here's a very non-scientific poll to find out.", 
      "date": "2006-12-04 22:14:00", 
      "id": 3311, 
      "responses": 29, 
      "subject": "Milton Court Poll", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2801"
    }, 
    {
      "body": "Great news - the plans for the new GSMD tower and scheme have NOT been passed by the planning committee today. The application was \"sent back\" rather than being rejected, as rejection would rule out any development on the site. But this appears to mean that the plans proposed are dead and it is back to the drawing board.  Well done to everyone who has been involved in objecting and campaigning against this. Perhaps someone that was there can fill in a bit more detail as I only heard this indirectly. Hopefully something that will work for everyone will come out of this in the end.", 
      "date": "2007-05-15 12:35:00", 
      "id": 3729, 
      "responses": 29, 
      "subject": "Milton Court - the tower has been rejected", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3332"
    }, 
    {
      "body": "It is not too late to make a difference. Today (31 October) is the last day to get in your objections for the Milton Court development: a school for the Guildhall School of Music and an enormous residential tower. Reference 06/01160/FULEIA If you haven't got your objection in yet, you can email it to   or you can hand it over in person by going to the 18th floor of St Alphage House. You must ask for a receipt with today's date. Objections received after today will still be taken receipt of, but might not be considered fully. But if you can't make today, you should definitely still send yours in. I have pasted derbyram's points to object on below. It is important that people who object to the proposal to send in a letter of objection. We helped to have the submission rejected before and we can hopefully do it again. Here are the points: The plan submitted in March has been modified in an attempt to satisfy some of the objections raised, but in essence remains the same: a new building with the lower block housing a concert hall and theatre for the GSMD, surmounted by a residential tower.  284 flats in a tower covering half of the existing site, just lower than City Point  residential density over 8x greater than within the Barbican (even Heron note this in their environmental impact study  density will be 1183 units per hectare, compared with a recommended central location maximum of 240-435 as per the Mayors London Plan, which also states that density should respect local context and communities)  the existing Milton Court perimeter wall moved 1.9m closer to the Barbican, resulting in the road carriageway narrowing from 10.4m to 7.3m  buses and other large vehicles will have great difficulty is safely negotiating the Silk Street/Moor Lane junction in the face of oncoming traffic.  Heron still plan to purchase 210 car parking spaces in level 03 and 02 car parks below Willoughby, and convert space under the Moor Lane car-park ramp into secure bicycle parking, all for the exclusive use of Milton Court.  a health spa/club with outside tables will sit on top of the GSMD building (6F), directly opposite upper floor residents bedrooms in Willoughby and Speed.  many flats in north Willoughby and Speed will still suffer from a loss of light, loss of privacy, and be subject to overlooking from the new tower.  loss of the existing public highwalk  note that recent new buildings constructed around the Barbican area have been designed to retain highwalk access  similarly redevelopment of Milton Court should follow the same UDP requirement.  this development will generate 3,705 person trips and 423 vehicle trips per day, which will be in addition to traffic generated by the new Ropemaker Place building.  a caf/restaurant will be located at the SE ground floor corner  expect early morning delivery noise, as experienced with the City Point bars/restaurants.  the contractor has promised to abide by CoL working hours (which differ from Barbican Estate noisy work hours), but note than the contractor has already broken such pledges made while constructing the new lift/staircase.", 
      "date": "2007-10-31 10:07:00", 
      "id": 4154, 
      "responses": 29, 
      "subject": "MILTON COURT FINAL OBJECTIONS", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3755"
    }, 
    {
      "body": "WEDS 7TH SEPT 3.30-8.00pm at Fortune Park Campus(the old Prior Weston School) entrance on Whitecross Street just in case you fancy a gander ", 
      "date": "2005-09-02 19:41:00", 
      "id": 3053, 
      "responses": 27, 
      "subject": "GOLDEN LANE CAMPUS  (exibition of plans)", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1826"
    }, 
    {
      "body": "Does anyone have any information as to how high, how wide, the number of students, the age of said inhabitants, when will the structure be finished, when will the first kids be under roof etc. etc.! I've heard all kinds of stories, some plausable, some pretty far fetched, a few wanting me to sell up and flee. Having risen from the ashes of the old seat of learning the structure at present looks pretty formidable to say the least! Many months ago I was under the impression it would be a one story group of buildings. If one looks at what has risen so far that couldn't be gospel. I've even heard that there will be situated a football pitch on the roof!!! Enough rumours and neighborhood horror stories...any REAL information to give we who are interested to the point of distraction!", 
      "date": "2007-03-02 17:59:00", 
      "id": 3568, 
      "responses": 25, 
      "subject": "That shiney new school on Whitecros Street.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3095"
    }, 
    {
      "body": "I understand that Heron, the  company owned by Gerald Ronson, has supplied Linklaters with excellent secondary glazing as a form of minimising noise during the demolition/construction opposite. As far as I know the same offer was not made to the residents of Speed and possibly Willoughby who are even closer to the site. Why have the house committees and the BA itself not taken action on behalf of the residents?  Why has there not been any public information?  Heavy and noisy destruction is about to start and nothing has been done. Answer please!", 
      "date": "2008-02-04 08:35:00", 
      "id": 3501, 
      "responses": 21, 
      "subject": "Milton Court:  Failure to protect Speed and Willoughby", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3978"
    }, 
    {
      "body": "I noticed that there is a letter from Waitrose on the communal noticeboard acknowledging the petition many of us signed in favour of a Barbican branch. Looks like positive stuff. PS Crispins is selling Andrex 4-packs for 1.55 so hurry!", 
      "date": "2005-10-06 17:49:00", 
      "id": 4530, 
      "responses": 21, 
      "subject": "Waitrose in Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1871"
    }, 
    {
      "body": "Does anyone know if a new Tesco is coming to the building on the corner of Aldersgate Street and Carthusian Street?  It's the building currently covered in scaffolding, next to the NatWest Bank.  I know planning permission has been given for flats and a bookies.", 
      "date": "2006-05-27 11:09:00", 
      "id": 3122, 
      "responses": 20, 
      "subject": "Planning permission - Tesco?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2322"
    }, 
    {
      "body": "Had a letter and saw an application in the Standard last night (Tues.) for conversion of the turret in Aldersgate Street (sort of above the Indian restaurant) in to a flat.How bizarre.  They are going to have windows - obviously but they are currently slits, hence the turret like look. Hope they whoever they are will not spoil it.  This is a nicer addition to the Barbican than the dreadful fire station so I hope someone keeps an eye on it.  I don't object at all just hope the outside is not changed.  The Estate office seems to be \"selling off\" odd bits like 60 Aldersgate Street and now Pinxtos.  Maybe the old police station will change to.", 
      "date": "2007-01-31 10:19:00", 
      "id": 3275, 
      "responses": 20, 
      "subject": "Turret planning permission", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2985"
    }, 
    {
      "body": "There's a planning application by the City to remove some of the car parking spaces beneath Lauderdale Tower on 02 level, and turn it into office space (apparently the Barbican Estate Office have outgrown their offices). This would have a detrimental effect to the look and feel of Lambert Jones Mews, as the new offices would overlook the Mews. There would also, obviously, be a loss of carparking facility for residents not only of Lauderdale Tower but of the estate as a whole. Could I just urge anyone who thinks this is another terrible idea to write a letter opposing this aplication as soon as possible. The case officer is Chhaya Patel and the Planning Portal Reference number is: P40059 and the application reference is: 07/00684/LBC. You can I do this online I think, you can certainly have a look at the proposals via this link:   I think it's a slippery slope if we turn a blind eye to allowing parts of the estate to be turned over to commercial uses in this way, especialy if we end up losing valuable facilities such as parking places, and it affects the character of the estate.", 
      "date": "2007-08-30 16:58:00", 
      "id": 3462, 
      "responses": 19, 
      "subject": "Application to turn part of Lauderdale car park into offices", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3614"
    }, 
    {
      "body": "I understand that plans are now out to redevelop the post office and telephone exchange site on Fore Street.   Also that new plans for Mlton Court are out - seven floors lower than before. Has anyone been to the Planning Department to view them?", 
      "date": "2007-07-25 14:53:00", 
      "id": 4106, 
      "responses": 16, 
      "subject": "Redevelopment of Fore Street Post Office site", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3537"
    }, 
    {
      "body": "Just noticed a planning application stuck to an office wall by the Nos 4/56 bus stop in Aldersgate Street.  Application for a zebra crossing by Barbican gate 8.  This is by the Barbican Tandoori.  Quite why they want one there by the chicane and bus stop beats me.", 
      "date": "2006-08-03 10:11:00", 
      "id": 3149, 
      "responses": 14, 
      "subject": "New zebra crossing", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2503"
    }, 
    {
      "body": "I see that the offices in Roman House (corner of Wood and Fore streets and facing Andrewes House) have been vacated and sold on to a developer for 20mil. Does anyone know whether this is also part of the JP Morgan/St Alphage massive development and whether they are also due to be demolished and redeveloped?", 
      "date": "2007-12-13 12:37:00", 
      "id": 3556, 
      "responses": 14, 
      "subject": "Roman House - Fore/ Wood Street", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3866"
    }, 
    {
      "body": "i see on \"skyscrapernews.com\" that j.p.morgan are planning a 21 story office block for the site completion by 2011.well that leaves us more or less living in a valley, very new york. i expect we will loose yet another pedestrian bridge!", 
      "date": "2007-05-04 05:53:00", 
      "id": 4324, 
      "responses": 13, 
      "subject": "st alphage house redevelopment", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3301"
    }, 
    {
      "body": "Am I the only one to be annoyed at the proposals for Silk Street? One of the key things promised as part of the Milton Court development was to enhance the Silk Street to turn it into an \"Arts Centre Promenade\", but more importantly calm the traffic and rat running that happens at the moemnt. Instead we end up with a wider pavement ( maybe) and a few trees.  The Corp rips us off again I think! (I do however like what they are porposingnfor Moor Lane though the new JP Morgan Building will probably wreck it)", 
      "date": "2008-02-14 13:43:00", 
      "id": 3516, 
      "responses": 12, 
      "subject": "Street Upgrade Consultation", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4019"
    }, 
    {
      "body": "After at least 330 years (!) as the Kings Head (and also the St Pauls) closes next weekend.  In theory the Kings Head will reopen as a pub once the Chiswell Street Brewery has been redeveloped as a hotel.   However, given the abject spinelessness of the City when faced with major developers we could well see the pub converted to become the breakfast bar of the aformentioned hotel, as per the developer's original plans. Meanwhile, there will be a closing party at the Kings Head on the evening of Thursday 21st February.  As I first supped there over thirty three years ago I'll see you there!  Mine's a pint of bitter!", 
      "date": "2008-02-17 18:56:00", 
      "id": 3817, 
      "responses": 10, 
      "subject": "Kings Head closing down next weekend", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4036"
    }, 
    {
      "body": "The following notice is being displayed on notice boards around the Barbican Estate to give notice of some forthcoming site investigative works at Milton Court. Apologies for any inconvenience.... From mid February until the end of April 2007 Ardmore Mace will be undertaking site investigations at Milton Court. The investigations will provide information on site conditions which will help finalise the detailed design. The work will be carried out within the agreed City of London working times: Monday to Friday hours, 08:00-10:00, 12:00-14:00 and 16:00-18:00 Saturday hours, 8:00-13:00 The professional team are in close consultation with the City of London's Engineers and will monitor dust and noise emission at the site perimeter throughout the duration of the works to ensure the works are kept within the agreed parameters. The team will continue to keep you informed on the development of the project and any further planned works over coming months. If you have any concerns or questions about the works please contact Jeremy Fraser of Four Communications on 0870 420 3246.", 
      "date": "2007-01-30 14:16:00", 
      "id": 4210, 
      "responses": 10, 
      "subject": "Milton Court Site Investigation Works", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2979"
    }, 
    {
      "body": "There's a planning application in for a new EAT sandwich bar on the corner of Aldersgate St and Long Lane (opposite the Pret a Manger and Frank Harris, if that makes sense, just down from Barbican tube). EAT is an independent sandwich chain, a pret-a-manger-a-like, but not as good, in my opinion. Chains are dull satisfaction, but I suppose we get what we go to.", 
      "date": "2008-04-16 15:36:00", 
      "id": 3996, 
      "responses": 9, 
      "subject": "new EAT on Aldersgate St", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4239"
    }, 
    {
      "body": "There is a sign from the COL Planning department on the building on the corner of Aldersgate Street/ Carthusian Street stating that Tesco has applied to change the doors and if anyone thinks that this will \"affect the character and appearance of Charethouse Square\" they should write in before Auggust 17th.  Apparently plans may be viewed at their office on the 18th Floor of St Alphage House, Fore Street and protests may be sent to - Department of Planning and Transportation, COL, Po Box 270, Guildhall.", 
      "date": "2006-07-28 10:26:00", 
      "id": 3142, 
      "responses": 8, 
      "subject": "Tesco Doors", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2485"
    }, 
    {
      "body": "We are very concerned having seen the new booklets in the Barbican Library. Apparently, \"The crossover has been moved to a different location beneath the Barbican\"... etc.  Page 4.  Originally scheduled for Aldersgate Street. \"IF compensation grout shafts are required in the Barbican basement car parks to mitigate impacts associated with PREDICTED settlement at the Barbican\"... etc.  (my capitals)  Page 14. There are other references to Moor Lane and Moorgate and I would hope that you will all go and have a look at these booklets and see what you think.", 
      "date": "2006-05-11 10:33:00", 
      "id": 4407, 
      "responses": 8, 
      "subject": "Amendment of provisions Crossrail", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2283"
    }, 
    {
      "body": "The City of London School for Girls has a planning application in with the City to replace the grass playing surface below Thomas More and Mountjoy with an all weather synthetic surface.  The application admits that local residents may notice the 'loss of the \"feel\" of a real grass area'. To mitigate this, the school proposes to relandscape the surrrounding planters so as to enhance biodiversity, including planting native shrubs which will encourage birds and butterflies.   What do we think about this and why haven't we been asked to comment? What does the 'real' feel like?  I'm concerned that we might get some hideous bright green fake sward (or purple, or blue, or brown). The improved planting and maintenance propsed in the biodiversity report sounds good, but I wonder whether this is a proposed simply to placate opposition. It would be better to have the enhanced biodiversity planting and the feel of real grass.", 
      "date": "2006-12-29 11:45:00", 
      "id": 4121, 
      "responses": 7, 
      "subject": "Playing Field at City of London School for Girls", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2863"
    }, 
    {
      "body": "Remember the old M&S foodstore a the very top of Moorgate (the same block as the tube station entrance and next to horrible old Clintons Cards)? There's a sign on it saying that Halifax Bank of Scotland is applying for planning permission to chang the usage from retail and to develop it as a bank.  What a shame. I was hoping we'd get something more useful and necessary in the City.  I know it sounds far fetched for that particular site, but  a Muji branch wouldn't go a miss. There are so many in the West End but none at all east of Tottenham Court Road. Such a useful and interesting shop! I was hoping they would have put one in the new Paternoster Square development, but no luck there.", 
      "date": "2006-05-19 09:09:00", 
      "id": 4398, 
      "responses": 7, 
      "subject": "Empty M & S on Moorgate.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2304"
    }, 
    {
      "body": "yay, we won the olympics! so, what does that mean for the crossrail link? is it now going to be pushed forward? are we all going to sink into the lake?", 
      "date": "2005-07-06 15:24:00", 
      "id": 4688, 
      "responses": 7, 
      "subject": "olympics and the cross-rail", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1728"
    }, 
    {
      "body": "When Somerfield acquired 115 stores from Morrisons, the Office of Fair Trading referred the matter to the Competition Commission.  The Competition Commission has this morning issued its provisional findings. It believes that there are competition concerns in 14 of the areas. These are listed, but do not include Whitecross Street. This surprised me as Somerfield seems to have our local market thoroughly stitched up (particularly on Sundays). If only Somerfield were required to sell on the Whitecross Street store to another operator...  Anyone wishing to comment on the findings is invited to e-mail  . A summary of the provisional findings report is available on ", 
      "date": "2005-07-26 06:32:00", 
      "id": 2950, 
      "responses": 6, 
      "subject": "Calling all anti-Somerfield campaigners", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1762"
    }, 
    {
      "body": "I guess many residents may plan to comment on the application to replace Milton Court with upgraded facilities for the GSMD and for the residential tower above it.  It was confirmed at the recent exhibition of the plans at the GSMD that revised plans are to be submitted at the end of the month. It is not likely that the revised plans will involve any radical changes to the current proposal, but this will mean that there will be extra time for people to write in with comments, which is a good thing. On the other hand, there is a risk that points of detail (at least) made in relation to the present proposal will cease to be valid where they address aspects of the plans that change between now and the end of the month.  My understanding is that the changes, although small, are likely to be beneficial from residents' point of view rather than adverse, but those of you intending to submit comments before the deadline presently advertised may wish to await the delivery of the revised plans and present their comments by reference to the revised plans. This will ensure the comments made continue to be relevant to the plans the Planning Committee will be asked to decide upon.  The BA will be submitting comments, but not before we have had a chance to review the revised plans.", 
      "date": "2007-03-17 17:37:00", 
      "id": 4346, 
      "responses": 6, 
      "subject": "Milton Court PLanning Application", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3153"
    }, 
    {
      "body": "Interesting article in BD magazine, condemning redevelopment proposals for Milton Court:", 
      "date": "2007-04-06 06:35:00", 
      "id": 4367, 
      "responses": 6, 
      "subject": "Milton Court in architectural press...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3208"
    }, 
    {
      "body": "I've found the planning applications for Milton Court.   This first one details the demolition etc    This second one gives details of a new bridge to replace exisiting one    The details show that both applications have been received by the City of London and you are able to submit your comments on both.", 
      "date": "2007-01-15 14:48:00", 
      "id": 3250, 
      "responses": 5, 
      "subject": "Planning application details - MILTON COURT", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2915"
    }, 
    {
      "body": "I don't know why the \"Street Upgrade Consultation\" forum has been closed when it is still being discussed. Let's continue it under this new title.", 
      "date": "2008-02-24 11:53:00", 
      "id": 3517, 
      "responses": 5, 
      "subject": "Barbican Area Plans", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4055"
    }, 
    {
      "body": "Only joking... I'm not at all. I'm very cross about it ...BUT That said, is it worth discussing what we should lobby for in the medium to long term with regards to the St Alphage site?  We might get lucky and Chase JP Bear away this time. The economy might collapse. Bear JP might be rouge traded, I don't know. But the fact remains that someone at some point will try and develop the land. It may be 5-10 years from now, but surely, it will happen.  Putting aside the ghastly injustices of the political situation which've been detailed on other posts, what is clear is that the hilariously impartial planning department regard us as nothing more than a bunch of self-serving fascists who don't understand the basics of the  London economy.  It seems to me that this their way of writing off our concerns as a form of selfish Nimbyism that damages the productivity of the City.  This is clearly ridiculous, but it seems entrenched in the mind of the planning department.  Surely then, we have to present ourselves as people who care deeply about the City ( not untrue I would imagine) and who lobby for the Barbican on belhalf of the 300 000 workers we have been sterotyped as being against? We should argue for an architecture that is bold and as landmark as the Barbican itself.  We should present ourselves as people who not only care about The Barbican- but care about other people having acess to the Barbican? Not just the arts centre, but the place as a whole? If this is a grandmother suck eggs situation, forgive me. My white rage at the proposal has made me want to do all kinds of things! But should we also be working out what would be acceptable- or is this giving up before we've even started? Perhaps it is a dangerous strategy. Perhaps me saying this is all part of their darstardly plan. I put nothing past their evil cunning. And I'm sure I'm absolutely stating the obvious here and everyone else is five steps ahead of me on this- for example- the Save the Barbican T-shirts I thought struck the right note I thought! I personally would rather another Gherkin or even a 'Shard of Glass' outside my living room than the bulky monstosity we've been offered. But more importantly, I want to be able to walk to the Guildhall / Cheapside without crossing a big road. I want to get to Moorgate without getting in a lift and I want the safety offered by having a steady stream of people coming in and out of the Barbican. These are, to me, more important that the height of the building. A landmark beauty would, in my view, benefit us all. But discuss... And apologies for the provocative subject title, I was concerned that the telephone had knocked the issue off the top spot. Don't even get me started on BT. [/i]", 
      "date": "2008-04-12 14:20:00", 
      "id": 3866, 
      "responses": 5, 
      "subject": "Pro the St Alphage Development", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4229"
    }, 
    {
      "body": "T-Mobile are about to put in a planning application to site a phone mast on the roof of 45 Beech Street. A very quick internet scan suggests from various sources that there are potential health risks, particularly to those living within 300 metres of mobile phone masts. If we want to object to the siting of this mast - individual letters/objections count. Does anybody else know about this?", 
      "date": "2006-06-13 17:17:00", 
      "id": 4429, 
      "responses": 5, 
      "subject": "T-Mobile proposed phone base station - i.e.mast", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2364"
    }, 
    {
      "body": "Does anyone have any details of the planning application for the school in Whitecross Street to be extended extensively to cover the whole playground area? It's under Islington Council. This will mean at the very least that all the lovely trees will come down, more congestion in Whitecross Street etc.", 
      "date": "2005-06-20 08:27:00", 
      "id": 4671, 
      "responses": 5, 
      "subject": "PLANNING APPLICATION", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1699"
    }, 
    {
      "body": "Just read this on Timesonline   and even though we wouldn't mind a few more shops open on the weekend, we wouldn't want the City to become another West End. The reason we live here is for the peace and quiet. We would hate to see this beautiful part of London spoilt by a mass of high street shops. ", 
      "date": "2008-02-04 20:28:00", 
      "id": 3779, 
      "responses": 4, 
      "subject": "Rival to Blue Water Shopping Centre", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3981"
    }, 
    {
      "body": "Sunday - from at least 9am until 12:45 last - hammering from the old green glass fronted building on Moor Lane/Chiswell St - fed up by 11am - went down to the site - Polish builder very reluctantly directed me to the site office, - he said  \"I am  just wasting my time now\" - I signed the site visitors book, since no-one there to complain to - and called the CoL environmental health line 7606-3030. Apparently I was not the first person to complain about this specific noise today - and the environmental health officer had already visited the site - but unable to find any perpetrators - and yet STILL (12:55) the noise goes on - not really very reassuring when Willoughby/Speed residents  are asked to accept promises from a new developer (Heron) about noise associated with the redevelopment of Milton Court, which will be monitoted by the CoL........(CoL terms -no work allowed after 13:00 Saturday, no work allowed Sunday) - message to CoL - your/our terms are being breached deliberately - what means do you propose to enforce the mutually agreed terms ??", 
      "date": "2007-03-04 13:07:00", 
      "id": 4250, 
      "responses": 4, 
      "subject": "NOISE from One Moor Lane construction site on Sunday", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3102"
    }, 
    {
      "body": "I note a few messages about Crossrail on another thread - and thought it might make sense to start a new one here.  I think one of the messages says that there is a plan B regarding the Crossover cavern under Defoe House.  There is indeed a Plan B, but that doesn't stop the crossover being constructed - but it might enable the engineers to do away with the proposed surface works on Aldersgate Street as the plan involves removing the muck through the tunnels back to Liverpool street, rather than through a shaft at Aldersgate Street/Beech Street.  Regarding subsidence, residents will be exceedingly unlucky if they are affected at all.  Virtually all underground works make for some subsidence (most of the Barbican falls within a prospective area where up to 10mm of subsidence might be expected) - but if this occurs evenly across the structures it is unlikely that anyone will notice apart from the engineers with their precision monitoring instrumentation.  Bear in mind that the Crossrail route under the Barbican is actually directly underneath the existing Metropolitan Line/Circle line/Thameslink tracks - and for safety reasons any subsidence will have to be very tightly controlled under the existing tracks.  I don't think Defoe residents should have anything to worry about.  Plenty of tunnelling has taken place under London recently without damage to overlying structures. Regarding the Crossover cavern - this is a structure where the twin tunnels are merged effectively into one much wider one so that trains can be switched from one track to the other.  These are necessary for both safety and operational reasons.  I am not sure why such a cavern needs to be directly under Defoe, but it is necessary for it to be somewhere, and in an urban environment it is virtually bound to be under some building and the plans place it  below Defoe and I doubt that that will be changed, but I reiterate that I still don't believe that Defoe, or any other Barbican residents will have anything to worry about from the tunnels themselves as they are 30 m down and modern engineering should be able to cope very well with this kind of problem.  The noise etc. from works in Aldersgate Street is another factor altogether and i think the current plans call for works to be carried out there for up to 43 months! - If we can do anything to get Crossrail to implement Plan B then we should.  Traffic disruption alone will be pretty horrendous, and there will also be major traffic problems in Moorgate where a major sewer has to be diverted and then replaced.  We do live in 'interesting times.'", 
      "date": "2005-04-13 20:06:00", 
      "id": 2909, 
      "responses": 3, 
      "subject": "Crossrail", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1560"
    }, 
    {
      "body": "i may have missed this elsewhere, so it might be old news, but I was intrigued in yesterday's observer to see that the Terry Farrell re-development of the far side of Smithfield incorporates the potential to re-locate both the Museum of London and the Barbican Arts Centre ...  doesn't strike me as realistic but stranger things have happened ...", 
      "date": "2007-11-05 09:03:00", 
      "id": 3465, 
      "responses": 3, 
      "subject": "arts centre move?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3773"
    }, 
    {
      "body": "This morning on the way to work I saw a little demo between St Pauls and the Millennium Bridge. There were signs up protesting against the City's plans to allow an incinerator to be built there, just by the Salvation Army building. Anyone know what this is all about?", 
      "date": "2007-07-09 21:13:00", 
      "id": 3483, 
      "responses": 3, 
      "subject": "incinerator near St Paul's?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3485"
    }, 
    {
      "body": "According to Skyscrapernews.com planning permission has been granted for a 13 story building on the site of the Fore Street telephone exchange   . . I do not understand this on two counts.  Firstly I was not aware of plans having been submitted for public comment, and secondly I thought that the highly contentious plans for redeveloping the St Alphage Highwalk included taking in this site.", 
      "date": "2008-02-08 09:32:00", 
      "id": 3495, 
      "responses": 3, 
      "subject": "Redevelopment of Fore Street telephone exchange site?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3994"
    }, 
    {
      "body": "One page flier advertising a one evening consultation meeting posted through Speed House doors today.  Private company to build the flats and sell them but not clear if the freehold will remain with corporation.", 
      "date": "2008-01-24 00:15:00", 
      "id": 3613, 
      "responses": 3, 
      "subject": "Frobisher crescent to be turned in to flats", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3947"
    }, 
    {
      "body": "Have we all received the above letter telling us that a hoarding \"will be erected\" for the above work on 23rd April, the very day that a decision was due on planning permission. Was permission granted? If so, are there any ways for the decision to be called in or appealed? Has a hoarding gone up?", 
      "date": "2007-04-24 12:19:00", 
      "id": 4253, 
      "responses": 3, 
      "subject": "Milton Court Lift / Stair Works (Four Communications)", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3266"
    }, 
    {
      "body": "I am astonished to read on p26 of Barbican News that Frobisher Crescent is to be considered for conversion to residential accommodation but that \"No element of affordable ......housing will be included within the Barbican Estate\". I know what they mean, but a better way of expressing it may have been appropriate!", 
      "date": "2006-06-03 11:48:00", 
      "id": 4412, 
      "responses": 3, 
      "subject": "Frobisher Crescent", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2332"
    }, 
    {
      "body": "fabric has been granted a 24 hour license seven days a week after the corporation of london withdrew its objections hours before a licensing hearing", 
      "date": "2005-08-19 16:21:00", 
      "id": 2977, 
      "responses": 2, 
      "subject": "fabric granted 24 hour license", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1814"
    }, 
    {
      "body": "Have spent an hour this evening looking at the proposals for the redevelopment of Milton Court and am extremely worried.  There was no mention, that I could see, of the impact a 42 storey building would have on the surrounding residential buildings.  In the expensive looking mock ups of every possible aspect of the new building + model, there was no reference to Cromwell Tower for example.  Residents there, and their current views had been conveniently forgotten. There was also minimal reference to Speed House & Willoughby House, unless I am mistaken. Am I the only one concerned about the imposing nature of the building, the impending building noise, light disturbance and additional hassle such a large building will cause? When I asked the City of London representative about the impending planning application & the date it would be submitted, he was reluctant to be specific.  He tried to placate me with \"sometime in June\".  My advice to all residents in the Barbican is to be vigilant about the planning applications and register your objections as soon as possible.  I would be interested in other peoples opinions on the redevelopment plans.....", 
      "date": "2006-04-27 21:38:00", 
      "id": 3075, 
      "responses": 2, 
      "subject": "Milton Court - proposed redevelopment", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2233"
    }, 
    {
      "body": "Does anyone know what they are building where the old Whitecross school used to be?????? I looked on the islington planning website but couldn't find any info", 
      "date": "2006-05-13 18:36:00", 
      "id": 3104, 
      "responses": 2, 
      "subject": "Building works opposite from Waitrose", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2288"
    }, 
    {
      "body": "Heron and the GSMD have distribited a sales memo stating that the application to redevelop Milton Court was deferred because of \"design related reasons\". This is simply not true. I was at that planning application meeting - there were a myriad of reasons given by those who spoke in objection to this plan, and the Planning Committee effectively said \" go back and come up with an entirely new plan\". However - it seems that Heron and the GSMD care not a jot for the concerns of local residents, and believe that those concerns can be \"steamrollered\" away. So much for so-called \"consultation\". As invited by this memo, please do contact  \"leanne.parkinson@fourcommunications.com\"  and let Heron know how Barbican residents feel about such an approach........", 
      "date": "2007-06-06 22:16:00", 
      "id": 3337, 
      "responses": 2, 
      "subject": "Milton Court - Communication from Heron & GSMD", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3401"
    }, 
    {
      "body": "Dear all, it seems that Islington Council want to try and turn Whitecross Street into some form of Carnaby Street style bannered thoroughfare. If you would like to support, object or amend the proposal, you can do so at:  Application number:  P072094  Application type: Advertisement application  Application date: 09-Aug-2007 Date received: 14-Aug-2007  Date valid: 14-Aug-2007 Consultation start: 31-Aug-2007  Consultation end: 27-Sep-2007 Ward: South Area - Bunhill Ward  Library: See details at Contact Islington only Related application:  Case officer: Sandra Chivero Decision date: Decision:  Consultation start: 31-Aug-2007  Consultation end: 27-Sep-2007 Main location: Whitecross St Junction with Old St & Whitecross St Junction with Beech St/Chiswell St Proposal: Display of banners on Whitecross Street. 2 at Old Street end, 2 at Barbican end; to be applied vertically on either side of the road, including 1 banner applied horizontally attached to proposed banners on either side of Whitecross Street at Barbican end. Status: With case officer This case is being dealt with by Sandra Chivero who can be contacted on 0207 527 7097 Comments on this application should be made by 27-Sep-2007. enjoy M", 
      "date": "2007-09-04 20:27:00", 
      "id": 3418, 
      "responses": 2, 
      "subject": "Application for permanent banners at Whitecross St Entrance", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3630"
    }, 
    {
      "body": "An article today in the Sunday Times makes interesting reading.  Is it indicative of how choices concerning building in the City are made?  I wonder if Mr. Ronson, who they point out was convicted of fraud, will take legal action?  I wonder if the principal person who backed the scheme and is behind the Morgan scheme will now have to justify himself?  I wonder if the procedures by which planning applications are dealt with need review.  Is a judicial review required?", 
      "date": "2008-03-16 09:32:00", 
      "id": 3816, 
      "responses": 2, 
      "subject": "Milton Court and Sunday Times claims", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4129"
    }, 
    {
      "body": "No one else has probably noticed, but the Arts Centre have installed a couple of new chillers on the roof for the air conditioning for the art Gallery (over by the conservatory). I'm not fussed about what they look like but when the winds in the wrong direction they make a terrible racket which I can hear from my flat. Does any one else in the east & south facing Shakespeare flats and Gilbert hear it? It's a short .. er .. farting sound as the fans start and stop, every 20 seconds or so. Most annoying.  Checking out the planning application, it seems as if they should have an acoustic enclosure and be modified not to start and stop so abrupty. But this has not been done yet. Does anyone know who I should write to in the arts centre to jolly them along and discharge their planning conditions? Ta BB", 
      "date": "2007-09-25 17:55:00", 
      "id": 3433, 
      "responses": 1, 
      "subject": "Strange noises from the roof of the Arts Centre", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3689"
    }, 
    {
      "body": "Is it all back on again now?   I see the City of London have voted to make a 250m contribution", 
      "date": "2007-10-05 09:13:00", 
      "id": 3445, 
      "responses": 1, 
      "subject": "Crossrail!!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3711"
    }, 
    {
      "body": "Does everyone already know this?  Planning consent has gone in for a change of use for the Butler's Wine Bar site in Defoe Place at the bottom of Shakespeare Tower, to be turned in to Livery Company accommodation. The Worshipful Company of Paviors: currently without a livery hall (motto: God Can Raise to Abraham Children of Stone; mission: to further the craft of paving). At least its not those Haberdashers, they can be pretty rowdy.  The reference is 07/00709/FULL  on the City's planning portal: there doesn't seem to be any associated documents at present to shine more light on the case. This is the same site that the City wanted temporary permission for offices for three years, but what became of that?", 
      "date": "2007-07-31 10:21:00", 
      "id": 4112, 
      "responses": 1, 
      "subject": "Shakespeare Tower Wine Bar Plans", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3546"
    }, 
    {
      "body": "Shakespeare Tower residents seem to have been leafleted about the planning application for change of use of the old Pintxos wine bar to office space. It took me a while to find the planning application, so here's a public spirited link to it:", 
      "date": "2007-01-12 18:14:00", 
      "id": 4134, 
      "responses": 1, 
      "subject": "Planning application - base Shakespeare Tower", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2903"
    }, 
    {
      "body": "I am on the Crossrail email list and received this missive today: The proposed Crossrail Bill is currently being considered by a Select Committee in the House of Commons and a number of changes to the scheme are proposed to address petitioners' concerns, or otherwise improve the project design. These are called 'Additional Provisions'. We are now holding an information round to explain these changes and keep you up to date on the project. Public information centres are being held along the proposed route between 11 September 2006 and 10 October 2006. Additional information centres are now being held at Liverpool Street on 5 and 6 October, and Bond Street on 9 and 10 October 2006.  All information materials relating to the current information round can be found on the information round microsite by clicking the button at the Crossrail website  . The Liverpool Street information centre is, apparently, at the Broadgate end of the main concourse, for anyone who might like to check out what the latest proposals are for themselves", 
      "date": "2006-09-27 17:29:00", 
      "id": 4267, 
      "responses": 1, 
      "subject": "Crossrail", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2637"
    }
  ]
}