{
  "summary": [
    {
      "body": "Does any one know of any choirs that are local that might be looking for singers. Preferaly something quite informal. Any hints much appreciated.", 
      "date": "2005-07-12 11:38:00", 
      "id": 1123, 
      "sentiment": 1, 
      "subject": "choral singing", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1739"
    }, 
    {
      "body": "My JLP sources confirm that the Waitrose is definately coming to   Tree Walk!", 
      "date": "2006-03-09 11:10:00", 
      "id": 1176, 
      "sentiment": 1, 
      "subject": "Waitrose", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&hilit=Organic+Morello+Cherry+Preserve&t=2122"
    }, 
    {
      "body": "Could anyone recommend a good, local cleaner for a neurotic? My last one shipped herself back to Poland, first class. D07", 
      "date": "2008-02-24 09:18:00", 
      "id": 1324, 
      "sentiment": 1, 
      "subject": "Cleaner Recommendation", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4054"
    }, 
    {
      "body": "Thank you to all the stall-holders, helpers, buyers, sponsors, lenders, entertainers and Corporation staff who made this Fayre happen.  I am extremely grateful to everyone involved before, during and after the Fayre. All our expenses were covered by sponsorship and donations, enabling all the cash taken on the day to be given to charity: that is, a total of nearly 2,000 to the different organisations present, including over 1,000 to the Guild of Bart's Hospital. Once again, many thanks to all who gave their time, effort and money. Same time next year?", 
      "date": "2004-06-21 15:13:00", 
      "id": 2901, 
      "sentiment": 1, 
      "subject": "A big \"Thank you\" from Mary", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1167"
    }, 
    {
      "body": "All I am replacing my kitchen starting 10/1/05.  If you are interested in salvaging bits from it please contact me on   N.B. The debris is cleared on the day so you have to be able to take it away as the builder takes it out.  If you want lots of pieces removed carefullyI will need to ask for some compensation for any extra effort the builder needs to do it carefully.", 
      "date": "2004-12-13 09:52:00", 
      "id": 2906, 
      "sentiment": 1, 
      "subject": "Old kitchen available for salvage", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1383"
    }
  ]
}