{
  "summary": [
    {
      "body": "Anyone going to the \"No Wax\" event at the Barbican? I know we're quite a tech savvy bunch so expect lots of i-Whores shaking their funky thangs and jiggling their funky wheels. So go on, do it. And if you're going to, what's your bag baby.  Parrrrrrrrrrrrrp", 
      "date": "2005-04-21 00:22:00", 
      "id": 2917, 
      "sentiment": 2, 
      "subject": "Mo' no wax", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1580"
    }, 
    {
      "body": "That's television, rather than transvestite by the way.  Anyone know a decent technician who would install and set up a new dvd to my telly. I know this must sound feeble to all of you who know what you are talking about on the massive posting about our new television system, but my expertise lies in other directions.", 
      "date": "2005-07-28 12:55:00", 
      "id": 2947, 
      "sentiment": 2, 
      "subject": "TV technician", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1766"
    }, 
    {
      "body": "just out of curiosity did you hear the gas fire explosion sunday morning? my windows shook and it woke me up, I had no idea what it was till I saw the news. Apparently they heard the explosion as far as Holland!", 
      "date": "2005-12-12 09:42:00", 
      "id": 3007, 
      "sentiment": 2, 
      "subject": "gas fire explosion", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1981"
    }, 
    {
      "body": "I was very disappointed to see that the Barbican no longer figures in the top 10 of Britain's ugliest buildings (according to a popular vote tken as part of Channel 4's Demolition programme). Is the British public taking a shine to Brutalism or were we just edged out by the new Scottish parliament? Either way, I'm very concerned at our new found popularity, it's  making me feel like a conformist. Time to move to Park Hill, Sheffield?", 
      "date": "2005-12-12 22:32:00", 
      "id": 3017, 
      "sentiment": 2, 
      "subject": "ugly buildings", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1986"
    }, 
    {
      "body": "I'm looking at covering Health Clubs and Gyms in close proximity to the Barbican in the next issue of Barbican Life.  Those I'm looking at are:  Champneys, Holmes Place Barbican, Holmes Place Moorgate, Lambs Club (Fitness Exchange), LA Fitness, Fitness First and the YMCA.  Comments appreciated as long as they don't stimulate a thread like the long running one - 'The Hell that is Holmes Place'!  Interested in facilities, service, pricing etc.  Obviously I'm asking the health clubs themselves to send in photographs and details on their services, but users comments would also be appreciated and may be used anonymously.", 
      "date": "2006-01-14 10:19:00", 
      "id": 3044, 
      "sentiment": 2, 
      "subject": "Health Clubs etc.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2034"
    }
  ]
}