{
  "summary": [
    {
      "body": "We currently have an old style kitchen, which we'd like to re-furbish back to it's former glory, as it is looking a bit tired. However my question is , is it worth trying to source all the bits and pieces, as nothing is made anymore. Would it be better financially in the long run to install a new kitchen in a modern style in-keeping with the streamlined 60's/ 70's white feel that the originals have? Does anyone have experience of whether this would add value or lessen it?  It does seem that many people are now getting fed up of the crankiness of the old kitchens , and maybe new buyers would also prefer this as they may find out how difficult it is to repair / source original fittings. So is it worth spending money on re-furbishing the original....or on completely re-fitting in a suitable 'in-keeping with' style?", 
      "date": "2005-08-02 13:09:00", 
      "id": 2989, 
      "sentiment": 2, 
      "subject": "Kitchen Dilemma", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1778"
    }, 
    {
      "body": "We're considering letting a small flat in the Barbican as a second property but have no experience of this kind. Does anyone have some advice for us, say, on agents or tax issues to watch out for? Many thanks.", 
      "date": "2005-12-19 10:20:00", 
      "id": 3013, 
      "sentiment": 2, 
      "subject": "Advice on letting", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1994"
    }, 
    {
      "body": "Holmes Place Barbican has been trying to put my Gold/Link membership up to 980 per year on the basis that that is their usual membership.  I've resisted and they have now come in with a better offer but I'd be grateful to hear from others about what they pay, particularly if there is anyone with an ancient membership which was supposed to give a permanent discount. Also, since Holmes Place often raises my blood pressure as much as it's supposed to lower it, does anyone have strong recommendations for alternatives.  Is Champneys still hugely expensive?", 
      "date": "2006-02-13 16:01:00", 
      "id": 3184, 
      "sentiment": 2, 
      "subject": "Gym fees", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2071"
    }, 
    {
      "body": "Past experience suggests that the Frank Harris estate agency acts as a good indicator of Barbican property.  Property hard to sell and prices on the low side = politeness and smiles to all potential buyers.  Property scare and prices on the way up = snotty attitude.  Snottiness at Frank Harris is now reaching such extreme levels it could indicate a turn in the market.  Or maybe I'm just generally less tolerant of rudeness and snotty behaviour than I used to be - obviously getting spoiled by Waitrose.", 
      "date": "2006-07-07 14:51:00", 
      "id": 3247, 
      "sentiment": 2, 
      "subject": "Frank Harris snottiness barometer", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2436"
    }, 
    {
      "body": "Has anyone in one of the large studios acquired made-to-measure venetian blinds recently? I'm contemplating replacing the ready-mades in my flat since they don't cover the 3 small windows across the top, and the fit over the big windows isn't great either. Any info on costings would be very helpful. Many thanks!", 
      "date": "2007-01-22 11:17:00", 
      "id": 3272, 
      "sentiment": 2, 
      "subject": "Venetian blinds", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2946"
    }
  ]
}