{
  "summary": [
    {
      "body": "Has anyone ever set eyes on our MP?  Does Mark Field hold public \"surgeries\" round here?", 
      "date": "2008-03-11 17:14:00", 
      "id": 603, 
      "sentiment": 1, 
      "subject": "Our MP", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4110"
    }, 
    {
      "body": "When Somerfield acquired 115 stores from Morrisons, the Office of Fair Trading referred the matter to the Competition Commission.  The Competition Commission has this morning issued its provisional findings. It believes that there are competition concerns in 14 of the areas. These are listed, but do not include Whitecross Street. This surprised me as Somerfield seems to have our local market thoroughly stitched up (particularly on Sundays). If only Somerfield were required to sell on the Whitecross Street store to another operator...  Anyone wishing to comment on the findings is invited to e-mail  . A summary of the provisional findings report is available on ", 
      "date": "2005-07-26 06:32:00", 
      "id": 2950, 
      "sentiment": 1, 
      "subject": "Calling all anti-Somerfield campaigners", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1762"
    }, 
    {
      "body": "The Boudoir hearing is set for 10 am on August 1st.  Islington are expecting a good turnout so we shouldn't disappoint. Also people who have had personal bad experiences with the bar need to turn up and give their experiences.  Cntact   (phone number on the BA website).  This is really important as Islington sent officers down to observe what was going on and have reported that they witnessed no problems.", 
      "date": "2005-07-21 10:03:00", 
      "id": 2952, 
      "sentiment": 1, 
      "subject": "Boudoir Hearing - Need WITNESSES and a GOOD Turnout", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1754"
    }, 
    {
      "body": "If objecting to an islington Licnese application (Essence, Boudoir) you can e mail  .  Include your name and address.", 
      "date": "2005-08-06 10:20:00", 
      "id": 2959, 
      "sentiment": 1, 
      "subject": "E mail address for Islington License Applications", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1790"
    }, 
    {
      "body": "Is anybody intending to write any objections?  Just to remind you the LATEST they need to be in is next Wednesday  24 August 2005.", 
      "date": "2005-08-15 12:27:00", 
      "id": 2995, 
      "sentiment": 1, 
      "subject": "Shakespeare Pub Objection letters reminder", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1808"
    }
  ]
}