{
  "summary": [
    {
      "body": "The Neighbourhood Policing Team has been asked to remind BarbicanTalk members that advice on how to lessen the impact of the current heatwave can be found at   or by phoning nhs direct on Tel: 0845 4647 We would also ask, if your neighbour is elderly or infirm, that you just check on them during this time. Although stormy weather is forecast, the temperature is forecast to remain 'high'. If you are worried about the lack of response from a neighbour's premises, please contact the City Police switchboard (020 7601 2222) as soon as possible. Yours", 
      "date": "2006-07-04 12:29:00", 
      "id": 3248, 
      "responses": 1, 
      "subject": "Current Heatwave", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2427"
    }, 
    {
      "body": "Strong winds are expected on Saturday over much of England. Gusts of 70-75 mph are possible anywhere. As the warning indicates there is still some uncertainty about the precise area which will be affected by the strongest winds. Different computer models are giving slightly different signals. While at present the greatest risk of disruption looks set to be a little further north, some models are predicting a more southerly track to the depression and hence stronger winds across the London area. With disruption possible, the winds may impact on any outdoor events in the London area on Saturday, such as the rugby international at Twickenham", 
      "date": "2006-11-23 15:50:00", 
      "id": 5041, 
      "responses": 1, 
      "subject": "Severe Weather Warning", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=2774"
    }, 
    {
      "body": "I'd love to say it's a heatwave, but it's not...... Friday 20/07/2007 \"The risk of disruption across the London area is assessed as 60%.  20-30mm of rain looks likely, generally over much of the area in the 36 hours up to midday Saturday.   60-90mm is possible in some areas although, as the warning indicates, there is some doubt about where the highest amounts of rainfall will occur.  At this stage, parts of London must be considered to be in the firing line for some of these higher totals.  With regard to timings, the rain currently looks likely to reach London in the early hours of Friday but it could be Friday evening before the heaviest rain clears northwards.  Thereafter, there is a risk of further outbreaks of rain as another band moves back across the region during the day on Saturday.     There are considerable doubts about the detail of this though.   \" Should anyone notice signs of Summer, please contact Barbicantalk immediately.", 
      "date": "2007-07-18 11:26:00", 
      "id": 5350, 
      "responses": 1, 
      "subject": "Severe Weather Friday 20/07", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=3506"
    }
  ]
}