{
  "summary": [
    {
      "body": "Does anyone know why the estate have started locking the recycling bins. If this is supposed to police recycling it does not work.   This weekend I saw people take stuff down for the recycling bins but then use the ordinary waste bins because the recycling bins were locked.", 
      "date": "2006-07-17 11:17:00", 
      "id": 3246, 
      "responses": 2, 
      "subject": "Locked recycling bins", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2458"
    }, 
    {
      "body": "We are removing our original kitchen this week and would be glad to hear from anyone who would like any doors, drawers, or any other bits which may be of use. I was astonished to discover that there is no re-cycling facility for these items and yet apparently people are often ringing the Estate office about it.  Ann George", 
      "date": "2005-03-14 19:21:00", 
      "id": 4656, 
      "responses": 2, 
      "subject": "Kitchen Removal Lauderdale Tower", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1498"
    }, 
    {
      "body": "After slowly dying over the past year, my video recorder has finally packed up. Although I guess I could dispose of it in the rubbish skip in the car-park, I was wondering if there was  a special service for recycling electrical items. A lot of local councils run these schemes, partially to stop landfills getting contaminated with nasties, and also to recycle scrap copper etc. On another point, I'm going to replace my elderly computer soon. It seems a pity to just throw it away as it still works perfectly well, although it's not up to the demands of running today's software. Does anybody know if there's any charity or similar who would be interested in taking it? Cheers, Charles.", 
      "date": "2006-05-02 19:47:00", 
      "id": 3080, 
      "responses": 1, 
      "subject": "Recycling electrical items", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2248"
    }
  ]
}