{
  "summary": [
    {
      "body": "Does any one have any idea how much the lower garden flats (the studios) go for in Thomas More? i've never seen inside one, but i like the idea of living in one - does anyone know what they're like inside? Do they actually ever come on the market - i have never seen one for sale - or do the people that live there love them so much they never move?", 
      "date": "2005-08-28 20:19:00", 
      "id": 2985, 
      "sentiment": 2, 
      "subject": "Thomas More Garden Studio Flats", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1823"
    }, 
    {
      "body": "About time!  I thought Barbican flats were flying off the shelves? There's a few here that aren't shifting, despite being on the market a couple of months. Hopefully if these reductions continue, in a year or two I might finally be able to afford one!", 
      "date": "2007-06-26 10:50:00", 
      "id": 3364, 
      "sentiment": 2, 
      "subject": "Price reductions in EC2", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3447"
    }, 
    {
      "body": "Hello! I am looking for a flat share. It is the first time in my life and I have no clue of how it works. Is Golden lane cheaper?  Thanks for all Strawby", 
      "date": "2008-01-08 05:36:00", 
      "id": 3550, 
      "sentiment": 2, 
      "subject": "How do I find a flat-share?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3914"
    }, 
    {
      "body": "Hamilton Brooks have just re-instated their third row of flats for sale on their front window - either an ominous sign for the health of the housing market here, or just an indication of things returning back to normal after a crazy few years. I remember Hamilton Brooks always used to have 3 rows of flats for sale, but a couple of years ago, literally every single flat had an 'Under Offer' sign on it. They then reduced it to only showing two rows of flats for sale. Until quite late last year, every flat was still 'Under Offer'. Then the tide changed. Now they've re-instated the third row of flats, and few, if any, are 'Under Offer'.", 
      "date": "2008-04-29 20:27:00", 
      "id": 3574, 
      "sentiment": 2, 
      "subject": "Hamilton Brooks Estate Agency - 3rd row of flats!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4287"
    }, 
    {
      "body": "Has anyone got a spare freeview box? I am not ready yet for a digital TV and my box just expired. I saw someone offered one in November but I suppose that one's gone by now.", 
      "date": "2008-02-05 10:22:00", 
      "id": 3780, 
      "sentiment": 2, 
      "subject": "freeview box", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3982"
    }
  ]
}