{
  "summary": [
    {
      "body": "Hi Everyone. We live in a small Barbican flat for the last four years and am now my flatmate and I are desperate for more space but couldn't bear to move out from the Barbican. If anyone knows of a tower flat coming up for sale then please bear us in mind.  There's no chain and we could move quickly.  Thanks for your help!", 
      "date": "2006-04-15 10:22:00", 
      "id": 3060, 
      "sentiment": 3, 
      "subject": "Tower Flat Wanted", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2201"
    }, 
    {
      "body": "My mother-in-law, her sister and young son are visiting us from Australia as of Sat 15th Sept and we've come a cropper with accommodation plans - the builders working on our new flat have been delayed and it's now looking very likely they will be homeless!  Unfortunately we can't put them up as we're currently living in a small style studio  Would anyone be away on holiday around this time (they are here for 3 weeks) and like a paying home-sitter?!  We've actually done this before with them (though not last minute!) and they stayed in a lovely flat in Willoughby.  They're Barbican savvy & very well behaved! Fingers crossed someone can help!", 
      "date": "2007-09-05 14:50:00", 
      "id": 3416, 
      "sentiment": 3, 
      "subject": "Help w/ accommodation crisis!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3633"
    }, 
    {
      "body": "Hi there Apologies in advance for making my first post a contentious one. We have been thinking about moving to the Barbican for some years. In 2003 it was possible to buy a split level 1 bed flat for about 275K. Unfortunately, for various reasons, we did not take this opportunity. Similar flats now appear to be on the market for 400K and over. Studios for 300K. I would like to ask longer-term residents: do prices tend to reflect the ups and downs of the stock market and the fortunes of the City? Did the prices of Barbican flats fall in the last recession, or did they hold up? If prices continue on their upward spiral, I guess we will have to give up the idea of ever moving here. A third of a million pounds for a single room is a bit steep, even if it's in the best place to live in London! Best wishes to all.", 
      "date": "2006-08-24 11:23:00", 
      "id": 3471, 
      "sentiment": 3, 
      "subject": "Barbican flat price fluctuations?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2555"
    }, 
    {
      "body": "Have discovered,much to my horror, cashmere sweaters put away(in bags)have been attacked, know how to darn but wretched eyesight prevents me doing a satisfactory job.Does anyone know of a repairer or even a knitter whom I would pay to do it.Have most of the relevant matching wools.Thanks in advance", 
      "date": "2007-08-07 10:51:00", 
      "id": 4117, 
      "sentiment": 3, 
      "subject": "moth attack", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3569"
    }, 
    {
      "body": "We are two very disappointed people.  We wanted to make an offer on an M2A in Ben Johnson but the owner withdrew, missed another similar type in Bunyan and have just learned of another that went privately! We currently live in Marylebone and have sold our place with contracts ready for completion so in a REALLY strong position.  Would you please let us know if you are considering selling!  We love the barrel vaulted but would consider other 2 beds on the Estate.  PLEASE contact us - we are serious and committed buyers and very disappointed at not being successful at finding anywhere.   Drop an email to   or call me on 07803 474367.   We are definitely not estate agents but want a Barbican flat as a home and hence you wouldn't have any commission fees at all!  Thanks", 
      "date": "2006-08-24 17:11:00", 
      "id": 4280, 
      "sentiment": 3, 
      "subject": "Desperate to buy a flat here!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2558"
    }
  ]
}