{
  "summary": [
    {
      "body": "The postings of recent weeks on why the Barbican Estate is a good place to live naturally concentrate on the physical environment, but have raised in my mind questions about who lives here, the demographics, the flesh and blood in the tons of concrete. We have lived here since February 1976 and witnessed many changes in the population - there are for example many more children. I've made a not very skilful web search to see if there has been any research on us, but have discovered nothing. The 4000+ plus residents of what is after all the most upmarket council estate in the country are as a community unique and therefore unlikely to attract much market or sociological research.The indicators of who we are are many, but the following, not in order of importance, I would find interesting: Cars - (eg, how many Porsches, Ferraris, Rollers?) Voting behaviour. Income. Second homes. Newspaper circulation. Holidays? Reading. Library use. Hobbies. Occupations. Age categories. Ethnicity. Theatre, concert and cinema going. Years of Barbican residence. (Post your own Barbican resident indicators). BarbicanTalk only rarely gives insights into such matters and posters are representative only of their largely unidentified and uncharacterised selves. My curiosity might perhaps be satisfied if some aspiring postgraduate student in search of a dissertation or thesis topic at one of the many universities which surround us chose us as research material. Edward Dudley  [/b]", 
      "date": "2006-11-19 11:49:00", 
      "id": 3226, 
      "responses": 21, 
      "subject": "Barbican demographics", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2759"
    }, 
    {
      "body": "I have just been reading a book description of Heathcote's work \"Barbican - Penthouse over the City\" and it describes the estate as having its own underground railway. Anyone know more?", 
      "date": "2007-03-11 14:24:00", 
      "id": 3286, 
      "responses": 9, 
      "subject": "barbican underground railway", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3132"
    }, 
    {
      "body": "An Illustrated talk                           by John Honer Please come to hear one of the original job architects of Golden Lane Estate and Barbican Estates talk about his personal experience of working with Chaiberlin,Powell and Bon on the creative process behind the desighn of these listed estates                        Tuesday 12th December                              from 6 pm           Golden Lane Estate Community Centre", 
      "date": "2006-12-05 14:37:00", 
      "id": 3305, 
      "responses": 8, 
      "subject": "The Story of Golden Lane Estate", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2803"
    }, 
    {
      "body": "Does anyone know when the next St Giles book sale is? I want to donate some books for them to sell.  I can't see anything about it on the St Giles website (although it does have some great photos of the history of the church).", 
      "date": "2008-04-21 11:13:00", 
      "id": 3565, 
      "responses": 8, 
      "subject": "St Giles Book-sale: when is the next one?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4256"
    }, 
    {
      "body": "I have been commissioned by the Barbican Centre to write a self guided walking tour leaflet  to the estate and centre. The leaflet will be given out free and it will be printed ready for the London Architecture Biennale taking place in mid June. Before anyone gets upset I would like to point out that as well as being a design historian I am a resident and therefore won't be suggesting those using the guide trespass or interfere with the bucolic barbie bliss we all enjoy. I do however want to produce an informative history to the site and surrounding area. The routes will begin at the tube stations/silk street etc and go around the highwalks leading the visitor into the Centre or down to the fountains. Hopefully this guided map will also be of use to residents who can pass them out to friends and family visiting, instead of having to rescue tearful lost first timers or those that arrive slightly distressed having spent 20mins walking around the estate in the wrong direction....... If any residents have nice Barbican urban myths, stories,quotes and history they think should be included do let me know ( eg the squirrel resident in Willoughby). I have of course lots of material/books on the history of the site and the estate and have consulted barbicanliving. But I thought there might be some hidden gems in the collective barbie brain bank. Many thanks", 
      "date": "2006-03-16 12:37:00", 
      "id": 4639, 
      "responses": 8, 
      "subject": "walking tour guide/leaflet on the Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2139"
    }, 
    {
      "body": "Does anyone know if there are exciting archaeological discoveries being made on the site of the new school in Whitecross St.? I can see it from my windows and was surprised to see that a large white protective roof has gone up over part of the site. There's a notice saying 'Danger Deep Excavation' on the surrounding fencing. The people who've been visible on site today are certainly not the usual workforce, either. As an historian specialising in this area I'm fascinated!", 
      "date": "2006-05-05 14:56:00", 
      "id": 3108, 
      "responses": 6, 
      "subject": "Archaeology on the new school site?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2256"
    }, 
    {
      "body": "The HSBC Poultry and Princess branch - the old Midland Bank Headquarters, next to the Bank of England - closes this Friday, 20th July. This branch has one of the last great Banking Halls still in use for it's original purpose. So if you want to see it before it closes, you better go now.  If you are not a HSBC customer, don't worry, there are two entrances, one at each end of the building, you enter at one, and walk the length of the banking hall to exit at the other. The branch has been doomed since HSBC moved their headquarters to the Docklands in 2004. The offices above the hall were closed at that date, HSBC sold the building for 40m and rented the ground floor for 1m a year. It has since been sold again for 72m. Since the building is Grade 1 listed, it cannot be demolished - it's supposedly going to become a grand hotel - the Banking hall becoming the hotel lobby, with the offices above being turned into hotel rooms. The replacement HSBC branch is in an inconvenient location (for the Barbican anyway) on the corner of Queen Victoria Street and Queen Street, close to Mansion House Tube. They converted the ground floor of some offices into a branch. I wouldn't hold out much hope for any architectural interest...", 
      "date": "2007-07-17 08:58:00", 
      "id": 4042, 
      "responses": 4, 
      "subject": "Closure of a Grand Banking Hall - HSBC Poultry and Princess", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3502"
    }, 
    {
      "body": "A friend of mine has lent me the original brochure for the Barbican Estate and also the Breton House brochure. I think they both date back to the sixties or early seventies. I just wondered whether anyone had the equivalent  for Ben Jonson House, which I would be very interested to see. Or perhaps they are all archived somewhere?", 
      "date": "2007-07-02 22:59:00", 
      "id": 3479, 
      "responses": 3, 
      "subject": "Original Barbican brochures", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3465"
    }, 
    {
      "body": "bbc /on this day JAN 24 1956 has an interesting article on the original CoL plan for our estate.Well worth a look!", 
      "date": "2008-05-12 11:40:00", 
      "id": 3580, 
      "responses": 3, 
      "subject": "barbican past", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4331"
    }, 
    {
      "body": "For those of you who are interested in what was on the school site in previous centuries, I've been doing some more research and found out the following. In the late 18th century a brewery called the Goat Brewhouse was operating. A 20 year old called Sam Whitbread starting working there, then moved to Whitbread's present site within a few years. By 1813 the Whitecross St site was a debtors' prison! It was built to separate debtors from the other prisoners who were held in Newgate, so that they (the debtors) wouldn't be led astray by hardened criminals. The medieval Jewish cemetery was further south than I thought and probably stretched from Thomas More Gardens up to Beech Street.   The dig under the marquee seems to have been completed now, although the soil being replaced is being sifted through, but there's a smaller dig opened up nearer Whitecross. No idea what's there.", 
      "date": "2006-06-22 08:26:00", 
      "id": 4434, 
      "responses": 3, 
      "subject": "A little more local history", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2382"
    }, 
    {
      "body": "Can anyone recommend a good printing company ? Our bowls club is celebrating its centenery this year (see previous postings) and a local historian has compiled a history which we hope to turn into a brochure / booklet to give as a gift to members and opposition teams. Any help appreciated.", 
      "date": "2008-05-05 18:45:00", 
      "id": 3572, 
      "responses": 2, 
      "subject": "Printers.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4302"
    }, 
    {
      "body": "In one of the obituaries of Benazir Bhutto it was mentioned that after escaping imprisonment in Pakistan in 1984 she lived for a while in the Barbican, I was wondering if anyone knew what building - are there any of her one-time neighbours around?", 
      "date": "2007-12-30 17:46:00", 
      "id": 3553, 
      "responses": 1, 
      "subject": "Benazir Bhutto", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3895"
    }, 
    {
      "body": "For those who are interested in history, there's a new book just launched about the Churchill brothers.   Briefly what's it about: _______________________ Revealed: Sir Winston Churchill's secret brother Jack.  Authors Celia and John Lee reveal the best kept Churchill secret, that Winston had a clever brother John, known in the family as Jack.  Over 400 pages and old photographs.  Price 25.  ________________________ The book is available in Waterstones, Hatchards Piccadilly, John Sandos off the King's Road, and Pan Book Shop at Fulham Road. I personally highly recommend it. I own it, and I am reading it now.", 
      "date": "2007-11-19 20:39:00", 
      "id": 4146, 
      "responses": 1, 
      "subject": "WINSTON AND JACK. THE CHURCHILL BROTHERS", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3804"
    }
  ]
}