{
  "summary": [
    {
      "body": "I hate to be a moaning minnie, but the sound of the lady above me marching up and down and up and down her flat is driving me mad! Whats the etiquette here? She must have a wooded/hard floor. I guess I might just need to knock on her door and have a quiet word, but by the sound of her footsteps, she sounds bigger than me!", 
      "date": "2008-03-13 17:47:00", 
      "id": 1597, 
      "sentiment": 1, 
      "subject": "Footsteps driving me crazy!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4119"
    }, 
    {
      "body": "Has anyone else been bothered by a dog barking on  a balcony in Shakespear tower?  I'm in Lauderdale and with the doors open, all I've been hearing today is a regular yapping from what sounds like a puppy.   I think the noise is coming from a flat roundabout the 9th floor, but I'm sure the flats above and below are aware of just which floor the dog is on! I'm hoping that the dog is just a weekend visitor, but does anyone know what the situation would be if it turns out to be a permanent resident?  Keeping pets is not allowed in the lease, but how is this enforced by the Corporation?", 
      "date": "2005-09-10 13:46:00", 
      "id": 2998, 
      "sentiment": 1, 
      "subject": "Barking dog", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1838"
    }, 
    {
      "body": "I have a knackered old sofa that I want to dispose of. Will the estates office take it away? Anyone know the process?", 
      "date": "2005-12-16 10:29:00", 
      "id": 3010, 
      "sentiment": 1, 
      "subject": "Getting Rid of a sofa", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1990"
    }, 
    {
      "body": "This is a Shakespeare Tower problem that others - elsewhere on the Estate - may have experienced. If so, help, guidance and advice would be appreciated. It is driving us mad. At 0600 each morning the bedroom wall behind our bed broadcasts the  Radio 4 time pips and then - for an hour - we get the TODAY programme. On the other side of that wall is a stairwell and not the wall of an adjacent flat.  We have no objection the programme - one of us normally gets out of bed to listen to it on the radio in the bathroom at around 0620 before going off to work - but the other needs to go on sleeping and cannot because of the noise from the wall. The two of us have to suffer it at the weekend. It is a real and intrusive problem. We have (as informally as is possible as 0600, gumpy, wearing pyjamas and carrying tumblers to improve the accoustics by resting them against front doors) checked the neighbours flats. It does not seem to be those immediately above or below us.  God know what they would have done if they had seen us. The noise is coming from somewhere else on our side of the tower (we are an 8B: **2 flat). It seems to be travelling up (or down) the wall from a flat where someone has the radio on a timer that lasts for exactly one hour.  Then there is peace. Is anyone else suffering - we are finding this noise is seriously intrusive - and what do we need to do?", 
      "date": "2006-05-07 21:45:00", 
      "id": 3091, 
      "sentiment": 1, 
      "subject": "Broadcasting Wall", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2270"
    }, 
    {
      "body": "are ymca residents allowed access to the estate private gardens?", 
      "date": "2006-06-09 16:28:00", 
      "id": 3132, 
      "sentiment": 1, 
      "subject": "barbican private areas", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2351"
    }
  ]
}