{
  "summary": [
    {
      "body": "I like reading Barbicanews and I am grateful to the people that put it together. And I liked what I read in the July issue with the exception of this short section, which did rather jump out at me (p.20):  OK, no problem with the washing, but I don't actually recall ever having seen anyone's bedding or bloomers out in the breeze in EC2. But what is this about recreational use? And people smoking on balconies? It is the very place we send smokers, and that probably happens 6 times a year at our \"demise\".  So, what is recreational? Have I been inviting the wrath of my neighbours while I have been : - Gardening (beyond that which is strictly necessary to comply with the lease) - Contemplating the view - Talking to the neighbours - Taking in the sun - Watching the rain, the fireworks, planes, helicopters... ? If they mean filling the balcony with patio furniture, then they should say so. I am with the BEO if there is a serious risk of harm by people blocking off others' means of escape. But doesn't the rest go a bit too far?", 
      "date": "2005-08-14 22:34:00", 
      "id": 2976, 
      "sentiment": 3, 
      "subject": "Recreational visits to balconies now banned?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1806"
    }, 
    {
      "body": "Do you remember not all that long ago when one could wander over to the Centre amble up to the seventh floor ( or even take the lift ) and enter the wilds of what at one time was a haven of tranquility surrounded with the lush collection of plants, trees and heaven knows what from all over the world that abounded all about one. Fat old carp merrily swimming about two pools, one situated in a mini jungle and the other in a display pool. At one time all about the visitor were displays of many a colourful variety of named and mystery plants all beautiful in their glory.         On a floor above is situated a collection of cactus growing in all shapes and sizes and if one visits during the blooming period one can admire the hanging baskets filled to overflowing with the cascading variety. Upon leaving this wonderment look down and to the right and see a large grouping of terrapins.           All this was brought to a screetching halt some years ago when the Management of the Centre came to the conclusion that money could be made by barring residents during the week and selected weekends and letting it out, naturally for a price, to functions, receptions bla, bla,bla. Kind of makes one wonder where the priorities lie, with those who it was given to originally years ago or to a profit making group who put profit before resident! ", 
      "date": "2006-08-11 10:07:00", 
      "id": 3148, 
      "sentiment": 3, 
      "subject": "The lost gardens of the conservatory!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2518"
    }, 
    {
      "body": "I know that the following is going to cause a stir. I swear I am writing this with no intention whatsoever of provoking anyone but to canvass views on the subject. I have a friend whose dream is to move to the Barbican. His only \"problem\" is that he owns a little, cute, lovely and well trained dog.  The dog does bark every now and then. But, having said that the new born baby opposite screams keeping me awake most nights and the next door neighbour blows her hair dry at 6.30-6.45 every morning (saturdays and sundays included)!   My friend fully understand that keeping a dog in a block of flats requires extra care to minimise the impact on other residents (e.g. he would never let the dog running around in the gardens fouling the grass-mind the geese already do!). In fact, he already lives in a \"well-to-do\" block of flats in Clerkenwell and has never had any complaints about the dog. Most residential leases of blocks of flats contain restrictive covenants about the keeping of pets. However, these are generally regarded as \"old fashioned\" and as such largey ignored and seldom enforced. Why cannot be the same in the Barbican? Why people have to be deprived of the joy of having a pet? Why cannot pets be allowed (perhaps subject to introducing \"ad hoc\" rules)?   I am also thinking here of the elderly residents to whom the company of a cat and/or small dog could make such a difference.", 
      "date": "2006-08-18 11:19:00", 
      "id": 3167, 
      "sentiment": 3, 
      "subject": "Pets", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2537"
    }, 
    {
      "body": "Hullo I have an original bathroom in my flat which I like very much. My problem is that the sink has a number of cracks in and there are lots of broken tiles.  I want to repair the room but I'm not sure what I'm allowed to do under the listing rules. Is there anywhere obvious to find out? Do I need to ask the Estate Office?  If anyone has an experience of something similar, I'd be really grateful for your advice Thanks", 
      "date": "2006-11-07 17:18:00", 
      "id": 3199, 
      "sentiment": 3, 
      "subject": "bathroom and listing rules", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2734"
    }, 
    {
      "body": " We were made aware last weekend of complaints listed on this website about actions by us or our contractors. I immediately started an investigation as we take these complaints very seriously. We have spoken at length, prior to being allowed on site, to all workers about a number of issues including hours of working, attitude when working and respecting that this is a residential neighbourhood. I have repeated this following last weekend to ensure that all workers know that any failure to respect these rules will mean they risk disciplinary measures and dismissal from the site. Following my investigation I received an apology from the scaffolder who swore, he is the foreman and it was out of character. He denies the incident happened at the time stated and was clear that he was not present on site at that time and neither were his team. I cannot prove he was there but have given him a final warning over the swearing. He is going to write to the resident who first made us aware of the complaint (this has been made possible by your Chair asking the complainant for his address). The second issue was my email address, it is working now but was not last weekend and I apologise. Thirdly I delayed this statement to you until after we had met with your representative's on Thursday night as part of our regular consultation on the planning and construction of Milton Court. This was to ensure that we had covered all the issues and had made ourselves accountable. Fourthly I was asked if we could repeat the hours of working we are keeping to, these are: Monday to Friday hours, 08:00-10:00, 12:00-14:00 and 16:00-18:00 Saturday hours, 9:00-2:00pm with no noisy works Sunday, No work Fifthly for ease here are the ways of contacting me. I hope you will not need to but would prefer that you had it easily to hand. Please contact me on 07823 442024 or   Finally I wanted to update you on the fire that occurred on the Milton Court site on Thursday. The fire was restricted to the fire station training tower in the courtyard area of the site and was caused as a result of the burning operations that were being undertaken by Cantillon on the steel sections of the tower. Once the fire was detected, the Emergency Plan was put into effect by Cantillon - the site was evacuated and the emergency services contacted. The emergency services arrived within minutes and the fire was very quickly put under control. The sheeting around the site did its job in containing the fire for longer allowing for safe exit from the site and the arrival of the fire services. The sheeting shrank and melted on the upper floors, without giving off toxic fumes or separating from the structure.  The roads around the immediate site were sealed off by the police as a precaution. Once the dousing down was completed, the scaffold to the tower were inspected by Cantillon and the District Surveyor and it was found that there was no apparent structural damage caused to the scaffold itself. The scaffold sheeting is now being removed and a more thorough inspection of the scaffold has taken place along with the clean up operations generally. No one suffered any injuries and no evacuation of adjacent premises was necessary. No delay to the project is anticipated and the whole episode was dealt with over the space of a couple of hours. This incident has of course been reported to the statutory authorities. Thank you for your understanding over both these incidents. I hope I have given a helpful explanation and that as we go forward with this project we can be a good neighbour to you. Yours faithfully Andy Dyson", 
      "date": "2008-01-13 15:22:00", 
      "id": 3559, 
      "sentiment": 3, 
      "subject": "Statement from Andy Dyson, Project Director for Cantillon", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3926"
    }
  ]
}