{
  "summary": [
    {
      "body": "I've bought some Ikea curtains and they need toi have the gathering tape (which I bought too) sewn on.  Is anyone handy with a sewing machine?  I'd rather my money go to a resident than outside! ", 
      "date": "2004-05-26 08:01:00", 
      "id": 2899, 
      "sentiment": 1, 
      "subject": "Some sewing, anyone?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1128"
    }, 
    {
      "body": "I'm looking to get hold of 3 x original Barbican Kitchen power switches and 1 x light switch, if anybody is getting rid of theirs please do let me know. Thanks.", 
      "date": "2005-01-14 10:48:00", 
      "id": 2941, 
      "sentiment": 1, 
      "subject": "Barbican original kitchen light and power switches", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1419"
    }, 
    {
      "body": "2 pleas for help: 1) Does anyone know of someone who can access some old files on our former computer and make a CD of them to download to our new computer? 2) Re the old computer, does anyone know if there are any charities who might want it (it is pretty old...) Thanks", 
      "date": "2005-07-30 17:06:00", 
      "id": 2948, 
      "sentiment": 1, 
      "subject": "New computer/old computer - help please!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1772"
    }, 
    {
      "body": "does anyone have any tips on companies/people able to help with moves across the barbican? I'm moving from Andrewes to Brandon Mews, it seems silly to get a full-on moving firm for a move of 200 m and 3 floors, especially since I'll only really need help for a few items of furniture. Alternatively if anyone fancies volunteering for the weekend of the 23rd July, I'll pay in wine.", 
      "date": "2005-07-02 10:24:00", 
      "id": 2973, 
      "sentiment": 1, 
      "subject": "moving across the barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1721"
    }, 
    {
      "body": "Hi The Observer are interested in doing a feature on designery flats in the barbican (and their owners), to flag up the Barbican tours taking place during the London Architecture Biennale in June. If your flat is ready for its close up then do send some snaps of  it to    the PR company for the biennale by next Tuesday 2nd May. For more info on the events during the festival check out   tickets go on sale in a week.", 
      "date": "2006-04-28 12:20:00", 
      "id": 3071, 
      "sentiment": 1, 
      "subject": "observer article on barbie flats", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2235"
    }
  ]
}