{
  "summary": [
    {
      "body": "I've just bought a laptop, but am not sure what I now need to do to go online - sorry for the stupid question!  I have a connector for the phone line, do I need to get connected to someone like Wanadoo?  If so can anyone recommend a good internet provider?", 
      "date": "2005-10-04 13:43:00", 
      "id": 3112, 
      "sentiment": 2, 
      "subject": "Internet Connection", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1865"
    }, 
    {
      "body": "One of my hobs has stopped working, and they no longer make them. I think the salvage store is temporarily out of action at the moment, so would be grateful to hear from anyone who knows of any that are available following a kitchen refurbishment.", 
      "date": "2006-08-11 16:40:00", 
      "id": 3146, 
      "sentiment": 2, 
      "subject": "Creda hob needed", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2519"
    }, 
    {
      "body": "To all BarbicanTalk users I'm the administrator of this site and would like your assistance in a small matter, plus your feedback on ways to deal with it. As some of you have already been discussing, there are falcon chicks nesting within the Estate. This is quite unusual as apparently most falcons do not last long in urban areas. I have received a phone call from the City of London's Wildlife Officer, who is vociferous that the location of the birds should not be revealed. This is so that the birds can have the best shot at survival, without attracting attention from people who might want to steal the chicks' eggs (which are apparently relatively rare and valuable.) There is an additional danger that people could be injured trying to get up to watch the birds close up, or to steal the eggs - apparently something similar happened elsewhere last year. For the meantime, I have edited out all references to the location of the birds. Amending text is not something I have done often in the five years or so that this site has been around, but in this case I hope there's not too much serious injustice involved. What's more, I think most people would agree that we don't want to be attracting burglars (or birdwatchers!) onto the estate. In turn you could help by agreeing not to reveal the location in your postings. Ultimately it may prove academic if more mainstream media (newspapers/ TV etc) mention the exact location. In that case, of course, we can re-assess the situation. Please feel free to give me your feedback on this approach. Hopefully you'll agree this is a fair solution, but I'm happy to read any discussion.", 
      "date": "2006-06-19 15:50:00", 
      "id": 3170, 
      "sentiment": 2, 
      "subject": "Important - for all readers - bird issue", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2377"
    }, 
    {
      "body": "Hi there Normally we live in Defoe House, but this year we decided to rent our flat out and attempt to cycle from the Barbican to Dehli for charity. We are currently in Romania. You can follow our adventure on   John and Sally ps. we are struggling to get a visa for Iran. If anybody has any contacts at the Iranian embassy please drop me a note at ", 
      "date": "2006-06-29 15:07:00", 
      "id": 3177, 
      "sentiment": 2, 
      "subject": "Cycle trip from London to India", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2415"
    }, 
    {
      "body": "HELP - did anyone record the first episode of The Choir on BBC2 last night? I tried but got the times wrong so am seriously in the doghouse . . .", 
      "date": "2006-12-05 14:40:00", 
      "id": 3230, 
      "sentiment": 2, 
      "subject": "The Choir on BBC2", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2804"
    }
  ]
}