{
  "summary": [
    {
      "body": "Can anyone advise on fuzzy phone reception on the 25th floor - is this a common problem? I've tried different handsets including digital but can't get rid of the hissing sound. Might it be something to do with Broadband/WiFi? Grateful for any thoughts or advice as it's driving me nuts!", 
      "date": "2007-05-01 19:57:00", 
      "id": 3316, 
      "responses": 7, 
      "subject": "Fuzzy phone reception", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3292"
    }, 
    {
      "body": "It's been 10 days, 4 long phone calls, and BT still haven't allocated the right telephone number for our new home at Mount Joy. They have no record of the two order numbers being placed. Our calls are being routed through to call centres in India where they have been giving us wrong numbers and not placing the orders. Does anyone know of a currently good substitute for BT in the Barbican or is it a question of from the frying pan to the fire? Thanks everyone", 
      "date": "2007-04-14 12:20:00", 
      "id": 4382, 
      "responses": 6, 
      "subject": "B.T. Substitute?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3231"
    }, 
    {
      "body": "Despite many hours of searching, I can't find where the BT phone line in my Willoughby House flat enters the premises. The telephone socket is located in the South-side living room wall (dividing my flat from the neighbour's) - though it doesn't seem to enter the property through any of the fuse boxes or the other cabinets near the front door (unless I'm missing it?). A good rattle of the telephone cable in the trunking at the socket also reveals very little.  Does anybody know where / how the phone lines are connected / enter the property? (I need to have it extended / relocated and I'm trying to avoid the splice-and-staple-along-the-skirting effect that the engineer is suggesting).", 
      "date": "2007-08-12 17:17:00", 
      "id": 3392, 
      "responses": 3, 
      "subject": "Telephone wiring question", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3583"
    }, 
    {
      "body": "Hey has anybody else's phone line stopped working ? I can access internet via broadband but I can't make or receive calls. Is it just me ? cheers Matt", 
      "date": "2006-11-23 19:50:00", 
      "id": 3214, 
      "responses": 2, 
      "subject": "Phones not working ?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2775"
    }, 
    {
      "body": "I need a second phone line for my job. Has anyone had this done and are there any Barbican specific wrinkles about having this done?", 
      "date": "2007-09-27 17:30:00", 
      "id": 3436, 
      "responses": 2, 
      "subject": "Second phone lines", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3695"
    }, 
    {
      "body": "We have now been without a functioning telephone for 2 weeks although amazingly our broadband internet service (with Pipex) is working fine. I am assuming this is something to do with the BT move from Moorgate. Is anyone else in BJH suffering? Joe", 
      "date": "2008-05-10 10:04:00", 
      "id": 3576, 
      "responses": 1, 
      "subject": "Telephone exchange 020 7638", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4322"
    }, 
    {
      "body": "Can anyone advise about a strange call I had today? Someone asking for my husband and claiming to be from BT rang to ask if we had any problems with our phone line, because they are going to dig up the road tomorrow to fix it and were just covering our arses. I know he wasnt from BT (as Im the subscriber, not my husband). But Im at a loss to understand why someone would ask for my husband by name, supposedly to enquire about our phone service. Any ideas? (BT werent that helpful. Apparently when the caller display reads Unavailable it always means the call is from overseas  I didnt realise that. (It was, however, an English voice.) BT claim that people are always ringing up claiming to represent them, & are clearly not interested in doing anything about it.)", 
      "date": "2008-05-09 17:26:00", 
      "id": 3577, 
      "responses": 1, 
      "subject": "strange phone calls", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4319"
    }
  ]
}