{
  "summary": [
    {
      "body": "Does anyone know an electrician?  I have tried Roger Thomas but he is busy until July 1st and our kitchen lights have burnt out and I need someone reliable who can make it more quickly than that!", 
      "date": "2005-06-06 15:09:00", 
      "id": 2268, 
      "responses": 16, 
      "subject": "Electrician needed", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1670"
    }, 
    {
      "body": "Can anyone recommend a good electrician, who might be able to fix a broken bathroom towel warmer?    The towel warmer has been broken for many months and efforts to gain assistance and a replacement timer unit (from the German manufacturer) have met wholly without success.  The broken timer needs to be removed and the unit fixed so it can simply be switched on and off (the timer function is largely irrelevant to its operation).   I think it needs an electrician with a creative, 'old-fashioned' approach who can actually repair things, rather than just install parts.   Any suggestions greatly appreciated.  Thanks.", 
      "date": "2007-03-23 13:02:00", 
      "id": 3322, 
      "responses": 5, 
      "subject": "Competent, Creative Electrician?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3175"
    }, 
    {
      "body": "My son just bought a flat in Willoughby House and we struggled to find a good contractor who wanted to work at the Barbican. Eventually through a recommendation from a friend we found Dan O'Connor and he has proved to be fantastic. He has completely renovated the flat including two new bathrooms and a new kitchen (Bye Bye Garchey!) We've now broken him in to the perculiarities of the Barbican so he knows how to fit in with the regulations and how to deal with rubbish disposal etc. He is a qualified electrician and can issue the appropriate certification of his work We found him honest, reliable, skilled and above all 'easy to do business with'. If you'd like to know more please let me know - I can even arrange to let you see his work.", 
      "date": "2008-03-06 15:21:00", 
      "id": 3884, 
      "responses": 4, 
      "subject": "Interested in a good reliable contractor -Was great for us", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4088"
    }, 
    {
      "body": "Anyone know of a reasonable reliable electrician with special skills in lighting?!", 
      "date": "2007-11-12 23:14:00", 
      "id": 4142, 
      "responses": 4, 
      "subject": "Electrician", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3791"
    }, 
    {
      "body": "in need of estimates to carry out work in my flat ,Seddon house. Is there anybody who can help me with a useful list of a few telephone numbers? Christine[/b]", 
      "date": "2006-10-17 14:16:00", 
      "id": 4294, 
      "responses": 4, 
      "subject": "Need a list of electricien, plumbers, other crafmen", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2688"
    }, 
    {
      "body": "The thermostat in my kitchen water heater seems to have gone (water coming out at near boiling point) - can anyone recommend an electrician/plumber (whichever is more appropriate) to fix it?", 
      "date": "2007-07-08 20:39:00", 
      "id": 3485, 
      "responses": 3, 
      "subject": "electrician/plumber?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3478"
    }, 
    {
      "body": "Can anyone recommend a reliable, electrician, with reasonable rates? Several points in my kitchen have gone.  Joanna", 
      "date": "2007-09-05 18:47:00", 
      "id": 4147, 
      "responses": 3, 
      "subject": "electrician recommendation?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3634"
    }, 
    {
      "body": "Does anyone know a decent electrician who is Part P registered (ie, can do rewiring in kitchen and self-certify for building regs)? After loads of calls that went unreturned I have got one quote. I have just picked myself up off the floor and would like to get a competitive quote. PS I do know of Roger Thomas, who works around the Barbican, but he is too busy.", 
      "date": "2005-10-12 21:03:00", 
      "id": 4537, 
      "responses": 3, 
      "subject": "Looking for an electrician", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1882"
    }, 
    {
      "body": "Can anyone recommend a reliable electrician who can connect up a large ceiling light to a double height hallway?", 
      "date": "2005-08-05 11:32:00", 
      "id": 2963, 
      "responses": 2, 
      "subject": "ELECTRICIAN", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1787"
    }, 
    {
      "body": "I have just bought a flat in Crescent House, Golden Lane Estate, I want to renovate the bathroom and kitchen and the original kitchen/dining room partition does antbody have any good contacts?", 
      "date": "2004-11-26 17:27:00", 
      "id": 2903, 
      "responses": 1, 
      "subject": "Renovators, carpenteters, plumbers, electricians, anyone!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1357"
    }
  ]
}