{
  "summary": [
    {
      "body": "Hello good Barbican people I am considering renting out my second bedroom and was wondering if anyone could tell me roughly what the going rate is?   (It is a good sized double with lots of wardrobe space; shared bathroom / separate loo; large living room, dining room, study.  Washing machine, dishwasher, tumble dryer.  To include all bills, wifi internet etc.) Thank you in advance Tom", 
      "date": "2007-08-07 08:05:00", 
      "id": 3394, 
      "responses": 8, 
      "subject": "Going rate for renting out a room?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3567"
    }, 
    {
      "body": "Hello! I am looking for a flat share. It is the first time in my life and I have no clue of how it works. Is Golden lane cheaper?  Thanks for all Strawby", 
      "date": "2008-01-08 05:36:00", 
      "id": 3550, 
      "responses": 8, 
      "subject": "How do I find a flat-share?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3914"
    }, 
    {
      "body": "I am renter, and am wondering if there are manhy people here who have rented their flats over a long period of time, say five or ten years.  If so, what is the usual rent increase each year? Have you found it to be a safe and convenient way to live?  I have assumed I would buy as soon as something came up that I could afford (a large studio), but now am settling into the rental, and wondering if its nuts to stick to this way of life.", 
      "date": "2006-09-19 20:33:00", 
      "id": 4497, 
      "responses": 5, 
      "subject": "Renting in the Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2612"
    }, 
    {
      "body": "First of all, please forgive me - I am not actually a resident of the area, but I'm sure all you Barbican inhabitants may be able to answer my question, which is.. Why has the Barbican become so madly popular recently? I have always considered it on and off, and just a month or two ago nearly every estate agent in town had a vast choice of different Barbican properties, but now there is literally not a single property available, and in a tower block with a view... forget it.  It was always the case for years that there were consistently many Barbican properties available, but now they've all gone.  I saw in another thread that someone recommended calling the estate agent on the day they release details of a new sale, and they're quite right!  This has become like trying to buy a property in Primrose Hill! Prices have skyrocketed too, there is currently a tower block apartment for 700,000 (under offer), whilst this time last year tower apartments were about 550,000 with the desirable views, and much less (400k region) with the north (and west?) aspect.  There was a penthouse in one of the tower blocks that sat on the market for about 3 years, but recently it appears that two newly for sale penthouses in tower blocks have been snapped up in about a month. Are you (Barbican residents) noticing more people in the area? Has anything specific brought about these changes, or are people finally opening their eyes to how magnificant the Barbican estate actually is?  Are the original generation of Barbican dwellers (who perhaps have a second home too, out of London) starting to sell up and move out?   Whatever it is, i'm rather annoyed now!", 
      "date": "2006-06-10 12:40:00", 
      "id": 4416, 
      "responses": 2, 
      "subject": "Current mad popularity of Barbican...", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2354"
    }
  ]
}