{
  "summary": [
    {
      "body": "I came down the East staircase to podium today - found that both doors had been smashed in. It also turns out that a door on East Central stair had been smashed. This is really deeply disturbing.  I did hear some noises last night but can't place when as I was in bed drifting off to sleep - could have been 10 or 11. Anyone any info? Very alarming", 
      "date": "2006-10-05 07:08:00", 
      "id": 4299, 
      "responses": 49, 
      "subject": "Ben Jonson House: attacked", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2654"
    }, 
    {
      "body": "This morning I was woken up, in the west end of Ben Jonson, at 5.25 by an electronic alarm followed by a recorded woman's voice saying \"Can I have your attention please. Can I have your attention please.\" There was a further message after that which I couldn't hear. This repeated for nearly ten minutes before stopping part-way through. I assume it's an alarm from some nearby building, and I've heard it occasionally in the past too. Very annoying, and I'm wondering if anyone knows where it comes from?", 
      "date": "2006-05-03 07:51:00", 
      "id": 4400, 
      "responses": 16, 
      "subject": "\"Can I have your attention please\"", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2249"
    }, 
    {
      "body": "Police have closed off Long Lane and Aldersgate Street.", 
      "date": "2005-10-01 06:18:00", 
      "id": 3111, 
      "responses": 14, 
      "subject": "What's going on?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1862"
    }, 
    {
      "body": "Does anyone know when/how the glass panel next to one of the Podium level doors of Ben Jonson was smashed? It has been repaired, temporarily, but it's still a bit crunchy underfoot.", 
      "date": "2006-05-06 16:02:00", 
      "id": 4403, 
      "responses": 14, 
      "subject": "BJH smashing", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2260"
    }, 
    {
      "body": "Can anyone with access to news updates please post them here? So far this is what I have heard: Scotland Yard declares \"major incident\". \"Many fatalities\" reported in press - 20 at last report but not confirmed. Incidents at Aldgate, Old Street, King's Cross, Russell Square and Edgware Road - initially reported as \"power surges\" but now possibly bombs. Reports of a possible bomb at Houndsditch. Bus roof blown off at Tavistock Square, reports of two more bus attacks but no confirmation. London Underground, Zone 1 buses and Congestion Charge stopped. London's emergency plan in action. Tony Blair to give press conference televised at midday.", 
      "date": "2005-07-07 10:30:00", 
      "id": 4698, 
      "responses": 13, 
      "subject": "City terror attacks - please post updates in this thread", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1729"
    }, 
    {
      "body": "Does anyone know what happened to the tree stump - I walked past this morning and it was all broken. Did it fall or was it pushed?", 
      "date": "2006-05-02 09:07:00", 
      "id": 4206, 
      "responses": 11, 
      "subject": "Mendelson Tree", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2245"
    }, 
    {
      "body": "Anybody notice the police activities in Barbican tonight, Police dogs and all sorts  whats going on??", 
      "date": "2006-08-24 21:13:00", 
      "id": 4475, 
      "responses": 9, 
      "subject": "Police presence in Barbican", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2559"
    }, 
    {
      "body": "I've just returned home and learned from a neighbour that there have been enquiries from police going house to house in the block about a theft?  Any information on that please?  Anything to do with the dogs being deployed around here late last night?  I realise that if there is an investigation under way right now, you may not be able to reply. Thanks Barbie.", 
      "date": "2008-03-07 20:42:00", 
      "id": 5519, 
      "responses": 9, 
      "subject": "Trouble in Andrewes?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=4097"
    }, 
    {
      "body": "So.. what happened?  London Wall is closed now.", 
      "date": "2006-05-03 11:38:00", 
      "id": 3086, 
      "responses": 6, 
      "subject": "Moorgate fire", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2250"
    }, 
    {
      "body": "Does anyone know what's happened to the Anthony Gormley statue \"Resolution\" that was placed on the pavement near Shoe Lane library in october last year? I hesitate to say it's been stolen, but the fact that it's gone and its feet are still present, hacked off by the ankle indicate that it might have been. this link shows it in situ   (copy and paste link into browser address line if it's not clickable)", 
      "date": "2008-02-07 12:09:00", 
      "id": 3749, 
      "responses": 6, 
      "subject": "Anthony Gormley Statue Gone from Shoe Lane", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3988"
    }, 
    {
      "body": "Did anyone see the two people who were walking along the brick wall in the middle of the lake about 11pm last night?! Don't know how they got there or what they were doing btu they stood there for about 5 mins then turned around and walked back again!", 
      "date": "2006-04-07 09:47:00", 
      "id": 3134, 
      "responses": 5, 
      "subject": "Random walkers!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2184"
    }, 
    {
      "body": "Did anyone feel that earthquake then?", 
      "date": "2008-03-01 00:05:00", 
      "id": 3528, 
      "responses": 5, 
      "subject": "Earthquake", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4073"
    }, 
    {
      "body": "A Chinook and an Apache have just flown past my window, taken off from HAC I assume. I  heard what  I am sure was machine gun fire from the grounds earlier today. Anyone know what's been happening?", 
      "date": "2008-05-20 19:54:00", 
      "id": 3598, 
      "responses": 5, 
      "subject": "helicopters", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4362"
    }, 
    {
      "body": "Does anyone know what the ceremony was that was taking place today    involved 6 or so what looked like coachmen carrying a bit red hogs head on a tray     walked down St Martins Le Grand drum was being banged", 
      "date": "2007-12-04 15:37:00", 
      "id": 4161, 
      "responses": 5, 
      "subject": "Red Pigs Head", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3844"
    }, 
    {
      "body": "Anybody know what happened to create the pool of blood in the ``Fireman's Entrance'' to the garage in Andrews House. It was there last night at the corner of Fore Street and Moor Lane. Any word from the police?", 
      "date": "2007-04-12 11:12:00", 
      "id": 4381, 
      "responses": 5, 
      "subject": "Blood on the Street", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3223"
    }, 
    {
      "body": "Anyone notice the steam coming out of the drains on the corner of Beach St and Aldersgate? Just curious as to where the heat is coming from as it looks like the streets in New York.", 
      "date": "2006-08-22 09:28:00", 
      "id": 3166, 
      "responses": 4, 
      "subject": "Steam", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2549"
    }, 
    {
      "body": "There was a spate of graffiti alongside Defoe House over last weekend.  This was quickly removed by the Barbican staff on Monday but it's the first time I've seen this on the Estate.  Has anywhere else been affected?", 
      "date": "2006-02-07 20:08:00", 
      "id": 4570, 
      "responses": 4, 
      "subject": "Graffiti", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2062"
    }, 
    {
      "body": "I have just called the City of London police and was told that there had not been any shooting on Friday night... How bizarre. Does anyone know anything???", 
      "date": "2005-10-03 12:18:00", 
      "id": 3059, 
      "responses": 3, 
      "subject": "Confused", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1863"
    }, 
    {
      "body": "This morning on the way to work I saw a little demo between St Pauls and the Millennium Bridge. There were signs up protesting against the City's plans to allow an incinerator to be built there, just by the Salvation Army building. Anyone know what this is all about?", 
      "date": "2007-07-09 21:13:00", 
      "id": 3483, 
      "responses": 3, 
      "subject": "incinerator near St Paul's?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3485"
    }, 
    {
      "body": "I saw the signs at the entrance of the tunnel. Do we have any more information? Rather worrying...", 
      "date": "2008-03-14 15:28:00", 
      "id": 3811, 
      "responses": 3, 
      "subject": "Robbery by Defoe House?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4123"
    }, 
    {
      "body": "There was a parade of men, many wearing orange sashes and accompanied by bands & banners in the city this afternoon. I spotted them in the Smithfield area & later on London Wall & Aldersgate, but couldn't see what their banners said. I suspect that they were orange men - does anybody know what was going on?", 
      "date": "2005-04-23 17:41:00", 
      "id": 2920, 
      "responses": 2, 
      "subject": "orange parade in city???", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1584"
    }, 
    {
      "body": "I don't want to frighten anyone - but I was a bit surprised to see a couple of police go past my study window at 2:30am on Saturday night/Sunday morning. It was on the Moor Lane facing 6th floor of Willoughby. Anybody got any info of anything we should be aware of?", 
      "date": "2006-04-24 15:56:00", 
      "id": 3066, 
      "responses": 2, 
      "subject": "Police on Willoughby Balcony", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2218"
    }, 
    {
      "body": "Anyone know what happene to the City Boot over Tuesday night?  Smashed out window, the smell of smoke and police on Wednesday morning leas to one conclusion. Any details anyone?", 
      "date": "2006-07-20 06:51:00", 
      "id": 3137, 
      "responses": 2, 
      "subject": "City Boot", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2464"
    }, 
    {
      "body": "I arrived home late last night by car, to find Aldersgate Street closed by the Police from the London Museum roundabout to the junction with Old Street, so I was unable to park my car away in the car park under John Trundle. Aparently the Police were investigating an accident or a crime scene. I tried again at 3.30am, as I was not happy for my classic car to be out all night, but was unable to access Fann Street because of Police barriers and the the anti rat run barriers there. I eventually parked in the visitors car park under Mountjoy where I live. Does anyone know what was going on?", 
      "date": "2006-07-01 19:21:00", 
      "id": 3179, 
      "responses": 2, 
      "subject": "Closure of Aldergate Street, Saturday at 1.am", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2421"
    }, 
    {
      "body": "I wonder if the Police can cast any light on the mystery highlighted on the main discussion pages about statue which has 'gone walk abouts'?", 
      "date": "2008-02-07 16:10:00", 
      "id": 5513, 
      "responses": 2, 
      "subject": "Missing Gormley Statue ifrom Shoe Lane", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=3990"
    }, 
    {
      "body": "My brother in law called me up tonight to tell me a team from the Barbican was on University Challenge competing against one from the Society for the Preservation of Ancient Buildings.  However, i missed the start and would like to write a news item on this for Barbican Life.  Can anyone who may have watched, or happens to know, whether the Barbican team was drawn from the staff of the Barbican Centre, or from residents?  I also only managed to pick up the team's surnames - can anyone supply me with their forenames too? Thanks", 
      "date": "2005-08-15 20:14:00", 
      "id": 2971, 
      "responses": 1, 
      "subject": "University Challenge", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1809"
    }, 
    {
      "body": "Anyone know what was going on there earlier today? mea", 
      "date": "2005-05-18 21:12:00", 
      "id": 4714, 
      "responses": 1, 
      "subject": "london wall", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1637"
    }, 
    {
      "body": "About 2:15 today, five police and a riot shield standing around outside the Shakespeare pub. Anyone know what was going on?", 
      "date": "2006-10-06 13:53:00", 
      "id": 5039, 
      "responses": 1, 
      "subject": "Police outside the Shakespeare pub", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=2663"
    }, 
    {
      "body": "I was surprised to see a (female) officer in the THM gardens this morning, living on the ground floor I am sure I would have noticed if this was a regular occurance.  Does anyone know if this was for a specific puroose or just part of their rounds? Do they have pass keys?", 
      "date": "2007-05-30 17:12:00", 
      "id": 5346, 
      "responses": 1, 
      "subject": "police in the gardens", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=3378"
    }, 
    {
      "body": "We watched the police chase someone along the podium under Thomas More House on Saturday night. Shortly after, police dogs were on the scene.  Can you enlighten us as to the nature of the incident?", 
      "date": "2007-09-23 10:27:00", 
      "id": 5356, 
      "responses": 1, 
      "subject": "The Chase", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=4&t=3680"
    }
  ]
}