{
  "summary": [
    {
      "body": "Does anyone know when the Barbican Christmas tree goes up? And does it still go up by the stairs overlooking the lake by Willoughby?", 
      "date": "2005-11-30 09:23:00", 
      "id": 184, 
      "sentiment": 1, 
      "subject": "Christmas", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1964"
    }, 
    {
      "body": "My JLP sources confirm that the Waitrose is definately coming to   Tree Walk!", 
      "date": "2006-03-09 11:10:00", 
      "id": 1176, 
      "sentiment": 1, 
      "subject": "Waitrose", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&hilit=Organic+Morello+Cherry+Preserve&t=2122"
    }, 
    {
      "body": "As those of you who have received the latest Barbican Life will have seen, we did use barbicantalk comments on local establishments.  I am particularly keen to continue doing so, so please do comment in this thread on good, or bad, eating experiences in the general Barbican area.  I'm also keen to learn of reaction to new restaurants - for example I looked in on the new Cardamom Rooms restaurant in Charterhouse Square the other day (has replaced the old Gulshan/Bar Bombay) and it looks really nice and they seemed to be making a great effort - but I haven't eaten there yet.  Any comments would be appreciated. Also the Comptoir Gascon in Charterhouse Street has extended its eating options - anybody tried this yet? Any other new restaurants around that barbicantalkers have sampled?", 
      "date": "2005-09-25 08:56:00", 
      "id": 1375, 
      "sentiment": 1, 
      "subject": "Restaurants", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1854"
    }, 
    {
      "body": "Anybody know what the big tent inside Frobisher Crescent is for?", 
      "date": "2004-06-03 15:06:00", 
      "id": 2900, 
      "sentiment": 1, 
      "subject": "Marquee", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1144"
    }, 
    {
      "body": "I am new round here..... please can someone tell me how i might go about joining the Barbican tennis club? Or else how we are able to access/use the School courts?", 
      "date": "2005-04-15 13:37:00", 
      "id": 2911, 
      "sentiment": 1, 
      "subject": "Anyone for tennis?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1567"
    }
  ]
}