{
  "summary": [
    {
      "body": "I've just bought a laptop, but am not sure what I now need to do to go online - sorry for the stupid question!  I have a connector for the phone line, do I need to get connected to someone like Wanadoo?  If so can anyone recommend a good internet provider?", 
      "date": "2005-10-04 13:43:00", 
      "id": 3112, 
      "sentiment": 1, 
      "subject": "Internet Connection", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1865"
    }, 
    {
      "body": "HELP - did anyone record the first episode of The Choir on BBC2 last night? I tried but got the times wrong so am seriously in the doghouse . . .", 
      "date": "2006-12-05 14:40:00", 
      "id": 3230, 
      "sentiment": 1, 
      "subject": "The Choir on BBC2", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2804"
    }, 
    {
      "body": "Anybody know to which body I should address a letter of complaint about the music from the keep fit classes in the early evening? It's like having a rave foised upon the area each day. Pub noise I expect and accept within reason but thudding megawatt soundsystems in order to shift a few calories is several steps too far. I'm afraid i'm not going to be satisfied with approaching 'the management' either in this case. They have paying customers to satisfy so there is a conflict of interests for a start.  I want to lodge something with a body that cannot simply turn a blind eye nor file my complaint in a folder marked 'trash'. I'm thinking upon the lines of a local noise abatement officer or similar. Please feel free to PM me with accurate details if you have them  or simply don't want to to broadcast the information. Having said that ,unless i'm the only one ready to pop a valve over this irritant, then i'm sure others may be wish to object or lobby too. Regards, L", 
      "date": "2007-05-21 18:21:00", 
      "id": 3323, 
      "sentiment": 1, 
      "subject": "Enough! YMCA gym music", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3352"
    }, 
    {
      "body": "I have a computer problem which is driving me INSANE but which one of you barbies out there may be able to solve. It is simply that when I am typing in Word or in Hotmail, the wretched cursor jumps suddenly somewhere else in the text and then proceeds to overwrite whatever is there. I have no idea what to do. I know it's not caused by the mouse or any of the keys. AND IT'S JUST HAPPENED AGAIN - BOTHER! Any ideas or suggestions? Thanks", 
      "date": "2006-12-15 20:53:00", 
      "id": 3371, 
      "sentiment": 1, 
      "subject": "COMPUTER GLITCH", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2838"
    }, 
    {
      "body": "Thames Water has sent me a letter asking the size of the flat in order to assess next year's rates 'because we were unable to fit a meter at your property when you requested on'.   I understood we all had some sort of fixed rate because it is not viable to fix meters here.  Was just wondering how I should respond?", 
      "date": "2007-07-15 15:50:00", 
      "id": 4043, 
      "sentiment": 1, 
      "subject": "water rates query", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3498"
    }
  ]
}