{
  "summary": [
    {
      "body": "Hello All - am hoping someone can help out... I am applying for the Freedom but need to be nominated by 2 members of the Common Council. Do you know how I can get their attention - or actually who they are? I have tried to contact them through the Corporation web site and have had one v helpful response (Stephen Quilter) but still need a second nominee. Any ideas or experience? Many thanks", 
      "date": "2006-11-28 22:02:00", 
      "id": 3223, 
      "responses": 9, 
      "subject": "Freedom of the City", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2787"
    }, 
    {
      "body": "I have a friend from Russia currently resident in the UK who wants to work freelance and therefore, I guess, register as self-employed here. Do any barbican talkers know if that is possible? ( I realise the question might not be quite a simple as I have worded it, but would be grateful for any hellp at all)", 
      "date": "2008-04-07 11:53:00", 
      "id": 3855, 
      "responses": 4, 
      "subject": "registering as self-employed when foreign", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4199"
    }, 
    {
      "body": "Would a kind neighbour please be willing to help me retune my tv which seems, inexplicably, to have detuned itself today?  I'm not getting any channels either on digital or analogue.  I've been staring at the setup guide for the last hour and I may as well be reading Martian.  I know I'm being a big girlie about it and should be able to manage without the telly but I'm stuck at home not too well AND my computer has a trojan (someone coming to sort that one out later), so I'm now feeling a bit sorry for myself as well as very inept. If there's anyone in or near Andrewes House that would be happy to accept money or a nice bottle of wine or two to tune in my tv, I would be so grateful.  Please call me on 07775 570208 as I won't have access to my computer later once the trojan expert arrives.  Thank you very much.", 
      "date": "2007-10-31 16:03:00", 
      "id": 3461, 
      "responses": 3, 
      "subject": "help please!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3756"
    }
  ]
}