{
  "summary": [
    {
      "body": "I hate to be a moaning minnie, but the sound of the lady above me marching up and down and up and down her flat is driving me mad! Whats the etiquette here? She must have a wooded/hard floor. I guess I might just need to knock on her door and have a quiet word, but by the sound of her footsteps, she sounds bigger than me!", 
      "date": "2008-03-13 17:47:00", 
      "id": 1597, 
      "sentiment": 3, 
      "subject": "Footsteps driving me crazy!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4119"
    }, 
    {
      "body": "i got a taxi from outside selfridges last night to fann st, by the time it got to toteham crt rd the fare was six pound and by the time it got to fann st the fare was ten pound forty,dazed and confused by this i gave the driver eleven pound and told him to keep the change, the journey took about six minuets as there was no traffic on the road, do you think i was ripped of by the driver fixing his meter?,or is this realy how much it costs these days ", 
      "date": "2005-05-05 15:54:00", 
      "id": 2933, 
      "sentiment": 3, 
      "subject": "Taxi prices", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1608"
    }, 
    {
      "body": "Does anyone else have this problem?  It's led to horrible discolouration & we are concerned in case the condensation is damaging the plaster.  Any remedies?  Thanks in anticipation.", 
      "date": "2005-08-18 08:37:00", 
      "id": 2975, 
      "sentiment": 3, 
      "subject": "condensation on bathroom ceiling", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1811"
    }, 
    {
      "body": " We've just got our Freeview box and all is not well.  The TV aerial goes from the wall to the freeview box to the TV.  The TV is giving us the 5 old channels but the Freeview box is picking up nothing.  The signal strength is exactly 0% for both its tuners.  Any ideas?  Since having SCCI change the face plate on the wall we've not been able to get FM radio.  We've tried retuning but it's not helped.  Again, there's no signal at all.  Any ideas? thanks.", 
      "date": "2005-09-09 21:27:00", 
      "id": 3049, 
      "sentiment": 3, 
      "subject": "Freeview & radio problems", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1837"
    }, 
    {
      "body": "I know the subject has been here many times but I got overwhelmed today when the Estate informed us that the new system will be installed in Mountjoy from next week (so not the week of 25/7 as the BA chairman let us know on Barbicantalk in March). I thought we would finally get a sort of cable system that lets us view foreign channels, as everybody on the continent gets (practically free, I think), but I only saw Sky mentioned in the discussions, Top up TV, and Freeview. Even Sky at 19.95 per month does not offer foreign channels, though they said that you can tune in those channels yourself once you have Sky. Does anyone have any experience with this - in the new system? Is there an alternative to Sky? We are not interested in most of their 40 or so channels. We dislike NTL like everybody else but we do get the channels we want and pay dearly for them but Sky is not much cheaper and we must still see if we can tune in these other channels. We have no digital TV. Will appreciate some advice.", 
      "date": "2005-04-18 16:28:00", 
      "id": 3050, 
      "sentiment": 3, 
      "subject": "TV again", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1572"
    }
  ]
}