{
  "summary": [
    {
      "body": "Is BA membership on a personal or a per-flat basis? If the latter, is it possible to get extra membership cards issued so that e.g. my wife (who has a different surname to me) doesn't try and persuade the dentist that she's me to get her discount?", 
      "date": "2005-04-26 22:22:00", 
      "id": 2925, 
      "sentiment": 2, 
      "subject": "BA membership", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1591"
    }, 
    {
      "body": "anyone else notice that 02 lift in ben jonson needs just a splash of paint to get rid of the graffiti? its all begining to look a lttle tatty and it shouldn't", 
      "date": "2005-04-20 21:31:00", 
      "id": 2939, 
      "sentiment": 2, 
      "subject": "service charges, somerfield, and a splash of paint", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1579"
    }, 
    {
      "body": "there are bags of original white tiles at 03 Willoughby Car park  which have been dumped. I also saw a completed kitchen lying on Golden Lane by the car park entrance yesterday. I don't understand why the estates office can't  put aside a store to keep some of these pieces for those trying to restore their interiors.", 
      "date": "2005-01-18 15:07:00", 
      "id": 2943, 
      "sentiment": 2, 
      "subject": "white bathroom tiles dumped in willoughby car park", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1423"
    }, 
    {
      "body": "I have signs of water leaking in to my ceiling, but the people upstairs say they can't find any problem? Any suggestions as to what I do now? If water is coming in through upstair flat's window frames, is it the Corporation's problem? Anyone know? Advice welcomed, thanks", 
      "date": "2006-04-29 10:52:00", 
      "id": 3076, 
      "sentiment": 2, 
      "subject": "water leak", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2237"
    }, 
    {
      "body": "Does anyone have any details please?  Is there a talk and presentation - in which case there is no point going except from the start at 6 p.m., or is it an open exhibition with people around to answer questions?", 
      "date": "2007-09-20 11:33:00", 
      "id": 3431, 
      "sentiment": 2, 
      "subject": "Tonight's meeting (20/09) about Milton Court", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3668"
    }
  ]
}