{
  "summary": [
    {
      "body": "I'd be interested in hearing what others think about the latest estate initiative we are being consulted on -- this time about providing residents meeting rooms. If I understand it correctly the idea is that we are being asked to pay for the renovation and the upkeep on our service charge, but then also pay rent to use the facilities -- although it's difficult to say given the paucity of information provided in the flyer. If that's the case, it seems a bit much to me. Surely if we are going to have rooms we can rent then the estate  should fund the refurbishment cost and the annual upkeep, we shouldn't have to pay twice. And I thought local authorities were supposed to provide these facilities, not the estate office. I'd also love to know whose great idea this was.  ", 
      "date": "2006-10-27 17:29:00", 
      "id": 3201, 
      "sentiment": 4, 
      "subject": "residents meeting rooms consulation", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2706"
    }, 
    {
      "body": "We're looking to have some fairly minor alterations made to our flat (all very much in keeping with the original Barbican aesthetic, and in some areas restoring what was there before the previous occupiers took issue with the interiors). One of these alterations necessitates the repositioning of a partition wall in the bedroom - effectively to allow us to widen the cupboard and wardrobe space (by moving the bedroom door closer to our structural / boundary wall - at the moment it's half way along a partition wall). From what I've understood from the BEO, there is no formal application process (with triplicate forms and the like) for applying for landlord's permission... I simply need to write to them, supplying our architect's drawings of what's intended. They'll then write back either granting permission (or declining it). I would have thought the process was more bureaucratic than that. Can it really be that simple? Beyond that, I've had no end of grief trying to speak to somebody at the Corporation about planning / listed building consent. Nobody seems to be available to take my calls, and despite leaving several messages, nobody calls back. I have found dozens of forms on the COL website, though they seem to be geared to quite major projects - like demolishing and rebuilding a property (for which environmental statements need preparing, etc). There doesn't seem to be a simple / straightforward guide anywhere that discloses what to do with regard to smaller residential alterations. Does anybody know the process and the approximate timescales? Are there any other parties I need to consult with?", 
      "date": "2007-09-02 10:38:00", 
      "id": 3411, 
      "sentiment": 4, 
      "subject": "Listed building alterations", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3622"
    }, 
    {
      "body": "Has any body else stop receiving TV Saturday morning from 0130hr following a power failure. I have called the Bunyan court CPA who was going to look into it, so I then called the resident Engineer, only to have the phone answered by Defoe house CPA who said his TV works alright and he would connect me to the Bunyan CPA who would deal with my problem. The Bunyan CPA did call back with a telephone no. of the TV / satellite people under contract to the Barbican Estate, I call the number and listened to an answer machine message requesting our contract number with them (to which I don't know, only the Barbican office knowns, and they are not back for 3 days, so I could not leave any information). I have decided that Life dose not revolve around TV, so thanks to the BEO and there contract with an answer service I am now cancelling my subscription to rip off sky and going to buy a free view box which will work when the BEO get the TV people to switch back on the trip switch (shame the resident engineers dont know where this switch is!). Sorry about the rant, but missing all my favourite TV programmes this weekend. AHHHHHHHHHHHHHHHHHHHHH -0", 
      "date": "2008-05-05 19:40:00", 
      "id": 3566, 
      "sentiment": 4, 
      "subject": "TV Bunyan Court - May Day Bank Holiday weekend without TV", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4304"
    }, 
    {
      "body": "We have just received the questionnaire about the refurbishment, and I hope that many residents will complete it and return it to the estate office. Overall the refurbishment looks great, and the automatic doors are a big improvement. However, the budget was 190,000 - quite an astonishing amount of money to spend on the podium entrance and car park entrance. The budget apparently did not stretch to the following items which I think residents should consider, as I had understood that they would be included: -- the porters' desk was not renewed and is showing lots of signs of wear and tear -- there is no parcel store - as before, parcels are left on the floor, which I find rather astonishing. Nowadays people order more and more online, and there is no provision for the storage of delivered items. -- the doors at podium level (possibly elsewhere) were poorly repainted. You can see that old layers of paint were not removed, and already the new paintwork is showing signs of damage. I'd be interested in hearing opinions from my neighbours on this. The house committee has been silent, to my knowledge. The whole job took an extraordinary amount of time, and cost an unfathomable amount of money, and I think that in less than 12 months we will all have serious misgivings - if we don't already.", 
      "date": "2007-11-24 20:32:00", 
      "id": 3614, 
      "sentiment": 4, 
      "subject": "Shakespeare lobby refurb questionnaire", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3815"
    }, 
    {
      "body": "Twice in recent weeks the new lift at the eastern end of the estate has broken down.  The telephone number posted for emergencies actually leads to the Guildhall switchboard.  They have no record of who is responsible.  The Corporation failed to pass relevant material sent to them from the then builder Ardmore-Mace (now fired by Gerald Ronson for not being tough enough in their dealings with residents and the Environmental Health people when damage was caused to a number of flats due to their work).  Ardmore-Mace says it is not responsible.  So the fire brigade had to be called.  Anyone using the lift should be aware that aside form shouting no help is available.  The Corporation was informed at least a fortnight ago and still no telephone numbers have been posted. They even claimed that the lift should be maintained by the Estate!  News to the Estate and our excellent engineers.  The Estate was unaware of this and, in any case, the Estate would not assume responsibility for a year after construction.  One trusts that the Estate will charge the Corporation for staff time.   So use that lift at your own risk.  If you press the bell no one who can do anything is altered.  If you use the telephone you get the staff at the Guildhall or the new call centre and the reply that the lift does not exist or they know nothing.  The name of the contractor and an emergency telephone number should be there by law.  It is not.  The Corporation has done nothing about this that has led to an improved situation.   However, the alternative of the exit from Willoughby 03 car park is also very uncertain.  The door has been out of action at least twice over the last fortnight nicely coinciding, on occasion, with the lift on the podium being out of action. People in wheelchairs and other people with walking difficulties have no way out from that corner of the estate unless someone with a pass key kindly takes them through Willoughby House and that is a long way around.", 
      "date": "2008-02-03 10:22:00", 
      "id": 3625, 
      "sentiment": 4, 
      "subject": "Corporation incompetence?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3977"
    }
  ]
}