{
  "summary": [
    {
      "body": "Looking for a wateringhole with convivial atmosphere with decent good beer as replacement for the Kings Head after a Barbican Friday evening concert. The Two Brewers is next up along Whitecross St.  Recommendations / comments welcomed.  Are there any other pubs close by?", 
      "date": "2008-04-27 11:34:00", 
      "id": 3973, 
      "responses": 14, 
      "subject": "Two Brewers, Whitecross St", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4278"
    }, 
    {
      "body": "Hey everyone I'm on big business in Vienna, the european community sure is complicated , and lets just say this place ain't no Boston! Any one got any ideas what I should see here. I'm here for a week and I've already done the Third man tour three times. Well hell the guide is cute!", 
      "date": "2007-06-20 21:11:00", 
      "id": 3477, 
      "responses": 9, 
      "subject": "Help, things to do in Vienna.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3432"
    }, 
    {
      "body": "I have done a search, but apologies if this came up recently and I have missed it. Is there a good-ish (doesn't need to be Grade A, just good!) Chinese restaurant near here? Must serve crispy duck. I've thought and thought but can't think of anywhere and have a friend visiting who won't have time to go to China town but wants to have crispy duck. Any recommendations most welcome. Thank you.", 
      "date": "2008-05-17 18:30:00", 
      "id": 3594, 
      "responses": 9, 
      "subject": "Good Chinese restaurant near Barbican?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=4349"
    }, 
    {
      "body": "First of all, my thanks to everyone who provided me with gardening advice in the early part of last year - greatly appreciated. Now, on behalf of a woman friend who is retiring shortly, has anyone any brief views on an itinerary for a 3 months or so trip around the world on a shoestring budget, taking in the Trans-Siberian Express, China, Singapore, Australia (she is a cricket buff and has friends in Sydney), New Zealand and either S or N America.  She has already done a lot of research, but personal views would be welcomed re the best time of the year to set out and whether to travel East/West or West/East.  Also, is she being over-ambitious in trying to cover everything in 3 months? (She'd like to take the train across Canada but realises that time of year and time/money available have bearings on this.) She will be travelling alone - any views on this? (and please don't say 'go with her'!) Many Thanks", 
      "date": "2007-02-18 12:41:00", 
      "id": 3259, 
      "responses": 8, 
      "subject": "Tips re Round the world hol.", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3069"
    }, 
    {
      "body": "Does any one know of a car hire firm operating locally which allows you to take a car to France without doubling the daily rate? No reason why people should know but barbicantalk is often a font of knowledge! We don't have a car but would like to drive to our holiday.", 
      "date": "2007-02-21 10:24:00", 
      "id": 3258, 
      "responses": 6, 
      "subject": "Tips re: car hire", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3075"
    }, 
    {
      "body": "For my mum's birthday present this year, I had the idea to try to book a private guided tour of an interesting museum or gallery collection. I know that both Tate Britain and Tate Modern can do this and include an afternoon tea, which would be fab, but my ma would be far more interested in a personal tour of a ceramic or sculpture collection. Anyone have any ideas regarding where to look? I have emailed V and A, but can't think of anywhere else at present. Thanks for any suggestions.", 
      "date": "2007-01-06 14:40:00", 
      "id": 3274, 
      "responses": 6, 
      "subject": "Tours of Museums and Galleries", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2885"
    }, 
    {
      "body": "I have been looking at Landmark Trust properties and wonder if any Barbicantalkers have taken a break in any of these places.", 
      "date": "2007-08-08 21:17:00", 
      "id": 3387, 
      "responses": 5, 
      "subject": "Landmark Trust", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3574"
    }, 
    {
      "body": "Any suggestions?  dedided to eat out on Christams day itself,  not too worried about the price and will travel if nesc. but would rather not eat Cuban-Romanian fusion or the like", 
      "date": "2007-11-07 10:58:00", 
      "id": 4165, 
      "responses": 4, 
      "subject": "Best place for a Traditional Christmas Dinner", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3777"
    }, 
    {
      "body": "Can anyone recommend a web site for holiday home swapping has anyone done it before any tips? thanks", 
      "date": "2007-03-08 18:27:00", 
      "id": 3282, 
      "responses": 3, 
      "subject": "Holiday Home Swap", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3124"
    }, 
    {
      "body": "Hey BarbicanTalkers! I'm back in the States for the Holidays. However I am planning to spend New Years in London, can anybody suggest what to do? I have my step daughter and her fiance staying with me...", 
      "date": "2007-12-14 19:10:00", 
      "id": 4180, 
      "responses": 3, 
      "subject": "New Years in London", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3870"
    }, 
    {
      "body": "It is closing and being moved to the V & A towards the end of next month. In the meantime it is free to visit and open most days except three over Christmas. Well worth a look. The shop with the Collection has a sale on but from my experience yesterday the stuff is going fast. Excellent mulled wine and hot chocolate on sale afterwards in the cafe\\bar at the side of the ice rink in the Somerset House courtyard. If you visit the Collection, it's a good idea to borrow one of the magnifying glasses they keep at the check-in desk.", 
      "date": "2007-12-16 07:36:00", 
      "id": 4177, 
      "responses": 2, 
      "subject": "The Gilbert Collection at Somerset House", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3873"
    }
  ]
}