{
  "summary": [
    {
      "body": "Hi there Apologies in advance for making my first post a contentious one. We have been thinking about moving to the Barbican for some years. In 2003 it was possible to buy a split level 1 bed flat for about 275K. Unfortunately, for various reasons, we did not take this opportunity. Similar flats now appear to be on the market for 400K and over. Studios for 300K. I would like to ask longer-term residents: do prices tend to reflect the ups and downs of the stock market and the fortunes of the City? Did the prices of Barbican flats fall in the last recession, or did they hold up? If prices continue on their upward spiral, I guess we will have to give up the idea of ever moving here. A third of a million pounds for a single room is a bit steep, even if it's in the best place to live in London! Best wishes to all.", 
      "date": "2006-08-24 11:23:00", 
      "id": 3471, 
      "responses": 49, 
      "subject": "Barbican flat price fluctuations?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2555"
    }, 
    {
      "body": "We are two very disappointed people.  We wanted to make an offer on an M2A in Ben Johnson but the owner withdrew, missed another similar type in Bunyan and have just learned of another that went privately! We currently live in Marylebone and have sold our place with contracts ready for completion so in a REALLY strong position.  Would you please let us know if you are considering selling!  We love the barrel vaulted but would consider other 2 beds on the Estate.  PLEASE contact us - we are serious and committed buyers and very disappointed at not being successful at finding anywhere.   Drop an email to   or call me on 07803 474367.   We are definitely not estate agents but want a Barbican flat as a home and hence you wouldn't have any commission fees at all!  Thanks", 
      "date": "2006-08-24 17:11:00", 
      "id": 4280, 
      "responses": 39, 
      "subject": "Desperate to buy a flat here!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2558"
    }, 
    {
      "body": "We are in the process of buying a flat and would welcome any reccommendations for a solicitor to handle the conveyancing procedures", 
      "date": "2007-01-22 15:31:00", 
      "id": 4356, 
      "responses": 14, 
      "subject": "Solicitors", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2948"
    }, 
    {
      "body": "Is there a massive difference between the north and south sides of the estate ?  The reason i'm asking is that i'm looking for a studio or one bedroom flat (perhaps a type 21 2bed) and the north side (john trundle, ben johnson etc) seem to contain more studios and one bedrooms.  Does this mean that any of the buildings on the north side are designed to a lesser standard, or that services are not as good. Does the north side feel seperated from the south side because of the different podium levels etc.? Thanks for any answers.  Oh, and the poll is a bit of a gimmick. But still interested.", 
      "date": "2006-08-27 18:42:00", 
      "id": 4317, 
      "responses": 10, 
      "subject": "north vs. south", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2562"
    }, 
    {
      "body": "Dear all,  I am considering buying a large studio (currently renting one). I am doing my \"price discovery\" howework now. There are records of sold prices at nethouseprices.com. However, only flat numbers and prices are available. For example,  Abcd Court, Flat 123, 234,000, 01-Jan-2007. What is the easiest way to determine flat type (e.g., F2B) given flat number? Calling into each of the flats in the appropriate price range and asking \"what is your flat type, please?\" is probably not such a great idea... (I personally would not mind if someone called into my flat with such a question, but this does not mean that I can bother others...) Would the Estate Office be able to provide such information? Or could you recommend another source, please? Thank you.", 
      "date": "2007-02-01 12:06:00", 
      "id": 4216, 
      "responses": 7, 
      "subject": "Block + Flat number ---> Flat type?", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3000"
    }, 
    {
      "body": "Is it true that one of the penthouses, in Shakespeare tower was specified with a terrace large enough for the first owner to land his helicopter or was it even Harrier jump jet (?) on - although planning rules or something prevented this from ever happening? I am quite interested in the tower block penthouses; does anyone on here own one, and if so are they good to live in (and do you land your helicopter on the roof!)  Does anyone else know how often penthouses in tower blocks come up for sale?  I remember about two years ago there was one in Cromwell for about 1.5mil, but it was the smaller one and had the less desirable north-west view.", 
      "date": "2005-06-14 13:06:00", 
      "id": 4745, 
      "responses": 6, 
      "subject": "Penthouses", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1684"
    }, 
    {
      "body": "hello all. i've been considering moving to the barbican estate for a long time now - it's near to work, public transport is good. most importantly, the estate itself is quite beautiful - in an odd way. and the barbican centre is incredible. so i've spent a few hours looking over estate agents and this site. service charges are a recurring question though - i've lived in a mansion block before so i'm used to phenomenal service charges. does anyone know round-about annual service charges. i'm looking at type 28/29 , or larger studios w/ \"bed areas\" (type 44?). the flat would have to be in a \"north-south\" terrace - i really can't afford being hit by a mega-lift-charge. if anyone knows really approximate for a studio/1bed/2bed flats in one of the north-south terraces i would really appreciate it. thanks.", 
      "date": "2006-08-25 22:31:00", 
      "id": 4458, 
      "responses": 5, 
      "subject": "service charges", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2560"
    }, 
    {
      "body": "About time!  I thought Barbican flats were flying off the shelves? There's a few here that aren't shifting, despite being on the market a couple of months. Hopefully if these reductions continue, in a year or two I might finally be able to afford one!", 
      "date": "2007-06-26 10:50:00", 
      "id": 3364, 
      "responses": 3, 
      "subject": "Price reductions in EC2", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3447"
    }, 
    {
      "body": "Hi Everyone. We live in a small Barbican flat for the last four years and am now my flatmate and I are desperate for more space but couldn't bear to move out from the Barbican. If anyone knows of a tower flat coming up for sale then please bear us in mind.  There's no chain and we could move quickly.  Thanks for your help!", 
      "date": "2006-04-15 10:22:00", 
      "id": 3060, 
      "responses": 2, 
      "subject": "Tower Flat Wanted", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2201"
    }, 
    {
      "body": "... a tower flat (Cromwell or Lauderdale) between 10th and 20th floors. I don't hold much hope in the present housing market, but you never know..", 
      "date": "2007-04-20 16:26:00", 
      "id": 4387, 
      "responses": 2, 
      "subject": "LOOKING FOR ..", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3250"
    }, 
    {
      "body": "Does any one have any idea how much the lower garden flats (the studios) go for in Thomas More? i've never seen inside one, but i like the idea of living in one - does anyone know what they're like inside? Do they actually ever come on the market - i have never seen one for sale - or do the people that live there love them so much they never move?", 
      "date": "2005-08-28 20:19:00", 
      "id": 2985, 
      "responses": 1, 
      "subject": "Thomas More Garden Studio Flats", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1823"
    }
  ]
}