{
  "summary": [
    {
      "body": "Does anyone know when the Barbican Christmas tree goes up? And does it still go up by the stairs overlooking the lake by Willoughby?", 
      "date": "2005-11-30 09:23:00", 
      "id": 184, 
      "sentiment": 1, 
      "subject": "Christmas", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1964"
    }, 
    {
      "body": "Anybody know what the big tent inside Frobisher Crescent is for?", 
      "date": "2004-06-03 15:06:00", 
      "id": 2900, 
      "sentiment": 1, 
      "subject": "Marquee", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1144"
    }, 
    {
      "body": "if the corporation can provide private schools in the city can it not provide a state school for city residents no matter how small do we not pay council tax for this?should our children be fobbed of to other bourghs ", 
      "date": "2005-04-25 12:50:00", 
      "id": 2922, 
      "sentiment": 1, 
      "subject": "corporation owned schools in the city", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1588"
    }, 
    {
      "body": "Has anyone else noticed that the M&S food department has been very poorly stocked recently - at least on Saturdays? We tend to shop late morning, so it is not a question of getting there at the very end of the day and finding that certain items have sold out. On the last few weekends, there have been lots of empty shelves. Certain areas are terribly depleted - for example, the fresh meat section. If you fancied pork this weekend, you were totally out of luck - I think we managed to buy the only package of pork in the shop (and it wasn't even the cut we wanted). And the fresh herbs are very hit and miss. It makes it pretty hard to shop for a particular recipe. I spoke to the manager, who said that parts of their order had been diverted to other stores because of the bank holiday. Doesn't make much sense to me, and also doesn't explain the previous weekends with the same problem.  It seems bizarre, as M&S could have a monopoly on high-end grocery purchases here if they just made a little effort. At present I wonder whether they are planning to run this store down until it's at a point where it's not worth opening on Saturdays.  So many retailers don't seem to have any common sense anymore.", 
      "date": "2005-05-02 10:46:00", 
      "id": 2929, 
      "sentiment": 1, 
      "subject": "more supermarket woes", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1603"
    }, 
    {
      "body": "Does anyone know why some of the 153 buses make an ungodly shrieking sound when they accelerate? You can hear them coming streets away.", 
      "date": "2005-07-30 07:57:00", 
      "id": 2946, 
      "sentiment": 1, 
      "subject": "153 Bus", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1770"
    }
  ]
}