{
  "summary": [
    {
      "body": "How cheap is Spice Corner Indian now?!  Last time I went prices were borderline ok to modestly priced, now they've lowered again!   It's good to have competition amongst restaurants as it's good for the consumers.  I know a few of you eat at Spice Corner now and again so just thought I'd let you know about their price-slash. All the same, had a real good curry at a price I'm happy to pay!", 
      "date": "2005-07-31 23:32:00", 
      "id": 2957, 
      "sentiment": 4, 
      "subject": "Cheap or what?!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=1776"
    }, 
    {
      "body": "In perusing the many comments on BarbicanTalk I thought I'd introduce to those who on occasion pop a lowly egg into a frying pan ( naughty ) or possibly poach the rascal or whatever a most delightful addition to my cupboard and hopefully yours. Waitrose stocks a large variety of the orb, and not overpriced for those who think our new shop is only for the rich, and in choosing my dozen one day recently I hit upon a sure winner!         In opening the box to check whether any might be broken I came upon a charming description of the product written over the lady's name whose layers laid the goodies,Mrs.Mabel Pearman's Burford Browns!!           I'll impart that message if I may but not before telling the reader that never in my long life have I tasted a more delicious egg, the flavour unsurpassed I do believe. But the colour truly beautiful, not a sallow and pale little yellow thing but almost orange and reminding me of many a sundown just before the heavenly star sank into the sea out there beyond that Greek Island. Oh dear I waffel so onward if you have a moment!            \" Clarence Court Free Range Eggs are special, not only for their superior flavour and quality, but because the poulturer's attention to the health and welfare of her hens , which are free to range and forage on green pasture from dawn till dusk, leading a natural and hapy life.            Our birds enjoy a gererous helping of sun drenched maize corn in their non-GM vegitarian diet, the privacy of warm secluded nest boxes, trees and scrubs for cover, dust baths - in fact, everything that a healthy hen requires for it's freedom of expression and fullness of life, to bring you a truly Free Range Farm Egg! \"               Somehow I feel that I've done the reader a service and I shall forever be in Mrs. Peaman's debt knowing full well that a succession of Burford Browns will be popping pullets for years to come!  ", 
      "date": "2006-08-13 10:21:00", 
      "id": 3151, 
      "sentiment": 4, 
      "subject": "A wonderful discovery via Waitrose!", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2523"
    }, 
    {
      "body": "Life just gets better and better here . . . the new zebra crossing opposite the Barbican Tandoori has now opened and is getting lots of use. Much needed! And I've seen two cyclists being cautioned by police at the corner of Aldersgate and Beech Street in the last week. Hopefully the message will get round that cyclists should ride responsibly . . .  [cue the flame war]", 
      "date": "2007-01-29 22:34:00", 
      "id": 3281, 
      "sentiment": 4, 
      "subject": "Aldersgate zebra crossing", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=2974"
    }, 
    {
      "body": "Dear residents, Went to Steven Dossou-Yovo's \"Perspectives\" exhibition yesterday at Smithfield Gallery (next to Carluccio's) and thought it was great. His stuff fits with the Barbican-walls look perfectly, so if you're in the market, go and take a look. Prices not too over the top. Worth a look anyway. That's all.", 
      "date": "2007-06-07 10:11:00", 
      "id": 3339, 
      "sentiment": 4, 
      "subject": "Smithfield Gallery - recommended exhibition", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3403"
    }, 
    {
      "body": "In case you haven't discovered it yet, there is a fantastic new tapas bar on Featherstone Street (just off City Road up by Old Street tube) Its only been open a week or so and has just started opening in the evenings. its called  , and is a sister offshoot of the bigger Pintxos People in Brighton which has won huge plaudits and bar/restaurant,of the year award in various circles. thoroughy recommend the delicious rose and lychee sangria - knocks the socks off pimms any day. so good i am going back again tonight for more.....", 
      "date": "2007-06-22 09:59:00", 
      "id": 3358, 
      "sentiment": 4, 
      "subject": "Fabulous new eatery in our Manor....", 
      "url": "http://www.barbicantalk.com/forum/viewtopic.php?f=2&t=3436"
    }
  ]
}